{"start_date": "1543578665", "end_date": "1543762558", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7768, "text": "<masonarypp>: One of my favorite shots while hiking around Manaslu (8156m) in Nepal <travelingwolf>: Oh wow! Do you mind sharing more about the trip you did? How long did you hike there? Was is a multiday one? Would love to go to Nepal in the next few years as well :)<hornylittlegrandpa>: Not OP, but spent two months in Nepal a few years back, although not for hiking. Wonderful country, and can’t wait to return. Some points from my experience: - Kathmandu has some amazing historical sites but overall I found it extremely dirty and crowded. There’s definitely sights to see but I recommend spending a couple days there and moving on. - My personal favorite city was Pokhara, it’s beautiful and much cleaner, and there’s a beautiful lake that’s ringed by mountains. Can’t recommend it enough. - Perhaps it’s a bit more stable now (I was there in 2012) but when I was there, there was a nationwide strike, and apparently that wasn’t uncommon. Nepalis are very political in my experience. - For the most part, Nepal is very welcoming to foreigners, and people are very friendly. That said, as with most any foreign travel, have your wits about you and watch out for scams. No, that boy doesn’t actually need baby formula for his little sister, he’s just going to sell it back to the shopkeeper (a grift I experienced several times in Kathmandu). - Nepal is very affordable, and even more so outside of Kathmandu. If memory serves, I was able to haggle the cost of my hotel in Pokhara to around 4 or 5 bucks a night, and it was a pretty nice hotel. - Speaking of which, haggling is very normal in Nepal, and foreigners are usually going to be given inflated prices for things. Don’t be afraid to haggle people down. - If weed is your thing, it’s plentiful and common in Nepal, and there’s even a holiday (shivaratri) during which it’s commonly smoked. However, be wary of the people trying to sell it to you, especially in Kathmandu. It’s very common for these guys on the streer to whisper in your ear things like “smoke?” Or “hashish?” If you bite, they’ll pull you into an alleyway and, at worst, mug you, but typically they’ll just try to massively rip you off (we’re talking 100 usd for an amount that actually costs around 15 dollars). Personally, I had better luck asking the shopkeepers at head shops. <EDIT>: accidentally posted before I was done typing <gpwpg>: Thanks for sharing! How about travelling around? Airlines in Nepal are notoriously dangerous I guess (which is a bit unfair considering how hard of conditions they fly in).<hornylittlegrandpa>: I flew I to Kathmandu on an Indian airline (don’t remember which) and from there traveled by bus or car (I, luckily, had help from Nepalis with this aspect so unfortunately can’t help you much with that info)<gpwpg>: Thank you anyway. Did some research and Im a bit scared. How was driving by bus?<hornylittlegrandpa>: Extremely cramped; most buses end up packed to the gills and then packed some more. Including people on top, which can be fun! Don’t recommend that on the mountain roads, but in the terai I rode on top of the bus frequently. Overall the buses were fine and fairly cheap.", "num_messages": 7, "avg_score": 1109.7142857143}
{"start_date": "1544757030", "end_date": "1544808270", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 18, "text": "<cesiumchem>: Is TripIt pro worth the cost? TripIt pro is having a 50% discount sale ($24 instead of $49) right now. Is it worth the cost? What are your experiences? Is there a better app? I currently use the free version to organize my trip. Thanks in advance! <Kananaskis_Country>: Useless for business travel, but I know lots of people who love it for personal use.<elijha>: Why do you feel it's any better for one or the other? For the kind of stuff TripIt does, travel is travel<Kananaskis_Country>: It's useless for business travel because (last time I looked at it) it had zero capacity to tie any travel to expense reports. That's crucial for a business traveler.<elijha>: It's pretty tightly integrated with Concur (both owned by SAP). Not sure what exactly you're trying to do, but there are some capabilities there. But still, if it's useful to someone for personal travel, it'll be useful to them for business travel. Saying it's useless just because it doesn't do one tangential thing is like saying that your car is useless for commuting to work because it doesn't read you your emails on the drive.<Kananaskis_Country>: &gt; Not sure what exactly you're trying to do It's really simple, tie all the travel that TripIt is handling directly to expense reports that the company's accounting department is handling. That was impossible the last time I looked at TripIt. At that time I couldn't find a single corporation that used it. Maybe that has changed, I have no clue.<elijha>: Yeah, that's been possible for a couple years. If you have a reservation in TripIt it automatically creates an expense in Concur<Kananaskis_Country>: Kudos to them for the update.", "num_messages": 8, "avg_score": 2.25}
{"start_date": "1543622270", "end_date": "1543631015", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<hikerinthemidwest>: New Years Eve in New Orleans and a week in Mississippi Hey I'm taking a little over ten college students on a service trip to Billoxi Mississippi. We will be spending New Year's Eve in New Orleans. I'm looking for suggestions on great activities in the area. The students are all interested in environmental issues and so I'd love things related to that. We also have no budget for activities and are not allowed to drink alcohol so a night on the town is out of the picture. Thanks for any advice!<nim_opet>: Good lord...teens in nola for NYE...<hikerinthemidwest>: To be fair most of us are in our 20s 😂", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544754786", "end_date": "1544767506", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 3, "text": "<treehouseops>: What's your general process for planning a trip like? I'm curious as to what everybody's steps are for planning a trip. If you're one of those people who just books tickets and wings it the whole time, this isn't directed towards you (though that's badass). I find researching beforehand helps me to understand the place better and have more fun while I'm there, but I sometimes get overwhelmed with all of the decisions/recommendations from friends. So, what's your process, and do you have any main frustrations? <lnvu4uraqt>: I plan by finding a cheap flight anywhere through a deal or flash sale. I then plan logistics like how to get around, places to stay, activities and things to do, and then places to eat. All this research gives me an idea of how much I will be spending. I then research more about the place I'm going to through a combination of asking friends if they been to the place before for recommendations, Reddit, Wikitravel, Lonely Planet, TripAdvisor, blogs, and various resources<treehouseops>: So once you have a big list of things to do, do you make a rough itinerary?<lnvu4uraqt>: Yes. I always leave it flexible as something else interesting may come along. If I'm set on something then I will do it regardless but I tend to have a rough plan to follow. Some days I may not want to do much besides wander around, soak up sights or just sit around. I personally think traveling shouldn't be made stressful as it should be.", "num_messages": 4, "avg_score": 0.75}
{"start_date": "1543597131", "end_date": "1543615510", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 41, "text": "<Im_The_One>: Is it feasible to explore both Ireland and Scotland in 7 days? My friends and I just booked a roundtrip flight to Dublin. We'll have 7 full days in the UK. The top things we'd like to do are visit the Cliffs of Moer but also explore the Scottish Highlands. I've not ever been to the UK so don't really have a grasp on the size, but would it be feasible to do both of these things in the different countries in that timeframe? Thanks!<super_salamander>: &gt; Dublin &gt; 7 full days in the UK Calling Dublin part of the UK is an excellent way to meet locals. And by \"meet\", I mean \"get punched in the face by\".<Oax_Mike>: Not Dublin and not related to a geography snafu (well, sort of)...but when I was leaving Belfast to hop the train to Dublin I decided to walk to the train station because it was only a couple miles and it was early, like 6am. Anyhow, I was just walking down the road with my backpack on and this guy comes up to me on the street and says, \"Hey, where are you going?\" \"To the train station.\" \"By yourself?\" \"Yeah.\" (Man makes a funny face) \"You're fucking crazy.\" And then he walks off. No explanation. Just walks off shaking his head after this odd 15 second interaction. Sweet. &amp;#x200B;<tinyderpers>: Oh lord, is Belfast that bad? Husband and I are spending two days there in a few weeks. We met a woman on our recent trip to Japan and told her and she said to us, \"It's really not as bad as everyone says! You'll be fine!\" Then we lost her in the crowd so we couldn't get any more info. <Oax_Mike>: This was in 2001, I think. I'm pretty sure most of the IRA stuff has calmed since then. But yeah, our train was halted half way to Dublin because there was supposedly a bomb on the track. We had to get into these ancient buses and ride several hours through the countryside to get on a new train on the other side of where the bomb was meant to be.<tinyderpers>: Man that sounds rough. That’ll put a damper on your trip real fast. I hope the scenery made up for it. <Oax_Mike>: Not really. The real purpose of travel is to build a library of bar story fodder to reference when you're drunk. Just ask /u/Jippiejee<tinyderpers>: I know what you mean. I used to get really upset when small disasters would crop up during travels but now I try to remind myself to just think of what great stories they’ll make later.", "num_messages": 8, "avg_score": 5.125}
{"start_date": "1544752885", "end_date": "1544753251", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<MegaWeight88>: Help! I can't decide! So today my wife surprised me with an early Christmas present of which she handed to me in a plane white envelop. Upon opening it, to my amazement, I found 2 round trip tickets to anyplace we want to go in the continental US or Canada. I'm ecstatic! But also have NO idea where to go! The tickets dont expire for some time so its no rush at all... but I thought my fellow redditors wouldn't mind giving my planning a jump-start with some suggestions! &amp;#x200B; We are foodies, we love the outdoors and hotels/cabins with amazing views. We hate crowds and very busy places. We enjoy weather (rain, fog etc) The northern lights have always interested us but the wife says that Alaska wouldn't sound fun.<stokedandbroke0000>: There is so many different types of landscapes in America, my opinion is to try the Southwest, sedona Arizona area, Grand canyon, southern California.<MegaWeight88>: Great suggestion! But.... We live in the desert already haha. <stokedandbroke0000>: I see haha I tried. Try the Pacific Northwest!<stokedandbroke0000>: Or the Rocky mountains!", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1544644763", "end_date": "1544726252", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 2015, "text": "<uspn>: Bonus view on flights across northern Iran in nice weather; Mount Damavand, the 12th most prominent peak on the planet. <Zaluiha>: How does one define “most prominent”. <uspn>: The prominence of a peak is the minimum height of climb to the summit on any route from a higher peak, or from sea level if there is no higher peak. I know, it may seem a bit weird to measure a mountain that way. But see https://en.wikipedia.org/wiki/List_of_peaks_by_prominence for a full explanation, and it will make sense. <Vikingwithguns>: New Guinea has a 4,500m Mountain?! Who new.<comparmentaliser>: Yep - Pancuk Jaya is 4,600m and has (had?) a glacier on top and a massive gold mine at the base... inside the mountain.<Vikingwithguns>: That’s Indonesia I think. But that’s crazy too.<moonboots13>: The mountain is in Indonesia, but on the island of New Guinea. New Guinea is shared between Indonesia and Papua New Guinea.<comparmentaliser>: The mine is the primary reason why Indonesia wants to keep West Papua - there’s a long history of violence and opposition to Indonesian rule.<rafxgsy>: Very little chance of it being decolonised as long as there's money to be made by the colonialists.", "num_messages": 9, "avg_score": 223.8888888889}
{"start_date": "1544726565", "end_date": "1544797681", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 956, "text": "<sandiota>: I went through the Gatun Lake lock of the Panama Canal! <brokenodo>: More info? I'd love to do this.<sandiota>: I was on the Norwegian Sun, and did a partial transit before heading to Costa Rica. After this transit we got in the life boats to go ashore, and we did the “Two Oceans by Railroad” excursion. Which was a little deceiving, because we took a bus to the pacific, and then took the railroad back. The train was awesome! I wish I would’ve known how long I was going to be on a bus though.... There are a lot of cruises that do the partial transit and a full transit, I would highly recommend it!<brokenodo>: That sounds amazing, thanks! Trains are cool too! <JamesWjRose>: I'm not OP, but we did this nearly 2 years ago and they trains are called Mules. (almost seems rude) <EDIT>: Well aren't I stupid, if I had paid ANY attention I would have seen that OP was talking about actual trains, duh<melted_tomato>: I think OP was talking about vintage train excursion which is offered by some cruise companies, not about ship pullers in the video.<JamesWjRose>: oh, duh. How embarassing. Thanks for the correction (really) Have a wonderful weekend", "num_messages": 7, "avg_score": 136.5714285714}
{"start_date": "1543584559", "end_date": "1543591332", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 146, "text": "<PatSenburg>: Strasbourg, France. The architecture of this city is awesome! <karachristinad>: I'll always remember rounding the street corner to the Cathedral in Strasbourg and seeing how grand it really is - one of my all time favorite travel memories.<phyneas>: It's the most magnificent building I've ever seen in person. You walk around the corner from Gutenburg and it's so huge that it just blots out the sky in that direction. Then as you walk towards it, you get absorbed in the stunning detail of the Gothic facade and start to lose your sense of scale...until you get close enough to see the crowds on the square in front of it and you realize that the heads of the tallest people there don't even reach the top of that tiny sliver of unadorned stone at the very base of the cathedral and it hits you all over again just how enormous it really is. <karachristinad>: This exactly describes the feeling, I would go back in a second.", "num_messages": 4, "avg_score": 36.5}
{"start_date": "1544736421", "end_date": "1544759944", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 38, "text": "<onelittleworld>: Ever visit a country just to get the passport stamp? I did, once. We had some downtime in Croatia one afternoon, not far from the Bosnian border. Popped over the border into Bihać, took a quick look around, shrugged, turned around and headed back over the border to hang out at a local taverna with wi-fi and cold beer. But hey, got another stamp! How about you?<FamilyOnStandby>: Yes! Well, that and because my pregnant wife wanted Belgian chocolate. So we flew an out-and-back to Brussels.<onelittleworld>: &gt;my pregnant wife wanted Belgian chocolate Now that's a priority!<FamilyOnStandby>: Oh yes. She texted me on Friday morning, said \"I need chocolate and seats are open on the 5:30 to BRU.\" Ran home, packed a bag, headed to ORD. It was wonderful. <crackanape>: Surely there is a shop in Chicago selling Belgian chocolate.<FamilyOnStandby>: 😂😂😂 There is no reasoning with a pregnant woman. And I was more than up for the adventure.", "num_messages": 6, "avg_score": 6.3333333333}
{"start_date": "1543623479", "end_date": "1543701957", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<uke_gal>: New Zealand vs. Scotland Hello everyone! I'm having a bit of a big decision ahead of me where I have applied to graduate schools in both New Zealand and Scotland. I have been accepted to both, and now I'm faced with the decision of where to go. I am interested in both countries, and would really like some advice of where to go. I'm interested in New Zealand because I haven't been to that part of the world yet. Plus from all pictures I've it's a beautiful country. I really love nature, and I know there's lots of great hiking trails and mountains there. Plus weather, it's a lot more sunnier than Scotland. Downside is it's far away, plane ticket is expensive, plus it's farther to travel to other countries. Scotland is also a very beautiful countries. There's also lots good hiking trails there. It's in Europe, easy access to travel to other countries. I have lots of friends in Spain, I used to live there and teach. The downside, it can be cold and rainy. Another thing to think about is the program in New Zealand starts in February whereas the Scotland one starts in August, so I would have the chance to make more money before I go off and get into debt with school. If anyone has advice or have been to both countries and can tell me their two cents that would be much appreciated. <bpe9>: Where in New Zealand? What university? <uke_gal>: Christchurch, University of Canterbury. <bpe9>: Christchurch is still a bit dead after the big earthquake there, I feel you may get bored there for 3+ years", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544741682", "end_date": "1545035736", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 3578, "text": "<etta_etta_etta>: Naxos island, Greece <etta_etta_etta>: So, i have recently decided to move here! Took this photo this summer while house hunting!<VeryTalentedArtist>: What made you move if I may ask? How do you support yourself? Just curious since I have plans to move with the family in the future.<etta_etta_etta>: My husband found a job on the island and i have a small business which i will transfer. No kids. We actually found an amazing house and we are getting the keys next month! We have been visiting Naxos for years and we love it! Living in Athens has been hard for us these past years so we decided to make a change! You and your family plan on moving to Naxos? <VeryTalentedArtist>: So since you live in Athens I take it you're greek? Good thing you can take your business with you. Did you buy? Or rent? What are the costs like? We are probably going to Crete, Naxos feels to small even though it's very nice there.<etta_etta_etta>: Yes I'm Greek. We rented although we had an extremely hard time finding a place, and we ended up renting in a village about 7km outside the main town. EVERYONE is renting their places on airbnb so it took us a while to find an available home.. It seems to be an issue finding a house to rent year round.. But in the end we got lucky! The costs are pretty cheap in the villages, availability is a problem though. Buying was out of the question for us (at last for now) but it is a good option to get a good deal. <VeryTalentedArtist>: I figured it would be hard finding a place considering airbnb. Thanks for your input :)", "num_messages": 7, "avg_score": 511.1428571429}
{"start_date": "1544721694", "end_date": "1544739059", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 54, "text": "<valeyard89>: I have visited 266 places on the Traveler's Century Club list. Here are photos from 239 of them. <valeyard89>: It was a goal of mine to visit every country by age 45, which I finished a few years ago. I'd heard of the Traveler's Century Club, which has a list of 327 'countries' which include territories and regions. I'm not sure if I will go for all of them yet, but I am a lists kind of person. :) Since completing every country, I have also been working on visiting every Texas county (254). <MickeyFinns>: Are you a member of TCC or just following the list? I'm in the UK chapter and there's some great people at the events in London, a few are only a few territories away from completing the TCC list! Nomad Mania (1281 territories) and MTP are worth looking at too, I know the founder of NM and he's a lovely guy, has visited 1100+ of the territories it's crazy.<valeyard89>: Yes, I have been a member for several years now. On MTP and NomadMania as well yeah. I haven't met Charles or Harry yet though. NomadMania makes it look like I've hardly been anywhere though heh. <MickeyFinns>: Ah cool, let me know if you ever head to a London event? Checkout Harry's new book if you caught wind of any of the William Baekaland drama, really good, only had one dealing with the guy which seems like a lucky break. Hope to meet Charles at some point, MTP market some of the tours I and my partner's organise and I've chatted with him. I know someone who was with him on the Rockall trip where they managed to land and apparently he's great to travel with.<valeyard89>: Yes am familiar with the Baekland story, pretty crazy. And I do know someone that was affected. Haven't yet bought the book though.", "num_messages": 6, "avg_score": 9.0}
{"start_date": "1544436380", "end_date": "1544512735", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<dspe1946>: Solo traveller looking for suggestions on beachside town anywhere in the world for 20 days in June 2019 to live as a local [removed]<amanduhsings>: Tofino, BC, Canada. <noodle_and_liquor>: &gt; A budget of around 150 USD a day to spend including accomodation That won't get you the back seat of a car in Tofino-time for Plan B<amanduhsings>: There are hostels in Tofino where you can get a dorm bed and have access to a kitchen for around $40-50 USD per night depending on the season.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544725999", "end_date": "1544904503", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 2806, "text": "<DanielleDefiance>: Morning at Oyunohara in Hongu <DanielleDefiance>: Taken during a trip with my SO last month, just before starting our third of four days hiking the Kumano Kodo. <ShakaUVM>: &gt; hiking the Kumano Kodo. Nice. I've always wanted to do that hike. How difficult was the hike, and were there good food places along the way?<DanielleDefiance>: I am a casual-intermediate hiker, but subjectively I would say overall the hike is moderate. Easier and tougher in spots, not many flat sections of trail. We did the Nakahechi route from Takajiri to Nachi Taisha and the first and fourth days are the most challenging for elevation gain. You also have to watch your step on some of the decline as well, since portions of the path are stone steps that can be slippery. The last couple miles into Hongu are fairly leisurely. We did several homestays and minshukus so meals were home cooked at our accommodations and I thought they were all wonderful. We also stayed at one ryokan that included an substantial dinner and breakfast that was excellent. Some accommodations offer bento/lunch boxes to take with you on your hike or you can pick something up some a local store before you hit the trail in the morning, or depending on timing you can eat wherever you hike into. I found the couple noodle shops/cafes we ate lunch at to be very tasty. Although, I was quite hungry by then, so I definitely wasn't feeling picky! If you are a fan of Japanese food and don't mind trying new things you won't be disappointed. (Edit: Grammar)<ShakaUVM>: Thanks for that wonderful response! How many days did you spend on it? How were the minshukus? I've always worried about staying in one since our Japanese is poor.", "num_messages": 5, "avg_score": 561.2}
{"start_date": "1543617103", "end_date": "1543617931", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 14, "text": "<CrippinDawg>: Hello World! Travel Insurance, Compulsory? I'm doing some solo travelling from London to Malta on easyjet flights. Getting lots of different views online. Will I be able to board my flight without travel insurance?<Kiwitechgirl>: Yes. The airline doesn’t care. Whether you should is a different matter.<CrippinDawg>: Do you think I should? I'm pretty healthy and I won't be taking many valuables? What would be the key things the insurance should cover? <Kiwitechgirl>: The only places I travel without travel insurance are places which have a reciprocal medical agreement with my home country. Anyone can get hit by a car while crossing the road, no matter how healthy you are!<CrippinDawg>: That's damn true. Thanks for your help!", "num_messages": 5, "avg_score": 2.8}
{"start_date": "1543581773", "end_date": "1543586377", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 32, "text": "[deleted]: Traveling tomorrow, very sick daughter. What to do? [deleted]<Oax_Mike>: This is what travel insurance is for. It sucks to learn this the hard way but pretty much any time you buy the lowest cost ticket you are agreeing to no refunds and no changes.<electricsheep12345>: But I bought this super cheap ticket and I expect them to treat me like first class and bend over backwards to accommodate me!!!<Oax_Mike>: I do understand that not everyone has been travelling extensively for 20 years, though. Some of these lessons you only learn by experience. Many of the flight gurus in here treat pretty obscure rules as common knowledge. For example, the fact that if you miss the final leg of your outgoing flight that your return flight is cancelled. I never knew this before joining Reddit. I don't think it's unreasonable if you've flown &lt;10 times in your life to not know that most tickets offer ZERO refund...but this is the reality so there's no point in sugar coating it, either. As I said, this is a shitty way to learn but now OP knows! :D &amp;#x200B;<electricsheep12345>: Fair but in OP's case they should read the T&amp;S<Oax_Mike>: Nobody reads that shit. Maybe 2-3% of the populace. Max. Getting fucked by an airline that could totally help you out is just part of the travel experience. Like shitting in a hole. Getting diarrhea. Overpaying for a taxi. And so on.<electricsheep12345>: While I don't read deeply into them I do read the high level of cancellations, changes, etc. It's not that hard to do.", "num_messages": 7, "avg_score": 4.5714285714}
{"start_date": "1544712737", "end_date": "1544714047", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 1, "text": "<dunzeod>: Am I being stupid? [Amsterdam] Hello! I'm sorry if this counts as low effort but I'm kind of in a cunundrum and I would like some help from the community. So I am traveling from Alicante, Spain (Beautiful place by the way) to Atlanta, but I have a layover in Amsterdam from 1:10Pm to my flight departure at 4:50 PM. I wanted to try the infamous coffee shops near Centraal station. Would it be feasable to smoke a quick joint/ eat a cake and then head back to the airport? More information: I am a United States citizen and I am travelling from the Schengen zone. <swollencornholio>: Not impossible but it's pushing it for sure. Factoring in ~30 minutes to deboard and get to the train and ~1h-1h15min m of travel to and from downtown including walking and finding a coffee shop. You'll have ~2h not including any time being spent smoking a joint.<dunzeod>: Oh Tbh i don't really care too much for wandering the city. I'm going with my girlfriend this summer for pleasure anyways and I'd like to spend leisure with her. I just wanted to get high for the flight. <swollencornholio>: I meant that you'll have 2 hours before your flight leaves, not 2 hours to spend in Amsterdam. So if you usually go to the airport 2 hours before your flight you'll have no time.<dunzeod>: Oh I'm sorry. I thought that sounded a bit weird haha. Thank you for the advice!", "num_messages": 5, "avg_score": 0.2}
{"start_date": "1543625499", "end_date": "1543630498", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 12, "text": "<50buttons>: Which airline(s) take very large dogs? Hello r/travel! My husband and I are moving to Spain on military orders. We have a large dog, shes about 75 lbs, and the big issue with flying is she is 31 inches tall and so we have an xxxl crate for her. We were able to book her on our AMC flight, but cannot find a commercial airline that will take such a large crate! Does anybody know which airlines might take her? Any advice appreciated! Thank you! <Edit>: I should mention I'm looking for US airlines, specifically Portland to Virginia<SomaliYacht>: I work for AA and we get large dogs all the time. You’d need to contact the cargo division for shipping large animals. <Edit>: <https>://www.aacargo.com/AACargo/ua/forms/pet<50buttons>: I spoke with someone at AA cargo and they mentioned a 28 inch height limit for crates. If that's not correct that would be fantastic! I'll call in again and see if the first person I spoke with was mistaken. Thank you!", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1544684728", "end_date": "1545188673", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 16, "text": "<lovelyiris2>: Where to stay while travel to Singapore? I'm from Vietnam and I'm planning to travel to Singapore for one week next January. I'm finding a place to stay with the price less than 50$/night. I searched on AirBnB, and the website suggest that I stay at the apartments **IN MALAYSIA**, near the border between Malay and Singapore - the area near the bridge connecting two countries. So my question is: should I stay at those apartments? I'm mostly worry about the **transportation** and the **Visa** thing. Is there any immigration check when I take a cab from Malay to Sing?<oscarjeff>: Try a hostel. Singapore has some hostels that are more upscale or have capsules if you want more privacy. <lovelyiris2>: We are couple, so I need a place that is big enough. We also need private bathroom, because we use it a little much in the morning. And, as you can guess, couples need to do \"couple things\", so I can't take hostel. <CheeseWheels38>: Hostels often have private rooms. If you want a private bathroom then you'll need a pay for the appropriate place. I think that staying outside of Singapore to save ten dollars per day per person for a week is insane. You're saving even less when you take into account travel costs. Out of curiosity, what are you actually doing in Singapore for a week? What's your total budget like? <lovelyiris2>: I see. Guess I'll choose a hotel or apartment in Singapore then. We don't have a budget limit, it's just \"don't spend to much just for a one week trip\". But we're trying to minimize the accommodation cost and put more money in enjoying Singapore. After all, we're gonna spend most of the day out in the city.<brp>: Recommend you get a tourist unlimited metro pass for Singapore when you land at the airport and stay at a hostel near an MRT station. It will be very cheap to get around if you can walk to the MRT and take it anywhere you need, that it will make up for the fact that you maybe are paying a bit more for the hotel.<lovelyiris2>: Thank you for your suggestion. I also have plan to travel using MRT :D<brp>: Like I said - just make sure you get unlimited tourist the pass at the airport. It's only sold at the airport and like 2 MRT stations. I didn't get one and was really annoyed that even some of the larger staffed MRT stations did not have it available for sale. <lovelyiris2>: Ah, I see, didn't know about its limited availability :D<brp>: Yup. Also, if you are looking for Budget accommodations, Little India is a decent place to check out. You can get rooms for like $50 a night or so. It's conveniently located around 2 MRT lines and easy to get around. <https>://www.agoda.com/reddoorz-near-lavender-street/hotel/singapore-sg.html?checkin=2019-01-11&amp;los=4&amp;adults=2&amp;rooms=1&amp;cid=-1&amp;searchrequestid=a2952e7a-ebf4-4f84-8c35-0e611af47881&amp;travellerType=1&amp;tspTypes=3&amp;ssri=0&amp;tabbed=true<lovelyiris2>: Thank you. As you and other guys suggested, I'm now checking for room on booking and agoda :D", "num_messages": 11, "avg_score": 1.4545454545}
{"start_date": "1543625819", "end_date": "1543676351", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<NLMTN>: Amsterdam, Berlin or Budapest in February? Planning to book a holiday for the back end of February 2019 for my 21st with the duration of around 4-5 days. However, I'm not entirely sure which city to pick from these three that I've wittled it down to. I have previously been to Krakow in Poland in February this year with my girlfriend for 4 days and we took around £300 each and lived like kings since money goes a lot further there. Really enjoyed the historic sites in Krakow and the fact that everything was reletively close together as well. Wouldn't mind suggestions on other cities in Europe either, thanks!<travelingaccountant>: If you want to live like kings and queens again, Budapest.<elijha>: I didn't realize that kings and queens spent so much time drinking cheap beer and eating kebab.<travelingaccountant>: Dont be jealous, sir. You got the famous beer and Christmas markets anyway.", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1544709617", "end_date": "1544878060", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 12, "text": "<FranklyBaffled>: Feedback on itinerary - 13 days in Switzerland Hi guys, I have a trip in March with 13 days dedicated to Switzerland. My current plan is as follows, in chronological order: &amp;#x200B; 3 nights Lucerne (flying into Zurich) 1 night Lugano 1 night Zermatt 2 nights Lausanne 1 night Bern 3 nights Lauterbrunnen/Grindelwald 2 nights Zurich &amp;#x200B; Would this be a good use of my time? I wonder if I've overkilled it with 5 nights in the Lucerne/Zurich regions, although the very first day is a late arrival. Is there too much train travel involved? Should I stay longer in the Gevena region? Bern? Lauterbrunnen? &amp;#x200B; Thank you! &amp;#x200B;<travel_ali>: At that time of year I would spend more time in Lugano and the rest of the Ticino area. Much likely to be nicer weather and closer to spring.<FranklyBaffled>: You seem very knowledgeable so a good person to ask a further question - Where is the best base city to do a day trip to Fiesch / Eggishorn? &amp;#x200B; &amp;#x200B;<travel_ali>: Of the ones you listed Bern or Zermatt.<FranklyBaffled>: The more I've thought about it, Bern sounds like the ideal place to set up as a base a good 5 days or so. I could turn Zermatt into a day trip rather than a multiple night stay and check the weather to hopefully ensure a good day for it. Day trips to Fiesch and Basel also very possible. Flying in that first afternoon I might go straight down to Lugano for 3 nights. Then head back north for a night in Lucerne, before a few nights somewhere in the Lauterbrunnen valley. A full 5 nights in Bern with day trips each day around the country, before a night in Zurich on the way out. How does that sound relative to the original? Thanks for your help.<travel_ali>: Sounds reasonable. Bern has trains to so many options that you will always find an option the best suits the weather that day.", "num_messages": 6, "avg_score": 2.0}
{"start_date": "1544715313", "end_date": "1544728222", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 9, "text": "<aidxn-1872>: Travel Neck Pillows: to purchase or not to purchase? I am about to embark on another 16 hour flight from Asia to Europe. Do they support you so that sleeping is far easier? I can never find a comfy position to sleep on the plane. Experienced neck pillow lovers, advise. <cafecrisp>: If you get the inflatable type, you can customize firmness for your own preference. Also easier to pack. <phyneas>: Yep, I like my inflatable one. It's also flat on the back, so it doesn't push your head forward, just gives it side support to keep it from flopping over.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1544732030", "end_date": "1544736642", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 4, "text": "<signal15>: What are your best packing light tips for whole families traveling from the US to other countries? My wife and I have 2 kids (8 and 10). When I travel alone for work, I usually have a duffel bag, and my laptop bag. But, previous family trips involved SO MANY bags. Toys for the kids that they never played with, ridiculous amounts of clothing, 10 pairs of shoes, etc. The last trip, to Mexico, was a backpack and carryon for each kid and my wife, plus a HUGE 55lb suitcase that got checked. I had a duffel bag and my laptop bag (since I had some work to do). That's 9 total pieces of luggage. If steamer trunks were still a thing, we would have had like 2 of them filled. We're going on a family trip in a couple of months. Destination is warm, 500 year old historic city for the first half of the week in a 400 year old hotel, and a beach hotel for the second half of the week. I want to get myself down to one light bag (no laptop bag), and convince the wife and the kids that they don't need to bring everything they can possibly fit. This trip will have a lot more walking and exploring than previous trips. But, we'll have a hotel to stash our stuff during the day. My goal here is to get everyone prepped and have everything down for when we start traveling to Europe regularly. I'm thinking of using Rick Steve's packing list from Europe through the Back Door, and then getting one of his bags or something similar. These are the two I'm looking at: - https://store.ricksteves.com/shop/p/carry-on-backpack - https://www.ebags.com/hproduct/ebags/mother-lode-tls-weekender-convertible/143101?productid=10126285&amp;cat=travel-backpacks&amp;country=US&amp;currency=USD&amp;couponid=94790994&amp;sourceid=ADWPRODUCTH&amp;adtype=pla&amp;gclid=EAIaIQobChMI9J-628ed3wIVCJ7ACh34hAhGEAYYASABEgIarPD_BwE Plus, I'd get a small crushable backpack for a day trip bag. I'd like to get my wife to get one of these bags as well and get it to be the only bag she takes. I know Rick Steves has a video with one of his female employees giving a talk on what to pack if you're a woman, and I might be able to get her to watch it. Changing 20+ years of packing habits is probably not going to be easy though. The kids are old enough now where we don't need to bring toys. A pad of paper for drawing, and a tablet for games is enough entertainment to keep them from getting antsy on the plane and give them something to do before bed. So, my questions: - Does anyone have feedback on either of these two bags above? Or, recommendations on something better? I don't want a backpack that looks like I'm a backpacker, and I don't want luggage with wheels. I don't want to look like a tourist, and when I'm alone in other countries I'm pretty good at blending in. - What tips do you have on packing a single backpack for a kid that contains everything they need, and will be able to carry? We can probably carry some stuff also, but I want to get them used to carrying their own stuff and being self-sufficient in that regard. Are there good travel backpacks for 8-10 year olds that are not touristy looking? - What tips do you have for getting my wife on board with this idea? - Any other general tips <yellowpolish>: You mentioned \"first half of the week\" and \"second half,\" so it sounds like you will be travelling for a full week? Let's just say 8 days. I would pack outfits for 4 days which means each outfit will be repeated twice. You can probably do two medium suitcases as your checked bags (mom+kid in one, dad+kid in another). For the plane, each of you can carry a small bag or pack. The kids can probably bring their school backpacks. Mom can bring a backpack or large purse, you can bring a backpack. Since you will be in a hotel for half the trip, that automatically cuts down the soap/shampoo needs from your toiletries. Since you will be in a warm place, walking shoes and sandals. It's good to have two pairs each so you can air out a sweaty pair between wears. The kids can probably get away with just sneakers and maybe some flip flops for the beach. I wouldn't buy new bags. Sounds like you all have travelled before and already have luggage. Don't add an unnecessary expense. For your day bag, use the same bag as your airplane personal item (casual backpack, book bag, tote-style purse).<signal15>: I want to avoid checked luggage, it's a PITA. I never check luggage when I travel alone. I'm not concerned about buying new luggage. I just want something well designed that suits the type of travel I'm doing. My current laptop bag is great for work, but not so much for leisure travel. My duffel bag is fine, but lacks compartments and pockets for organization, something I seem to need more of when traveling for leisure. Plus, the plan is when in Europe to switch locations several times over the course of a trip, so light packing and not having to wheel around heavy luggage is pretty important. Packing light for leisure travel should be easier than business travel though. With business travel, I typically have to bring a suit and dress shirts and dress shoes, and those take up a lot of room.<yellowpolish>: Oh, gotcha. In that case the bags you posted look fine. I personally have an Osprey pack which I tried on at REI before I purchased it. In terms of compartments, I love packing cubes. You're only going to be gone a week, though. <signal15>: True, only gone a week this time. I'm viewing this as a test run before we start booking trips to Europe that are longer and have multiple destinations. So, I am planning on doing the packing cube thing and everything that you'd do on a longer trip. One of the principles of the Rick Steves packing methodology is that you pack the same way whether you are going for a week or 6 months.", "num_messages": 5, "avg_score": 0.8}
{"start_date": "1543574540", "end_date": "1543595960", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 13, "text": "<SammyGeorge>: Questions about Canada I'm Australian and I have never been to the Northern Hemisphere but I'm going to Canada soon and I dont want to make an arse of myself, so; 1. Are you supposed to tip in Canada? 2. Is the tax included in prices. I've heard it's not in America and that sounds super confusing. 3. Can you sit in the front seat of a taxi in Canada? It would be weird not to hear but I know that's not the case in other places. <bfrank815>: You should tip. Assuming you mean a restaurant with servers, it’d typically be 15-20%. If purchasing gas, tax is included on the sign price. If for a full-service gas station, maybe a dollar or two. Taxes aren’t included in the sticker price of products. So expect to pay a bit more. Preferred that you ride in the back of a taxi. If you use Uber, they’d likely allow you to ride in the front. <SammyGeorge>: Thanks! I appreciate the answer. Follow up question. What does 'full service' mean?<bfrank815>: They pump the gas for you. It isn’t super common, but it’s usually posted on the sign or could be the closest pump to the building.<electricsheep12345>: If I recall it's mandatory in BC.<noodle_and_liquor>: &gt; it's mandatory in BC. LOL-that's nonsense. *source*-am driver living in BC and No we don't tip for rare full service gas situations.<electricsheep12345>: Duurrrrr I shouldn't think before having coffee. **Pay at the pump** is mandatory in BC. <noodle_and_liquor>: &gt; Pay at the pump is mandatory in BC Not at all there are some full service stations around especially in rural BC", "num_messages": 8, "avg_score": 1.625}
{"start_date": "1543626235", "end_date": "1543899215", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 14, "text": "<BoofinDaddy69>: Looking help and info on Southeast Asia travel. Hey guys, so I’m pretty terrible when it comes to planning trips. Last time I went anywhere was a few years back, spent 2 months on Kauai backpacking around with no definitive goal. Had a blast. The time has come again and I want to take another adventure similar, and I think I’ve settled on Southeast Asia. Only issue is my indecisiveness makes it incredibly hard to plan anything out. I will have roughly 2 months to spend traveling, and a not very tight budget, but I do want to keep the cost low as possible. I was thinking of trying to make it to Vietnam, Laos, Cambodia, and Thailand, but I would also love to go to Bali. I just have no idea how to go about it. If I can just book the flights I’m sure I can just wing the rest, as dumb as that sounds. I really hate having a day to day schedule and wouldn’t mind spending one week relaxing on a beach and then the next week in a random city or village. Basically just take the adventure as it comes lol. If anyone could point me in the right direction, that would be great. I’m into photography and will be taking as many photos as possible, and as far as lodging goes I was planning on finding hostess to stay in. I also am really trying to get into surfing but I live in a landlocked state and can’t do that here. I’ve surfed a few times in Hawaii and once in Florida and I’m dying to do it again. I would not be against spending the entire trip on different areas of the coastal regions and going surfing everyday. Sorry if I’m lacking details, I just really don’t know where to start. Thanks in advance! <A-Ayy-Ron>: I spent 5 weeks earlier this year travelling around Thailand and Vietnam and I think you can definitely get by on a budget without planning too far in advance. I had planned out where I wanted to go but I didn't want to be locked into anything and booking accommodation and transport as I went was really easy. I think SE Asia is a really good place to visit without a set plan, but I still think it's worth figuring out a general sort of route and some key places you want to visit . What time of the year are you planning on traveling?<BoofinDaddy69>: Planning on leaving early January and coming home early March. And right on, good to hear that it’s not too tricky. I was originally planning on Central America but figured Asia may be better for now! <A-Ayy-Ron>: Should be great weather that time of year. As you go it's a good idea to book any trains or buses you want to take a few days in advance if they seem to be filling up, I had a few times where I left it until the day before and had to wait an extra day or so. What's on your list of places/ideas so far?<BoofinDaddy69>: So I literallly just have a few saved locations from others mentioning them here and on other subs, some are Ho Minh/Da Nang, Phnom Penh, Krong Kampot, Sihanouk, also Pai Thailand, then I also saved Kata beach and Pansea Syrian beach.. Not sure if you know but I’m wondering if I could get something like a next day flight to Bali from one of those countries, for not too much. I’m also unsure where I even should book my main flight to the area plus the return home and from which city. Hopefully that made sense <A-Ayy-Ron>: That's a good list of places so far! I think you should be able to get flights to Bali from any major city, I think next day flights are likely to cost a few hundred dollars though, the further in advance you book it the cheaper it will be. It could be worth going to a Bali at the very start or very end of your trip, that way you could get some better prices without having to plan your way around it mid-trip. I've never been to Bali before, but if it ends up being too much effort to get there I think places in Phuket and Ko Samui could be quite good alternatives which might be a bit easier. Flying into the area I think the cheapest flights will either be into Bangkok or Ho Chi Minh. I flew into Bangkok, made my around Thailand then flew to Hanoi and made my way south through Vietnam and flew out of Ho Chi Mihn. That could work well for a route through Thailand -&gt;Laos-&gt;Vietnam. You could fit Cambodia in there as well pretty easily, or you could go from Vietnam to Cambodia and fly out of somewhere there.<BoofinDaddy69>: So the alternatives you mentioned in Vietnam, what’s in those two cities? Or do you mean they are just worth visiting? <A-Ayy-Ron>: Sorry which alternatives do you mean? Hanoi and Ho Chi Mihn?<BoofinDaddy69>: Oh, in the part where you mentioned alternatives if I didn’t make it to Bali. And you mentioned the two places in Vietnam.", "num_messages": 9, "avg_score": 1.5555555556}
{"start_date": "1544725072", "end_date": "1544744771", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 480, "text": "<Queenbach>: Went to Shinjuku Park in Tokyo, Japan over the summer. Never knew I’d like green landscapes this much <dekekun>: I love this place, totally unexpected given where it is.<Queenbach>: Right? Would’ve never guessed this was in the middle of a Metropolitan centre<endlesslyautom8ted>: If you want to go down a rabbit hole look into how much the emperors palace and land in the middle of Tokyo was worth during the real estate bubble in the 80s (I think it was 80s, but possibly 90s)", "num_messages": 4, "avg_score": 120.0}
{"start_date": "1543614958", "end_date": "1543754563", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 302, "text": "<inspiredtotaste>: The views from Mirador de San Nicolás in Granada, Spain had me spellbound. <monkeybugs>: My best mate and I visited Granada in the middle of our month tour of Spain and Portugal. The main reason we went was to visit the Alhambra. Unfortunately, some miscommunication over a holiday weekend led us to never getting in, so we spent our two and a half days in town quietly drunk on sangria and tortilla espanolas. My first memory of Granada that has stuck with me to this day (besides my mate getting crapped on by a bird) was this view. Thanks for the reminder! It was a bust of a stopover for us, but it doesn't make parts of the town any less beautiful.<inspiredtotaste>: Honestly that doesn’t sound like too bad a time to me! I feel like the unexpected stops sometimes end up turning into pretty decent memories, even when they don’t go as planned. Our trip was wayyyy too fast-paced for my taste. We were pretty exhausted by the time we reached Granada, but this view definitely stands out to me too. :)<monkeybugs>: It was miserable at the time just because it was one thing after another of disappointment, but looking back on it, it was such a small blip on an otherwise amazing trip, and it makes for great storytelling. We did 18 cities in 30 days that time and it was definitely so fast paced that the down time ended up being needed. But I still am bummed we never got into the Alhambra. I'll probably never make it back.", "num_messages": 4, "avg_score": 75.5}
{"start_date": "1544621694", "end_date": "1544625436", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 21, "text": "<SimplyHollieFace>: Advice for a new traveller? Hi, I've been looking at going travelling for a long time and now I am finally working, I've started to add to my inheritance money to go travelling. However, I don't know where to begin.. I don't know how much I should save, how to plan or anything. So any advice would be amazing! I'm thinking about starting in Europe (I'm from UK) and then see what happens from there. Always willing to work while I'm there too. <dutchchatham>: Travel light. Don't take unnecessary stuff with you. Having a cell plan that works in Europe is extremely helpful. Check out rail passes. ...and.... Amsterdam. In my opinion it's the greatest city. But also it's a great starting location. From there its a short train ride to Brussels, Paris, Luxembourg, Germany etc. I was fortunate enough to travel abroad when I was 20 years old. I just turned 40, and I still love travel more than ever. Happy trails!<SimplyHollieFace>: Brilliant! This helps a lot. I was. Thinking of going to Amsterdam first anyway as I can stay with someone I know who lives there. Thank you so much. I'm 19 and don't want to wait too long to go travelling or it'll be too late <dutchchatham>: Having a friend to stay with is awesome. It cuts down costs too. I hope it's never too late to travel! Cheers.<SimplyHollieFace>: Thank you for the advice, I've been so hesitant for a while. Do you know how much is would cost for europe usually? I don't really know how much to save <T-Shirt_Weather>: Have a look on hostel world if you're planning on staying in hostels", "num_messages": 6, "avg_score": 3.5}
{"start_date": "1543514250", "end_date": "1543629779", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<triathlononline>: Left my wallet in the chair pocket I travelled to Mexico last night and when we were getting off the plain I was scrambling with my daughter and forgot to grab my wallet which I had placed in the seat pocket where the magazines/safety guide is. I called the airport once I realized I didn’t have it and couldn’t get in touch with anyone who spoke English. I called southwest hoping they might be able to call the southwest desk for me and they told me to simply file a claim and wait. Luckily I have my passport but I had a lot of cash in the wallet and I’m worried. Anyone else ever do this? Does southwest crew clean the plane? Is it cleaned after every flight? <Update>: after failing to contact the airport in Cancun via the phone I flew out yesterday and checked with lost and found, and to my surprise my wallet had been found. They had me verify contents and it was short $100. I’ll write it off as a finders fee, I’m happy I have it back! <eavevee>: I once left my wallet and passport in the chair pocket too. I approached the airline’s desk at the airport right away, they asked which flight, seat number I was in and some personal details. The airline personnel made some phone calls and got my wallet in no time. :) I hope you can get your wallet back OP!<brp>: Similar happened to my wife. She got the wallet back with all IDs and cards, but no cash. OP - you may be able to get the wallet back, but don't count on there being any cash in there.<eavevee>: Wow.. they took the cash? How long did it take to recover your stuff? Fortunately, I got mine like 5-10 mins after reporting the incident. Everything in there! Thanks to Emirates!<brp>: My wife left it at on a connecting flight at LAX and then got on a plane to Singapore without realizing it. The lost and found e-mailed her about it a few hours after she landed at Singapore. In the e-mail it listed \"Wallet with green card, credit cards, No Cash\". I took it as a sign that I should do a mileage run and was able to grab a cheap ticket connecting in LAX, grabbed her wallet, then delivered it to her in Singapore and hung out for the weekend.", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1543560320", "end_date": "1543659026", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 342, "text": "<aabasttaher>: Ra'as Al Hala ,Libya. <ooo-ooo-oooyea>: Nice photo. How did you end up in Libya? Do you have to take a tour or do they let you in? Any safety issues?<aabasttaher>: I'm actually Libyan, born and raised, but I live at the states now. I always travel there every summer since I got Libyan and American passports. I can travel almost anywhere in Libya, not during wartime of course. But I don't know how thugs might treat you there in Libya if they find that you are foreign/ tourists.<RyanIsMegatron>: I imagine majority will treat you the same as all these other media called upon war torn countries. With nothing but compassion, consideration and friendliness. <valeyard89>: I went on a tour in Libya about a year ago.. the day before we arrived the airport had been closed due to fighting (and a plane was damaged by gunfire). Heard a scattering of gunfire one night I was there. And the locals were a bit suspicious/paranoid. Though we were sitting at a cafe and this woman and her daughter kept watching us and were curious about us, they came up to talk to our guides.<panameboss>: Who did you go with? Lupine?<MickeyFinns>: Always nice to see our name pop up :) I've tour led the Libya trip once.<panameboss>: Awesome I'm very jealous. Btw I know you guys did (or still do?) a tour to Socotra island. Have you heard of this relatively new Yemenia flight from Cairo to Socotra via Seiyun that apparently runs once or twice a week? I've seen a bunch of people talk about it running and that you have to buy the tickets in person in Cairo but then I haven't seen anything from anyone who's actually successfully taken it.<MickeyFinns>: Socotra has been delayed a couple times now, my colleague who is looking after that trip is currently waiting on some military clearance then hopefully the trip will finally happen. We've looked at the flight options which might be how it ends up happening. The issue is you don't just need Yemeni permission to go to Socotra, you need some Saudi documents too.<panameboss>: Ah very interesting. I thought you might need Emirati documents since they're super involved in South Yemen but had no idea you'd need Saudi ones for Socotra. What's the best way to keep track so that I could get on the trip to Socotra if (when inshallah) it happens? Just follow your website?<MickeyFinns>: There's a waiting list specifically for it, if you email me, James at Lupinetravel.co.uk I'll get you on it.<panameboss>: Great, just sent you an email! Thanks very much!", "num_messages": 12, "avg_score": 28.5}
{"start_date": "1544724034", "end_date": "1544814101", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 23, "text": "<podgoorsky>: Places like Wanaka in New Zealand Hello everyone. I'm flying to Queenstown, New Zealand for a week to trip around the Southern Island. I'd like to rent a house with my friends in March. What place do you recommend? I was thinking Wanaka or some place like that with the views. What should we see South? I like all the bays, the coastline, mountain view (not cold). Next we'll be on North for 5 days, what place do you recommend max 5h drive from Auckland airport?<Souprx>: eh, you're going to be in nz for 2 weeks and you want to rent a house? You won't see both islands properly in 2 weeks, just sprint through them spending a lot of time driving and not a lot of time seeing much. But since you're flying into Queenstown, i'd just stay there - take a day trip to Wanaka and then go up through Mt Cook / Tekapo, id probably go out to the banks peninsular and see akaroa etc. I don't know where your flight is leaving from but i'd assume chch to auckland? If its leaving from QT then spend more time in QT/ wanaka and go down to milford sound / Te Anau From Auckland i'd probably get out, go across to the cocomandel, Whitianga is nice do cathedral cove + hot water beach hang around there and chill. On the way back out maybe go to Waiheke and or piha. I don't really know what you're looking for and I hate itinarys but theres a few things I've enjoyed since being here (8 months so far) you might be able to fit them in, you might not. Don't sweat it though, a lot of NZ is pretty samey it really is the highlights that make it. Controversial but I think the Banks Peninsular is chronically underrated.<podgoorsky>: Thanks for your comment! I just want to have a good sleep every day and a kitchen/grill to cook my own food. Could rent like a room in backpacker's motel or something with good people and nice view. What do you recommend? I'm 7 days on the south (Queenstown airport), then flying to Auckland to stay on the North for 5 days somewhere near to the Auckland airport. I want to rent a place with spectacular views. We like car trips and stops at every nice place. The coastline, maybe some swimming. I was thinking Coromandel actually when it comes to last 5 days on the North Island. I want the views, nice people and good food.<Lowlevelcomedy>: I agree with Souprx, if you can I would absolutely recommend sticking to one island. There just isn’t enough time to see everything you can on either island with that little time, but if you do both islands here is my recommendation: South Island: I would spend 3 days in Queenstown eating, drinking, and full of activities. Maybe do a day trip to Milford sound on a bus. Then travel up to Wanaka for a day or so and to Mount Cook, stopping at lake Tekapo (Mount Cook was our favorite place). I wouldn’t go much more north than here, maybe explore what Souprx suggested. North Island: wiaheke island for the first day for wine and good food. Then go to coromandel for a relaxing time. You could spend the entire time here if you want beaches and relaxing. If you want to see other things go down to Rotorua and see geothermic area, redwood forest, Maori culture, hobbiton (awesome even if you don’t enjoy the films), glow worms cave (a bit of a drive but we regret skipping), and maybe go do the tongariro crossing if you are into amazing hikes but you would have to stay closer to it. Best of luck and have fun!<Souprx>: I mistakenly assumed they were flying from chch though, I wouldn't recommend the trek to akaroa from Qt just to see it esp if you can make it to Milford sound ha there's loads of cool, cheap things to do near QT if you look for them. We were just there and arrow town is a cute little town right next door and Glenorchy is absolutely stunning. Both drives north out of Queenstown are breathtaking (to haast and my cook), you literally cannot lose. Don't regret not going to waitomo! We went and weren't blown away, given how far away it is from.. anything, I could easily pass on it<podgoorsky>: We ended up renting a house in Wanaka for 7 days in March. We will see QT, Milford, all the lakes and bays within 2-3h driving. What about the North? Is Coromandel okay to stay for 5 days?<Souprx>: Wanaka is tiny, there's really not much to do there. I would think about what you're actually planning on doing. Queenstown is a good hour and a half away with better views and a lot more to do both in QT and the surrounding area. You're going to see so little of new Zealand from Wanaka. Unless your plan is to come to NZ just to chill out, in which case crack on. I'd be be pretty sad if I came all the way to NZ and spent a week in a tiny town. After you've done Roy's peak and seen the tree what else are you going to do? And sure you could spend another week in the coromandel but you'll run out of things to do pretty quickly. Witianga is where hot water beach and cathedral cove are but witianga itself it a bit dull, average beach and a couple of takeaways. If you're looking for nice beaches you need to be in the Northland, piahia for example. I don't understand your way of holidaying so I can't really offer any advice. Milford sound is going to be a good 5 hours driving one way. You seriously think you're going to spend 9-10 hours on the road and enjoy Milford sound?<podgoorsky>: &gt; Unless your plan is to come to NZ just to chill out, in which case crack on. I'd be be pretty sad if I came all the way to NZ and spent a week in a tiny town. We rented a house in Wanaka for 7 days. I loved the scenery of these lakes around. We will spend few hours every day there to sleep, eat and grill. It's a good start point for 2-3h daily trips. When we do that kind of ride we always make short stops so we should see at least the area. Won't be able to see that much in 7 days but that's just a reason to come back. It's more of chilling than climbing the mountains. Wanaka scenery looks awesome to just do that.", "num_messages": 8, "avg_score": 2.875}
{"start_date": "1543595753", "end_date": "1543744541", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 56, "text": "<JP92_>: Top of the Zugspitze in Germany <st8king>: Wanted to go there our last trip to Germany but some mechanical break down happened with the lift or something and we didn't go. When did you take the picture?<JP92_>: Just a few days ago! That’s unlucky, if your ever back I’d recommend it.", "num_messages": 3, "avg_score": 18.6666666667}
{"start_date": "1543599073", "end_date": "1543614076", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 42, "text": "<meganisawesome42>: ELI5: What is travel insurance and why do I need it? I understand the purpose of travel insurance from a sort of dictionary definition stand point, but I'd like to understand it from a practical point from other travelers. I'm from the US and the only time I've been international was when I traveled in Europe while studying abroad in college. So obviously I'm super naive about all things travel. I'm looking at taking my family to the UK for a week next fall, so I'm trying to be more prepared and less of the typical erratic college kid abroad I was last time. What are the benefits of having travel insurance? How do you figure out what will best suit your travel plans? What have been your experiences with utilizing it when needed?<super_salamander>: The only part of travel insurance I care about is the part where they fly me out of Bumfuck, Democratic Republic of Shitholistan to a Western hospital after my lungs mysteriously fill up with water or an alien starts growing in my chest or something. The bit where they pay you to buy a new hair curling iron when the airline loses your luggage can go fuck itself, but it’s included. <Edward_the_Penitent>: \"Accidental Death &amp; Dismemberment\" and \"Body Repatriation\" are two of my favorite travel-related terms.<super_salamander>: I don't care as much if I get killed. I'm far more concerned about getting half-killed and relying on the hospital preventing me from completely dying having been cleaned this year.<Edward_the_Penitent>: &gt; I don't care as much if I get killed. Your family may when they're billed for your body's repatriation. It is not cheap. I don't mean *you*, I mean anyone.<elijha>: Most people who are regularly traveling internationally likely have a fair amount of savings and no beneficiaries, so repatriation could be covered by their own estate.<Edward_the_Penitent>: Data source required.<elijha>: Well, I guess I'm thinking about the situation where someone is traveling alone and dies. Not a family vacation where daddy kicks the bucket. But still, it's basic deduction. Traveling frequently is not something that people without resources can do. Traveling frequently, especially in riskier ways, is also more common among people who aren't tied down with commitments at home. Sure, there are tons of exceptions to those, but in general, penniless families of eight don't tend to spend a lot of time gallivanting.<Edward_the_Penitent>: &gt; But still, it's basic deduction. According to a quick search, it costs $5,000 to $8,000 USD to repatriate a dead body to the US from as nearby as Mexico. With that amount of money, a traveling person can buy insurance that covers this expense many, many many times over. If we are talking in terms of \"basic deduction\", it is clear what the wiser option is here. I also disagree with your presumption that you must be \"penniless\" in order to not have thousands of dollars on hand, and which your family can immediately utilize to bring back your body. I don't think I need to go into why the legality of this situation is also troublesome.<elijha>: Surely I don't need to explain that the insurance being much cheaper than what it insures against (as insurance always is) doesn't automatically make it a wise option. I wasn't even saying insurance is or isn't wise though. I'm just saying that the people who are most at risk of dying abroad are probably also best prepared to cover their own repatriation. Now, if that describes you, I do think it's silly to buy travel insurance just for repatriation protection (alive-me doesn't want to pay anything to save dead-me a few thousand dollars). If it doesn't, make your own judgement call.<Edward_the_Penitent>: &gt; I'm just saying that the people who are most at risk of dying abroad are probably also best prepared to cover their own repatriation And I'm just saying you and I are traveling to different places if you think the average traveler has 8 grand to blow on repatriation. &gt;I do think it's silly to buy travel insurance just for repatriation protection No one said this. &gt;alive-me doesn't want to pay anything to save dead-me a few thousand dollars This entire conversation was started when I mentioned that the family of \"dead you\" may care, so it doesn't matter what \"dead you\" thinks.<elijha>: &gt; if you think the average traveler has 8 grand to blow on repatriation. The average millennial has something like $4k in savings, and I don't think it's crazy to assume that those who travel internationally a lot (or at all, even) probably have a fair bit more. If no one is counting on an inheritance from you, you can \"blow\" every dollar you had on getting your body in the ground in your home country and it doesn't matter. &gt; No one said this. You said \"\"Accidental Death &amp; Dismemberment\" and \"Body Repatriation\" are two of my favorite travel-related terms.\" which is pretty close, no? &gt; This entire conversation was started when I mentioned that the family of \"dead you\" may care, so it doesn't matter what \"dead you\" thinks. My entire point is that, for the people I'm talking about, they don't need to care about the money part since the estate could pay for it all. The normal thinking on insurance is that it's better to pay a little than to *maybe* have to pay a lot, but that goes out the window if you won't be around to care that the \"lot\" went to pay for repatriation instead of to your parents or something.<Edward_the_Penitent>: &gt;My entire point is that, for the people I'm talking about, they don't need to care about the money part since the estate could pay for it all. And my entire point is you're basing this on absolutely nothing concrete and in fact I doubt you are correct. I am still waiting on the source I asked for in my first reply to you. &gt;The average millennial has something like $4k in savings 1.) This is far less than $8,000. 2.) That's great for Millenials. What about Gen Z? Because they're the ones I'm picturing here. 3.) [The GOBankingRates survey, which identified millennials as ages 18-34, found that 67% had less than $1,000 in savings.](http://fortune.com/2018/01/24/millennials-saving-money/) 4.) This argument is extremely boring.", "num_messages": 13, "avg_score": 3.2307692308}
{"start_date": "1544582765", "end_date": "1546278697", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 951, "text": "<Milanosen>: Al Dayr (The monastery in Petra) - rare moment with no other tourists in the pic <EducationalRat>: Always wanted to go here, is it quite touristy?<infurno1991>: It is, but 90% of tourists that are visiting are people on a day trip from Israel or else in Jordan. Typically, they arrive just after noon, spend about 2-3 hours on the site and then leave. Even worse, they rush to the Treasury (at peak time) take their picture and then leave again. For the love of God, do not visit Petra like this. The site is magical and it's huge, it takes you at least a full day to explore. &amp;#x200B; I entered the site as soon as it opens (6AM), which meant that I basically had the Treasury to myself. Vendors and locals weren't even set up yet. After a coffee and enjoying the view I started the hike to the Monastry. Since it was still quite early there was barely anyone on the trek to and at the Monastry. By the time I returned from the Monastry the major tour companies started arriving so the site started filling up. I had already seen the 2 major sites in all their glory so was able to just wander off and explore the site further, whereas all the other tourists were just rushing from site to the site. &amp;#x200B; Petra is gorgeous and absolutely worth a visit. But please, take your time and get there **early.** You will not regret it.<bluebuddha11>: I did the exact same this, this last March. I met a Canadian at my hostel &amp; offered him a ride down to the entrance (I rented a car for my time in Jordan). We were in my 6.30 am &amp; one of the first people at the Treasury. We then decided to beat the crowds to the Monastery. When we arrived there were less than 15 people--absolutely lovely. We spent the rest of that day &amp; the next day visiting the smaller ruins &amp; hiking the many trails. We could always see the crowds below but were well away from everyone.<Zoetekauw>: How cheap/expensive is car rental compared to US pricing?<bluebuddha11>: I had the car for 4 days. Booked it online through Kayak, car company was EuropeCar (I think). Just a basic 4 door automatic, so a little more expensive than a manual, but still only $125 or so for those 4 days. Gas, however, is much more expensive than the US. It was about $50 to fill up the tank. But it was worth it--I liked the freedom.<Zoetekauw>: Being Dutch I'm used to those gas prices. Think I'll opt for something similar. Thank you for the info!<bluebuddha11>: Glad I could help! As you drive through town toward the main entrance/tickets to Petra you have to curve to your right &amp; go slightly uphill. This is where the parking is--buses to the left, car parking on the right. It is free, which is nice. We got there around 6.30 am both days &amp; had no problems with finding a spot.<Zoetekauw>: Sweet. I'm looking to reserve one day for Petra and spend the remainder hiking Wadi Rum. I would've gone for the simplest small manual, but probably won't get away with 2wd in the desert.", "num_messages": 9, "avg_score": 105.6666666667}
{"start_date": "1544667854", "end_date": "1544803442", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 19, "text": "<young_vet1395>: What length of travel makes a US to Europe flight worth it? My friends are trying to decide if 8 days in Europe is worth it for flight cost... what are your length requirements for long flight travels? <valeyard89>: I've flown to Europe for 1 night before. So worth it for me.<marrymeodell>: How long was your flight and what did you do in that one day?? That sounds so crazy to me.<valeyard89>: ~10 hrs or so. Houston to Amsterdam. Went to Van Gogh museum, walked around the canals, did a canal boat tour, Anne Frank House, to hostel to spend the night. Then walked around a bit the next morning before going back to the airport.<Kaitauna>: Why <ski_thru_trees>: Not the above, and probably wouldn't do it for only 1 day, but 2 days maybe. (Also out of chicago so a little shorter flight). I think the main thing is just not minding the travel part. Just a single carry-on, no need to stress at the airport or haul shit around. Have my laptop and switch, so when I'm on the plane, I basically do what I'd do on a normal night in anyways. Also, I tend to get lucky when flying international where I have open seats next to me most of the time which makes it more relaxing.", "num_messages": 6, "avg_score": 3.1666666667}
{"start_date": "1544738165", "end_date": "1544741300", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 15, "text": "<Neptonrs>: Scooter driving safety in Central America vs Asia/Europe I recently booked next trip for the end of this year to Panama city. I really want to experience the Central-American cityscapes and also get out of the city into the surrounding regions and was thinking about renting a scooter (think Vespa) for 2-3 days there. I don't ride a scooter or motorbike back home (Canada), but have scootered about 150km in Vietnam (Hoi-an/Danang region + Hai van Pass), as well as 200km in Italy (from Naples over the mountains to the Amalfi coast and back). How dangerous is Panamanian traffic compared to those that I have experienced so far? I am a pretty big risk taker, but would this be ill-advised? I found the winding mountain roads along the Amalfi coast to be at the absolute peak of my ability to navigate on a scooter, anything more dangerous would be a no-go from me. Are there any other considerations that I should account for other than traffic? Any insights would be greatly appreciated!<electricsheep12345>: Do you have a motorcycle license in Canada?<Neptonrs>: Nope, just a drivers license. I have only ridden a scooter where I mentioned above, as well as in Greece. Maybe 20-30 hours of driving experience<electricsheep12345>: Then I highly recommend you don't do this. You would be breaking the law and thus void any travel insurance you have.<Neptonrs>: How so? Is it a Panamanian law or Canadian? I definitely want to avoid breaking the law, but myself and many people I know have ridden scooters legally in other countries with an international drivers license but without a motorcycle license. It might be worth noting that I'm referring to a scooter of 150cc or less, so not a motorbike, just a Vespa that tops out at 90 km/h. <electricsheep12345>: What do you mean how so? Obviously not a Canadian law as you wouldn't be in Canada. Many countries require you to have a motorcycle license to ride scooters. Check that out. &gt;people I know have ridden scooters legally in other countries with an international drivers license but without a motorcycle license. Depends on that country's requirements.", "num_messages": 6, "avg_score": 2.5}
{"start_date": "1543521054", "end_date": "1543679322", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 149, "text": "<panameboss>: My view while hiking on the wild island of Santo Antão in Western Cape Verde <noodle_and_liquor>: Wild? All I see are terraced fields and a village surrounded by more fields and more houses-that's not wild.<panameboss>: Please. This photo was taken after hiking out of the cone of a volcano and then 1200 metres down the side of the mountain without running into a single other person. If you visit the island you will see what I mean when I say it is wild. <Murghchanay>: It's not \"wild\". Not many volcanoes have cities at their top<panameboss>: And this one doesn't either.. The town is in a valley at the BOTTOM of the mountain ffs. This was the trail: https://i.imgur.com/g3dSJq4.jpg You really going to tell me that doesn't classify as wild?<Murghchanay>: That's just tropical vegetation. <panameboss>: And fucking 1400 metre mountains lmao<Murghchanay>: Wheredo you live? 1400 metres is relatively small, even for volcanic islands. I just don't think you know what wilderness is<panameboss>: Bruh what. What is your requirements for something to be considered wild lmao<Murghchanay>: Here: [https://www.theguardian.com/environment/2018/oct/31/five-countries-hold-70-of-worlds-last-wildernesses-map-reveals](https://www.theguardian.com/environment/2018/oct/31/five-countries-hold-70-of-worlds-last-wildernesses-map-reveals)<panameboss>: Wilderness ≠ wild", "num_messages": 11, "avg_score": 13.5454545455}
{"start_date": "1544740635", "end_date": "1544773614", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<steamin661>: YEE-HAW! Wild West Travel Destinations in America? I am wanting to build a travel itinerary which is focused on the Wild West and Gold Rush of America. I am looking for points of interest and activities, which embody the stereotypical Wild West we know and love. Ideas I have, include: Horse riding through Zion National Park, Wild West gun ranges, Monument Valley Utah, Devils Tower in Montana, Virginia City, Deadwood, Bodie CA gold rush town, etc. Any ideas on additional places and activities would be appreciated! <Edit>: spelling and grammar<gymyjam>: Devils Tower is in NE Wyoming. Like another said check out the Black Hills nearby. I would also avoid all of that area during Sturgis Rally week.<gymyjam>: Also check out Custer South Dakota is a good one for wild west history. Not much to look at but you can read about how General Custer got wiped out.", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543504602", "end_date": "1543506439", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<gl0wfish>: Good morning travel experts, what is the best way to travel to New England (US) in the winter? I am headed up north for a couple of job interviews in three weeks. I need to get to Rochester, NY and then to New Hampshire after. The issue comes in where there is no airport where I am going in New Hampshire (Lebanon/Hanover), so I either have to take the Vermonter Amtrak or take a bus. Boston and NYC are the connectors. For the flights home NYC offers a direct flight to where I am returning to while Boston has a layover, so that is something to consider. I am reluctant to go to NYC though as I have never been before and am scared that I will have difficulty navigating there. &amp;#x200B; Part of me is just thinking \"screw it just drive\" which is 9 hours to Rochester and then an additional 4 to NH then about 14 back home, but at least I'd be in charge of my own transportation and there would be less moving parts. Obviously, in that case snow and road safety is a huge worry. I have a sedan. &amp;#x200B; How would you guys approach this? tl;dr: I need to get to New England for the week to get a job (hopefully) how do you guys think I can best accomplish it?<tariqabjotu>: I certainly wouldn't go all the way to New York just to a avoid a layover. <newloginwtf>: Very true. The drive is long and the region had quaint towns and nice landscape, but you'd be rushing to get to the city and the drive is long. A bus is feasible, but time on the ground would be wasted.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544739966", "end_date": "1544800059", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 1042, "text": "<AmishAmish>: Italy, Parghelia. Stayed in a small italian town next to the main tourist city (as it worked out much cheaper) and found this nice hidden beach. Ended up going there most days. <soyvickxn>: Are those cacti/nopales in the foreground?<idleat1100>: Yea, tuna! <soyvickxn>: Oh, my! Didn't think these were available in Europe.<idleat1100>: Yea all through Southern Europe, ate a bunch in Morocco too. They always seem to have the yellow variety. Never saw the deep magenta pears like in the Southwest where I grew up. But still tasty. <soyvickxn>: Yeah, they're actually delicious, but though I knew it was possible, somehow I didn't expect there were plants of that family in the Mediterranean", "num_messages": 6, "avg_score": 173.6666666667}
{"start_date": "1544763108", "end_date": "1544844751", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 48, "text": "<smashedon>: View looking down from Säntis, Switzerland. Worth a visit if you're there. Absolutely gorgeous views. <loveactuallyis>: Good god Switzerland is beautiful. What an amazing photo. I'm going for the first time in May and can hardly contain myself<smashedon>: Protip if you're not a wealthy person, the Migros grocery stores and gas stations sell pretty good food. Sandwiches and pastries and what not. I didn't find accommodations too expensive compared to elsewhere, but the food is very pricey. Like 30 CHF for a mediocre lunch per person. <loveactuallyis>: I've been reading that! I'm honestly shocked at the prices. I live in New York and am used to outrageous prices for food, but Switzerland is on another level. Thank you for the tip, we'll definitely want to save money on the food front so this is helpful :)<smashedon>: The trains and trams are also pricey, but every one I used to get up a mountain was totally worth it. Also, if you're visiting Zermatt, you cannot drive in. You have to park and take a train the rest of the way. The village is car free. I found this out in the dark trying to get to my hotel. Additionally, during the spring and summer (not sure how early into the spring) there is a dawn train up to view the Matterhorn on Thursdays only. It's a wonderful way to see it and they bring a traditional band with bag pipes to ring in the dawn. It's an interesting experience. <Sumjonas>: Getting a Swiss Travel pass for tourists might be worth it for you- it’s expensive, but depending on how much you’re going to go on a train and how long you’re there, you may find it worth it. I was there for 5 days and had to take a long haul train between Basel and Interlaken round trip, and found it worth it.", "num_messages": 6, "avg_score": 8.0}
{"start_date": "1543637050", "end_date": "1543711818", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7, "text": "<DannyMalino>: Lhasa, Tibet, China Hey guys, I work in night shifts in a hotel so i have a lot of time to surf in the deepest parts of the internet, tonight i was on google maps (i spent a lot of time there) looking for some cities in China and ended up in Lhasa, Tibet where i found this magnificent palace in the middle of nowhere (there's only mountains and more mountains around). After looking at some photos and stuff i tried to see just for curiosity if i could get there from Moscow by car (i'm from Portugal, but i don't know why this city came to mind) and i got this message: S*orry, we could not calculate driving directions from* *\"Moscow, Russia\"* *to* *\"Lhasa, Tibet, China\". I tried from other cities, same message, then i tried to go around China and i just couldn't reach outside using roads.* My question is just one: Why ? &amp;#x200B; <PS>: Sorry for my bad english :\\* <EDIT>: [https://imgur.com/6joO6gF](https://imgur.com/6joO6gF) This is the palace at Lhasa, it's called Potala Palace<UncleSpoons>: You can't just drive straight into Lhasa, you'd literally die from altitude sickness. Lhasa is located in the highest region on earth, the city itself is at a safe altitude, but the surrounding Himalayas get to dangerously high altitudes. The Train that connects China to Tibet has a sealed cabin with oxygen pumped in. If it didn't, the passengers could die from the lack of oxygen. The only way to go to Tibet is through a government sponsored tour, it is illegal and impossible to go on your own. If you start in China, a tour company can organize a train or plane to Lhasa. If you start in Nepal, it is possible to go safely by car, but it has to be on a government sponsored tour, with a tour guide driving the car. <DannyMalino>: I know all of that and that's not what I asked and the reason I created this post lol<UncleSpoons>: What are you talking about? You asked why google won't let you drive to Lhasa, I explained why, because there isn't any roads, and if there were, you'd die from altitude sickness.<DannyMalino>: No, I asked why Google maps doesn't let us have directions from outside side China to inside<OstentatiousDude>: Google doesn't work in China.", "num_messages": 6, "avg_score": 1.1666666667}
{"start_date": "1543637349", "end_date": "1543648542", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 25, "text": "<sp0ngeb0bz>: India EVisa SCAM WEBSITES - WARNING! &amp;#x200B; Oh wow - just leaving this warning for everyone guys. There are so many scam websites for India E-VISA. I almost went through and got charged $215 for a Tourist Visa!!! The SCAM Page had SSL Green tick and everything it need to look official. The scam page pops up number 2 or 3 on Google search! When I saw the conversion rate, that it was going to cost me $215 dollars, I hesitated at the last Mastercard payment screen and cancelled. Then after few minutes after i exited the website - i even got a phone call on my mobile and a guy offered to help me finish the application. I declined and he said if you dont finish the application then you cannot apply again for two weeks. (This is a common rushing tactic by scammers!) The correct website is [https://indianvisaonline.gov.in/visa/index.html](https://indianvisaonline.gov.in/visa/index.html) as of 2018! For example , the cost for Australian Citizen is US$80 (as per December 2018) Hope it helps you out. Be careful of the scam sites. I am a Software engineer and I can usually tell a scam site straight away, but there are Webpages that look so real that I even I got scammed!. Be careful.<tariqabjotu>: &gt; The scam page pops up number 2 or 3 on Google search! And the number 1 is the official site... I assumed people only end up on these sites because they click on the ads instead of the actual results. For things like this, you should be looking for government sites. <sp0ngeb0bz>: No 1 is not the official site mate. See all the promoted pages. In this search i did it was no 5. [https://imgur.com/a/GrPuyec](https://imgur.com/a/GrPuyec) just leaving warning here because sometimes people do travel changes due to various reasons and use small screens - tablets - public computers while travelling to get E-visas. IT is easy to be confused by Google Search results if you use a browser you are not familiar with etc...<tariqabjotu>: &gt; No 1 is not the official site mate. See all the promoted pages. In this search i did it was no 5. https://imgur.com/a/GrPuyec See the word \"Ad\"? C'mon now. <sp0ngeb0bz>: Sounds like you will be okay. There are often times people want to go to promoted Web pages. The Ad suffix does not always mean it is a bad website. <tariqabjotu>: &gt; There are often times people want to go to promoted Web pages. The Ad suffix does not always mean it is a bad website I thought you were tech-savvy. When looking up something on a search engine, the ads can effectively be ignored. The \"first result\" is the government website. I'm sure there are some people who don't catch on to the fact that these are ads, which is why looking out for a government site is a good idea, but knowing clicking on an ad for something like this... makes no sense. <jadeoracle>: Agree with you totally. \"First Result\" is the first result that matched your search, not the Ads that are trying to pay their way to the top.", "num_messages": 7, "avg_score": 3.5714285714}
{"start_date": "1543533684", "end_date": "1543535338", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 9, "text": "[deleted]: Best places to see Matterhorn? [deleted]<Oax_Mike>: I remember that the Matterhorn was shut down when we were there as kids because a 48-year old woman had just been decapitated.<travelingaccountant>: Jeez that's terrible. Did they use the Iron Curtain to cover the M?<Oax_Mike>: We just did Pirates of the Caribbean a 2nd time instead.<travelingaccountant>: They could use Trump's help to build THE wall", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1543637906", "end_date": "1543638150", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<ropliai>: Canadian First Time Traveller To The US/Debit Card/ATMs hello, everybody! next month i will be travelling to the united states for the first time, namely massachusetts, i'm very excited, however i have a question regarding using a Canadian debit card (CIBC/VISA) in the US. i know you guys have VISA cards/atms in the US, but can i use my debit card and withdraw money using an ATM in the US even though it's a Canadian issued card? i'm having some money sent to my bank account by a relative, and just wanna make sure i can easily access and withdraw that money in US currency while i'm in the states. :) thanks! look forward to having a great time in your country.<Kananaskis_Country>: &gt; can i use my debit card and withdraw money using an ATM in the US even though it's a Canadian issued card? Yes. Have fun.<ropliai>: niiiiice. thank you 4 the prompt response.<Kananaskis_Country>: Don't forget your Passport, and have a gas in Massachusetts. Happy travels.", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1544763388", "end_date": "1544765658", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 12, "text": "<Alexxisalex>: Coming up with a shared destination list Is there any websites out there where you can choose a range of countries you would like to visit and then share with someone else to see compatible destinations? I'd like to share something with my partner so we can start talking about where we'd like to visit next and in the future, Thanks!<Kananaskis_Country>: You can't simply list a few countries and email/text them?<Alexxisalex>: The thought had crossed my mind yes, I was hoping a map would be integrated to make it a bit more interactive.<Kananaskis_Country>: [Maybe something like this?](https://mapchart.net/world.html)<Alexxisalex>: That's great! Thank you", "num_messages": 5, "avg_score": 2.4}
{"start_date": "1543485989", "end_date": "1544038915", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 40, "text": "<AutoModerator>: r/travel Topic of the Week: Happiness Hey travellers! This week's discussion topic is the wholesome counterweight to last week's grumpy community thread. Please share with us what makes you smile when thinking about travel: the small and big things that make travel so rewarding for you. Or even addictive... --- This post will be [archived on our wiki community topics page](http://www.reddit.com/r/travel/wiki/topic-of-the-week) and linked in the sidebar for future reference. As the purpose of these is to create a reference guide to answer some of the most repetitive questions, please do keep you comments on topic. If comments are off-topic any particularly long and irrelevant comment threads may need to be removed to keep the community threads tidy - start a new post instead. Please report content that is: * Completely off topic * Unhelpful, wrong or possibly harmful advice * Against the rules in the sidebar ([blogspam](http://www.reddit.com/r/travel/wiki/faq#wiki_what_is_the_no_blogspam_rule.3F)/memes/referrals/sales links etc) <jippiejee>: While packing for an SEA trip, leaving this weekend, I realise that the *anticipation* of travel is truly uplifting :) Planning, packing, the process of travel makes me almost as happy as actually arriving there: loading music to my ipod, picking a book to read on the plane, listening to the buzz of people from all over the world in the airport, it's such a fun part of going on a trip. Maybe even the best past :)<Edward_the_Penitent>: What book did you pick?<jippiejee>: [IJsland](http://www.uitgeverijpodium.nl/book/341/IJsland), a dutch novel...<Edward_the_Penitent>: I can't read that!", "num_messages": 5, "avg_score": 8.0}
{"start_date": "1544751499", "end_date": "1544764662", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 3, "text": "<_m_s_l_>: My company is going to give away a travel backpack, what's everyone's favorite? [removed]<makanimike>: Peak Design Travel Backpack for city trips. Mystery Ranch (Glacier or Ravine) or Norrona for outdoors trekking.<Kananaskis_Country>: A man after my own heart.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1543610273", "end_date": "1543638988", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "[deleted]: What’s the best way to get to Cuba from Sydney, Australia? [removed]<Anton-Brovelli>: Plane<getoutofthechawper>: Dang! Here I was thinking a kayak would be an option *sigh* Back to the drawing board ;-)", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544755136", "end_date": "1544812475", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<zwandz>: European Beaches with Variety So my fiancé and I are planning our honeymoon and scouting through destinations. I’m fairly well traveled through the cities, and I know you can risk some redundancy of seeing the same thing over and over again. We’re trying to figure a route that includes variety, but ties in beaches. I’d prefer it was a logical route (at least as far as budget goes). Paris will be the starting spot, as fiancé’s must is Euro Disney. I’d like my must to be Croatia. Most likely Dubrovnik, but open to suggestions. We’re looking at coming home through Athens. I’ve looked at the South of France and a few islands of Greece, but became a tad overwhelmed. This is me taking a break for the night and looking for some inspiration. Dates mid to late August 2019, approximately 10 to 14 days. 2-3 Paris, 3-4 Dubrovnik. Thoughts? Suggestions? Thanks! <swollencornholio>: If 10 days Paris-Dubrovnik-Athens would be your trip. If 14 you could add one more place. No beach destination would really make sense by train unless it was close to Paris, Athens or Dubrovnik soo...you would want an aiport nearby too so you can go to your next destination. St Tropez Saronic Islands Islands near Split (Hvar)<zwandz>: Do you recommend Dubrovnik or more time in the Greek islands? <swollencornholio>: Depends what you're trying to do. For site seeing Dubrovnik, for chilling at the beach Greek islands. You could add a Croatian beach to Dubrovnik and get both. I'd actually recommend not flying out of Athens and leaving Greece for another trip. Instead see more of Croatia: Split, istrian peninsula (Rovinj), or Plitvice are some ideas...maybe even Ljubljana and Bled. Another idea is Kotor, Mostar, Split and the isles for beaches and plitvice to the trip. Looping from Dubrovnik to Venice with Split + Bled could be a good idea too though it may be a tad packed schedule wise with Paris in there. <zwandz>: The flights from Croatia to Toronto are insane, so that’s where Athens came into play. I could also add a major European hub for 1 day just to get the flight reasonable if I cut out Athens. The more read around about Croatia the more nervous I am it’s going to be stupid touristy. Which I know sounds strange, but what’s your take on that? Especially in comparison to Greece <Edit>: and once Athens came into play, I became interested in the islands and that’s right around when I got overwhelmed <swollencornholio>: &gt; The flights from Croatia to Toronto are insane, so that’s where Athens came into play. I could also add a major European hub for 1 day just to get the flight reasonable if I cut out Athens. That's why I mentioned Venice. Venice is generally cheaper to fly out of internationally and you can get cheap flights from Split-Venice. Could actually do something like Paris-Dubrovnik-Split for beach - fly into Venice then bus to Dolomites for some Alps then back to. Split is actually has cheap flights to Paris too so you could do a roundtrip then add Kotor and Mostar to the Dubrovnik + Split portion to round out the trip. There's also cheap flights from Split to Florence, Milan, Amstrdam Salzburg, Dublin Dubrovnik is well connected to Bari, Milan, Naples, Rome, Venice, Vienna, Athens, Paris, Berlin and Dublin. I think I would pick a beach that's in Croatia, maybe stay on Hvar. Then from there it's up to you. I personally would avoid flying the entire trip...so if I was going to Paris I would add St Tropez, Nice, Chamonix, Colmar or maybe Switzerland and Benelux but you seem pretty set on plane hopping. &gt; The more read around about Croatia the more nervous I am it’s going to be stupid touristy. Which I know sounds strange, but what’s your take on that? Especially in comparison to Greece Dubrovnik will be crazy touristy, like Prague levels. Other than that it's pretty standard. It's why people don't recommend too much time in Dubrovnik can see most of it in a full day. If you were travelling in one day I would stay 2 nights and leave the 3rd day unless you want to daytrip to mostar and kotor. Santorini and Mykonos is a similar level of touristy. Both locations have tons of less touristy options.", "num_messages": 6, "avg_score": 1.3333333333}
{"start_date": "1543640816", "end_date": "1543642879", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 14, "text": "<trainfart>: looking for help with euro trip My wife and I will be flying into London on the 6/4 and flying out of London on the 20/4. We plan on spending around 6 nights in London but also want to visit Paris and Barcelona, does anyone have any itinerary suggestions or think this is a feasible idea?<More_Beer_NYC>: Sure, look into the Eurostar for getting from London -&gt; Paris, fly from Paris -&gt; Barcelona, then fly back from Barcelona -&gt; London for your flight home. <trainfart>: Thanks! had no idea how cheap internal flights in Europe are $69 from Barcelona to London.<More_Beer_NYC>: Just be careful with fees for luggage you have, but is fairly easy/cheap. You could fly from London to Paris, but personally I enjoy the Eurostar more than flying. <trainfart>: I think we would enjoy the train to Paris. Do you recommend any of the budget airlines? Or just stick to Air France and British Airways?<lost_traveler_nick>: For those short hops they're all budget airlines. BA even has some code shares with Vueling. Both BA and Vueling are owned by the same group. Pick the flight with the best schedule for you. Read the terms closely. Follow the rules and you'll be fine. In addition watch which airport the airline is using. Ryanair likes to invent airport names. There is only one Barcelona airport. BCN is the code. The other two are a trek from the city and you can spend more for the transfer to/from the airport than the flight. BTW $69 US for those routes is on the high side for five months in advance. At least for just the seat.", "num_messages": 6, "avg_score": 2.3333333333}
{"start_date": "1544765456", "end_date": "1544825719", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 23, "text": "<Quaribea>: Best ways to prevent pickpockets? I’ll be travelling in Europe soon and was wondering what y’all do to prevent being the target of pickpockets? I’ve heard it’s best to keep stuff in your front pant pockets, but I can’t fit my phone or purse in these! So what are some other options for keeping valuables separated and safe? <Vorenvs>: Don’t go to hyper-touristed circus centres and forget to pay attention to your surroundings. And if you have to go be ready to stare down anyone following you and get a good right or left hook ready. I’ve had one pickpocketing incident and it was in Prague at night. Gypsy put his hand in my pocket. I put my fist in his jaw. Problem solved.<bpe9>: Starting a fight with a pickpocketer is not a good idea for 95% of the population<Vorenvs>: I didn’t start a fight, I ended one quickly and efficiently. <bpe9>: And thats pure luck that the person you hit could not fight. Generally somebody that's going around stealing will have more experience fighting, so if you do not train in any martial arts do **not** try start a fight &amp;#x200B; The vast majority of people can not box, and starting with a hook is a sure fire way to miss.. <Vorenvs>: No, he was a skinny little piece of rubbish person and I was with two good friends who can both handle themselves. He had no chance. There was no “fight,” there was a shot to his jaw, a shove, and he ran off. Stop projecting facts onto something you know nothing about. Also thanks for the downvote, great way to have a discussion.<bpe9>: You're encouraging people to be ready to throw a punch in general, these other details were left out. If its 1 vs 3 and they are half your size, sure then you have grounds to start something, but thats not what you said in your original post. \\&gt; Stop projecting facts onto something you know nothing about I speak from *general* experience. You're making *general* suggestions, not talking about the 1 specific situation that occurred to you, so I don't understand how me not knowing about your 1 situation has any effect. 95% of people do not know how to fight and thus, should not start fights. Specifically, starting with a hook is awful advice for untrained fighters<Vorenvs>: I had a guy put his hand in my pocket to steal my camera. I stand by my reaction. Had he been bigger and my friends not there, it instead might have been a shove. I don’t like fights or fighting and I’m not a violent person. I absolutely believe people should defend themselves mindful of circumstances and fending off someone literally grabbing stuff from your pockets is fair. That doesn’t mean attack a mugger or refuse to hand over a wallet if presented with a knife. Thankfully most thieves are bullies and they prey on easy targets. Don’t be one of those. <bpe9>: &gt;I don’t like fights or fighting and I’m not a violent person. I absolutely believe people should defend themselves mindful of circumstances and fending off someone literally grabbing stuff from your pockets is fair. That doesn’t mean attack a mugger or refuse to hand over a wallet if presented with a knife. Im on the opposite end of the spectrum, I love fighting (organised fighting, Im an amateur kick boxer), and I love watching fights. Don't get me wrong I'm not saying don't stand up for yourself, I agree people should defend themselves, but having a fighting background I still don't think its wise to fight random people if you can not fight. Just trying to save people from getting injured", "num_messages": 9, "avg_score": 2.5555555556}
{"start_date": "1543611885", "end_date": "1543615550", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<ceqarht>: Northern Ireland Day Tours? Hi all! I'll be heading to Northern Ireland and Ireland for a bit over a week in March. I'm trying to do some planning in terms or what to see/do while there. I'll be flying into Belfast (with 4 nights in a hotel booked before moving on to Dublin and/or Galway for the the second half of the trip). So, question: any recommendations for day tour companies leaving from Belfast? My boyfriend is really into Game of Thrones, so I thought a tour that goes to those locations + Giant's Causeway would be cool, but it looks like there are tons of companies and it's hard to tell the good from the bad. Any recommendations? (I know renting a car would be the easy thing, but I kind of like getting a guided tour with history and stories. I previously did a Newgrange tour with Mary Gibbons' company following a recommendation on here and loved it -- so something like that would be awesome.)<tattooeddryad>: We checked out the GoT locations by car without a tour, but I highly recommend the Black Taxi tours in Belfast. The tour is a couple hours and you'll drive around Belfast in an old black taxi while they tell you the history of The Troubles in the city and they show you a lot of the land marks. Really informative and an interesting way to learn about the city and its history.<ceqarht>: Great suggestion! I'll check out the Black Taxi tours.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544687229", "end_date": "1544991927", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7, "text": "<soQuestionable>: Struggling to pick a place to travel to! First time posting here! I apologize in advance for the scattered thoughts and long post. I hope you read all the way through! &amp;#x200B; I have two weeks off in January (Jan 5-19) and would like to budget somewhere around $2000USD excluding my flight. Unfortunately, since it's winter, I'm struggling a bit on where to travel to, so I'm hoping you guys can help me out! Just a note, I prefer weather anywhere from 50s-70s (F). &amp;#x200B; I'm a 27M living in NYC. However, I don't want to go to big, touristy places like NYC because it'll be overcrowded with people. I tend to enjoy smaller cities. &amp;#x200B; As for international places I've been to: Taiwan (Kaohsiung; Taipei), Thailand (Chiang Mai), the Philippines (Manila; Leyte; Palawan), South Korea (Gangnam), China (Beijing; Hong Kong), Indonesia (Bali; Lombok; Jakarta), Poland (Poznan), Canada (Toronto, but I was a kid and don't really remember much). &amp;#x200B; Within the USA, I've mostly been along the East Coast. Off of the East Coast, I've been to Hawaii, but that was on a cruise, so I didn't spend much time on the islands. This isn't exactly the USA, but I've also been to the Bahamas and Bermuda while on cruises. &amp;#x200B; I'm looking for a place where I can enjoy the outdoors and enjoy smaller towns/cities. Ideally, my next trip was to hike the Dolomites in Italy, but I fear it'll be way too cold to go there in January. I enjoy hiking for fun, but usually limit myself to day trips like those found in the Catskill Mountains. I would say my camping experience is extremely low. Also, I wanted to see the Cinque Terre in Italy, but I hear that it is now crowded with tourists. I assume visiting the Cinque Terre is also not so enjoyable during the winter months, but hiking through the five towns and experiencing the cultures sounds like my type of trip. &amp;#x200B; Other than hiking, I do enjoy trying new kinds of foods. I'm not so much into nightlife. I would not go in to a club or a place with loud music, but I would go to a quieter bar to wind down after a long day. I enjoy seeing historic sites, like Peru's Machu Picchu, and learning about its history. I am not so much into art. As for beaches, I don't mind them, but would not spend more than two nights along a beach. Of course, if a beach is recommended or along a route, I will most likely check it out. Otherwise, I want to do more exploring! &amp;#x200B; I only speak English. There's Google translate, but sometimes that isn't enough help, or reception is bad. Just a thought to keep in mind. &amp;#x200B; Some places that I've wanted to travel to are: Mexico, Peru, UK, Japan. I'm just sure if any of these places are good to see during January. I'm also intimidated by foreign languages since I will be traveling alone. The UK will be English-friendly based on my above list, but I do not want to be limited to there if other countries are more English-friendly than most people think. &amp;#x200B; I would love all and any recommendations! I don't expect itineraries (not stopping you if you write one though!), but if you have suggestions on how to fill my time, I welcome it!<peIVasse>: I would suggest Oberstdorf, Germany. It's very quiet and peaceful and you're surrounded by mountains. You can either ski Nebelhorn mountain or hike all you want during the winter months. It's also a tourist resort but it's not extremely populated like most resorts can be. Not to mention that you won't get lost because it's a small village and the train station is connected to it. Many restaurants with excellent food as well. I highly recommend this place. I also wanted to mention a few things during my experience there. My Airbnb host was very nice and the place I stayed in was very nice with a balcony facing Nebelhorn mountain. I was lucky enough to have sun the entire week but keep in mind they do have their fair share of rain so plan accordingly. I didn't ski because I was there for a competition for a different sport and didn't want to get injured but I still went up the mountain on the ski lifts. You have to take 2-3 different lifts to get to the top but the views are more breathtaking each lift that you take. Once you get to the top they have a restaurant of some sort with windows to spend your time eating/drinking while enjoying the view. There is also a small tunnel above the restaurant that leads to a sky walk that you can walk on to experience what it's like to be at the top of a mountain and look straight down. Very cool! I didn't do any hiking but I do know they have it. If you end up going I hope you have a good time. Good luck!<soQuestionable>: This sounds beautiful! Right now, it's a debate between your recommendation and Portugal, since two other people recommended there! But this seems more in line with my typical hobbies! Thank you!<peIVasse>: No problem. I hear good things about Portugal as well.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543641979", "end_date": "1543683351", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 14, "text": "<stonesi>: Visiting Denver, CO, USA in February - clothing/weather tips? A friend and I are visiting Denver to go to an Avs game in early February of next year, and I’m wondering what kind of weather to be prepared for? I’m coming from Oregon, so I’m *reasonably* prepared for cold weather, but the altitude is a factor I have no reference for. I’ve got a good Columbia jacket and winter boots, but will I need to pull out the thermals/gloves/earmuffs too? A 30-40 degree (F) day with snow in Portland is about the extent of my winter experience. Any advice is much appreciated! <Update>: Thanks for all the tips everyone! Having an experienced answer, even when that best answer is “Check weather a few days before so you know what to pack”, really helps calm some of my travel anxiety. Thanks again! :)<jadeoracle>: Could be in the 0's and snowy, could be 60 degrees and sunny. Bring lots of options. <shytooth>: Came to say this. Check the weather closer to your trip because you may have t shirt weather, or you may have a blizzard.<jadeoracle>: I remember one year in February it was warm, like 60 degrees warm for weeks. I flew out to a Costa Rica trip in essentially shorts. But...when I got back...completely forgot about it, and it was a blizzard. I remember waiting for my shuttle for almost an hour outside in the snow. I had gloves and a hat, but no pants or anything better than a sweatshirt. Now I have to always be prepared for weather changes when I get back to CO.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1543638708", "end_date": "1543798564", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7, "text": "<Realconsulting>: Help Using Miles for AA, UA, and AMEX Points I need help using air miles. If anyone could let me know the most efficient way to use the following miles to get 3 business class tickets to Korea, I would be very appreciative. I will be flying in April 2019. I have the following miles: American Airlines: 260,000 <United>: 125,000 Amex points: 120,000 These points can be converted to miles but AA and UA are not on the list. Thanks for any advice you can provide. JB<tariqabjotu>: Use [Award Hacker](https://www.awardhacker.com/). You don't have enough miles for three business class tickets, round-trip, unless you travel on separate airlines. What your options are will depend on where you're flying from. And then you have to check availability. On AA, you're looking at 120k round-trip. On UA, it's 140k, but only on United. There are potentially cheaper partners, e.g. ANA.<Realconsulting>: Dear Tariq: &amp;#x200B; Really nice of you to respond to my request. I will check out Award Hacker and see what that has for me. Merry Christmas.", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1543514504", "end_date": "1543848642", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7393, "text": "<xflowerchildx>: Belém Tower in Lisbon, Portugal <AlphaBetaParkingLot>: Shit I'm in Lisbon now but leave tomorrow. Wonder if I'll have time to check it out...<giro_di_dante>: You went to Lisbon and didn't plant on visiting this tower/neighborhood?! That's a shocking bit of news. <southieyuppiescum>: I didn't either! It was kind of out of the way and I'm not a huge monument/museum guy.<giro_di_dante>: The neighborhood in which it's located, Belem, is amazing. And that area goes beyond the run of the mill monuments/museums. It's pretty much the departure point for the Portuguese maritime empire. There are several dedications there to the Age of Discovery, including a giant map of the world made of marble and laid out on the ground, which you can only see in full from the tower. It's a remarkable area, with a lot of truly cool and fascinating historical sites. And damn good food. <Derik_D>: I am from the Lisbon area and would say this is the main area to visit. If people are not visiting this section I don't really get it at else they are seeing. It is like going to Paris but not checking out the Eiffel Tower. <ananananaaaaa>: I think our Eiffel Tower is not an actual monument but a landscape. I think it's what you see from the S. Jorge castle, from the ferry, and from the countless belvederes all over Lisbon. Belém is a very nice area to visit, no doubt, but I don't think it's *that* iconic. Sintra is a bigger attraction than Belém, actually.<flutuar>: Quando fui a Paris nem visitei a Torre Eiffel havia imensas coisas que me pareceram mais interessantes. E se no caso de Belém acho que é uma área que merece ser vista há muitíssimas coisas para visitar em Lisboa sem ser Belem. Alias há quem nem considere Belém Lisboa.<ananananaaaaa>: Belém é interessante porque tem ali um cluster de coisas para visitar e depois ainda tem pastéis e tudo (e aquele passeio junto ao rio é um espectáculo, sobretudo passeando de pastel em riste), mas acho que há coisas muito mais giras em Lisboa (eu ainda considero Belém Lisboa) e sem ser necessário passar o dia a saltitar de fila em fila.", "num_messages": 9, "avg_score": 821.4444444444}
{"start_date": "1543640344", "end_date": "1543669064", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 4697, "text": "<PingitBrah>: Streets of Hakodate in Japan near the old British consulate <Retrooo>: I’m literally a block away from there right now. Weird.<elefandom>: How’s it feel?<Retrooo>: Cold.<PingitBrah>: I just left Hakodate for Sapporo a few days ago haha. But yea, Hakodate's historic buildings and food were incredible. <Retrooo>: I just came from Sapporo, last night in Hakodate tonight and then on to Noboribetsu tomorrow morning. Happy travels!", "num_messages": 6, "avg_score": 782.8333333333}
{"start_date": "1543636822", "end_date": "1543764949", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 10, "text": "<snow-light>: Help with winter (Jan/Feb) Norway itinerary, please! Hi everyone! My friends and I are planning a Jan/Feb trip to Norway, mainly to see the northern lights &amp; landscapes. This is our plan thus far: * 1.27: flight into **Oslo** (early morning arrival) * 1.28: Oslo-&gt;**Bergen** (train, arrive in the evening) * Stay 2 full days in Bergen * 1.31: Early morning flight from Bergen to Bodo, then catch the afternoon ferry to Lofoten Islands (arrive in Moskenes/Reine) * Stay 3 full days in **Reine** * 2.4: Reine-&gt;Leknes, 6PM flight from Leknes to **Tromso** * Stay 3 days in Tromso * 2.7: Tromso-&gt;Oslo (in the evening) * 2.8: After spending a full day in Oslo, fly out at night **My biggest concern is the Lofoten Islands. What is the best way to get around it? Is renting a car necessary?** If so, what are the driving conditions like in Feb? My friends are experienced drivers but they have no real winter driving experience. Of course, tips/comments about all aspects of this itinerary would also be very much appreciated! We are still in the early stages of planning and this is my first serious-winter trip. Usually I just can't take the cold, but hey northern lights…(I know there is no guarantee but I'm hopeful. :)). Thanks for reading!<aknomnom>: This sounds like so much fun, please post any awesome photos you take! I've only been to Oslo and Bergen, but in case you're interested---there's a great food hall in Oslo off Youngstorget. It's fun to walk around and offers really tasty food. I ate lunch at the seafood place---delicious---and picked up some charcuterie to snack on during my train ride to Bergen. There's also a lot of cool street graffiti/art in that neighborhood as well, if that's your thing. Bergen was a little more touristy, but I enjoyed taking the funicular up to the park and walking back down. There's a good bakery near the base of the funicular, so I'd suggest taking a pastry along for sustenance on the way down (lots of switchbacks). Best of luck and safe travels!<snow-light>: &gt; There's also a lot of cool street graffiti/art in that neighborhood as well, if that's your thing. Thanks! That totally is my thing! ;) Do you think 2 days in Bergen sound about right? I would love to try some Norwegian food. Do you remember the price range for food (restaurant dishes and snacks)? Thanks again!<aknomnom>: No prob! I think Oslo has more to offer (attractions, food options, neighborhoods, etc). Bergen felt like a cutesy tourist town down near the wharf mixed together with a sleepy college town further away. I was there over an Easter weekend though, so the holiday might've skewed my experience. But based upon it, 2 days would be plenty for Bergen. Everything in Norway was very expensive compared to what I was used to paying in the US (and even pricey compared to Denmark and Sweden!) but it was also usually better quality. $20-30 USD (160-240 Kr) for a non-fancy dinner (as in a bowl of soup with bread) and $10 USD (80 Kr) for a pastry and tea at a neighborhood bakery. Beer/wine or a 3-course meal would likely more than double and triple, respectively, that budget. <snow-light>: Thanks for the quote! I hear the seafood is very good. Would like to try it a couple of times at least.<aknomnom>: It is, and you should! Have a great trip!", "num_messages": 6, "avg_score": 1.6666666667}
{"start_date": "1543326721", "end_date": "1543363233", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 4921, "text": "<daKav91>: I did the W circuit in Torres Del Paine and was treated with this view coming out of Cuernos campsite <HarryScrotes>: Wow, that is amazing. I was thinking about heading to this area myself possibly in January or February. What were the prices like? Like for hotel and meals? The only countries in South America I’ve visited are Peru and Bolivia. From what I understand Chile is substantially more costly.<andres57>: &gt; I was thinking about heading to this area myself possibly in January or February. it's too late sadly, I understand that you have to reserve with a lot of anticipation even for camping, unless you want to visit only for the day (i.e. day trip from Puerto Natales). <HarryScrotes>: You mean like every accommodation is already booked through the summer there?<andres57>: camping at least have limited availability, since one or two years you have to reserve because the amount of people was just too much. No idea if hostels and hotels. You would have to check both options ASAP<HarryScrotes>: So you can’t just set up your own tent? I have a pretty nice one, I’m used to camping just anywhere I want out in the wilderness here in Colorado.<andres57>: yep, there are determined zones for that to protect the nature. [too much stupid tourists leaving a mess in the park](https://es.wikipedia.org/wiki/Incendio_forestal_de_Torres_del_Paine_de_2011-2012)<daKav91>: Like the dude that tried to burn toilet paper and the set the park on fire", "num_messages": 8, "avg_score": 615.125}
{"start_date": "1544767330", "end_date": "1544770222", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<Symbolician>: Is there a guide for Korail? Im planning on taking the KTX from Seoul to Busan on 5 Jan 19 and from Busan back to Seoul on 8 Jan 19. I see multiple types of tickets and bulk buy from 2-5 people and ecinomy and 1st class tickets. Im not quite sure which is the best option. Any advice? My group is a group of 6 uf that helps.<tariqabjotu>: Seat61 has everything you need to know about trains. It's even linked in the sidebar. <Symbolician>: as in the Flexi Day tickets. I checked out the website but there wasnt any explanations regarding that. Im wondering if I could buy the Flexi Day tickets in my case<tariqabjotu>: It is mentioned there, although it points you to the Korail site. And indeed, the Korail site provides everything about the pass (which kind of seems like overkill but I guess does actually price out a bit less than a round trip).", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1544498697", "end_date": "1544772436", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "[deleted]: Coming back from England [removed]<Kananaskis_Country>: &gt; Is there any way I can bring that back with me in my checked bag? No problems.<LilRebel57>: Would I need to claim it or can I just toss it in my bag and be good to go?<Kananaskis_Country>: No clue what your OP was about. It has been removed.<LilRebel57>: My OP was asking how I would go about bringing back drinks like lucozade and snacks back from the UK in a checked bag, if that’s possible<Kananaskis_Country>: I answered that in my first reply. Don't overthink this.", "num_messages": 6, "avg_score": 1.0}
{"start_date": "1543551399", "end_date": "1543650749", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 33, "text": "<CrossfittJesus>: View of St Vitus Cathedral, from the Christmas market below [Prague, Czech Republic] <vagrantheather>: Lovely. What was your favorite thing to do in Prague?<CrossfittJesus>: Still there now! Love just getting lost and stumbling into gems here and there <vagrantheather>: I am headed there in May (just booked flights yesterday!) and although everyone says it's amazing and I need to go, I've heard very little about what to actually do when I get there. Please do share your favorite things when your trip is over. Enjoy the rest of it!<CrossfittJesus>: Hey! If you want to, PM me and I can drop you an itinerary!", "num_messages": 5, "avg_score": 6.6}
{"start_date": "1544768624", "end_date": "1544770495", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 19, "text": "<RecnepsD>: Traveling to Paris on Dec 24-29 I booked a 5-night stay at the Pullman hotel and looks like I won't be getting my money back even if I want to cancel. With all the news about the riots and the recent terror suspect, do you guys think it's still worth/safe to travel to Paris? I'm hearing a lot of restaurants and shopping centers closing down.<tariqabjotu>: Paris isn't a warzone. Seems you're from LA. I assure you Paris is safer. I can only imagine if tourists applied the same metric to US shootings as you are to the Strasbourg one... <More_Beer_NYC>: I mostly agree with you, but didn't most 'touristly' places close last Saturday? Really only advice I would give is if the protests are going on, maybe think about a flexible Saturday.", "num_messages": 3, "avg_score": 6.3333333333}
{"start_date": "1543644355", "end_date": "1543666565", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 18, "text": "<MoofuJJ>: Do award seats on asian airlines typically \"open up\" later? Im planning a trip to Bangkok in early February of next year, im an ex plat on AA. I was hoping to book the trip with award miles, however im running into a bit of a block, as there doesnt seem to be any award seats available currently. I was attempting to go DFW-HKG-BKK or DFW-NRT-BKK, but the problem seems to be there being no award seats for the last leg of the trip. If I wait and keep checking, do you think theres a better chance of seats \"opening up,\" or should I take what i can find now?<tariqabjotu>: This is strangely worded. Like \"Asian airlines\" operate the same way as each other and notably different than American airlines? What dates are you flying? Particularly from Hong Kong, you might be colliding with Lunar New Year, reducing availability.<MoofuJJ>: I have flexibility in my dates, but I was hoping to fly around the 6th of Feb ( i can do a couple days before and after) And That does explain why im having difficulty with Hong Kong, I seem to be colliding with the new year. <tariqabjotu>: What class are you flying? <MoofuJJ>: I would like to fly business for as much of the time as possible.<tariqabjotu>: I see availability from Tokyo to Bangkok on Feb 4.<MoofuJJ>: do you have what airlines it is? I am on the AA site and its showing as a blank for me<tariqabjotu>: Going to double post on this. You seem to be unaware that AA.com doesn't show award availability for every partner airline. Like, for example, JAL. So... you could spend all day there, and I don't think you'll find any availability for them on any day. <MoofuJJ>: Ah, thanks! I was unaware about that!<LupineChemist>: Paying for a month of expertflyer might be in your interest.", "num_messages": 10, "avg_score": 1.8}
{"start_date": "1544769444", "end_date": "1544773590", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 3, "text": "<web_dev_etc>: What are your thoughts on Ryanair's recent (ish) changes to their cabin bag policy? Ryanair gets a lot of hate, but to be honest they are cheap and get you to your destination in the same way as other airlines, and they fly to almost any city I've wanted to go to in Europe (often the only airline that did). But they've recently changed their cabin bag policy. You used to be able to take a small suitcase / backpack, plus a smaller bag (under front seat ). Now you have to pay 8 GBP for that (plus priority). On some recent flights that just means that the priority queue is about 4 or 5 times larger than normal queue, everyone has small suitcases or backpacks, and it is the same problem as before where it is a struggle for space. On a recent flight they actually stopped selling the priority + 2 cabin bags (I guess they have a limit), then you are limited to 10kg checked (for 10 GBP), or just the one single small carry on. When they first changed their rules (I think at the start of the year - I remember it was definitely in place in Feb 2018) the priority queue was smaller, everyone checked in bags for free so there was lots of overhead cabin space and was a much nicer system. Now that you basically have to pay for any bag other than a small one that goes under the seat in front of you it hasn't fixed anything...<lost_traveler_nick>: The current rules where changed officially in November. I think they were supposed to start in September. The rule change earlier was to gate check non priority. That was awhile ago. It's not €8/£8 plus priority. To bring a larger bag onto the plane you have to buy priority. That's it. IIRC the €8 is to have a small checked bag. There is a limit of I think 90 priority passengers. It's linked to the number of overhead bins. If everybody follows the size rules there should be enough over head space for everybody. If somebody brings a larger case it messes up everything for everybody. Personally I've always bought priority. That means no change in price for me. BUT the new SMALL bag is bigger and for me that matters. I can put almost all my heavy stuff into that small bag. Camera,lenses and batteries. If I had a 15 inch laptop that would also fit. A 10KG carry on with just clothes would last me for quite a while.<web_dev_etc>: Oh yeah, i meant it is 8 GBP for 2 bags, but you get that plus priority.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1544757733", "end_date": "1544758300", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<jisaacs1207>: Buying a triangle return trip for a reasonable price? Usually, round trip flights are cheaper than if you buy one way. I need to go from china-&gt;USA-&gt;Ukraine-&gt;China... this seems to be charging me three one way tickets. Is there a way to get this cheaper?<tariqabjotu>: This doesn't surprise me. Three different continents... no way to make this into an open jaw unless you have no problem taking inefficient routing for one of the legs (e.g. flying through Europe on the way back from China to the US, which may not be so bad depending on where in the US you are going). Ukraine isn't exactly a big transit hub either. <jisaacs1207>: Actually, touching down in Europe isn’t a bad idea for a rest between legs. I’m traveling with two babies and a wife. :)", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543530536", "end_date": "1543539394", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 47, "text": "<tpq777>: Travel Agent: Does it matter if they're local to me? My fiancé and I are planning a honey moon in 2020. We want to travel to Bali then Japan. There seem to be limited agents in my city and most of them specialize in trips to the Caribbean or Mexico. Will my experience with an agent be drastically different if I find one in a different city than me? Has anyone else done this?<jippiejee>: You don't need an agent. This is so easy to organise yourself with all the online booking engines available.<tpq777>: The thought of planning travel between two countries really makes me nervous. I'd be fine if it were just Japan since I've been before, but I'm not familiar with Bali at all. I don't even know where to start, and thought an agent would have some good insight.<electricsheep12345>: If there was a place to do research ... maybe call it Foogle ... and if only there was somewhere to ask specific questions about travel.... Sigh .. oh well .. I guess the fact you're going to an extremely obscure place that almost no one goes to makes it even more challenging. <tpq777>: An idea for you... if you have nothing worthwhile to contribute to a conversation, move on. My question is specifically about using an agent local to me vs. an agent not local to me. I didn't come and ask \"how can I plan a trip to Bali?\" My comment about not knowing where to start is simply a response to someone saying I could plan it myself. I don't want to plan it myself which is specifically why I'm asking about an agent. Some people have better things to do with their time and resources than look for hotels, travel fares, and activities. But Sigh .. oh well .. I guess the fact that you have trouble reading the original question should justify your childish response. <Oax_Mike>: &gt;Some people have better things to do with their time and resources than look for hotels, travel fares, and activities. In all honesty...other than masturbating, this is literally the best thing to do with your free time.<electricsheep12345>: I know of super busy parents wanting someone else to plan their Hawaii vacation for them and their 3 kids .. but your honeymoon?<Oax_Mike>: I still think it's a dumb way to plan your trip. Vacation is the best thing to happen all year, why not optimize it for your own personal tastes? I mean, I guess if all you're having is some shitty ass boring Hawaii trip with 3 kids it doesn't matter much. All you need is a car, a condo and a revolver to blow your fucking brains out.<Edward_the_Penitent>: Alright Mr. Contiki cool it<Oax_Mike>: My greatest pain in life is that I will never be able to see myself perform live.<Edward_the_Penitent>: I hosted a game show at work today. I made people spin in circles and do an impression of Mrs. Doubtfire.<Oax_Mike>: I really don't see how any mapping gets done at that place. I went into the wrong field.<Edward_the_Penitent>: I dunno but they gave me a bonus for putting it all together too lol Also had a couple beers with my boss's boss and his boss after work today in the office. Sweet gig.<Oax_Mike>: You're moving on up! I had a beer today at work, too, but it don't count.<Edward_the_Penitent>: I run two regular social events at work. I have my monthly travel discussion and now I have a quarterly geography trivia event. Today's game show was a one time thing meant as a promotional run up to next week's Cultural Day, which I am on the council for but am not running personally. <Oax_Mike>: I just unplugged a toilet.<Edward_the_Penitent>: Also cool.", "num_messages": 17, "avg_score": 2.7647058824}
{"start_date": "1544771583", "end_date": "1544801237", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 9, "text": "<garau>: Question about crossing border into Canada with hockey equipment Three of my friends and I will be crossing the border for a short stay in Niagara Falls, Ontario tomorrow. We are going to be crossing from Detroit late at night after a Red Wings game. All of us play hockey and we’re thinking about taking skates and sticks to try to find somewhere to play up there. My question is, do you think this will create cause any issues at the border? I don’t have much experience with crossing the border, however I’ve read articles that say not to take anything that isn’t a necessity. Hockey sticks are long and very visible so the border agents will no doubt see them. I may be overthinking this a little, but I don’t want to make it any more of a hassle than it needs to be.<BOATS_BOATS_BOATS>: Exactly what trouble do you think hockey equipment is going to cause? It's a national sport in Canada.. You think they'd turn you away for having hockey gear? If they ask, just tell them you wanna play hockey while you're there. <electricsheep12345>: I honestly don't understand how people think these are things to worry about. It's freaking hockey gear!<LupineChemist>: I mean, given it's Canada they might be worried that it could be inspected and could be given snide comments from CBSA if the the equipment isn't top notch. Also, maybe possibly challenged to an impromptu match at the border. Real concerns. But yeah...particularly crossing at Windsor. Half the people crossing there are explicitly crossing for hockey.<AntiquePangolin>: Hahahaha! “Win this one, Yanks, or you’re not coming in, eh?”. Tim Hortons after. :-)", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1543507913", "end_date": "1543647256", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 19, "text": "<pradain>: Need help planning days 4-7 in Italy! My boyfriend and I are flying to Milan, Italy this Sat. We bought a round flight ticket to/from Milan, Italy. We have never been to Italy before. Here's our plan so far.. - 1 Milan (confirmed) - 2 Milan (confirmed) - 3 Milan (confirmed) - 4 Como? - 5 Milan? - 6 Milan? - 7 Milan? - 8 Milan (Must be Milan on this day because that's where we will go to the airport to fly back home) My plans for the first 3 days- -Sforzesso Castle -Duomo -Galleria Vittorio Emanuele II -Evening - go to the naviglia area and have an apertivo and then go to the darsena -Monuemental Cemetery -Leonardo's Last Supper -Walk around in the Bret District **Length** - 8 Days **Budget** - We hope to spend around maybe $500 if possible. We've bought Milanocard for 72 hours - free public train in Milan. **Room** - So far, we have booked a room for the first 3 nights in Milan ($230) including breakfast buffet. A lot of food options! **Climate** Well, we're traveling in December. We already know that it will be cold and we're used to this weather. **Interests** - <Food>: This is extremely important! We're HUGE foodies! As long as the food is good, it doesn't matter if it's 4 star or came from a street cart. We would probably want a few nice meals at good restaurants, though. <Outdoors>: We like sightseeing. We don't mind hiking. We don't want to hike for more than an hour because of the weather. <Culture>: The whole point of traveling is to see music, museums, historic places and cultures different than your own. Any suggestions for days 4-7? <swollencornholio>: I'm not sure how you'll spend $500 when you already spent $230 on 3 nights. If you're booking things for $80/night and are staying 8 nights you blew your budget by $160 on only accomodation. That doesn't include eating, site seeing, transportation within the city, etc. Regardless I would bump your budget up and add at least one (maybe two) more destinations other than Milan. Milan gets boring after 2 days and is pricey. I would stay in Como 3 nights after Milan (guessing 12/5-12/7?) and see Varenna and Belagio. Here's a couple spots on Airbnb around $60/night t with all fees: [$50 - Real bed](https://www.airbnb.com/rooms/29091847?location=Como%2C%20Italy&amp;check_in=2018-12-05&amp;check_out=2018-12-07&amp;s=dzcI7p3c) [$63 -Pullout couch](https://www.airbnb.com/rooms/15940168?location=Como%2C%20Italy&amp;check_in=2018-12-05&amp;check_out=2018-12-07&amp;s=tdjhbK-U) [$60 - Real bed](https://www.airbnb.com/rooms/29210150?location=Como%2C%20Italy&amp;check_in=2018-12-05&amp;check_out=2018-12-07&amp;s=dzcI7p3c) I'd probably add one more city but you've allocated quite a bit to Milan already. You would basically spend a night in the other city...Verona or Bologna would be good choices. <pradain>: Yeah, I had a feeling that we may spend more than $500 and that's fine! As long as it's not over 1K. We need to save some money for Christmas haha. How about this.. Milan - 3 nights Como - 2 nights Bologna - 1 night Milan - 2 nights. We're leaving in the morning on Dec 8 so I think it'd be better if we stayed near the airport one day before we fly? <swollencornholio>: ehhh I would do Milan 3 (if you have to - if it's still refundable I would do Milan 2, Como 3, Bologna 2, Milan 1) Como 3 Bologna 1 Milan 1 - You don't need the whole day there to prep for your flight (or two for that matter). Milan's an hour away from Bologna - probably less than you travel to get to your home airport.<pradain>: Wow, Milan must be that boring! I will speak with the hotel and see if we can do Dec 1-2. Any good food places you know in Milan/Como/Bologna? :)<swollencornholio>: Read through this guide on Bologna: https://www.2foodtrippers.com/bologna-food-guide/ Prosciutto and Parmesan are heavily sourced out of Parma so you'll have loads of that. Could probably make a day trip to a Parmesan farm if you want.<Methenorth>: Drogheria Della Rosa in Bologna! Our favourite meal from our trip. Bologna is criminally underrated IMO", "num_messages": 7, "avg_score": 2.7142857143}
{"start_date": "1539051284", "end_date": "1539083126", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<Jimwhip>: Traveling to Jamaica dangerous? Going here at the end of November. After booking the flight I keep hearing about how it's really dangerous. I got back from Colombia a couple months ago and I heard the same thing but nothing serious happened. Are Americans generally just pussies or do I have to be concerned? Obviously not going to be bumbling around in sketchy areas. Flying into Montego Bay. Wanted to explore Kingston as well, take a bus over there but I hear you might get raided by gun toting dusche bags. Should I believe any of this?<americansaredumb666>: LOL, yes Americans generally are pussies. Lots of my friends will ask me dumb questions like \"is Japan safe?\". I don't think Americans realize that the US is actually quite an unsafe country. Jamaica is fine in the tourist areas like Montego Bay, they do a good job of keeping out the bad elements. <Jimwhip>: I want to venture out some though. Maybe Kingston isn't a good idea. But think I want to go to Negril and Portland. Maybe Port Royal, Ocho Rios, the blue mountains.<americansaredumb666>: Any place with lots of tourists is safe. I went to negril and Mb they were fine. Kingston i dont know", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543645405", "end_date": "1543713892", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 20, "text": "<lastditchattempts>: We struggled to breathe at altitude and were unsure of the route. These colourful flags brought great relief. At intervals, monks use them to mark the Lungchu Tsey trail in Thimphu, Bhutan. <4_seasons_in_one_day>: How could you be unsure? Your Bhutanese guides knew exactly where they were going. They've done it hundreds of times before.<lastditchattempts>: I was with my dad whose mobility is limited. The guide went ahead with the rest of the group and came back later to check on us. <4_seasons_in_one_day>: So, you knew where you were going. That trail is very clearly marked. Nothing unsure about. Except to add drama to your title ;-)<lastditchattempts>: It definitely wasn’t inherently dangerous like a hardcore Himalayan route requiring Sherpas and supplies but the drama in the title was actually understated. The actual hike was stressful, and the possibility of trouble real. Have you hiked the trail? The flags fall off for long distances. There are forks and pathless stretches. With my septuagenarian dad being unable to see roots and rocks due to macular degeneration and reporting an occasionally racing heart, I was genuinely concerned I would lead us the wrong way, he would run out of gas, and we would run out of daylight. We were so far behind the rest of our group the guide asked the monk at the monastery for light refreshment in place of lunch as they waited for us. We were never going to make lunch at the scheduled place, given our pace. On the way down, the guide stayed with the two of us the whole way. The descent was harder on my dad because he was fatigued from the ascent and it required muscle stability he doesn’t have. He does zero strength and cardio training. The climb itself was voted toughest of our trip - more so than Tiger’s Nest - by the group. The group leader printed a special certificate of recognition as a token for my dad for that very hike. I’m proud of my dad for finishing! <4_seasons_in_one_day>: Ok, so the main issue here is that your dad shouldn't have been on the hike. That's all. And at the start of the hike they even ask you if you want to use a pony part of the way. It was your choice to decline. And yes, I've done it. It's actually pretty easy for an average person. Which explains why the rest of your group was so far ahead of you. The guides do this hike all the time, they know the route, they know the difficulty level and they know that the risks are minimal. Otherwise they would not have let your dad do it. If something had happened to him, the guide would have been in a lot of trouble. Unless of course, your dad misrepresented his health issues and fitness level at the start of the hike.", "num_messages": 6, "avg_score": 3.3333333333}
{"start_date": "1544772737", "end_date": "1544773015", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 4, "text": "<mr__sniffles>: Traveling to France on Jan 15 [removed]<tariqabjotu>: Please see the nearly identical question posted an hour ago. <mr__sniffles>: Are there any areas I should avoid?<tariqabjotu>: Feel free to comment in the other thread if you have further questions.", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1544712278", "end_date": "1544727148", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 19, "text": "<silkspiders>: How to pack for very cold and very hot climate change? I'm flying US -&gt; India for 3 weeks but have two 34 hour stopovers in Finland on both ends! I don't want to bring a big suitcase but if I wear a winter coat it's going to take up half of my luggage while travelling India. But I really want to see as much of Finland as I can and expect to be walking around outside quite a bit. Any suggestions?<Prof_G>: when in Finland, leave cold weather stuff there for your return. Arrrange with hotel. not a problem. <CheeseWheels38>: Would a hotel really store things for three weeks? <silkspiders>: I'm actually planning on asking my airbnb host because I'm staying in the same spot but there's a bit of a language barrier so thinking of a backup plan<TheMightySupra>: PM me if you need help translating, but since they're using airbnb in the first place chances are that they speak English well enough anyways", "num_messages": 5, "avg_score": 3.8}
{"start_date": "1542875134", "end_date": "1543652313", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<Heh630>: Itinerary Suggestions? 12 Days In Peru Hi All - Heading to Peru this December and would love to get any suggestions from those who've been to Cusco/Sacred Valley/Lima. Ideally I'd like to get a little mix of everything including good food (both street vendors and fine dining), sight seeing, adventure tours, and nightlife. Also a very into photography if you have any go to locations! Below is what I'm thinking so far for the itinerary. Also deciding if I should get rid of a day in Cusco and add to Lima or just add a day to the trip all together. Input is much appreciated! (also pls forgive the atrocious formatting) Thanks. **1. Sat 29 - Flight arrives in LIMA 5:45am**. Get on plane to Cusco, land at 12pm. Take train or taxi to Ollantaytambo to acclimate -Explore Sacred Valley: Moray, Maray and Salinas **2. Sun 30 - Sacred Valley** -Ollantaytambo ruins, Pisac ruins, Pisac Market **3. Mon 31 - Cusco ** -Head to Cusco. Chill and explore town, acclimate. -New years party in town square **4. Tues 1st – Cusco tour** -Either Sascsay human ruins, mountain bike, or ATV around area **5. Weds 2nd - Cusco tour** -Rainbow Mountain or Lake Humantay tour **6. Thurs 3 – Cusco** -Chill and explore more of the city. Go out at night **7. Fri 4 - Train to Agues Caliente** -Look like the only trains are in the morning so may have to spend the day which I'd prefer not since it's a very touristy town. Beggars can't be choosers I guess! **8. Sat 5 - Machu Pichu** -Leave before crack of dawn. Spend half day hiking. Head back to Cusco late afternoon and crash. **9. Sun 6 - Cusco to LIMA am flight. LIMA** -Walk around miraflores and Barranco -Night tour at Pucilana Temple -Maido for dinner **10. Mon 7 - LIMA** -Historic Mansions, Casa Di Aliaga, Palaza De Armas, Church of SF, Palacio de Goberno, Catacombs tour, light and water show at night (is this worth going to?) **11. Tues 8 - LIMA** -Presbitero Maestro/Museums -Paragliding -Central for dinner **12. Weds 9 - LIMA** -Full day to chill, hit beach 11:59pm flight <OhHiSpoons>: feel like you should squeeze in the amazon if you're willing to give up a couple days in lima/cusco<Heh630>: Thanks for the advice! Added some extra dates to the trip so we're trying to fit the amazon in - unfortunately the tours I'm seeing look pretty expensive. Any chance you have reccomendations on which company/tour to book? Advice is always appreciated!", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543650819", "end_date": "1543655166", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 7, "text": "<Realdogxl>: Booking trip for group, same departure flight, different return flights. My parents, girlfriend and friend are taking a trip together. We all want to arrive on the same flight but are leaving the destination on different dates and times. I was able to load this up in expedia / cheapoair / favorite website etc and find 3 return trips, all the same departure flight, different return dates, similar prices etc. BUT As soon as I purchase the first roundtrip flight it will not let me purchase the second one at the quoted price as the \"prices have changed due to demand\" and now I am being charged an extra 500$ per itinerary. If I instead try to book the same return itinerary for all 5 passengers I can lock in the same price but then we all have to return on the same date. I called expedia and they were no help whatsoever. What is my best solution here? One way tickets are out of the question as the prices far exceed what we would be paying roundtrip.<wanderingdev>: Are you doing each transaction in a new incognito window?<Realdogxl>: I was not doing this but after hearing that cancelling the first booking is 7-10 days refund time I am hesitant to try it again.<wanderingdev>: Unfortunately this is how booking tickets works. If you do this incognito they use the cookies to increase the price. Plus, as each seat is purchased, that reduces inventory of the cheap seats and ups demand. You should really use a travel agent to book these as they can do them all at once.<tariqabjotu>: &gt;If you do this incognito they use the cookies to increase the price Wait, sorry, what? I never would have expected *you* to peddle this myth.", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1544544432", "end_date": "1544774045", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 49, "text": "<MValvicious>: My wife and I are hitting the road this summer with no plans of coming back. I’ve been planning this financially most of my life! I have a monthly income of five to six grand after all the bills are paid. I’m keeping my home’s in the US because one is paid off (same renters for seven years) and one is at 3.2% interest. I’ve already started selling everything else. By the time we leave this summer i’ll have around 70k in the bank. I plan on using a Costco credit card for most transactions and paying it off at the end of the month to save fee’s. Anyone have another card they think is better? We’re planning to start in Europe but I can fly anywhere there’s a US military base for free. Where would some can’t miss places be? I’m not a fan of the really touristy stuff. I prefer art, culture, and the outdoors. My wife’s the same. We’re hoping to eventually find a place that feels like home we’re our money goes further and we can enjoy a tropical climate. The plan is to stay in Hostels most of the time but is there better options when you have to pay for two beds anyway?<skiff151>: Dude if you have 5-6 grand monthly spending money you can literally travel to 90% of places, stay in baller Airbnbs and eat in TripAdvisor top restaurants every night. Or am I misunderstanding your current situation? I would follow the best seasons, honestly. Asia in the winter, then skiing in Japan, then New Zealand. Then maybe South America and a summer in Europe, finishing up in Portugal and on to Morocco by November? Seriously with that amount of money between you, you can literally do whatever you want all the time.<MValvicious>: I’m so excited! I have lived a very meager life to get here; even going to war. That’s one of my favorite things about staying in the move. I avoid the cold if I can so I’d like to chase the spring/summer around the globe. Have you been to the places you suggested? I did a three month trip to Australia earlier this year as a buffer and had the best time. Tasmania is one of the best places I’ve ever been.<thats_cripple_to_you>: As someone from Tasmania, you are correct, it’s the bomb! Enjoy your adventuring!<MValvicious>: That place felt like home! Honestly the part that sucked was the expensive buses to go to different tourist areas. I think it was $150-200 for the day. My friend and I just hitch hiked with our thumbs out. Aside from the Chinese tourists everyone was very nice <thats_cripple_to_you>: Our public transport is probably our single greatest weakness, it’s rubbish! Be careful hitchhiking though, it is illegal here in certain areas! I’m glad you enjoyed it, what did you manage to see? <MValvicious>: I ended up staying for six days and wish that I stayed longer. I went on a few of the major hikes, I saw the zoo, I spend a day at that farmers market, I didn’t get a chance to see the prison. What did I miss? I hiked from The bottom to the top of one of your biggest mountains. I was hot when I started and by the time I got to the top it was snowing. That was wild<thats_cripple_to_you>: Oh wow, what did you miss is a loaded question haha! Honestly I have lived here my whole life and not seen everything! Did you do dove lake? That’s one of our most well know hikes, my husband proposed by the lake so it’s particularly special to me. Hawley beach is another good one, so gorgeous! Oh haha that sounds like Tas, we have been known to have every season in one day, the temperature here just changes so crazily sometimes.", "num_messages": 8, "avg_score": 6.125}
{"start_date": "1543598877", "end_date": "1543704663", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<Welly-boots>: There is more to see at the Roman Forum than just the colosseum. Rome, Italy. <pinotkumarbhai>: one of your favorite photos eh ?<Welly-boots>: Yeah, I just liked the way the colours came out :)", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1543525500", "end_date": "1543653517", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 40, "text": "<Gegenteilige_Meinung>: Came to Hamburg to experience German Christmas Markets <pizzateufel>: so how was the experience of a german christmas market?<Gegenteilige_Meinung>: Very pretty! And so many self made gifts :-) The Christmas spirits are so high in Germany. I love it here", "num_messages": 3, "avg_score": 13.3333333333}
{"start_date": "1544750633", "end_date": "1544805858", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 6, "text": "<egyptionsr2buff>: A penny for your thoughts, Planning our next destination! Hey all, We have a 7-10 day break in February and we want to plan a trip. Our current thoughts are to do a turkey/Greece trip, Morocco trip, or Switzerland/north italy. In the past we did a 10 day trip to Italy which we loved and thought of spending more time to explore the Dolomites and that region is amazing. We also just returned earlier this year from an Iceland camper trip which I just don't know how anything can top it. Our top choice is currently Morocco, but every place I look at pales in comparison to the thought of being in a camper for 8 days and traversing Iceland. Help hype me up please!<sushixxxxx>: I'd do Turkey/Greece before either of the other trips. Might want to consider pairing Morocco with Egypt.<egyptionsr2buff>: Any reason why that is? We’re actually both Egyptian and lived in Egypt for many years lol. We live in the US now. Just seems so hard to get trip inspiration. We love exploring new places, beautiful scenery, and nature. We don’t do museums, and we definitely don’t spend to much time in cities we always like to cover a lot of distance in a short time. Any other places you could recommend?<sushixxxxx>: Oh I’ve never been but a turkey/Greece trip is next on my list. I always pair at least 2 countries when I travel as to take advantage of expensive air travel, might as well visit a couple places in somewhat close vicinity. I just got back from an India/Thailand trip where we were based in Delhi and Bangkok respectively and it was a blast!", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1543654447", "end_date": "1543768642", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<deep_blue_s0mething>: Travel to Greece in April I've been planning a trip to Greece - Crete, Milos, Santorini and Athens. I was planning to go in May of next year for a little over two weeks but because of a job offer it looks like that won't be possible. Does anyone have any experience on travel to Greece in April? My research indicates that the weather won't be as great but will still be okay and that the crowds will be smaller. However, I'm a bit worried about it being off season - will the ferries be running? Just wondering if we should postpone and pick another destination. Any advice would be appreciated.<CheeseWheels38>: I can't link to the post from mobile but I posted a trip report from April about a year and a half ago. This is the imgur gallery <http>://imgur.com/gallery/8JphS<deep_blue_s0mething>: Looks like you had a great trip - thanks!", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543654221", "end_date": "1543656766", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "[deleted]: I am having an extremely difficult time traveling to different cities in India [deleted]<tariqabjotu>: You are in Delhi, a city of 20 million, and you can't find a place to book travel? No travel agent? No train station? No bus station? Yeah, I don't believe that. <vember_94>: Obviously they exist, just that I can't find anywhere near where I'm currently at. Could I just go to a train station a few hours before the train departs and book a ticket in person? The last time I booked a sleeper ticket no one even checked.<tariqabjotu>: Have you asked someone about travel agents? Or just go to the train station? This really shouldn't be an issue. <vember_94>: I did ask someone about travel agents, they said they didn't know. My only plan right now is to turn up at the station on the day and try and get a ticket", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1544662799", "end_date": "1545060202", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 11, "text": "<kkranberry>: Knee stiffness and pain on flights - any tips? I had ACL and meniscus repair several years ago and have had intermittent knee issues since then, including a stretched ACL. In the past few years, I’ve noticed that I get pretty severe stiffness and pain in my knee on long flights or bus rides. I’m less than 3 weeks away from taking a long haul flight where I’ll be flying economy in a middle seat for 13 hours and will have more limited legroom than I’d like to stretch my knee out or get up easily from an aisle seat, and I’m pretty concerned. Do any of you have similar symptoms on flights? Are there any particular stretches or exercises you recommend for before, during, or after the flight? Are there any products (pain relievers, knee braces, compression gear) you find particularly helpful that you would recommend? If it helps, I’m a woman in my early to mid 20s. Thanks in advance! EDIT - to avoid common suggestions: I selected my seat upon booking and there were no aisle seats available whatsoever. I am also traveling with a friend on a tight budget, and given the price of upgrades on trans-Pacific flights, that’s not really an option. Assume I’m stuck with the middle economy seat. This has also been an issue for me for some time so I know that getting up and moving is good. **I’m more looking for specific products or exercises that are helpful.**<Kettch_>: I put on muscle ointment before the flight starts. It generally helps much more than putting it on after the pain starts. <kkranberry>: I’ll look into that, thank you! What type of product specifically am I looking for!<Kettch_>: I use one called \"icy hot\" or something close to that. <kkranberry>: Ah, gotcha thanks! I really like icy hot but the menthol scent is so strong that I don’t think I want to bring it on a plane. Luckily my roommate has some samples of another ointment I think might work.", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1544770741", "end_date": "1544828715", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<julieisdeadexe>: Skateboard on Spirit Airlines does anyone know how to get away with carrying on your skateboard? i'm thinking of putting it under my clothes and wearing an oversized jacket over it but idk, does anyone else have any tips or suggestions? &amp;#x200B; <edit>: to clarify, i'd first disassemble the skateboard and put only the board under my clothes<bpe9>: You can't take them on board, you always need to check them in. Ive skateboarded my whole life so have experienced this many times<julieisdeadexe>: i've read many stories of how when they check it in it comes back damaged or just goes missing<bpe9>: Wrap it in a garbage bag, mainly so it doesn't get wet. &amp;#x200B; Ive also used skateboard bags for most my trips and haven't had them damaged [https://www.skatewarehouse.co.uk/thrasher-skateboards-skate-mag-black-logo-duffel-bag.html](https://www.skatewarehouse.co.uk/thrasher-skateboards-skate-mag-black-logo-duffel-bag.html) [https://sohimages.com/images/images\\_soh/ACC0002-2.jpg](https://sohimages.com/images/images_soh/ACC0002-2.jpg) Where you strap your board underneath. Ive also just strapped my board around my suitcase with ropes, they tend to ask if its secure blahblah and just say yes all good<julieisdeadexe>: thank you very much, i'll do that instead!", "num_messages": 5, "avg_score": 1.0}
{"start_date": "1544541815", "end_date": "1544627847", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 22, "text": "<Elle473>: Is it difficult to get a visa to visit Canada? Hi My boyfriend (29M) lives in Ukraine and he plans on visiting me (25F) in Canada. However, from what we've read it's really hard for him to get a guest visa to stay with me temporarily. we've read tons of accounts of Ukrainians being unable to visit their partner in Canada. is this true? is the procedure really that daunting? he was telling me that it's even harder because he has me here, he was telling me that the Canadian government would see that as a reason to stay behind. for what it's worth, he doesn't have a job at the moment nor does he own any sort of property; he's struggling a bit over there. &amp;#x200B; thank you!<Kananaskis_Country>: &gt; he doesn't have a job at the moment nor does he own any sort of property; he's struggling a bit over there. Unfortunately he will almost certainly be denied entry to Canada, his profile raises every red flag possible for overstaying his Visa. It's a lousy situation, but you can certainly understand the difficulty. ~~The~~ Ukraine is a lovely destination for you to visit though.<powder2>: It's Ukraine, not The Ukraine. <Kananaskis_Country>: Yeah, that's the Russian in me. My mistake. Don't know why you're getting downvoted. Take my upvote.", "num_messages": 4, "avg_score": 5.5}
{"start_date": "1544562711", "end_date": "1544575709", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5, "text": "<monsignorcurmudgeon>: Best Christmassy places to visit in Europe? What are some places that are really festive at Christmas time in Europe? <Fatoldguy>: If you want to go to more than one city and you want easy short train transportation try Belgium. Nice markets in Bruges, Antwerp and Brussels and stop in Ghent to see the Altarpiece. Also see the Madonna and Child in Bruges. Nuremberg and Munich are close so if you pick Germany the train ride is short for these two. <monsignorcurmudgeon>: Thanks for the tips", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544676371", "end_date": "1545118370", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 15, "text": "<trashwizardnyc>: Thoughts on my solo Europe trip itinerary? First off, I’d love any advice on where to go and explore in and around these cities. I’m less of a nightlife person and more of a nature/culture/art/live music and history person. Second off, it’s my first time traveling outside of US. Are all of these countries accessible as long as i have my passport ? Thirdly, would you recommend trains for all my connecting trips? Any help with that is welcome. Lastly, open to any changes or detours/routes you have in mind. I’d really love to fit in Switzerland and Denmark/Sweden in somehow. Maybe I’m spending too much time in Glasgow and London ? UPDATED 12/13/18 START * March 1-7 LONDON+surrounding areas - Train * March 8-10 PARIS- Train * March 11-15 AMSTERDAM- Train * March 16- 25 BERLIN+surrounding areas - Fly * March 26- April 4 ROME+train to Florence/surrounding areas- Fly * April 4-15 BARCELONA + surrounding areas END Thank you tons ! <MightyMiami>: I am going to stop you right there and politely tell you this is the absolute wrong way to experience Europe, especially for someone who is visiting for the first time. Traveling is a beautiful experience. Traveling is also an extremely exhausting experience: physically and emotionally draining, so please read carefully. You are going to hate yourself by the time you reach Amsterdam and here is why. You are spending too much time traveling and not enough time enjoying and cultivating the places you are going to. I have been to more than half these places, some more than once, and even then I always longing to be there and have had the opportunity to spend more time there. You cannot possibly enjoy a city in two days. I, like you, when I begin to plan my trips I look at the dates I have available and the list of places I want to go. I always find myself trying to pack tons of cool new cities into my trips because I know I have a limited time to experience these places and I don't know if I will have the opportunity again. You need to move away from this mindset. You're only going to do a disservice to yourself. In these 45 days I would narrow it down to 6 to 8 or 9 places you really want to see and go enjoy those as best as you can. I cannot tell you how much time you're going to spend transporting yourself from point A to point B, standing in line at customs (especially as an American), checking in and out of your housing, riding the public transportation, walking to and from the places you want to go, eating food, etc. It's exhausting. You should at least be somewhat in shape for this many days beforehand. At the end of the day it is your trip and you can do what you want, but please try to cut down on your destinations and enjoy the ones you do get to see. Otherwise, frankly, you're wasting your time and you'll end up only being able to say you went to X destination you didn't really do anything. Anyway, **to answer your questions, 1.** yes, you will be able to access all these countries with your American passport. Some of these countries you will be able to travel to freely between them, others you will be stopped at customs depending on your method of transportation. **2.** There are some cities here that you can connect via train easily (London to Paris) (some are more complicated than others trying to access with various connects and companies you have to go through). There isn't one universal train that you can take. You will more than likely have to get off an on and bus to certain places if you only want to do trains. Otherwise, for example, Paris to Amsterdam and Rome to Nice, I would consider flying rather than train. That train ride alone will be long and take some time. **3.** I loved Copenhagen, but it's all preference. If I were planning your trip, I would do these cities (London, Paris, Amsterdam, Copenhagen, Berlin, Austria, Rome, Barcelona). They all are unique enough and offer a little bit of everything. If you have anymore questions or need help planning your itinerary, I would love to help. Once you decide on which places you want to go to, I can assist you better. p.s. Once you get a taste for the travel, you will want to go back. Make the cities you missed this time around something to look forward to in the future. Safe travels! *Edit: This is a piece of travel advice someone once gave me that pertains to what I have said here.* *\"You may only live once, but you still need to live it.\" Meaning, don't get too hung up on trying to do everything, and truly enjoy the things you get to do.*<trashwizardnyc>: Thoughts? START * March 1-7 LONDON * March 8-10 PARIS * March 11-15 AMSTERDAM * March 16- 25 BERLIN * March 26-29 FLORENCE * March 30-April 4 ROME * April 4-9 NICE * April 10-15 LISBON END <MightyMiami>: I will respond more in the morning, but I can see you haven't booked your flight yet. Right now there are some great deals from major metro cities to London about March 1. Use Google Flights. Chicago to London, Heathrow (roundtrip $500). Normally $800+. <Edit>: I see you are out of NYC. Nevermind. You always get great deals on flights overseas.<trashwizardnyc>: I’ve done some tweaking START * March 1-7 LONDON+surrounding areas Train * March 8-10 PARIS Train * March 11-15 AMSTERDAM Train * March 16- 25 BERLIN+surrounding areas Fly * March 26- April 4 ROME+train to Florence/surrounding areas Fly * April 4-15 BARCELONA + surrounding areas END <MightyMiami>: I have read some other comments and agree in the vain that adding spontaneity to your journey might make it more enjoying. It really is all personal preference. I like to plan, so I don't find myself wasting time – knowing I could have hit X spot and X spot and X spot in a certain manner instead of having to back track is not fun, but to each their own. I have not been to Rome, so I cannot speak to that, but I like your trip. Barcelona is a fun city, but it really is more nightlife and architecture (fun in the sun so to speak city) than any of the others. So maybe spend less time here and go someplace else or another place for longer. I lived in London for 6 months in college and I personally still didn't even feel like that was enough time. Some high points in the city for the musically inclined is the world famous **Camden Town**. Very rich history. Of course you'll want to see **Abbey Road**. **SoHo** and surrounding areas are great. Lots of gentrification and a rich LGBQT scene, but there are also some classic places in the area to visit or nearby like **Carnaby Street** or **Phonica**. There are so many great places to visit. It would be tough to list them all. BUT, I would highly recommend taking a day trip to **Bath** and do a half day trip down to **Brighton** \\- very famous for the Rockers vs. Mods era and The Who. For the majority of English people, football it next to breathing, so catching a match would be a great cultural experience. You'll see a lot of New York City in London. Some say London is the cultural capital of the world. You can literally visit some quaint areas in the city and get a taste of a culture you wouldn't otherwise visit. &amp;#x200B;<trashwizardnyc>: Thanks a ton! Yeh, in my mind. I’m not stuck to this plan, and if i feel like changing or altering i am more than happy to do so in the moment. Do you recommend buying airfare between European countries whilst I’m there? Incase i do want to stay somewhere longer. I’m also totally okay with buying my return flight later too. <MightyMiami>: You will save money buying them ahead of time, but if you're not on a very strict budget then sure. I don't know about some of the countries, but I know England has some tough customs. You never know what questions they'll ask and they may drill you on your travel plans, especially as a solo traveller. Some may want proof that you will leave the country before you allowing you to enter. Before people tell me this is not true, it has happened to me a few times where I was asked. In the instances I didn't know, I made something up. They tend to only ask how many days you plan to stay, but I did have an agent ask me how I planned to leave. I fumbled and said plane and the slight fumble gave him suspicion and he asked for proof. Luckily I had some. They will likely only push if you plan to do an extended stay, so I probably wouldn't worry about it. <trashwizardnyc>: Good point. I’m thinking, i get a round trip and i fly into London and out of London at the end, would they need to know that I’m planning on traveling inside Europe or do i tell them I’m planning to stay in London the whole time ? Or do they care , as long i can prove my return flight ?<MightyMiami>: You won't even really need to tell them you are traveling throughout Europe. Provide enough information without blatant lying. Before you land you will fill out a landing card, basically states your business in the country and a way to contact you on your stay. You will need to have an address to give them during your stay. The conversation will likely go: What is your purpose in England? *Holiday travel, exploring the city.* How long will you be staying? *I have a return flight booked for April 15.* Where are you flying from? *New York City* What do you plan on doing while you are here? *Sight-see, experience the culture.* Where will you be staying? *At XXX address, it's an AirBnB.* Enjoy your stay. They may ask how you plan on paying for the trip because you are staying for an extended amount of time. They may also ask you what you do for a living that allows you to take this much time off for work. There is no limit to what they may ask. They tend to be harsh and short with you. But just answer honestly. If you want to go into detail you can, but I tend to try and get through as fast as possible. <trashwizardnyc>: Brining bank statements a good Idea ?<MightyMiami>: No, no. You can simply say I saved up for it.<trashwizardnyc>: I’d love your opinion how to cut to this down to 30 days instead of what i have. Considering my love of Art/music and also my love of beauty, nice weather and ancient history . Also thinking of moving my trip from May 1-May 31 to make use of better weather START • ⁠March 1-7 LONDON+surrounding areas Train • ⁠March 8-10 PARIS Train • ⁠March 11-15 AMSTERDAM Train • ⁠March 16- 25 BERLIN+surrounding areas Fly • ⁠March 26- April 4 ROME+train to Florence/surrounding areas Fly • ⁠April 4-15 BARCELONA + surrounding areas END", "num_messages": 13, "avg_score": 1.1538461538}
{"start_date": "1544781839", "end_date": "1544818732", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 657, "text": "<Morid1n>: Beautiful Varenna in Italy, sitting pretty on the coast of Lake Como <Morid1n>: Taken on 2018/12/07, on our short vacation in the Lake Como area. No crowds, fantastic weather, peace and quiet — it was a great trip.<micachito>: Yes, the place is amazing. I have been there last 2017 summer and also visited Menaggio and Bellagio (my preferred place). It was not really crowded but was really hot as we arrived during the heat that affected most of Europe. After spent some days in Sardegna we decided to move to Lecco to enjoy the fresh air of the mountains but we we got was 34C around 23hs . :) . Terrible weather to travel (and it was far better than the 42C that we suffered while walking in Florence and Lucca). I promised myself to visit it again.<Morid1n>: We drove around many of the towns and stayed on the outskirts of Bellagio, but Varenna was so much more special. Personal thing I guess. 🙂 <swollencornholio>: Staying in Bellagio for 4 nights/3 full days at the tail end of April. Taking the ferry to Varenna is definitely in the cards<Morid1n>: Oh yes! Definitely!", "num_messages": 6, "avg_score": 109.5}
{"start_date": "1543497070", "end_date": "1543847444", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 242, "text": "<septemberalready>: Trip report: Isle of Skye, Scotland <Colin1223>: It looks like a fairy tale. I couldn't access the blog, but from the pictures I can tell it was an awesome vacation.<septemberalready>: If was like a fairy tale indeed! Scotland is a magical place.<Colin1223>: I plan to visit the country soon, what places do you recommend?<septemberalready>: On Skye I recommend what’s in the post. For the rest of Scotland, I’ve only ever been to Edinburgh, which is a great city worth a few days.<Colin1223>: OK, thanks for sharing. What's the minimum budget for a trip to Edinburgh? I saw that it's pretty expensive to find good accommodation (I don't like to stay in hostels).<septemberalready>: Depends on when you're visiting, but Edinburgh is pretty middle-of-the-road as far as costs of European cities goes. A quick look on Airbnb or [Booking.com](https://Booking.com) will give you a clear indication of accommodations costs.", "num_messages": 7, "avg_score": 34.5714285714}
{"start_date": "1544711255", "end_date": "1544834720", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 13, "text": "<SkitSkatSkot>: Small American Holiday Experience Wanted Hi, I’m an Australian School Leaver who will be going to University next year and am seeking advice on how to fulfil my holiday desire for next year. I am looking at holidaying in June*, the American Summer. I am looking at between 2-3 weeks. Now, for the meaty bit. I am seeking that Small Town American experience, with the motel and the diner with milkshakes and waffles. Where there’s a small hardware store and grocer. Everyone knows everyone and the community is tight knit. This could well be something that only happens in movies and if so I’m extremely disappointed. I’m a keen cyclist and adventurer, love the beach so somewhere with lots of scenery that would provide this would also be awesome. So please, I ask the following (thank you in advance!!) How do I find a small town like this? Are these sorts of things cheap or is that a myth too? Is travelling to a non-tourist area a good idea? Are there any Canadian options that meet the criteria I’ve stated. Cheers *edit wrong month <spooper_no_spooping>: I think it's definitely possible since I live in a town like that...but at the same time I wouldn't recommend travelling to this town because there is nothing to do. We have lakes everywhere and definitely lots of ground for cycling, but there's nothing else to do except visit a mall. I'm wondering if other people wouldn't recommend their small towns either.<SkitSkatSkot>: Very valid point. I guess that small town, relaxed vibe just attracts me. Coming from probably one of the most renowned Australian Cities that has so many tourists it annoys me..... and no it’s not Sydney. Cheers<roses_are_blue>: It's Canberra, isn't it?<SkitSkatSkot>: Is Canberra the other city you people hear about? Dam I’m disappointed. Canberra is our Washington DC equivalent. Our Federal Parliament is there, the National War Museum andddd fuck all else..", "num_messages": 5, "avg_score": 2.6}
{"start_date": "1544785168", "end_date": "1544814577", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<Anoopnk>: Need advice on my trip to Milan, to go to swiss Hello, I have booked tickets to Milan from 27 till 29. I reach there in the evening of 27th and leave on 29th afternoon. I want to look around Milan on 27th and 29th. I also want to go to swiss (places like Jungfraujoch, interlaken) and also try out skiing since I haven't skied before. Which of these places are possible and how I do reach those places? Do you recommend buying a pass for just one day? We are 4 people travelling. Total budget for 27-29th is 300 EUR each. <Note>: My stay for 28th is in Milan, so I have to come back to Milan with the last means of transport on that day. Thanks. <Edit>: Current plan is - Milan -&gt; Interlaken -&gt; skiing -&gt; Jungfraujoch -&gt; Interlaken -&gt; Milan Is this good? Milan &lt;-&gt; Interlaken costs around 180EUR. Skiing one day pass around 66EUR.<wanderingdev>: You don't really have time to go to Switzerland. You only have one day. I'd stay in Milan or do a day trip to somewhere else if there isn't enough in Milan to keep you interested.<swollencornholio>: Would be 4.5 hours each way to get to Kleine Scheidegg and you'd have to figure out ski rentals... if you left on the earliest train best case scenario you would be on slopes by 1300. Best bet for skiing would be going either Lugano, Como, [Aosta by bus from Milan](http://www.savda.it/public/documenti/218.pdf) or pushing it a bit would be Cervinia which would require a bus transfer at Chatillon but could be worth it for OP to see the Matterhorn. Would take 2.5 hours to Aosta and you would get there before 10, be on the slopes by 11. Cervinia would require a transfer at Chatillon or a taxi and would be another hour but could be worth it to see the Matterhorn.", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543006990", "end_date": "1543674957", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 5971, "text": "<michaelmaurer>: La Alhambra in Spain <userinaz>: Lucky you. Was there at beginning of the month and it took my breath away. Visit Granada’s Al Hamman baths if you’re still there. <Semaphor>: Oh man, I'll be there in two months. Anything you'd recommend in that region? <sillylittlebird>: Not op, but playa Granada does a night hike to the cave and the Alhambra that is amazing. La tana is a must (rip bourdain- if you haven’t watched his episode there do it!) hiking in Granada is amazing in general. And flamenco. Go to the caves and see some flamenco!<marrymeodell>: Is Playa Granada a tour organization? <sillylittlebird>: It is.<marrymeodell>: Cool heading there in a few days so I’ll have to check this out. Thanks!<sillylittlebird>: Have a wonderful time!!! I’m so excited for you!", "num_messages": 8, "avg_score": 746.375}
{"start_date": "1544773387", "end_date": "1544905820", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 13, "text": "<peIVasse>: Tampa,FL/Red Tide Hi, I will be travelling to Tampa, FL in February with my mother and have some concerns about Red Tide. We have already booked our flights before realizing this was an issue that might concern us during our trip. Will it still be an issue by February? Will we have to avoid all beaches in the area due to this? I have so many questions...I will plan our trip accordingly once I know what the actual concerns are. If anyone could shed some light on this situation it would be greatly appreciated. Thanks!<insurancefun>: Hopefully it won’t be an issue for the Tampa area in February but there was just a big fish kill in Bradenton. The reality is no one really knows. What you can do is check the [FWC website that tracks red tide](http://myfwc.com/media/4525265/wholemap1212.pdf) when you come down and plan your beach days accordingly. <daydreams_afloat>: There's a slightly better zoomable interactive map [here](http://myfwc.maps.arcgis.com/apps/View/index.html?appid=87162eec3eb846218cec711d16462a72).<peIVasse>: Perfect! Thank you.", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1544601122", "end_date": "1544786017", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 20, "text": "<pumpkinthot666>: Advice for someone traveling alone (to NYC) for the first time? so as a graduation present (finally getting my degree saturday yay!) my mother paid for my hotel + plane ticket to visit NYC, somewhere i’ve wanted to go for literal YEARS. unfortunately due to obvious and understandable financial reasons, none of my friends were able to go with me. i *do* have a friend who lives in brooklyn, but she’s been having a lot of issues with her anxiety and depression recently, so the likelihood that we’ll be spending lots of time together next week while i’m there seem slim. so it looks like i’ll be tackling most or all of this trip alone, but the most solo traveling i’ve ever done is flying alone with a family member waiting at the airport to pick me up. i’m having a bit of anxiety about this, but i’m determined to enjoy myself next week and learn how to travel alone (since i want to travel in the future better get used to doing it solo) so fellow experienced travelers, please share your tips with me! 😬<SkyartXV>: Hello, I’m currently typing this at an airbnb on a solo trip in New York City :) this is my first time as well and day 4/8! 1) first off I got super lost day one, the subways can and will be hard to navigate at first coming from a city that didn’t rely on public transportation. Buy a metro card, 31$ for a week, and you get unlimited rides for the duration. I thought 20$ would be enough for my trip and it definitely wasn’t. I’ve refilled twice now. 2) back on the topic of subways, take a bit of time to learn which rail goes where. The one line for example runs up and down manhattan while others would go to a specific destination. Ask a New Yorker for help, they’ll gladly do it. It’s also a very walkable city so you don’t need to rely on the subways, 3) the closer it is to Times Square the more expensive. Eat at the local stores and trust me, disregard how the store looks. Some of the best food comes from the small and danky spots vs the nice sit down restaurants. 4) people will get up on you to make a buck. For example when I went to see the Statue of Liberty the moment I stepped out to go towards the Staten Island ferry I had people stopping me and trying to get me to bite on a 31$ tour. Take the ferry. There will also be people trying to drop their product on you and ask for some “tip” I.e putting their mixtape in your hand and asking for 2$ 5) some must sees are the museum of natural history, the met, Central Park, visit the World Trade Center ground zero area but don’t pay to go up, same with the Empire State Building. Go to Top of the Rock instead for a view of the Empire State Building in the skyline. You can also ask for Bar Sixty Five for a free view of the skyline but you wont be outside. 6) the rails may have two entrances into the subway, like one going downtown and an entrance across the street for uptown. Don’t accidentally go into one and read the giant signs. 7) nyc is really cold during this time, dress very warmly. That’s my experience so far. I’m not a New Yorker so I can’t really give you the specific must see and must do spots. I’ve made those errors above earlier this week and I think it’ll server someone better to learn from my mistakes haha. <pumpkinthot666>: you know what’s funny, i hadn’t even put the statue of liberty on my to do list for when i’m there 😂 same with ground zero. i had places like “the museum of sex” and the bryant park christmas village or whatever it’s called (my friend wanted to take me to that) definitely adding top of the rock to my list tho!! i love skyline shots of NYC so i def wanna experience that in person thank you for all these tips!! i hope you’re having a successful trip!<Aberama_Gold>: new yorker here. Museum of sex was a fun-ish date night activity but there's not much there. It has like 2 exhibits and some activities and a bar. Wouldn't recommend it for your trip, especially given all the great museums in the city. <pumpkinthot666>: the reason i chose those two museums out of the other was cause i’m not big on museums (although that could be because i don’t have any nice ones where i’m from) and those two fit my interests lol", "num_messages": 5, "avg_score": 4.0}
{"start_date": "1543595029", "end_date": "1543848296", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 9, "text": "[deleted]: Santorini: Staying in Fira vs. a smaller village? [deleted]<ananananaaaaa>: Fira is the main town but it's SO CROWDED (with both people and cars/buses - because fuck sidewalks, right Greece?). You can still find a quiet place there, I stayed in a place called Lefteris Traditional Rooms and it was pretty nice. I didn't enjoy Fira, but all those restaurants and transportation nearby are handy. If you want to get rid of the crowds, visit the old port (both in Fira and in Oia) and do the Fira-Oia hike. People tend to dislike stairs and walking for too long, which is their loss, because it was all very beautiful.<ulrich994>: I've done this hike and it's a bit strenuous if your unprepared for loose ground and that Greek heat. <ananananaaaaa>: Yep, take a bunch of water, sunscreen and a hat. I thought it was a somewhat easy hike (in terms of terrain), but it's still 11km and it's tiring, even more in the heat.", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1541633032", "end_date": "1541674424", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<travellingirl123>: skiplagged flight confusion hello this is my first reddit post! i just booked a flight for my friend and me from SFO to Barcelona for $718 through skiplagged. after confirming the purchase i was given a confirmation code, but no email has been sent yet. i know they are a third party booking site and cant provide me ticket info but i am just getting a little nervous. how long does it usually take for the airline to send me my ticket info? and we are flying with Swiss and United. also, i read on skiplagged's website that by buying multiple tickets the cost of the flight can go up. is this likely? how much more will it be? will i find out when i get an email from the airline? also, for anyone who has purchased a ticket through skiplagged, can you guide me through the process? like what happens when you get the email - do you get a link that takes you to choosing your seat? also to note, i am not using the hidden city feature. which is why i am so shocked with how cheap it is for 2 tickets round trip. im really scared it is too good to be true and that the ticket price will go way up. but, i am not really sure how this works. anyways, thank yall! <Kananaskis_Country>: Just curious, how much money did you save with skiplagged compared to booking directly with the airline? Thanks.<travellingirl123>: we didn't look at the airline directly but tickets to europe are usually around $1000, but we saw kayak was selling the same ticket for around $500. skiplagged was only $353 which is a great deal. but, we are traveling in january which is a time not many people travel because of the weather <tariqabjotu>: Wow, didn't even look... I saw prices around $350 in January at the time of your post and I still see them now.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543658440", "end_date": "1543686485", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 396, "text": "<DaLieLama>: Old City of Bern, Switzerland. Loved walking around. <flutuar>: Bern is probably the prettiest mid-sized city I've been to. I don't understand why it isn't more popular.<travel_ali>: Is it not one of the most popular tourist spots in Switzerland?<travelingaccountant>: Maybe he's comparing it with Paris, London, New York, etc.", "num_messages": 4, "avg_score": 99.0}
{"start_date": "1543657640", "end_date": "1543769224", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<jjdresselhaus>: Delta Customer Support -- where to go from here? First -- if anyone has heard of the Delta \"Fast Track to Gold\" promotion, I'd love to hear about your experiences. I saw the promotion in my Delta Skymiles Account online, and reached out to Delta via Twitter PM, as I got an \"Access Denied\" message when trying to click the link. They were not very helpful, telling me to check my email, and contact my work for assistance. I have received no email from them. They weren't able to tell me the details of the promotion, why I received, nor how to get into it. I tweeted at them instead, and got the follow results... <https>://imgur.com/a/jBzrQDm<tariqabjotu>: Well did you contact workplace for assistance? Is the Gmail your work email? <jjdresselhaus>: I did not -- I shouldn't need to contact my work for help with a Delta program, should I?<tariqabjotu>: Not sure why you're making this harder than necessary... Maybe your workplace has a different email on file. Maybe there's some other person that receives these kinds of emails. <jjdresselhaus>: Because it's after business hours, and I need to make a decision on if I'm going to make the push to Silver by Sunday. If this Gold Fast Track is an option, I won't spend the extra money. <NomadicalMan>: Contact your HR person as it’s a private promotion to qualified companies. After you’ve enrolled, you’ll still have to purchase and complete 4 qualifying oneway segments (no basic economy, bulk tickets, etc) to qualify for Silver and 8 segments for Gold. So anything you’ve already purchased prior to enrollment won’t count. Good luck, see you on the upgrade list!", "num_messages": 6, "avg_score": 1.3333333333}
{"start_date": "1544698303", "end_date": "1544701585", "thread_id": null, "subreddit": "travel", "subreddit_id": "t5_2qh41", "total_score": 8, "text": "<phoenix_claw99>: Want to go to Europe in winter, but have allergic, can you help me? My family planned to go to Europe (maybe London or Paris) in December next year. This is also be my first time go to Europe. I know it's winter, but I have allergic Rhinitis (especially with cold air cold e.g after rain, in the morning) and I live in tropic country. My question is: 1. What countries/cities is the best to visit during winter? (I really want to go to London but it rains a lot and no snow?) 2. If any of you have the same allergies as me, can you tell me your experience in winter conditions? 3. What preparations must be made before travelling to Europe? Thanks in advance!<porcupixl>: I'm from Kent, pretty close to London. It rarely snows in London and is just cold and rainy most of the time. Italy is pretty good year round, I can't comment on snowfall likelihood but its beautiful all the time. Spain is also a strong contender. Germany may give you a better Christmas feel, i believe there's snow fairly often in winter, and the Christmas markets are brilliant. I can't comment on the allergies you have I'm afraid, and just check the travel information for the countries you visit to see if there's a heightened risk of terrorism etc <that-there>: &gt; Italy is pretty good year round This is not particularly true, especially for the northern parts, where it *will* be much colder in winter. <porcupixl>: As I said, I can't comment on the allergies, in terms of beauty Italy is pretty good year round as I've visited in each season and found it really nice", "num_messages": 4, "avg_score": 2.0}
