{"start_date": "1543621228", "end_date": "1543718124", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 31, "text": "<EmptyRamenBowl>: A Great Threat to Space Travel and The Human Race Hello fellow space enthusiasts, I am here today to explain and bring awareness to the Kessler Effect. I am making this post a part of my English 102 paper as a real-life application, and help bring it to the public eye. So what is the Kessler Effect and why should I care about it? Well, the main reason is those magnificent rocket launches and space projects will cease to exist. The Kessler Effect or sometimes known as (Kessler Syndrome) is the growing collision rate of space debris, most prominent in low earth orbit. These collisions are a problem as debris have “averaging speeds of 22,000 mph” (NASA 2017) which are extremely dangerous. For comparison, a sabot round from a tank moves roughly at 5,200 ft/s well above normal gun calibers, while objects in the atmosphere move around 32,000 ft/s. It’s clear that an object no smaller than a baseball can easily damage or completely obliterate a rocket. The chances of destruction increase the more massive the object is, as it has more force. This problem should be addressed early as we can still control the problem because it has not reached the critical amount. Think of the atmosphere being the equivalent of a trashcan and the critical amount being debris. When the trash gets full we take it out or it starts spilling everywhere and makes a mess. So the atmosphere has a set trash limit before problems start occurring. If the limit is reached, the number of collisions in the atmosphere will increase at an exponential rate encasing us in trash. This encasement of debris would make space travel far too risky, as rockets and their payloads have a high chance of collision with foreign debris. With this threat, launches would gradually fade away as the rocket business is not cheap, and sending them up would be a waste of money. The only notable things on the management of the Kessler Effect right now is SpaceX. Their revolutionary reusable boosters help keep a little less litter in space and while saving them a substantial amount of money. Although rockets are not the only victim of the Kessler Effect, satellites are also a major piece in the puzzle. Satellites play a major role in the contribution of to the Kessler Effect as they resemble a double-edged sword. On one edge satellites are highly beneficial to humanity as they serve a wide array of functions, like GPS and weather prediction. Although the other edge of the blade fuels the Kessler Effect. This contribution is caused by deactivated satellites, as they no longer have the ability to perform evasive maneuvers to avoid a collision. These “dead” satellites constantly collide with other debris creating more and more debris. Overall the Kessler Effect could serve as a massive barrier to the expansion of our knowledge to the universe. If you like cell reception or streaming services you should be worried. In conclusion, if want to learn more about it just look it up, it’s fairly new so not too many articles will be on it. Corbett, J. (2015, September 17). Micrometeoroids and Orbital Debris (MMOD). Retrieved November 27, 2018, from [https://www.nasa.gov/centers/wstf/site\\_tour/remote\\_hypervelocity\\_test\\_laboratory/micrometeoroid\\_and\\_orbital\\_debris.html](https://www.nasa.gov/centers/wstf/site_tour/remote_hypervelocity_test_laboratory/micrometeoroid_and_orbital_debris.html) <tastygoods>: Why cant we send up a couple of satelittebots to fly around and cleanup the debris?<riodin>: We would need laser satellites and I'm not sure how much energy each shot would require (solar charging?)<tastygoods>: Would the lasers really disintegrate the pieces of the debris? I was thinking it would have to be strictly capture and return. Maybe something like a squad of the X-37s to stay in orbit long term, essentially maneuvering around scooping up objects then jettisoning them back to the ground? Again a long term effort due to the millions of dangerous objects right?<fearlessnetwork21>: Why not simply push them out or back in? :O That's what she said? No, but for real. Is there no way to land on a satellite and attach some type of thruster thingy and then aim it away from its prior course? <EmptyRamenBowl>: This would be a bit cost inefficient, as sending something up for the sole purpose of bringing back down would be a waste of money. Current research shows lasers and some sort of capturing system are the best solutions.", "num_messages": 6, "avg_score": 5.1666666667}
{"start_date": "1544738254", "end_date": "1544833254", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 71766, "text": "<thesheetztweetz>: Virgin Galactic’s pilots reach the edge of space: \"Spaceship Unity, welcome to space.\" \"Copy base. Million dollar view!\" <juris33>: Million dollar view. Advertising ticket price much? Jk.<thesheetztweetz>: You joke but it’s currently $250,000 a person<iron-while-wearing>: Still, though, $250k to ride a damn rocket plane to 271,000 feet is...a thing. It's not quite your own personal X-15 flight but it's getting there. <nokianich>: Keep in mind how much are first-class ticket on a plane so $250k not really much<makoman115>: First class tickets are like a 2-20 grand depending on distance and timing Sooooo it’s a lot more than that<Acepox>: Think about it. &amp;#x200B; If you can afford to fly first class, paying 20k$ for half a day of flight, you can definitely afford to spend 12 times that for a once-in-a-lifetime experience.<CaptWoodrowCall>: I could afford to fly first class to most places if I really wanted to. (Not $20k, but $3-5k, which is what most first class tickets cost in my experience) I could not, however, just whip out my checkbook and pay $250k to fly to the edge of space. There is a huge difference. <xkegsx>: &gt;if I really wanted to I think the previous poster meant people that only fly first class and do so regularly. I'm sure a lot of people could take out a good chunk of their savings and fly first class if they really wanted to.<hahaigotkilled>: That's how I took it too. But the point is moot either way in my opinion. First class tickets on airlines are going to be dirt cheap once sub-orbital flights become common, so it's all a matter of perspective IMO.<Theycallmelizardboy>: Except aside from the experience of being in space, you're not really doing anything. You're literally just there for the experience. People fly in planes to get from point A to point B. This is more of a luxury that a service.<hahaigotkilled>: You're completely right, but the same thing could of been said about regular flight 100 years ago. Oh, you're just a few hundred feet above the ground, you can still just take a train. It's missing the point if you ask me.<Theycallmelizardboy>: Well in how much time we are talking about here? I mean, you and I are going to be long dead before space flights become commercial. They aren't going to be used for anything other than \"visiting space\".<hahaigotkilled>: I'm obviously no clairvoyant but I'd guess that within 20 years we'll have the capacity for manned sub-orbital flights with reusable spacecraft. It's a challenge that is well within our reach at this point, it's really just a matter of the right people getting funding and a decade or so of development and testing, and another decade of refinement, before the technology comes into the mainstream. Absolutely nothing about reusable SSTOs is outside of our technological capability right now, it's just a matter of bringing the costs down to commercially viable levels.<Theycallmelizardboy>: I mean how economical are they though? I'm not trying to argue, I'm geniunely curious. Because it seems with the amount of fuel and resources that it would take for even sub orbital flights isn't superior of getting from point A to point B.<PrimeLegionnaire>: Sub orbital flights can put airline travel times in the dirt though. It's gonna start just like planes did, high power executives will have their companies foot the bill to get to business deals faster than the competition.<Theycallmelizardboy>: I mean even with the prelaunch and landing? The longest flight in the world is under 18 hrs. If all conditions were perfectly met, a suborbital flight might be able to reach locations in just a few hrs but I'm wondering what the difference would be other than just reaching point B faster. As in, what purpose would this serve with a discrepancy of a few hrs. Medical transportation? I'm asking what the actual benefits would be. &amp;#x200B;<PrimeLegionnaire>: The difference between a normal plane and a Concorde was big enough that if Sonic booms didn't prevent over land travel it would have beat out traditional airlines. Spaceships don't have the problem of a Sonic boom over populated areas.<billthedwarf>: For that we should focus on low boom super sonic flight.<PrimeLegionnaire>: It's not a very promising avenue. The quiet spike is pretty cool, but even suppressed the planes still made a Sonic boom. Rockets promise a theoretical ~90 travel time to anywhere.<billthedwarf>: Low boom planes have promised books about as loud as a car door closing when percieved by people on the ground. Also when talking about loud noise, a rocket launch would have to be far enough away from major populated centers because those are extremely loud. Then, in order to fly somewhere, you would have to drive to a rocket airport like thing and then fly in the rocket, before having to rent a car or take public transportation to your final destination. With low sonic boom planes, you could have planes going into airports such as DCA that are right in the city.<PrimeLegionnaire>: &gt;Then, in order to fly somewhere, you would have to drive to a rocket airport like thing and then fly in the rocket, before having to rent a car or take public transportation Congratulations you have described airports. Why exactly is this a strike against rockets? You have to do this with every single flying transport method as well as a few land based ones (trains) and boats. &gt;With low sonic boom planes, you could have planes going into airports such as DCA that are right in the city. For more cost and less speed of travel. Rockets promise a theoretical ~90 minute trip to any location on Earth, and don't have to land at airports. <billthedwarf>: Sorry I should have phrased that better. I meant that you would have to go farther because rockets are significantly louder taking off and a rocket launch has to have a lot of space for heat. Sure a plane makes noise but it is significantly lower. <Edit>: could you also explain what you mean by \"doesn't have to land at airports\"? I'm not trying to dispute it but I don't understand what you mean.<PrimeLegionnaire>: So I can drive 20 minutes to the airport and take an 18 hour flight (longest flight I know of) or I can drive 40 minutes to the rocket port and be touching down ~2hrs later. Even with 3hrs of driving its going to be drastically faster for global travel. It seems like a no brainier. the main obstacle right now is launch costs and limited launch sites, but both of those problems affected early airlines.<billthedwarf>: This isn't a low boom flight but boom supersonic lists Sydney to LA, a 15 hour flight on a standard airliner, as 6:45 minutes. I'm not saying this is true for everyone but a 2 hour space flight plus 6 hours of driving (3 hours each location) is longer than a 30 minute drive to a airport each way and a flight <PrimeLegionnaire>: &gt;3 hours each location You don't have to land at a spaceport. You can land at basically any runway and even a few spots that are no good for airplanes. <billthedwarf>: And then the whole rocket has to be transported to a new launch site?<PrimeLegionnaire>: No? You don't land with a whole rocket. If SpaceX has it's way the launch vehicle will be back at the pad refuelling. Moving the crew parts of a launch vehicle is already something we do, look at how the shuttle worked.<billthedwarf>: IIRC the space shuttle took a lot longer than preparing for a commercial flight. Also I'm not trying to say that using space flight for transportation around the Earth is a bad thing, I just don't think we should dismiss the much nearer low boom supersonic jets.", "num_messages": 29, "avg_score": 2474.6896551724}
{"start_date": "1543583206", "end_date": "1543605709", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 40795, "text": "<MaryADraper>: NASA Curiosity rover investigates shiny object on Mars. The planning team thinks it might be a meteorite because it is so shiny, but looks can deceive, and proof will only come from the chemistry. <joozek3000>: If this is gold First human will touch surface of Mars in 7 months;p<StainGuy>: This is kind of why i hope it is gold or something like ^^platinum <joozek3000>: Hmmm corporation wars over resources on a different planet Interesting <MarinertheRaccoon>: At least they wouldn't be cutting trees down for it. <joozek3000>: Yeah it’s about time to start destroying another planet<inavanbytheriver>: I mean, Mars is essentially already destroyed. Creating more greenhouse gases on Mars would actually help the planet.<dishonestresponse>: Finally something we are good at.<TheVitoCorleone>: Build it up, only to destroy it. The cycle continues.<concreteTV>: I’m gonna go ahead and say if we fix mars, we’ll probably intend to keep it that way. I don’t see how we can terraform a planet just to fuck it up. We took earth for granted, so I’d only imagine we’d learn our lesson.<bipnoodooshup>: If we learned our lesson we’d terraform Earth before Mars.<VagrantMole>: W O K E Lol. In all honesty I don't know why the concensus seems to be that we need to try experimental climate altering technology on our home planet. I'd rather have Mars be a proving ground than screw earth up more than we already have. I guess the new edgy is to regurgitate the same stuff you saw your friendly neighborhood high-school burnout post on Facebook. <genron11>: You're very judgemental for someone who doesn't seem to understand the polar opposite differences between making mars hospitable, and reversing climate change on earth...<VagrantMole>: You're very condescending for someone who doesn't understand what terraforming is. <genron11>: That's basically what I said to you... Arrogant and unimaginative. <VagrantMole>: That was the point. I just wanted to make it clear you're talking out of your ass. Terraforming is making another planet have a similar environment to earth and making it habitable to earth like life. Would you say that Earth is earth like and habitable for earth like life? Yes. So saying we need to terraform Earth before Mars is ignorant. <genron11>: Terraforming mars will require adding carbon to the atmosphere, reversing climate change on earth requires removing carbon from the atmosphere. Yet you want to use mars as a proving ground... Idiot.", "num_messages": 17, "avg_score": 2399.7058823529}
{"start_date": "1543580409", "end_date": "1543652149", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 946, "text": "<mentol_mentolo>: Creatures born on a planet orbiting a star with a different temperature than the sun would see light in a different spectrum than we do, as they would have evolved to perceive light coming from a star emitting the peak of its electromagnetic radiation in a different range of wave lengths Our sun has a surface temperature of about 5.800 K, so it emits the peak of its electromagnetic radiation in the range between 400 and 700 nm (1nm = 10^-9 m), the one we call visible light. A red giant (surface temperature of about 3.000 K) would have the peak of the emission at a wavelength of about 1000 nm (infrared region then), while blue stars (with a surface temperature of 30.000 K or more) would have the peak of emission at the wavelength of just 96 nm (ultraviolet region). These calculations has been made according to the Wien Law assuming that stars can be considered black bodies (ideal objects that have the maximum emission associated to their temperature) and that life could be sustained around stars different than our sun. The general reasoning should be valid even if this assumptions are not 100% correct. Feel free to correct me if I have made any errors in my reasoning. <TizardPaperclip>: You're missing two key limiting parameters: 1. Most (all?) animal visual systems rely on the breakdown of chemicals by ionization. The lowest frequency with enough energy to ionize molecules is around 400 THz (red). 2. The highest frequency that isn't hazardous to delicate molecules, such as those involved in light sensing, is no higher than 1000 THz (ultraviolet). So any vision system that could work outside those parameters would have to operate on a different principle. <winterfresh0>: Don't some snakes \"see\" infrared by using heat sensing hollows in their face? <Edit>: https://en.wikipedia.org/wiki/Infrared_sensing_in_snakes &gt;In spite of its detection of infrared light, the infrared detection mechanism is not similar to photoreceptors - while photoreceptors detect light via photochemical reactions, the protein in the pits of snakes is a type of transient receptor potential channel, TRPA1 which is a temperature sensitive ion channel. It senses infrared signals through a mechanism involving warming of the pit organ, rather than chemical reaction to light. Edit 2: I'm not sure if this part is relevant, it's just interesting &gt;It has been found that the snake’s visual and infrared maps of the world are overlaid in the optic tectum. This combined information is relayed via the tectum to the forebrain.<EnclaveHunter>: Hold on. So they see an animal in infrared through warming up the pits in their face with the heat bouncing off the animal? What the fuck<winterfresh0>: It's basically always sensing the temperature of that membrane in the pit, to a very high degree of precision. When an animal goes in front of it, the radiant body heat is enough to warm that membrane just enough to be sensed by those nerves. The shape allows it to work like a rudimentary pinhole camera. You could also think of it like this. You know how you can feel the radiating heat from a fire or oven on your face? They can basically do that with stuff that's not nearly that hot, and they can tell exactly where/what it's coming from. <Threat-Level--12am>: So if I open the open when I'm cooking a pizza, I just feel a bunch of heat on my face, but a snake could tell me how many pepperonis are on the pizza?<BeesOfWar>: Yes because the snake made that pizza specially for you! &lt;3<PapaSnork>: Can I just say how much of a pleasure it is to ponder both the possible vision systems of organisms adapted to life on a planet orbiting a red dwarf, and snakes making pizza?", "num_messages": 8, "avg_score": 118.25}
{"start_date": "1543616634", "end_date": "1543624401", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 121, "text": "<raresaturn>: 2019 will be an extraordinary year in space <bearlick>: I really hope that spacers understand that militarization would deny the frontier to most. We have enough barriers to its exploration, space force would be another. We've explored space and kept it free of weapons for a generation, we don't need to bring sovereignty to it now.<KralHeroin>: There are tons of spy satellites flying above us, ASAT weapons were successfully tested, X-37B has spent a year doing God knows what in orbit... I don't think we have kept space free of military capabilities. <bearlick>: Yes yes, but none of that actively impedes private space companies, yet. Total sovereignty of space by any nation would inhibit explorers of other countries though. My main point is: Policing of space = fewer able to explore it. That's all. It's a barrier to entry, an inhibitor, it reduces the total capacity for exploration.. Once we have weapons up there gunning down anything without a US or Chinese permit, the endless void of exploration is walled off to our backyard instead.<wintersu7>: Current treaty obligations require nations to police all activity in space performed by their people. Nations will continue to exist in space. You assume, incorrectly I think, that the US would ‘gun down’ something done by, say, India, the UAE, or Japan as examples. What reason would America have to do that? If they want to land on the Moon, why stop them? As long as their activity doesn’t endanger American lives on the Moon it would be very illogical to gun things down. The debris from doing so alone would make things much more dangerous for American activity<bearlick>: If you think so. I have less faith in the good will of any government. As we've observed, one election can turn any power authoritarian.<wintersu7>: Good point, our last President completely ignored his Constitutional limits, and used the American military to attack five nations without authorization from Congress. However, things having been looking up lately, so don’t get too depressed", "num_messages": 7, "avg_score": 17.2857142857}
{"start_date": "1543559153", "end_date": "1543601593", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 84, "text": "<burtzev>: Revisiting the Dyson Sphere <acftmech75>: The only question i always had with the theory is what happens to the inhabitants as the sun cycles thru it's life cycles which includes red giant at which point it would swell in circumference to envelop the sphere or reach dangerously close to the inner surface rendering it uninhabitable.<RmaGdn>: Probably the same thing as if it weren't there. The Earth will still be wrecked. But you're talking about something in the time scale of 2-3 billion years so we're not really too worried about it right now.<acftmech75>: True, but i dont want to think in 2-3 billion years we as a species will be extinct anyways. Hopefully evolved and transcended. Of course the way we are going now in 2 or 3 hundred more years i am afraid for our survival.<szarzujacy_karczoch>: In 2 billion years I'm pretty sure we will be an interstellar species for quite some time. Even if it takes us decades or hundreds of years to get to another star<PM_BETTER_USER_NAME>: In 2bn years I fully expect we'll be completely extinct, long forgotten, and the only evidence we were ever here will be the voyager spacecrafts floating gently through the otherwise void regions of uninhabitable space, never to be discovered, carrying a brief glimpse of our 20thC culture - slowly disintegrating over the course of the next hundred billion years or so. <Fatbaldmuslim>: Not true, we also have the manhole cover. Aliens far in the future will ponder who the Stanton warrior race were.<EnclaveHunter>: Thank you for reminding me about that", "num_messages": 8, "avg_score": 10.5}
{"start_date": "1543549357", "end_date": "1543611129", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 698, "text": "<mvea>: NASA is offering private companies up to $2.6 billion to get the US back to the moon's surface by 2022 <zulured>: I'm happy this will give market opportunity to falcon heavy.<stoppe84>: falcon heavy is not human rated and never will be<zulured>: 1) NASA offering is not about human missions. 2) Musk claimed to send humans on a free return trajectory to Moon, from a Falcon Heavy, two years ago. 3) if you have enough money to spend, everything can be human rated 4) Human Rated Dragon has out-of-the-box so many abort/safe systems. I believe most of them can be applied to a Falcon Heavy launcher, and not only to a Falcon launcher. This at a small fraction of cost of human rating BFR. &amp;#x200B;<standbyforskyfall>: Musk also promised that Tesla's would be fully autonomous by the end of 2016. Dude lies about everything<MstrTenno>: If you take any “promise” that *any* CEO makes that seriously, you are a fucking idiot I’m sorry. That being said, despite Elon’s “optimistic” expectations, his companies have been doing insane innovation and producing results. Without him, the US probably wouldn’t have a rocket to even get to LEO by 2030. SpaceX has made other companies want to compete, and had created a new space race. I can forgive Elon’s failures to meet his deadlines, this tech is completely new and cutting edge. They are bound to run into unexpected delays. I’d rather have somewhat slow but consistent progress under SpaceX than no progress under NASA.<standbyforskyfall>: ula has been taking things into leo for decades. and spacex only exists due to massive cash infusions from nasa, as spacex most liekly is not in a good financial position.<MstrTenno>: Any evidence to support that? SpaceX has been making a lot of money off of transporting satellites lately. Of course they are getting lots of money from NASA, you think ULA isn’t?<standbyforskyfall>: https://www.forbes.com/sites/alexknapp/2018/04/12/spacex-is-raising-a-500-million-funding-round-at-a-25-billion-valuation/1 they tried to raise 500million, only got half that. if it had such a promising and profitable future, why would investors balk in investing in the company. only logical explanation is that the compny is not doing that well. if spacex is profitable, people would be jumping over each other to invest<MstrTenno>: People aren’t jumping to invest because it’s a risky business. Investors don’t like too much risk on losing their investments.<standbyforskyfall>: if there was a clear path to profit, no matter how risky the endeavor is, people will invest [deleted]: That's definitely not how investors work. If a project won't yield immediate quarterly gains, most wallstreet investors won't touch it with a 10 foot pole no matter how promising it is.", "num_messages": 12, "avg_score": 58.1666666667}
{"start_date": "1544750293", "end_date": "1545001229", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 28, "text": "<invertednose>: Space documentaries for the scientifically literate that don't use a bunch of weird metaphors? I'm so frustrated with most of the mainstream docs (Morgan Freeman, Neil DeGrasse Tyson, etc), they make me cringe and I always feel like the metaphors kind of work to explain things in layman terms but I'm always craving more accurate and scientific explanations. Any recommendations? Bonus points if they're streaming on Netflix or Amazon Prime for free <EDIT>: wow these are some great recommendations. I can't wait to dive in, thank you everybody!<LifeHeck>: I feel like documentaries are really geared towards more casual viewers and while im sure there may be a few out there, I feel like your best bet is to actually read scientific articles/papers if you want to get really specific. If there is a good documentary like the one you're asking for I would love to see it tho<invertednose>: You may be right. I'm bad at reading math and that has deterred me but I'm sure I could, at the very least, read some secondary summary papers.<spindizzy_wizard>: You can usually get the gist of the paper without necessarily understanding all the math. It'll be more informative if you can pick your way through the math, but it usually isn't essential. I did a lot of reading for meteorite behavior in atmosphere, and average rates of meteorites per year. I had some difficulties with the math, but eventually parsed my way through it well enough to write small programs that gave reasonable results based on their summaries. <Why>: A superhero game where one of the players is a physicist peripherally involved with LIGO. You like to have your science relatively straight before you use it in game. We even got to calculating the effects of a near light speed tungsten dart of the sort you throw in a pub. What sort of fusion/fission products would you get; before the GM pointed out that (a) he wasn't going to give us nuclear darts, and (b) as soon as the dart left his hand the explosion would happen. He'd be the only character left alive because only he stood any chance of out running the blast.<NearABE>: So what spalls off of tungsten-nitrogen? <spindizzy_wizard>: Remember, I'm not a physicist, but I was talking with one about this, and that I made LOTS of simplifying assumptions to keep the process within my reach. I also misremembered what we were doing, it wasn't a tungsten dart, it was a rock (SiO2), so I've had to work through the same process for tungsten-nitrogen. When you fuse tungsten and nitrogen: * Copper 61 * 19.9 MeV Decay products of Copper 61: * Half life: 3.3 h * Neutron + Nitrogen 60 (stable) Because of the half-life, you can basically ignore the decay products because the next iteration will happen before any significant portion of the Cu-61 decays. Since I chose an iteration of 1 second, another simplifying assumption was that you don't have to consider decay products until the half-life is two seconds or less. Considering only the nitrogen branch: * Iteration 2: 75% of Cu-61 is converted to Kr-75 (radioactive, half-life 4.3 min, 9 MeV); * Iteration 3: Tc-89 (radioactive, half-life 12.8 sec, MeV 5.9). * And so on. Did you notice the MeV numbers? This is the amount of energy released during the fusion operation. That energy becomes available to drive further fusion, but as you work your way up the atomic masses, you eventually reach a point (around iron) where it costs you more energy to achieve fusion than you get from the fusion. How long fusion continues depends on the excess energy you've built up from earlier, and what energy starts getting released from fission of radioactive isotopes with sub-second half-lives. As with the XKCD example of a baseball, the dart becomes effectively a point of plasma, which turns into an expanding wave of radiation and blast effects. I didn't get around to calculating at what distance that would happen for the rock, because whatever it was, no one other than the fellow throwing the rock had any chance of survival; and that was only because he had the 'no physics' benefit, which allowed him to run FTL, thus escaping the radiation and blast wave.<NearABE>: Titanium dart? <spindizzy_wizard>: Sorry, but at this point I think you should start looking into it for yourself. 😁 Primary sources of information Wikipedia \"isotopes of X\" and the following web application: <http>://nrv.jinr.ru/nrv/webnrv/qcalc/ Good Luck! (No, I'm not being sarcastic. I really do hope that you both enjoy it, and learn too!) The QCalc tool can be used to figure out the fusion product, and to figure out the decay products as well.", "num_messages": 8, "avg_score": 3.5}
{"start_date": "1543603464", "end_date": "1543629576", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 3, "text": "[deleted]: Elon Musk roasted by NASA for smoking weed live on the internet - Business Insider [deleted]<NiniMinja>: Hang on, I read another story earlier and the criticism seemed equally weighted between the alcohol and the weed. It appears that business insider is more anti weed than anti alcohol where as NASA seemed more concerned with disassociating itself from any inebriants. <Kellymcdonald78>: Which is why NASA launches an investigation into Lockheed Martin after they heard the CEO had a Scotch <SharpMind94>: Article to that? That seems way too suspicious <mayhap11>: Clearly he's being sarcastic, making the point that alcohol is deemed fine, yet pot isn't despite both being equally legal where Musk was filmed.<SharpMind94>: Oh, I thought it was legit. <Kellymcdonald78>: Nope, just responding to the previous comment that NASA was concerned about all inebriates", "num_messages": 7, "avg_score": 0.4285714286}
{"start_date": "1543610787", "end_date": "1543945071", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 96, "text": "<ye_olde_astronaut>: India seeks collaborators for a mission to Venus, the neglected planet <LostCirculation>: Sounds cool. Venus is an interesting place. My favorite thing about it is that if a base could somehow be established in the clouds there the flight time for missions to other parts of the solar system would be shorter.<ThatAnnoyingDutchGuy>: It would make no sense to use Venus for that... it's an inner planet. Only if you'd like to go to mercury this perhaps could be an option, but it wouldn't give you more time. Easiest way is just use it as a gravity assist. <LurkerInSpace>: The attraction is that it reduces the time between launch windows - the Venus to Mars launch window happens every 11 months instead of every 26 for example. A *well-developed* colony on Venus would complement one on Mars or in the asteroid belt as a result. The problem with Venus, though, is that there's not really any incremental benefits to setting up a colony - it's useful when it's big and can build things like nuclear rockets, but not really before that. I'm not even sure how one could do a flag-planting mission there without a nuclear rocket - the delta-V requirements are so large that chemical rockets seem insufficient. Still, it would be good to see more missions to the planet - just not anything that we'd want to bring back! Putting a balloon carrying a probe, or even a solar power plane would be an interesting mission.<kabloems>: I guess if we were to build a flying basecamp in the clouds, flag planting would be much easier. From a cloud base, you still need lots of delta v to reach orbit, but in a more reasonable range of 8-10 km/s. The ground would be reachable with conventional means like helicopters or balloons.<LurkerInSpace>: That's how it would need to be done, which is why I favour Mars first. With a large Mars colony capable of building and launching its own rockets it would be much more feasible to build a base before sending any humans - since a pre-existing base would be needed to actually leave (and nuclear rockets would be helpful). The travel to and from the surface from the cloud base would still be a bit unconventional though - whatever method gets used needs to resist 90 bars of pressure and carry all of its oxidiser as well as fuel! A static ground base with a cable suspended by a large balloon might be best for gathering resources.", "num_messages": 6, "avg_score": 16.0}
{"start_date": "1543165466", "end_date": "1543257597", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 66, "text": "<AutoModerator>: Week of November 25, 2018 'All Space Questions' thread Please sort comments by 'new' to find questions that would otherwise be buried. In this thread you can ask any space related question that you may have. Two examples of potential questions could be; \"How do rockets work?\", or \"How do the phases of the Moon work?\" If you see a space related question posted in another subeddit or in this subreddit, then please politely link them to this thread. Ask away! <Joonicks>: Why isnt the fairing filled with low pressure (like, &lt;0.5 ATM) instead of being left open to interact with the atmosphere? Or maybe even hydrogen, considering a rocket is literally a big bomb anyways. It would reduce the launch weight (and helium is cheaper than $1000-to-orbit). Most significantly maybe, it would vastly reduce sonic vibrations in the payload. Drawbacks... helium/hydrogen could seep into sensitive electronics (but would probably seep back out quickly after reaching orbit). Difficult to make the fairing air tight?<lutusp>: The problems that would be caused by having the fairing at a different pressure, or filled with hydrogen, would likely make this riskier than not doing it. Spacecraft should be as simple as they can be, but no simpler, even if this sometimes means taking a pass on an optimization that might introduce new risks. <Joonicks>: Hmmm... Im not so sure... In human rated it might be \"avoid risk at all costs\" but not so with unmanned. Reusability is a huge risk and adds lots of complexity and probably extra points of failure, but SpaceX still did it. Simply reducing the air with helium at sea level pressure would decrease the \"payload\" up to the point of booster separation by 200kg+ Using helium would significantly reduce soundwave energy, which is an actual hazard to the payload. Lowering the pressure amplifies both these benefits and the risk is probably quantifiable. The pressure only needs to be lowered for maybe 30 seconds as well.<lutusp>: I immediately thought of the implosion risk to the craft and payload if the reduced pressure option was in place. And for the other options I don't think the fairing should be airtight. Can you guess why it cannot be airtight? Think about the pressure changes it would encounter during launch, after which it would probably explode with a differential of 14.7 PSI. BTW I have some spacecraft design experience -- I designed part of the NASA Space Shuttle.<Joonicks>: Id imagine having equilibrium ports opening at the appropriate time would be rather simple. Emergency relief valves as backup. Sudden drops in pressure would be unwanted. The pressure isnt the main idea though, its the helium. The thing I like about it is that it both lowers the mass and reduces the energy of sonic waves just by being there. Shuttle design is cool. Actual design or manufacturing/construction work?<lutusp>: &gt; Id imagine having equilibrium ports opening at the appropriate time would be rather simple. Yes, but to assure a successful launch with no extra massive and complex equipment, how about not doing it at all? &gt; Emergency relief valves as backup. Extra mass, extra complexity. Both work against reliable launches. &gt; The pressure isnt the main idea though, its the helium. A pressurized fairing would explode just as violently if filled with helium as with air. And the fairing does have to open, and when it does, the pressure differential must be zero. The easy way to assure a zero pressure differential is not to pressurize it. &gt; Actual design or manufacturing/construction work? Electronic designs. High-efficiency, man-rated solid-state inverters used throughout the fleet. <Joonicks>: &gt; A pressurized fairing would explode just as violently if filled with helium as with air. And the fairing does have to open, and when it does, the pressure differential must be zero. The easy way to assure a zero pressure differential is not to pressurize it. You dont need to pressurize it to get the benefits. Inject it at the tip, the air is forced out at the bottom. Nothing else required, mass is saved and sound supressed. <lutusp>: &gt; You dont need to pressurize it to get the benefits. Of course you do. Think about what happens when the craft ascends and the fairing is not sealed against entering air, and the craft approaches the speed of sound.<Joonicks>: If its not air tight at the top it'd be a pretty shitty fairing. If air was allowed to blow through the fairing unimpeded you have bigger problems....<lutusp>: &gt; If its not air tight at the top it'd be a pretty shitty fairing. Airtight is airtight. One cannot have a fairing that's airtight only in some places, especially at supersonic speed. Therefore current fairings aren't airtight. They cannot be airtight and still meet their design requirements. In any case, airtight or not, a fairing cannot contain helium, because helium attacks integrated circuits. [If Your iPhone Stops Working, You Might Want To Check For Helium Gas Leak!](https://fossbytes.com/apple-devices-break-down-after-exposing-to-helium-gas/)<Joonicks>: your version of a fairing sounds like the inside is a wind tunnel with supersonic winds blowing through it. as the whole purpose of a fairing is to reduce drag and protect the payload from the outside environment, your wind tunnel fairing sounds very ill suited. so your expertise is in electronic engineering, or do you have any actual experience with fairing design? a fairing only needs small holes in hidden away places to allow the inside atmosphere to escape while it ascends, you know that right? such holes could even be outfitted with valves to minimize outside air influencing inside environment. and if you necessarily require no moving parts, etc, then put in tesla valves. &gt; because helium attacks integrated circuits. false. helium interferes with vacuum-dependent enclosed microscopic silicon oscillators. over a time period of 30+ minutes. as an electronic engineer, I hope you know that. If you want to make a point of it, name one more common component that dies in the presence of helium.<lutusp>: &gt; your version of a fairing sounds like the inside is a wind tunnel with supersonic winds blowing through it. That's not my version, that's what a fairing is -- it must withstand that environment. It cannot be airtight, it cannot contain helium. This conversation just ended. <Joonicks>: I see. Well, FYI, the falcon 9 is pressurized (overpressure) on the pad, with computer controlled vents opening only 10 seconds after launch.", "num_messages": 14, "avg_score": 4.7142857143}
{"start_date": "1543575935", "end_date": "1543610135", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 138, "text": "<MarshallBrain>: Moon Direct SpaceX Falcon Heavy Plan is 6 Years Faster and 50 times Cheaper than NASA <MichelleUprising>: Yes, I’m sure this will happen, just like how all of Elon’s projects worked scientifically and did what was intended.<albguru>: If this is /s, which project of Elon’s didn’t work as intended?<MichelleUprising>: He’s planning on putting people on top of a ballistic missile and shooting them at cities for the price of a plane ticket. For those that don’t realize, that’s a horrible idea. That, and the fact that Teslas are overrated, the hyperloop is impossible to maintain, and their rockets are just reusing decades old technology. Meanwhile he gets rich as hell, and his workers toil in terrible conditions. <ElectricTrousers>: &gt; their rockets are just reusing decades old technology The Soyuz is literally from the 60s, so you can't call SpaceX's technology old. I don't think you can argue that SpaceX isn't the most innovative and exciting aerospace company by far. (have you seen the Falcon Heavy launch???). In your response to your previous comment, while Musk's projects aren't usually on time, they have always been successful so far. SpaceX is advancing spaceflight at a faster pace than anyone else. <MichelleUprising>: The Soyuz isn’t pretending to be innovative, they’re sticking with technology that works. SpaceX is using publicly researched technology and simply putting it together with a giant tube of rocket fuel. There’s nothing special about SpaceX other than the fact that they have money. Anyone else could conceivably do the same, but they didn’t because it didn’t really have a point before.<Goldberg31415>: &gt;Soyuz works Dude you are not following the news it seems.<MichelleUprising>: In hundreds of space flights, there **will** be crashes. Another crash was statistically inevitable.<Goldberg31415>: Using a hammer to mount a sensor upside down or forcing a booster attachme t point that was bent is a gross neglegence of basics rules.Russian aerospace is collapsing<MichelleUprising>: It is true that Russia is coasting off of the Soviets in more ways than one, but that doesn’t mean that Elon is using new technology.<F4Z3_G04T>: We're just landing some rockets, nothing much<MichelleUprising>: [Here’s NASA doing the same thing and more, but nearly 30 years ago](https://www.youtube.com/watch?v=JzXcTFfV3Ls).<F4Z3_G04T>: That was lockheed martin, not NASA, it was suborbital and it never became a real thing nor commercially viable<MichelleUprising>: But it’s the same technology.<F4Z3_G04T>: It really really really isn't, not even close. It doesn't even have the same fuel", "num_messages": 15, "avg_score": 9.2}
{"start_date": "1543513985", "end_date": "1543562655", "thread_id": "t3_a1iu13", "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 5347, "text": "<EEcav>: Ha. Yes, but only where Humans are already colonizing it. Humans basically have a cloud of living organisms that surround them wherever they go. We do our best to sterilize Mars landers, but if humans ever go to Mars, the planet WILL be contaminated with earth microorganisms. We can't sterilize humans. <ronmusto>: Or can we?......<kufunuguh>: If only there was some kind of final solution to the bacterial problem.<Slidshocking_Krow>: Ever played Halo?<VeronicaKell>: Actually the rings wiped out all sentient beings, bacteria are not sentient... sooo... even the rings wouldn't work.<BearBruin>: This actually just explained to me how life recovers in the Halo universe after firing the Halos.<KAODEATH>: Undoubtedly some organisms evolved from left over bacteria. But the lore explains that the Forerunners took a boat load of lifeforms to the Ark before the firing, put them back after and then left.<BearBruin>: I forgot about the ark. That's like the entire plot of halo 3. It's been a while, that's for sure.<KAODEATH>: I'm a huge fan of Halo but what I'm about to say is complete heresy... I've never been able to beat Halo 1,2 and 3. Damn Flood are too difficult. <Edit>: As embarrasing as it is to admit, I play on easy. [deleted]: I mean you don't *have* to beat the game on legendary bro.<KAODEATH>: Yeah uhh... I play on the easiest difficulty possible. <Inglorious_Muffin>: No shame in that man, some of the levels are pretty rage inducing with the punishment they give on the flood levels. Regardless of difficulty the flood missions are pretty ruthless.<KAODEATH>: I think I got sort of close to beating Halo 1 but there's a level where I think I got to a checkpoint with sub-par weapons. That room is now my personal mausoleum.", "num_messages": 13, "avg_score": 411.3076923077}
{"start_date": "1544718449", "end_date": "1544744011", "thread_id": "t3_a5uvx0", "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 72, "text": "<DrLuckyLuke>: Well... http://www.parabolicarc.com/2018/12/03/fai-considers-lowering-boundary-space/<CieloHalcon>: Seems like a roundabout means of simply moving the goalpost rather than meeting it. I wonder how many people will be retroactively declared astronauts if 80km is used as the marker.<mattd1zzl3>: The US airforces line is just as good as anyone elses. Im sure you could make some pedantic argument about why the Karman line isnt REALLY the beginning of space. [deleted]: Most of the pedantic arguments I've seen are basically \"The Metric System is the superior unit of measurement.\"<mattd1zzl3>: Metric supremacists are the worst. While the base-10 simplicity of it is noted, its like arguing that your language is superior because it has the fewest words. If we can accept \"word languages\" i can accept \"number languages\". (Go try some hexadecimal stuff, its wild)<Polares>: Only logical reason for not liking metric system would be accepting base-12. It is clearly superior to the base 10. Division by 2-3-4-6 becomes super easy and we use those for division way more than 5. This would make metric system redundant. Other than that metric system is clearly superior. <Albino1Ninja>: Ah, if you like dividing things by other things, try and see how many fractions result in whole numbers of the smaller unit in imperial.<Aurora_Fatalis>: Unless you're dividing by something relatively prime to 10 but not 12 (so basically just dividing by multiples of 3 instead of multiples of 5), metric units have a vastly wider range covered, since you have prefixes like mega- and nano-.<Albino1Ninja>: What's 1/3 of a foot? What's 1/3 of a meter? That's the only point I'm trying to make.<Aurora_Fatalis>: What's 1/5th of a meter? What's 1/5th of a foot? Same bloody point, except there's a wider range of metric units to choose from and they're all regular. If I say I'm 1.15 millimiles, how much is that in feet?<Albino1Ninja>: Sorry, Aurora, I'm not intentionally attacking the metric system. I should have tried to make that much clearer. I just like to show that there's a difference between a decimal and a fractional system of measurement. Imperial isn't \"stupid\" or \"arbitrary\" like so many people point out. It's a very useful system for people who need to build things without precision instruments. With the introduction of precision instruments and computers, the need for a fractional system is much less necessary. However, for those laypeople who don't do scientific measurement on a daily basis, the case can be made for Imperial being a bit more approachable for day-to-day use.", "num_messages": 11, "avg_score": 6.5454545455}
{"start_date": "1543592158", "end_date": "1543747155", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 130, "text": "<MaryADraper>: Private companies building a spaceport in Japan. The launch site will be used for private space travel and feature 3km runways for craft that take off horizontally like airplanes. A newly formed company named \"Spaceport Japan\" is advancing the project. <i_start_fires>: That's great, but where are they going to get these \"[space]craft that take off horizontally like airplanes\"? If they were feasible we'd have already built them.<wintersu7>: Virgin Galactic could use such a runway. It’s longer than they need I’m pretty sure. After Elon talked about Earth to Earth transport Branson picked up on doing that to. They may be fishing for a partnership. That would be cool actually, hopping from LA to Tokyo would be a good look for a company<RedAsFolk>: That makes sense. So, not so much orbital vehicles than doing big suborbital hops between spaceports?<wintersu7>: Exactly. That could be big business someday. I bet going anywhere on the planet in 45 minutes or less could be a great selling point. There’s got to be a market for that<RedAsFolk>: Even better if it were socially owned and run according to a scientifically engineered plan. <wintersu7>: Airlines work very well. I’ve used them many times to fly from point A to point B. If they do poorly, people stop flying on them, and they suffer financially as a result The system works, and most airlines are owned by massive amounts of stockholders, but have regulations from government to insure that they operate safely. I don’t see any reason for this to be different If by ‘socially owned’ you actually mean ‘government operated’ than I will have to disagree with you. <RedAsFolk>: I don't mean government run, I mean socially owned. And I find it hard to believe you don't see the results of services being run for profit as something negative to the consumer. How many stories ran last year about rising baggage fees, lowered limits on carry ons, destroyed goods, or even straight up violence against its customers? <wintersu7>: And as a result of bad experiences and treatment, the airlines involved are losing money. They are getting hurt right where they pay attention. As a result, I’ve noticed that there hasn’t been recent footage of passengers being dragged off planes. They stopped doing it. If a government was doing it? There wouldn’t be a whole lot of change. Look at the VA hospitals. It’s taken many years, and one feisty President, to get change of any kind in their treatment of patients. Your socially owned thing boils down to government operated. In the good old USSR everything was ‘owned by the society’ and that didn’t go well. Please give an example of that working<Aior>: Eh, what <https>://en.wikipedia.org/wiki/Cooperative<WikiTextBot>: **Cooperative** A cooperative (also known as co-operative, co-op, or coop) is \"an autonomous association of persons united voluntarily to meet their common economic, social, and cultural needs and aspirations through a jointly-owned and democratically-controlled enterprise\". Cooperatives may include: businesses owned and managed by the people who use their services (a consumer cooperative) organizations managed by the people who work there (worker cooperatives) multi-stakeholder or hybrid cooperatives that share ownership between different stakeholder groups. For example, care cooperatives where ownership is shared between both care-givers and receivers. Stakeholders might also include non-profits or investors. *** ^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/space/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^] ^Downvote ^to ^remove ^| ^v0.28", "num_messages": 11, "avg_score": 11.8181818182}
{"start_date": "1544758554", "end_date": "1544859660", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 11, "text": "<HorizonAlphacat>: Horizon, A new aerospace startup. [removed]<kessler_space>: I'm one of the cofounders of Horizon Space Ltd. to further out some questions about the company. Who's in your team?<A>: Our team consists of amateur rocket enthusiasts and engineers who have been working and have an experience of rockets for about a year now. What is the vehicle architecture?<A>: The rocket architecture of it would be based for the small satellite launch market and also for cube sat launch market. What is your business model?<A>: Our proposed business model would be to compete with other small satellite launch companies, making sure that the payload is safe when mission aborted while being extraordinarily cheap by using innovative manufacturing techniques that will not only have quality materials but at a cheap costs. It aims to get down the cost so the consumers can launch their own cube sats to space and make the space near to next generation. Are foreign nationals also eligible for invitation to your main server?<A>: If foreign nationals who has a secured and verified profile would be the only ones who can enter the main server. For further questions, you can reply to this thread. I'm one of the cofounders of Horizon Space Ltd. And also, we can secure some security issues about exporting \"missile technologies\" and all of the materials would be locally made here in the Philippines. To everyone that can see this comment, thank you for reading. - COO and Lead Designer for Horizon Space Ltd.<BlazingAngel665>: &gt;Our team consists of amateur rocket enthusiasts and engineers who have been working and have an experience of rockets for about a year now. What vehicles and programs have your team members worked on previously? &gt;small satellite launch market and also for cube sat launch market. So two stage kerolox rocket? Gross liftoff weight of 80,000 lbs? &gt;innovative manufacturing What innovative manufacturing technique? &gt;we can secure some security issues about exporting The Philippines have a multitude of export control laws, most of which will apply to you. Sharing information with a foreign nation is a 'deemed export' and you can be charged just as if you'd shipped a missile out of the country. &amp;#x200B; &amp;#x200B;<kessler_space>: 1st Question<A>: We have previously worked on sounding rockets, which I myself won the highest altitude of any sounding rockets that made on that competition... 2nd Question<A>: 2 stage (1st stage is Methalox and 2nd stage is hydrolox) with a liftoff weight of about 1500kN. 3rd Question<A>: Using carbon composites for stages and outer layer. and electron beaming 3D metal printing the tanks, engines and other necessary components with an exemption of electronics and rubber seals. 4th Question<A>: Sorry, I think I have a misinterpretation before... The launch site, the factory and also the materials came from Philippines and launching it there...<BlazingAngel665>: Sorry to keep coming after you, but if you want to succeed at this, you need to have your a-game. Sounding rocket can mean a lot of things. By sounding rocket, do you mean flew to 10km on a commercial solid rocket motor using passive stabilization, or do you mean you flew to 400 km on bipropellant engine that was actively guided while beaming live telemetry? Please clarify. 2nd. Both of those architectures are good choices. How do you justify the expense of two separate sets of GSE because of the different fuels? Is the payload penalty for using another methalox stage (or god-forbid, hydrolox first stage)? Are you doing pumps or blow down? 4th. There was no misinterpretation. Sharing photos of your work, sharing design documents, allowing a non-citizen to handle your parts or tour your factory, all of these constitute an 'export.' You can be held liable for damages. The Philippines have laws protecting the dissemination of rocket technology. You could already be in violation by sharing your server with foreign nationals. You should contact your state department or commerce department and seek a ruling on your technology so you know what laws you must follow.<kessler_space>: Those of have you said is understandable to us. We also are already working on that particular subject. I've already contacted my country's Science and Technology Department, Defense Department and also the Aviation department for the clearance to do so. I've already put up the timeline of it if it goes right that my natin would have a working space agency by the next decade. I know you have many questions or considerations for it but I can't keep up this conversation any further. Thank you for reaching in with us. -COO", "num_messages": 6, "avg_score": 1.8333333333}
{"start_date": "1543105551", "end_date": "1543127175", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 40713, "text": "<harryyw>: I’m a 17 year old really interested in photography and space, I took this a couple nights ago! My second attempt at moon photography :) <nick042416>: Nice! What camera, what lens, and what settings? <harryyw>: Thank you! Nikon D3300, JINTU 420-800mm lens (its a lens for about £100 which of course, you would expect to be pretty poor quality for that focal length, however, it’s manual which makes it cheaper, and honestly, I’m more than happy with the quality, being someone who just takes photos for fun. In all honesty, I don’t fully remember the settings, it was a few nights ago and didn’t think about remembering them 😂<jordan1794>: Are you using a tripod, or holding it? If you're using a tripod (edit: or have one at your disposal), send me a message...I can help you do some AMAZING things. <Edit>: getting quite a few responses here. Feel free to send me your moon pictures in a message, and I can let you know how much improvement you might see out of post processing. Be sure to check out /r/astrophotography and their wiki for far more information than I can provide! That's where I got started!<harryyw>: Tripod, no chance of focusing it handheld 😂<aleblank>: For astrophotography, its actually really easy to focus, you just throw it all the way to infinity and you are good (the moon is pretty damn far away). It is harder to handhold though because you usually need longer shutter times. <scruffles87>: In my experience, you have to throw it to infinity and dial it back a notch or two if you want pinpoint stars. That's how it is with my A6000 kit lens, at least. <thereluctantpoet>: That's how a good number of lenses are. Most serious astrophotographers mark *exact* infinity on their lenses as noted during daylight (myself included).<jimonabike>: Most of my Nikkor telephotos have that infinity mark on the focus ring.<thereluctantpoet>: Are they separate from the infinity symbol on the focal length display? Not doubting you - I was a Canon and now Fuji shooter so the most modern Nikon lens I own is a 1960s 50mm 1.4 and I'm unfamiliar with the digital system.<jimonabike>: It's like a sideways figure 8 before infinity. Most of my Nikkor glass is over thirty years old (still works). Retired PJ, still got a shelf of Nikon F bodies ala 1959. Retired after the F5...then all this digital stuff. cheers<thereluctantpoet>: Ugh, I'm jealous of your F5. Its a Ferrari next to the Mamiya 645 I have sitting here (amazing IQ but clunky). I still shoot black and white and develop it in the bathroom, but unfortunately paid work requires digital these days so my workhorses are all digital. The Fuji X series is nice in that all dials are manual and aperture is a ring on the lens, but it's still not the same! <Edit>: I'm trying to move into photojournalism right now. Saturated market now that everyone is a \"photographer\".", "num_messages": 12, "avg_score": 3392.75}
{"start_date": "1544699389", "end_date": "1544880580", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 547, "text": "[deleted]: Martian methane—spotted in 2004—has mysteriously vanished [deleted]<AcneZebra>: With the recent news of just how deep we are finding life on earth it does give some hope for deep martian life far removed from surface conditions. It seems like once a planet has life, the crust could serve as a constant reservoir.<thejazz97>: I'd imagine Martian fossils would be news of the century, but I don't think we'd find them in such nice conditions close to the surface.<rupertTcalinbob>: Hmm, I wonder if the lack of plate tectonics and less geological activity (if at all) on Mars would allow fossils to be found easier than on Earth.<LumpdPerimtrAnalysis>: Or harder. While they maybe wouldn't be destroyed by such activity, they also wouldn't be brought to the surface either.<jhenry922>: One argument is that plate tectonics on Earth or what makes it possible for a life-sustaining environment to be maintained for billions of years. Scientists studying Venus and Mars, with their two different outcomes, are starting to realize this.<xXRoXx>: but why? since their movement is so slow relative to life, is it more about resources on the ground? (nutrients, minerals, etc)<Drauul>: The electro magnetic shield it generates that protects us from the sun.<naaarff>: Plate tectonics do not generate Earth’s magnetic field. It is generated near the core. The plates are near the surface, relatively speaking. <americansone5280>: The heat and activity of the core are what cause both. Mars has an inactive and relatively colder fire which means no plate tectonics and a much weaker magnetic field. The lack of the field protecting against radiation appears to be why the atmosphere was/is being stripped away<throwawayi9w>: Venus has no magnetic field<americansone5280>: “Unlike Earth, Venus lacks a magnetic field. Its ionosphere separates the atmosphere from outer space and the solar wind. This ionised layer excludes the solar magnetic field, giving Venus a distinct magnetic environment. This is considered Venus's induced magnetosphere.”", "num_messages": 12, "avg_score": 45.5833333333}
{"start_date": "1543626979", "end_date": "1543653289", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 116, "text": "<MaryADraper>: Tehran’s drastic sinking exposed by satellite data. Parts of Iran’s capital city, home to 13 million people, are subsiding by 25 centimeters each year. <Ranikins2>: TLDR: no satellite photos and full of popups. Just rambling.<T_Neil>: Popups weren't so bad, but it is highly repetitive which made it hard for me to read. Tl;dr it's groundwater depletion", "num_messages": 3, "avg_score": 38.6666666667}
{"start_date": "1543590504", "end_date": "1543627957", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 94, "text": "[deleted]: This footage from Saturn is surreal [deleted]<Flesh_Lettuce>: What song? Not sure if this was asked bc my comments aren't loading <Onion_master>: Not sure about this specific version but the original is [Max Richter - On the Nature of Daylight](https://www.youtube.com/watch?v=rVN1B-tUpgs)", "num_messages": 3, "avg_score": 31.3333333333}
{"start_date": "1543582607", "end_date": "1543602945", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 74, "text": "<MaryADraper>: Trump going for full-blown Space Force, White House memo reveals, despite the expected pushback from a Democratic-controlled House and the Pentagon. <rabbitsclaw>: american exceptionalism here \"we need to control/dominate space to give people our freedom\" if we were looking for equal control it wouldn't be a problem, but no we'll spend 100s of billions putting shit into space and our \"allies\" will all support us, China isn't going to see itself as something that isn't our equal and they'll crap up there too - penis measuring contest again, we'll do anything to have the biggest penis and eventually that will put cracks in our system, as it already is we can't try to be 1 step ahead of everyone, only equals, Russia and China have an easy time convincing their public we're evil when we try to dominate <FallingStar7669>: To be perfectly honest though... I think this is less about American exceptionalism and more about lining pockets. The old phrase holds true: follow the money. The first time I heard about this ludicrous Space Force, I immediately thought, \"Well, okay: that's another 100 billion dollars every year of tax money that isn't going to something useful\". American exceptionalism is an issue, but the American military industrial complex is a much more 'Occam's Razor' solution. Especially when the loudest voice - Trump - is a dyed-in-the-wool businessman. In other words, I don't think the people calling for this are genuinely interested in keeping America safe; I think they're only concerned about their own financial interests. Of course, regardless of where this is coming from, other countries will certainly see it as American exceptionalism, and will respond accordingly... as you said, dick-measuring.<Posca1>: I think your understanding of what the Space Force will be is flawed. This 2017 article, from long before Trump ever heard of the proposal, should shed some light<https>://www.cbsnews.com/news/congress-aims-to-develop-new-military-space-corps-branch/ [deleted]: I really don't understand why this is such a contraversial issue. It will happen eventually as the USAFSPC, SMDC, and the NSC continues to grow. Not long from now the growth of all the programs will get unsustainable and it will need a new branch. Better to do it now before shit gets wasteful funding and disorganized <Posca1>: I think the size of the force is too small right now to make sense. It would only be around 24,000 personnel. That's too small to be a separate service. If the issue that's driving this is the need to protect space budgets from raiding by Big Air Force, that can be easily accomplished by legislation. But, yeah, eventually this will happen. People are up in arms because, let's face it, \"Space Force\" sounds a bit silly. Combine that with everyone thinking Trump came up with this (and he is not really that smart a guy), plus not really knowing what it would entail (\"oh, it must be building spaceships, and space marines, and putting weapons in space\") [deleted]: See my comment above about the name. I think that's pretty reasonable considering it pays homage to how the Air Force formed. Personally, I think US Space Command sounds cooler though. As for the size; I agree it would be a small brqnch, but it's better to form a branch when it's small rather than waiting until the various programs become too big to run effectively. That'd keep wasteful spending down<Posca1>: &gt; Personally, I think US Space Command sounds cooler though. Well, you're in luck then, as the Command is being brought back to life <https>://en.wikipedia.org/wiki/United_States_Space_Command<DanaEn803>: That is the biggest problem, the Navy does things our way, Air Force does their thing, and Army does their thing with very little coordination from development to operations to basic procedures between the branches. They are turning Space Command into a Warfare Commander equal to CENTCOM or PACCOM, in Cyber Attacks or direct physical attacks on Satellites he will be the one responsible for a coordinated response. Space Force if created will be a compilation of the personnel with standard training and advancement. Then you will have Development and Acquisitions that will happen as a coordinated entity between the branches so each Branch isn't duplicating the efforts of the other branches. The initial consolidation they are doing now will help smooth things out even if the actual Space Force Branch is never created and becomes a Space Corps under the Air Force with a similar relationship to the Navy and Marine Corps under the Dept of the Navy.", "num_messages": 9, "avg_score": 8.2222222222}
{"start_date": "1543626855", "end_date": "1543685031", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 35, "text": "<MaryADraper>: As SpaceX prepares to launch a Falcon 9 carrying dozens of small satellites, some experts are worried that it will be difficult to track and identify the satellites once in orbit. Some experts are worried that neither Spaceflight nor the Air Force are ready to handle that work. <imagine_amusing_name>: This is just fluff by Boeing. They've been trying to damage SpaceX for a long time because SpaceX is kicking seven types of shit out of their ancient-tech rockets that cost 20x the price of a spaceX launch. <binarygamer>: That's a weird take on this article, did you just read OP's editorialised title? While you are broadly correct on Boeing's behaviour, the article really makes no attempt to attack SpaceX and stresses that the rideshare company (Spaceflight) bears responsibility. The author, Jeff Foust, is one of if not the finest spaceflight journalist in the US, very impartial and not at all affiliated with any launch provider or defense corp.<imagine_amusing_name>: Boeing has tried to get the Internet satellite system blocked, because they KNOW it will generate BILLIONS for spaceX. Which enables them to compete even MORE effectively. Your argument is whats known as an \"appeal to authority\". just because someone is a well known journalist, doesn't mean he isn't being paid or even without pay that he prefers Boeing to SpaceX.", "num_messages": 4, "avg_score": 8.75}
{"start_date": "1544706820", "end_date": "1544710205", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 10, "text": "<Dzoni330>: Details of Elon Musk's space x and flight to Mars [removed]<money_sandwich>: Correct me if I'm wrong but I don't think there are currently any manned missions planned to go to Mars in 2019. So I don't exactly know what flight you're talking about.<Dzoni330>: I heard somewhere about commercial flight and that japanesse billioner guy to be in the crew<Lakepounch>: That flight is to the Moon I think and it is not landing just orbiting from what I understand. The millionaire bought out all the seats and is giving them away to artist around the world. Mars is still a long way out on the tech side for human travel. During the travel to Mars austonauts will face 60 times the radiation dose some one on earth faces in the same amount of time. That doesnt include the radiation on the Mars surface but people could live in caves there. I'm guessing that dose will get lower with time and better shielding but we are still some years out from making it safe for human transport.<Dzoni330>: Ok thats sound more about right,prob some youtuber got confused or clickbaited the shit out of me cuz i tought thats to early too", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1543614273", "end_date": "1543615432", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 25, "text": "<moreorlesser>: If we terraformed a planet, should we make it exactly like Earth's biosphere, or an 'improved' version One that lacks organisms that are detrimental to humans, such as mould, parasites, and pathogens? I'm sure we could come up with an alternate biosphere if we wanted, although I'm sure new organisms would eventually fill these niches.<Dalhinar>: All of those things play an important part in the biosphere. Removing them would not be beneficial or even really work/be possible. <moreorlesser>: We could only take versions of them that don't impact humans or human crops. Besides, I dont think pathogens have a particularly necessary part in our food chain.<Dalhinar>: Mould and parasites play an important part in the life cycles of certain organisms and pathogens play an important part in controlling populations and driving genetic variation.", "num_messages": 4, "avg_score": 6.25}
{"start_date": "1543262122", "end_date": "1543331784", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 79589, "text": "<nebuladrifting>: NASA InSight has landed on Mars First image [HERE](https://i.imgur.com/vBEHl3O.png) [Video of the live stream](https://youtu.be/bGD_YF64Nwk?t=120) or go [here](https://youtu.be/bGD_YF64Nwk?t=3278) to skip to the landing.<nebuladrifting>: First image [HERE](https://i.imgur.com/vBEHl3O.png) [Twitter image](https://pbs.twimg.com/media/Ds9EYfxXoAAPNmx.jpg)<Seeeab>: Fuckin bananas how we catch light from Mars and beam it back to Earth in moments and we can look like we're standing there and just landed ourselves I know we aready did that and similar before but still, amazing<AccomplishedMeow>: Fun fact is it is about \\~7 minutes (due to speed of light)<LOUD-AF>: Suddenly, light doesn't seem so fast anymore🙂<Hi_Im_Wall>: The crazy thing is that it is; it's the fastest thing possible. Space is just big. I mean, really big. You might think it's a long walk down to the chemist, but that's just peanuts compared to space<superwinner>: &gt;The crazy thing is that it is; it's the fastest thing possible. I have this conversation with people all the time who've watched way too many movies that think light speed travel is 'right around the corner', its not (my personal opinion is we'll never get that fast). And even if it was, at light speed it would be 5 years travel time to the nearest star assuming you could speed up and slow down instantly.. people just think Im lying.<Hi_Im_Wall>: It's sort of my personal theory that right now Humans are going through the Great Filter part of the Fermi Paradox. If we managed to make it another 1000 years I think that eventually we'll crack something in the regard of, if not light speed or faster, at least something crazy effective. If you look back across all of human history we're actually super good at disregarding the limits that nature intended for us. Between boats, trains, plains, oh my, medical advances, technological leaps, knowledge increases at an exponential rate. It look less than one human life time to go from the first airplane to landing on the moon. Maybe I'm the optimistic type, but I don't see a future where some stubborn and brilliant peoples don't find a way to get past the light speed barrier too<SetBrainInCmplxPlane>: Speed of light isn't a technological barrier. It is **fundamental**. Anything going faster the the speed of light would have effects literally happen before causes. The speed of light is actually the speed of causality and will never ever be broken.<StaticMeshMover>: That's only if you assume a theory to be 100% correct...... Which you really shouldn't or else it wouldn't still be a theory.<SetBrainInCmplxPlane>: I don't think you know what the word \"theory\" is.<StaticMeshMover>: Please enlighten me then oh wise one....<mcochran1998>: Not the person you responded to but I'll anwer anyways. Theory has a layman's definition and a scientific definition. The layman's version is that of speculation or a hypothesis. The scientific version is different. A scientific theory is an attempt at explaining the observations made about our universe. It isn't a theory unless it provides a means of falsification, meaning it should make predictions about what will happen in a given system. A theory has to explain the observations &amp; if the results of experiments don't match the predictions then the theory needs to be amended. All of our observations have pointed to light being the fastest thing in the universe &amp; it's rate of speed is constant. Nothing has been discovered to upset our understanding of this. We would need to be fundamentally wrong about physics to be able to go faster than light. We are not fundamentally wrong, if we are then you're receiving this message on a magic machine. What we can do is learn how to warp space. What we know says that gravity can warp space-time &amp; we could in theory create a gravity well to shorten the space we'd be traveling through. Who needs to go faster than light if you can create a shortcut through space? The energy requirements are the real problem in this scenario.<Suspicious_Code>: &gt; We are not fundamentally wrong Not the person you replied to either, but you lost me here. Saying \"we are not wrong\" goes against everything science stands for. At best, we can say that nothing we've observed or measured up to this point has given us any reason to believe that we are wrong. But we still very well may be wrong.<mcochran1998>: I get what you're saying but it's a matter of refinement, not the kind of upheaval something like traveling faster than light would imply. You're right that in science it's levels of confidence and never absolute certainty but we would have to be more wrong than Newton was compared to Einstein if things can go faster than light. In science we always progress towards less wrong. Given what our current understanding sits at, the technology that we produce as a byproduct being testament to our understanding and manipulation of our reality. Either we aren't fundamentally wrong, or every electronic device is magic. <StaticMeshMover>: \"In science we always progress towards less wrong.\" This is exactly what I'm saying. The problem is you say that then contridict yourself by claiming that means we must have everything correct. No one is saying all the things we know are incorrect, like the science that makes our phones work. All I'm saying is we don't know anything for sure. We are only less wrong. We could discover anything in the years to come.<mcochran1998>: Fundamentally wrong would imply that we are wrong about everything. Me saying that we aren't fundamentally wrong doesn't imply that we don't have things wrong with our models of physics. It does imply that we are on the right trail. <ThePoultryWhisperer>: No it doesn’t. You can easily be fundamentally wrong about something and still use what you think you know to make progress. One day, you find the right piece of data to clarify everything and you have an entirely new theory. Thinking that can’t happen is _fundamentally_ arrogant and unscientific. I say this as someone who uses physics and engineering on a daily basis specifically for non-terrestrial communication. We do the best we can with the information we currently have while continuing to refine our current theories. That does not mean they are infallible in any sense of the word. It’s unlikely given the wealth of data and experimental repeatability, but everything could change when we sample the inside of a black hole, for example. Is it impossible? Maybe, but we have overcome impossible many times in the past. Calling this a fundamental, impenetrable barrier is arrogant at best as if we know enough to know anything fundamental about the universe yet.<StaticMeshMover>: Thank you for helping try to explain how simple science works to this guy. I don't understand how people can think they know or are into real science but then are still close minded. I'm no real scientist myself but at least I take the time to understand the simple concepts of it like what a theory is. Still can't believe he tried to tell me a theory in science somehow has a vastly different meaning and somehow means that thing is \"fundamentally\" correct. People are weird.", "num_messages": 19, "avg_score": 4188.8947368421}
{"start_date": "1543576965", "end_date": "1544817840", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 11, "text": "<sammyjamez>: We are terrible in managing a sustainable planet that is suitable for all forms of life on Earth. So how can we be sure that colonising Mars is a good idea? Edit- grammar My question is this - considering that we have lots of problems and complications to even manage or maintain an entire planet full of life and resources for everyone and all kinds of life on Earth - from global warming, deforestation, the destruction of natural habitats and extinction of thousands or even millions of species, filling our waters with tons of plastics and microplastics that cause a lot of health problems to other species on Earth and even us .... then is it a good idea to go and colonize Mars? If we are so terrible at doing our job to keep Earth as sustainable as possible for the entire human species and all the different species that exist on Earth, is it possible that we will not do a good job at managing an efficient and sustainable colony? And if we do find and manage to come into contact with other species on Mars, whether they are microscopic or not, will our species cause huge irreparable damage to the ecosystems that are on Mars? Or is it possible that our contact with other species or other forms of life on Mars like new diseases or bacteria that we still do not know, how will we know how to treat them in such a short time when all the advanced equipment would be on Earth? If we bring alien species from Earth or alien species from Mars to Earth, will there be consequences that could potentially be catastrophic or potentially have huge consequences on the entire ecosystem? Things like these just pop up in my head and considering that I am not an expert in biology, ecology or astronomy or psychology or politics and so on considering that there are so many different important academic fields to look into, I am often left with little answers. I feel that if we do manage to colonise Mars, I fear that it will be a while until we eventually manage the first colonies in a stable manner.<Relaxed_Engineer>: I am in agreement with this - if we can't even terraform *Earth* and manage that sustainably, I don't think we have any hope for Mars. That's not to say that we shouldn't go to Mars, but that we need to get our shit together here on Earth first.<Thatingles>: My question to you is: Do you think we've really tried? I think that the last few centuries have been focused on competitive development based on the idea that the world will just deal with what we are doing. In my lifetime I've seen environmentalism move from being a fringe concern that was often treated with mockery to a mainstream idea that people are enthusiastic about. We've only just started trying, in earnest, to create sustainable solutions that provide an acceptable standard of living. Have we gone too close to the edge to pull back? I don't know, but I feel like (finally!) this is a mainstream idea and that we are going to give it a go. <Relaxed_Engineer>: &gt; My question to you is: Do you think we've really tried? No. That's my point. We've yet to figure out how to sustainably manage and be good stewards to our relatively hospitable home planet. Until we do that I think talking about colonizing and terraforming Mars is wildly premature and irresponsible.<StarChild413>: But how long do we need to do that for?", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1543518238", "end_date": "1543555544", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 27, "text": "<DrScientist812>: Russia plans to establish 'colony' on moon by 2040 <Starjetski>: *Nasreddin was boasting to people that he could teach a donkey to speak. The Emir summoned him and asked if it was true that he could teach a donkey to speak. He confirmed that this was the case. The Emir then produced a donkey and ordered Nasreddin to teach him to speak.* *I am afraid that it will take me twenty years, was Nasreddin’s response.* *The Emir reluctantly agreed to the twenty years.* *And it will be very expensive, Nasreddin added. I will need one hundred thousand gold coins.* *One hundred thousand gold coins? Out of the question!* *Then I am afraid that I cannot teach a donkey to speak, Nasreddin responded.* *The Emir reluctantly summoned his vizier and ordered him to give Nasreddin the hundred thousand gold coins.* *However, he concluded,* *if you do not teach the donkey to speak within the twenty years, I will have you beheaded.* *Nasreddin joyfully went home and threw the coins onto the kitchen table in front of his wife. She was impressed but asked him where he got them from. He explained the story of the donkey and the Emir.* *Nasreddin, she said,* *others may be taken in by you but I know you well. You cannot teach a donkey to speak. In twenty years, the Emir will have you beheaded.* *Oh don’t worry, my love, Nasreddin replied,* *In twenty years either the Emir or the donkey or I will be dead.*<iroflmaowtf>: I NEED to know the source please, love it!<DesertPanther>: https://en.m.wikipedia.org/wiki/Nasreddin <WikiTextBot>: **Nasreddin** Nasreddin or Nasreddin Hodja () was a Seljuq satirical, born in Hortu Village in Sivrihisar, Eskişehir Province, present-day Turkey and died in 13th century in Akşehir, near Konya, a capital of the Seljuk Sultanate of Rum, in today's Turkey. He is considered a populist philosopher and wise man, remembered for his funny stories and anecdotes. He appears in thousands of stories, sometimes witty, sometimes wise, but often, too, a fool or the butt of a joke. A Nasreddin story usually has a subtle humour and a pedagogic nature. *** ^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/space/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^] ^Downvote ^to ^remove ^| ^v0.28", "num_messages": 5, "avg_score": 5.4}
{"start_date": "1544635415", "end_date": "1544642878", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 101, "text": "<Californie_cramoisie>: The NASA budget peaked at 4.41% of the US Federal budget in 1966, and the first moon landing was in 1969. What other feats would we have achieved if NASA had 4.41% of the US Federal budget for the past 52 years? <mattd1zzl3>: We'd have had some kind of violent revolution or something because that level of discretionary spending is not sustainable in anything but short bursts? Dont forget the \"Great Society\" programs were still being implemented at the time. People expect VASTLY more from the federal government to provide for them than they did before the 1960s. That spending couldnt have lasted 10 years, much less 52.<Roxfall>: Unsustainable? Look at US military budget. It's 15%, and in terms of actual dollars spent, it's more than the next ten highest budgets combined. <https>://www.pgpf.org/chart-archive/0053_defense-comparison <https>://en.wikipedia.org/wiki/List_of_countries_by_military_expenditures <mattd1zzl3>: As i outlined in my other post this is desirable and has a return on investment that pretty damn unarguably rivals or surpasses manned or unmanned space travel. And i have great respect for the ROI from space travel and support adequate funding for both. Also without greater revenue it is also not currently sustainable. Remember how many little programs are competing at that level for attention and money. *NASA needs to be compared to like, the energy investment budget or international diplomacy, not the frigging 4 armies, 2 navies and 3 air forces.* Finally, \"What about this\" is not a great persuasion strategy.<Roxfall>: It is a shame, on a humanitarian level, that the government that supports such a ridiculous military budget cannot pay for healthcare of its constituents, unlike every first-world country. How can we call US a first world country when Breaking Bad is how people pay their medical bills? And what's happening with student loans is also egregious and just as unsustainable. I mean, sure, we can rely on brain drain to give our best jobs to foreign H1B visa slaves, but our president doesn't seem to like those either. The AI that will destroy the world will not write itself, you know.<mattd1zzl3>: &gt; How can we call US a first world country when Breaking Bad is how people pay their medical bills? Two things: A government is not usually measured by providing a comfortable, safe life for its people (that falls to a society, or a culture). Thats a 1910s school of social thought that died out in the west for decades and is only now making a serious return. Im not sure how people can look at modern europe and say \"yes, thats a life i want for myself. I desire that\". I watch a youtuber that went to government-paid university until he was nearly 30, is both a trained law clerk and PHD, and never had the prospect of making more than $12,000-$15,000 dollars a year. Anywhere. He quit his job as a doctor and now makes double that making daily youtube videos. Thats the \"first world\" you refer to. MORE IMPORTANTLY, your term \"First world\". First world does not mean \"Wealthy, developed nation\". * First World: The US, its sphere of influance, and its allies * Second World: The USSR, its sphere of influance, its allies * Third world: Those unaffiliated with either party, at least openly.<Roxfall>: &gt;A government is not measured by providing a comfortable, safe life for its people. And if the people don't depose the government that fails to do exactly that, well, you get what you deserve then. United States, right now, is lagging behind the rest of capitalist democracies, in very measurable and unfortunate terms: healthcare and education. And as rich get richer, that is not going to get any better, unless we all do something about it. And now I'm on a list.<mattd1zzl3>: You know the first sentence or paragraph of an argument is often an assertion or statement of intent and the following sentences are the part where you provide evidence, examples and sources, which is normally the part you're meant to pick apart. But if it makes you feel better i'm probably on a few lists as well. So we're in it together :)", "num_messages": 8, "avg_score": 12.625}
{"start_date": "1543594303", "end_date": "1543676694", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 10, "text": "<diddykong52>: Inside look at telescope, LSST, that's going to capture 15 Terabytes of data a night [removed]<SpartanJack17>: I'm afraid I had to remove this because the video link seems to be broken. You can resubmit it, to do so go to <https>://www.reddit.com/r/space/submit?selftext=false Then put the URL of the article the video is part of in the URL box and your title in the title box.<diddykong52>: Ok, sorry, I’ll try to post correctly next time! 👍🏼", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1544698896", "end_date": "1544742295", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 14237, "text": "<mvea>: Finding Alien Life May Require Giant Telescopes Built in Orbit - Influential astrophysicists, roboticists and astronauts say that orbital construction could spark a renaissance in space science and exploration <LostBoyBarney>: I'm psyched for the age orbital infrastructure to begin. That said, I sure hope it includes cleaning up all the debris currently in orbit. I'd hate for us to fuck ourselves for the next few decades (or even centuries) due to Kessler syndrome.<wysiwyglol>: This. I think it was a Kurzgesagt video that made me acutely aware of the Kessler effect... And the fact that it may have already begun since the process is so slow that we wouldn't have noticed yet. Here's the video for those interested: [https://www.youtube.com/watch?v=yS1ibDImAYU](https://www.youtube.com/watch?v=yS1ibDImAYU)<cooljacob204sfw>: Space is huge. I normally like Kurzgesagt's videos but I feel like this one is just pandering. We are not currently at risk for these kinds of chain reactions blocking out our access from space. And all new satellites have requirements to move to a graveyard orbit or burn up at the end of their lifetime.<wysiwyglol>: Space is huge, but low earth orbit is finite in size. Generally speaking, though, it's not a good practice to simply dismiss potential hazards, as you're doing. NASA agrees: https://www.nasa.gov/mission_pages/station/news/orbital_debris.html<cooljacob204sfw>: I'm not dismissing it. I am saying that it is over stated (On Reddit) and it is already regulated. And even low earth orbit is huge. All large objects are tracked and the we don't have enough objects up there to create the kessler effect as that video images it to be. That said we should definitely be aware and careful moving forward, but it is not like we are at immediate risk. <pm_me_ur_big_balls>: Regulations are only useful for the nations that follow them. [China fucking destroyed one of its own satellites with a missile a few years ago in a anti-satellite weapons test](https://en.wikipedia.org/wiki/2007_Chinese_anti-satellite_missile_test), which the US, EU, and UN \"formally\" protested with a strongly worded letter. ...and guess what - both China and Russia are expected to be planning additional tests.<cooljacob204sfw>: Yeah, so have the US. But there isn't really a better solution then regulation and treaties.<FinndBors>: No other country has blown up a satellite purposely in leo before. [deleted]: we can just put a giant magnet up there and it will bunch up all the metal. easy solution <Cethinn>: I'm sure this is a joke but, in case it isn't, the magnet would also pick up their momentum and have to compensate for it. So even if that would work, which it really wouldn't unless it's an absolutely massive magnet, it would also need boosters to maintain its orbit. [deleted]: Are you absolutely sure what you said is fact or are you speculating?<Cethinn>: I'm sure. In order to \"stop\" an object and bring it to the magnet it would need to be strong enough to counter its current momentum. Unless they are really close and near the same velocity you would need a really strong magnet to have a large enough field to pull stuff in. Also, since energy is conserved, the magnet would change velocity by the difference in velocity of the newly captured object. A magnet could be used to gather the material up, but it would be a part of a larger craft that flies to debris first. Basically it would be a non-mechanical net.", "num_messages": 13, "avg_score": 1095.1538461538}
{"start_date": "1543619321", "end_date": "1543775724", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 9, "text": "<EphDotEh>: Mars Indirect? <andygates2323>: Isn't this dependant on Deimos having usable water ice? Granted, the solar system seems lousy with ice but I didn't think the Martian moons had been checked out for it.<EphDotEh>: Right. So Instead of sending probes, to figure it out all out in advance and waiting forever for results, I though maybe \"Plan B\" - added to the bottom of the OP above. If propellant is found, you can go to Mars, if not, can't, at least not on the Deimos trip. <andygates2323>: Remote manufacturing is a goodly ways off that level of autonomy - the Mars ISRU plan of building a plant on Earth, flying the plant to Mars and running it until the tanks are full is the simplest. Assembling the thing as well just adds failure points. Relativity Space and Made In Space are the envelope pushers. Relativity want to fab a whole rocket from surface stuff in one go, it's quite pie in the sky as yet, they're exploring feasibility-space; MiS 's Archinaut is an impressive combo of fabricator and robot arms to assemble the fabbed parts into truss, domes, etc. Hopefully it'll fly in a few years.<EphDotEh>: &gt; Remote manufacturing is a goodly ways off that level of autonomy - the Mars ISRU plan of building a plant on Earth, flying the plant to Mars and running it until the tanks are full is the simplest. Assembling the thing as well just adds failure points. I understand that using atmosphere for propellant production is simpler than extracting it from dirt/ice. The Deimos plan B doesn't rely on any ISRU for a successful mission. The 3D printer was as a backup if \"the plant\" doesn't work - a chance to improvise or fix something. These things will never be fully tested until they are plunked down on the actual planet or moon. [In-Situ Resource Utilization](https://www.nasa.gov/isru) I can see both paths tried by different groups, seems to be enough billionaires are willing to make Human Mars Missions happen. Full 3D printing of rockets is still fantasy IMHO.", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1544726907", "end_date": "1544761482", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 8, "text": "<CrankyBear>: Branson's Virgin reaches edge of space <Aszaszasz>: Glad they got there but its about 10 years too late. Other private companies like spacex and rocketlabs are hitting orbits now. The rutan design was interesting 10 years ago when no non government entity had hit the spaceline before. Now its just a puddle jumper.<---AL--->: Idk the Rutan design “seems” safer/more comfortable to a potential tourist than strapping in to a rocket. Space x seems more for pro astronauting while virgin/blue origin for noob ppl that will just barf everywhere and never do it again.<ScorpionDerp>: Actually, capsule designs have proven far safer and more reliable than spaceplanes.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1544747840", "end_date": "1544762730", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 8, "text": "<zzz123_>: Why dont we colonize the moon The moon seems closer and there appears to be water on the lunar poles, it could be used for research and to launch rockets, so why not?<RedWandererr>: It would be a massive step in the right direction imo, but I think the main reason that we're aiming for Mars is simply because it'll gain more public attention and public support (I have no real data on this so this is purely speculation) whereas the Moon in the general public's eyes is an achievement from the past. <V9VW>: No, Mars has an atmosphere. Mars has water. The moon has no atmosphere, and no water. We’re looking at mars because Mars seems to be the next best thing. The moon is literally dust, which also cases allergic reactions. <Jetskiimcfly>: We still haven't found water on Mars, and the ice on the poles is likely all CO2<V9VW>: We observed flowing brine? What do you mean we haven’t found water? <Jetskiimcfly>: We've found evidence of water that flowed long ago, we've yet to find liquid water <ElongatedTime>: No we’ve found evidence of current flowing water on Mars during summer months.<SqueakyHusky>: We’ve found evidence of potential flowing water, its not a given till we can test it, it could be any number of common liquids, water it just the most likely.", "num_messages": 8, "avg_score": 1.0}
{"start_date": "1543528740", "end_date": "1543530256", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 25, "text": "<MaryADraper>: Astrophysicists count all the starlight in the universe. By their estimate, over the history of the universe, stars have emitted 4 times 10-to-the-84th-power photons into the visible universe (that’s a 4 followed by 84 zeros). <dbeast1113>: I don't understand why they would want to do this though <MaryADraper>: I know this is a ridiculous suggestion, but you could read the article and find out.<Willow-wolliW>: But their work was more than counting sunbeams. The technique allowed astrophysicists to construct a history of star formation: Star births peaked about 3 billion years after the big bang, as members of the international Fermi-LAT Collaboration reported Thursday in the journal Science. This spurt has slowed dramatically in the 10-plus billion years since the beginning of time. That’s the snippet of why from the Washington post", "num_messages": 4, "avg_score": 6.25}
{"start_date": "1543406106", "end_date": "1543635667", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 26, "text": "<deadlydogfart>: Beautiful simulation of images from a Cassini-like explorer of Uranus and its moons <gundam1515>: This is avaliable for free at their website spaceengine.com for anyone interested. The version showcased here will be released on steam, which has really huge improvements.<Neaterntal>: Have more info about steam?<gundam1515>: This <https>://www.reddit.com/r/spaceengine/comments/a0ymnn/0990_release_date_cost_and_other_faqs/ Its stickied to their subreddit. <Neaterntal>: Thanks. I didn't think to check reddit spaceengine.", "num_messages": 5, "avg_score": 5.2}
{"start_date": "1544762531", "end_date": "1544765841", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 3, "text": "[deleted]: SpaceX May Be New Barrier for Trump’s Border Wall [deleted]<Quantum_Paradoxigm>: Imminent domain. Besides, they already cut through people's land and towns when they built the fence years ago. There's already Americans living on the \"wrong side\" of the fence.<spindizzy_wizard>: And the only reason that's still true is because our judicial system grinds so very very slowly.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1537421157", "end_date": "1537457482", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 1710, "text": "<Lucy-Danger>: Child pornography reason behind Sunspot Observatory closure, according to court documents <StuffChecker>: When has an entire facility ever been shut down and evacuated because of child porn? This explanation doesn’t seem super plausible to me and also doesn’t explain people claiming on the antenna. Sounds like a bad coverup of some kind of foreign espionage they found.<ATypicalFruit>: The guy with the child porn threatened that someone may die. I assume best to evacuate to prevent this. EDIT The janitor with the Child porn once his laptops had been taken he believed the place had very lax security and claimed that one day the place may be hit or someone enters to execute someone. One the director as the observatory found this out he called the federals for the safety of his employees.<sjryan>: So shut down an entire facility for days because one person makes a death threat? How many high schools get bomb threats and the FBI is called?<ThickTarget>: High schools aren't federal facilities. The parent organisations which ordered the evacuation are research organisations, they certainly aren't making decisions about closing schools.<shifty_coder>: Public high schools technically *are* federal facilities, though.<ThickTarget>: Pretty sure the school system is a state matter. I could be mistaken.<text_only_subreddits>: Unless you mean DC’s, you aren’t. Contextually, you probably don’t, but that’s no reason not to mention the exception.", "num_messages": 8, "avg_score": 213.75}
{"start_date": "1541894419", "end_date": "1542252819", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 35635, "text": "<DanielJStein>: It is staggering that cameras today can capture this much detail in the cosmos in just a single shot. Despite light pollution, I was able to yield this incredible shot of our Milky Way Core. <OwePea>: Light isnt polution. In your case i would call it interference. <Somniari>: you know what the term refers to, right? brightening of the night sky caused by street lights and other man-made sources, which has a disruptive effect on natural cycles and inhibits the observation of stars and planets. <OwePea>: What disruptive effect on natural cycles? The streetlight is bad for us? If you wish to see the sky but a tree is blocking your view, is the tree polution?<Somniari>: Only if the tree was man made. <OwePea>: the presence in or introduction into the environment of a substance or thing that has harmful or poisonous effects.. Polution. Your definition of polution is anything that is a physical obstruction to you. <Somniari>: The definition i gave you was foe the term light pollution. Not pollution <OwePea>: Light at night is polution, Got it. Ill start wearing sunglasses and running from shadow to shadow lest i die from those evil photons. I thought light was actually critical to life. #cavelife because stars and cancer and turtles and birds. Doesn't the Sun gives us cancer too? Daylight is Polution. <Somniari>: and to say light is critical to life is an overstatement. life has evolved in the deep ocean with complete absence of light.<OwePea>: I consider your thought. And i start to believe you. It may be that goldfish swim to the bottom of the ocean because. Light Polution. Boom<Somniari>: Considering those are fresh waster fish, thats highly unlikely. <OwePea>: What do the deep fish goldfish eat?<Somniari>: Oh i get it now. You're just a troll.<OwePea>: Just one last question. What do these deep-sea fish eat?", "num_messages": 14, "avg_score": 2545.3571428571}
{"start_date": "1543493337", "end_date": "1543512979", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 1314, "text": "<mvea>: SpaceX Has a Bold Timeline for Getting to Mars and Starting a Colony - Elon Musk wants to send humans to Mars, and it could happen as soon as 2024, with bold visions of refueling rockets to “planet hop” and explore the furthest reaches of the solar system. <Ruadhan2300>: Six years seems...really really optimistic. Even assuming everything going perfectly I don't expect to see people on mars before 2030<Kickagnome>: &gt;optimistic Even 2030 is extremely optimistic. I'd put it closer to 2040-2050 in all honesty. The technology isn't there yet, and I read the costs could be in the trillions. Something no single company could afford. I appreciate the vision, but putting someone on another planet needs to be a government funded and run project. There's far too many factors to consider for it not to be.<jwarnyc>: Clearly your not musk fan boi. 4 years from now sounds pretty realistic. He flew his rockets up and back to earth in about 4 years I think. So why not to get someone on mars In 4. They have he take off and the landing covered. Now they just need a small basic colony to start with. <umdred11>: &gt;Now they just need a small basic colony to start with This, obviously, is the easy part.<jwarnyc>: I thought the flying up the million gallon rocket up in the atmosphere and bringing it back safely was the easiest. Honestly if he can land on mars safely. They won’t even need humans there at first. Just cargo flying there unloading and taking off. Then once everything is in place they can start to introduce humans putting all that shit together. [deleted]: Nooooooo way. Making, flying, and landing a rocket is incredibly *incredibly* difficult, but even the smallest most basic colony on another planetary body dwarfs the challenge of rocketry. Mars is not an easy place for Humans to survive by any means and the tech to do so is going to be extravagantly expensive. The creation of a Mars colony may easily dwarf the cost of the ISS and the Apollo program and likely can't be done by any single company or country. This stuff is going to have to be a pretty major joint effort if it's going to work and will take quite a while to develop the technology.<Senn5>: Even though I agree what most people don't get is that under the best conditions 4 years for SpaceX to get a probe on Mars is really optimistic [deleted]: I'd say a probe is realistically doable in that time assuming their Starship plans continue on-track and don't suffer from feature-creep. I'd question how advanced the probe might be, but that ventures into speculation since SpaceX probably won't be building probes, only transporting them. Even the Falcon Heavy should currently be capable of putting a probe on Mars under an efficient transfer window. Iirc, the Falcon Heavy has a 40,000lb payload limit for a Mars transfer which I'd assume would allow a large enough stage to land a decently sized probe. <Senn5>: That sounds fair. My only rebuttal is that the whole conversation here is about nothing Elon Musk dates staying on track. Personally I don't think ~~BFR~~ Starship will stay on track [deleted]: (Also, see my edit above. SpaceX probably already has the capability to put probes on Mars without the BFR) I think the manned portion of the BFR project will get delayed a bunch, but they'll be pushing their engineers pretty damn hard and may stay moderately on-track with the unmanned portion. I think the biggest factor here is whether or not they'll have sufficient funding to stay on track, which I think they may get thanks to Starlink and investor optimism. <Senn5>: I can agree with that, just that money may not be the limiting factor. In the end who knows but big Musk himself (and his investors).", "num_messages": 12, "avg_score": 109.5}
{"start_date": "1544717274", "end_date": "1544748295", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 77, "text": "<magenta_placenta>: Mars' Olympus Mons, the tallest known volcano in the solar system, has such a gradual slope that someone standing at the base couldn't see the summit because it's beyond the horizon (it's also almost as large as France) <Timtitus>: I was wondering about this just yesterday.. Might there be something this huge on earth if we removed the oceans?<invertedshamrock>: The closest thing we've got is Mauna Kea, which is the tallest mountain as measured from base to summit, since it's base is the floor of the Pacific. But we could never get anything nearly this high on Earth basically because of erosion. Shield volcanoes form by a cycle of eruptions, lava flowing down, then cooling off and hardening. Do that thousands of times and you'll get a big build up. But on Earth we have two things that disrupt landforms that Mars doesn't--water and tectonics. Tectonics move shit around, sometimes thrusting land upwards like the Himalayas, and other times tearing shit apart like the crack in the middle of Africa. Water is the real key though--we have wind and snow and ice and rain, freezes and thaws, all of which slowly chip away at mountains. The Appalachians for example used to be as high as the Alps but that was hundreds of millions of years ago. They're some of the oldest mountains on Earth and the reason they're quite a bit shorter than the Alps and Rockies today is because they've been exposed to so much erosion (which also explains why they're much more 'rounded' than the more jagged Rockies and Alps). Mars has none of this, so Olympus gets to erupt, spew lava out and build up without any of the forces that tear shit down. So as long as we got water we'll never be able to come close to building something that high on Earth.<Sionn3039>: Doesn't gravity play a factor as well?<invertedshamrock>: I suppose so yeah, but I think whatever extent to which it does would be minor compared to erosion and tectonics. I don't think for example (but could very well be wing, this is just inference) that land forms on mars bulge out significantly more than on earth due to weaker gravity", "num_messages": 5, "avg_score": 15.4}
{"start_date": "1543642452", "end_date": "1543719128", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 38, "text": "<Carcass1>: Question about Mars’ atmosphere? Since Mars has an abundance of CO2, would we be able to plant trees to convert the CO2 for us into oxygen? I remember learning CO2 was a vital part of nutrients plants or trees need, they absorb CO2, while letting out oxygen... Obviously it would take a long time for that to effect the entire planet but eventually would it ever work? How long do you think it would take?<Twister_Robotics>: Plants require approx 1 psi pressure. Earth has about 14.7 psi. Mars has .088 psi. It is also too cold for liquid water, about -70 Celsius. It has been considered, but is not doable without a lot of prep work.<Carcass1>: Woah lol I see, when it’s out in this perspective <mts89>: If you’re a fan of sci-fi I’d recommend reading Kim Stanley’s red/blue/green mars trilogy. It’s a very engaging story and spends a lot of time looking at the physical as well as social issues of colonising mars.<Holographic_Machine>: That's an amazing trilogy! After you read those 3 novels your mind will be blown away and you'll feel like you've actually live through the colonization of Mars! <Carcass1>: I have to read these fucking books. I’m googling now....", "num_messages": 6, "avg_score": 6.3333333333}
{"start_date": "1544731755", "end_date": "1544766840", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 82, "text": "<clayt6>: Satellite images of penguin poop-stains in Antarctica have uncovered a massive, previously unknown population of Adélie penguins (1.5 million of them) living on the Danger Islands, which are located at the tip of the Antarctic Peninsula and are surrounded by treacherous seas. <toprim>: Training to find life in space by finding life on Earth<NearABE>: Recognizing that more than a million of animals are in plain sight in 40 year old photos taken from low orbit. &amp;#x200B; We can hope that aliens build surface structures and spread pink paint around.", "num_messages": 3, "avg_score": 27.3333333333}
{"start_date": "1534708417", "end_date": "1534721162", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 74, "text": "<aii_ko>: My dad doesn’t believe the Moon landing happened Hello r/space,i need a bit of help.I absolutely love science but my dad doesn’t believe in the moon landing.No matter how much i tell him he just laughs at me for believing in such things.Can you help me convince him?<Senno_Ecto_Gammat>: It's extremely difficult to convince someone of that using data and logic because their belief isn't dependent on data and logic. You can test this by asking what information your dad would accept as definitive. <aii_ko>: He claims that we haven’t been able to land on any planet or moon since then even with todays technology.So if we cant do it now,why could we do it before(sorry for my english,its not my first language,i hope u can understand)<Senno_Ecto_Gammat>: So what information would he accept as convincing evidence that we did?<aii_ko>: Im guessing us landing on a planet or moon recently,but that hasn’t happened yet(keep in mind he’s very thick headed)<Senno_Ecto_Gammat>: If the only information he would accept is something which doesn't exist then my point is made: you're not dealing with an opinion that cares about evidence. <aii_ko>: Yea ur right<kd8azz>: But wait; there's good news: (hopefully) we will again soon. /aspirational", "num_messages": 8, "avg_score": 9.25}
{"start_date": "1543644889", "end_date": "1543646915", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 15, "text": "<rockitman12>: It's not a supernova, right? [removed]<termsofsurrender>: I'd say satellite, but that can't be the case for widely separate locales. Could it be Rigel? That would be in the constellation of Orion. <just-the-doctor1>: I was thinking either Sirius (because of the brightness) or Orion’s shoulder Star <rockitman12>: I don't think it was in any constellation I know. It's funny you mention Orion though, I make a point of checking it out every time I have clear skies - just on the lucky chance I get to see Betelgeuse go supernova.", "num_messages": 4, "avg_score": 3.75}
{"start_date": "1543644849", "end_date": "1543649089", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 4, "text": "<a-cat-with-a-potato>: There was a flash of light in the night sky [removed]<mfb->: Did it move across the sky quickly? * If yes: Sounds like a small meteorite. * If it moved slowly (more like an airplane): An Iridium flare (satellite reflecting sunlight) of an active satellite can produce a bright light for several seconds, followed by gradual dimming. A flare from an inactive (tumbling) satellite can be a single short flash, or sometimes several flashes. * If it didn't move at all but lasted a while: Huh? &gt; and what was left was a blue flickering light that looks like a star How long did you see that? If you share the time and location of that event it would be easier to figure out what happened, but you have to decide if you want to share that information. You can also look for Iridium flares yourself with [calsky](https://www.calsky.com/) and similar websites.<Kuku_kachu>: &gt;If it moved slowly (more like an airplane): An Iridium flare (satellite reflecting sunlight) of an active satellite can produce a bright light for several seconds, followed by gradual dimming. Can confirm. My first time seeing an iridium flare I was incredibly surprised and I knew exactly where it was going to be.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543644679", "end_date": "1543650069", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 26, "text": "[deleted]: Recently been thinking a lot about Musk and his mission to Mars [deleted]<seethebluekiwi>: 1) The ship that spacex is currently proposing to build is going to have capacity for dozens of people as well as their supplies and cargo for the trip. Though its likely going to be one way trips or with 2 year stays before the next short transfer window back. There will be exercise and communal spaces on the ship just like there is on the ISS and alot of the stuff we've learnt from long term mirco-g habitation on the ISS will be applied to helping keep people healthy on the trip. I don't think Musk himself is planning on going to Mars. 2) There will be multiple people on board and they will have exercise equipment as well at multimeadia probably with collections of digital media to listen/watch/read to keep themselves occupied. They can also download new stuff from Earth though it would be slower than downloading things here (dependent on your internet connection). 3)We can use electromagnetic waves (usually radio or laser) to send information back and forth and there is already a network of satellites settup to allow the commutation from deep space and interplanetary probes back and forth from Earth. Since things are soo far away though there is a time delay since these communications only travel at the speed of light (its about an average of 8 min to Mars at light speed) Though if we send lots of people to Mars we will probably need to upgrade this system to meet the demand for communication back and forth. 4) Likely we will send pre built habitation modules that will be pressurized and might have green houses attached to supplement the food and water supplys sent with the people (think the Martian style). Alot of this will probably be sent of unmanned missions before we send people. 5) If something happens on Earth well there's not much they can do. depending on how self-sufficient they are they will either run out of supplies then die or keep on living and try and make new civilization on Mars. Hope that gives you some answers :)<AdmiralBarackAdama>: &gt; I don't think Musk himself is planning on going to Mars. He recently said there is a 70 percent chance he will go himself.<seethebluekiwi>: Oh I hadnt see that. I wonder what changed his mind? <AdmiralBarackAdama>: I don't know but here is him saying it. Cool, short watch. <https>://youtu.be/Dfg1n7Lh62Q", "num_messages": 5, "avg_score": 5.2}
{"start_date": "1544731711", "end_date": "1544820328", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 4, "text": "<GriffonsChainsaw>: Why is the night sky dark? <jessemanoske>: Space is so large that there are gaps in between things and in those gaps is nothing, which means there is nothing for light to bounce off of and come back to your eyes, which makes it black <cryo>: That’s not really why. The main reason is that space is only finitely old, or at least the parts from which light can reach us is. That means only finitely many stars. <Saerali>: You're both wrong. In the beginning, there was light.... Then we started murdering eachother, for thousands of years. The creativity we achieved! It was so frantic even God wanted to join in and take the high score! With every death the sky grew darker as time passed. Now we look up at the skies and sigh at how few stars remain in sight. Knowing soon there are no stars left visible, and no-one to see them if they were.", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1544375064", "end_date": "1544639746", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 36, "text": "<AutoModerator>: Week of December 09, 2018 'All Space Questions' thread Please sort comments by 'new' to find questions that would otherwise be buried. In this thread you can ask any space related question that you may have. Two examples of potential questions could be; \"How do rockets work?\", or \"How do the phases of the Moon work?\" If you see a space related question posted in another subeddit or in this subreddit, then please politely link them to this thread. Ask away! <Brvndvnmw>: Something I read/hear sometimes is “we would need a spaceship capable of surviving the speed of light” or some wording meaning the same. Because there is no air or resistance in space, if we could travel the speed of light wouldn’t the spaceship still be fine? <TheRamiRocketMan>: The issue with light-speed travel isn't air-resistance it's physics. It is literally impossible to make anything with mass travel the speed of light or faster. That-said, even if it were possible you'd have a major problem with interstellar dust. Colliding with even a single tiny particle like a grain of sand could be devastating for a spacecraft travelling close to the speed of light because of the amount of kinetic energy involved.<Brvndvnmw>: This is a big eye opener, in videos they never give the reason they just say it’s impossible but now I know! Thank you. <BG_Misonary>: &gt;This is a big eye opener, in videos they never give the reason they just say it’s impossible but now I know! Potential collision with dust is not the thing that makes going the speed light impossible. Were that the case you could, in a literal sense go that fast. What keeps things from going the speed of light is that the faster an object goes the more massive it becomes, at the speed of light an object would have an an infinite amount of mass which would require an infinite amount of energy to accelerate any more.<soadinc>: Firgive me if this is a silly question, but why is the mass of a photon constant (or is it constant?) travelling at its speed? Is it due to not having to accelerate to that speed? Or am i getting this completely wrong<BG_Misonary>: &gt;Firgive me if this is a silly question, but why is the mass of a photon constant (or is it constant?) travelling at its speed? Photons have no mass but for complex reasons none the less have momentum. &gt;Is it due to not having to accelerate to that speed? Its not the acceleration that imparts mass its the speed. <soadinc>: Ah ok. I wasn't aware of the massless nature of a photon. Certainly makes its speed make sense, but makes its nature make slightly less so.", "num_messages": 8, "avg_score": 4.5}
{"start_date": "1543322910", "end_date": "1543895257", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 23930, "text": "<mvea>: First sun-dimming experiment will test a way to cool Earth: Researchers plan to spray sunlight-reflecting particles into the stratosphere, an approach that could ultimately be used to quickly lower the planet’s temperature. <djoecav>: For anyone interested this is only using about 200 grams of calcium carbonate total (a pretty small amount) and is happening in the first half of 2019. Thankfully, I don't think this particular experiment will send us into another ice age or whatever else the good old survival instinct can kick up.<CallipygianIdeal>: I don't think this experiment would have any meaningful consequences given the shall amounts, but according to [this study](https://cen.acs.org/environment/climate-change/Solar-geoengineering-depress-crop-yields/96/i33) the effect on crop yields could mitigate any beneficial effects from reduced temperatures. My other concern is that it seems like treating the symptoms and not the cause. <E>: In sourcing another comment I found [this study - pdf warning](http://climate.envsci.rutgers.edu/pdf/20Reasons.pdf) that outlines more reasons to be concerned.<MechanicalEngineEar>: Sometimes in medicine you need to treat the symptoms to keep the patient alive long enough to treat the cause. <ddwood87>: And sometimes you cut out the disease. So many identifiable entities dump waste and don't carry any burden to properly dispose or clean up that waste.<EddoWagt>: Yes let's cut out the disease, kill all humans!<Paradoxone>: Or, you know, address the actual issue and place a global tax on carbon, **which is the consensus solution among economists**: *Howard, P., &amp; Sylvan, D. (2015). Expert Consensus on the Economics of Climate Change, 31.* [https://policyintegrity.org/files/publications/ExpertConsensusReport.pdf](https://policyintegrity.org/files/publications/ExpertConsensusReport.pdf) And **restrict the supply of fossil fuels** directly: *Green, F., Denniss, R., &amp; Lazarus, M. (2018). Cutting with both arms of the scissors: the economic and political case for restrictive supply-side climate policies. Climatic Change, 1–15.* [https://doi.org/10.1007/s10584-018-2162-x](https://doi.org/10.1007/s10584-018-2162-x) And **drop the ridiculous subsidies propping up the fossil fuel industry**, damaging our health, climate and communities: *Coady, D., Parry, I., Sears, L., &amp; Shang, B. (2015). How Large Are Global Energy Subsidies? IMF Working Papers, 15(105), 1.* [https://doi.org/10.5089/9781513532196.001](https://doi.org/10.5089/9781513532196.001) *Merrill, L., Bassi, A. M., Bridle, R., &amp; Christensen, L. T. (2015). Tackling Fossil Fuel Subsidies and Climate Change: Levelling the energy playing field.* [http://norden.diva-portal.org/smash/get/diva2:860647/FULLTEXT02.pdf](http://norden.diva-portal.org/smash/get/diva2:860647/FULLTEXT02.pdf) *Health and Environment Allicance (HEAL). (2017). Hidden Price Tags: How Ending Fossil Fuel Subsidies Would Benefit our Health, 1–61.* [https://www.env-health.org/wp-content/uploads/2018/08/hidden\\_price\\_tags.pdf](https://www.env-health.org/wp-content/uploads/2018/08/hidden_price_tags.pdf) **This is the bush you are beating around on behalf of industry by misplacing blame.** **3.5 billions of the world's poor** (*45.6% of the total global population*) have **emitted only 10% of emissions** due to individual consumption (so even less of the overall total): L. Chancel and T. Piketty (2015) ‘Carbon and Inequality from Kyoto to Paris: Trends in the global inequality of carbon emissions (1998-2013) and prospects for an equitable adaptation fund‘, [http://piketty.pse.ens.fr/files/ChancelPiketty2015.pdf](http://piketty.pse.ens.fr/files/ChancelPiketty2015.pdf) *Oxfam. (2015). Extreme Carbon Inequality. Oxfam Media Briefing, (December). Retrieved from* [https://www.oxfam.org/sites/www.oxfam.org/files/file\\_attachments/mb-extreme-carbon-inequality-021215-en.pdf](https://www.oxfam.org/sites/www.oxfam.org/files/file_attachments/mb-extreme-carbon-inequality-021215-en.pdf) On the other hand, **these emissions are overwhelmingly due to the business of around 100 fossil fuel companies**, which are responsible for 71% of emissions: *Heede, R. (2014). Tracing anthropogenic carbon dioxide and methane emissions to fossil fuel and cement producers, 1854-2010. Climatic Change, 122(1–2), 229–241.* [https://doi.org/10.1007/s10584-013-0986-y](https://doi.org/10.1007/s10584-013-0986-y) *Griffin, P. (2017). The Carbon Majors Database CDP: Carbon Majors Report 2017. Cdp. Retrieved from* [https://b8f65cb373b1b7b15feb-c70d8ead6ced550b4d987d7c03fcdd1d.ssl.cf3.rackcdn.com/cms/reports/documents/000/002/327/original/Carbon-Majors-Report-2017.pdf?1499691240](https://b8f65cb373b1b7b15feb-c70d8ead6ced550b4d987d7c03fcdd1d.ssl.cf3.rackcdn.com/cms/reports/documents/000/002/327/original/Carbon-Majors-Report-2017.pdf?1499691240) These very same fossil fuel companies **organized strategic and well funded disinformation campaigns** delaying any effective policy response or decarbonisation for at least three decades, despite having detailed early knowledge of human-induced climate change and its grave risks since the 1950s: *Kolmes, S. A. (2011). Climate Change: A Disinformation Campaign. Environment: Science and Policy for Sustainable Development, 53(4), 33–37.* [https://www.researchgate.net/profile/Steven\\_Kolmes/publication/254339532\\_Climate\\_Change\\_A\\_Disinformation\\_Campaign/links/5665f58f08ae4931cd62666b/Climate-Change-A-Disinformation-Campaign.pdf](https://www.researchgate.net/profile/Steven_Kolmes/publication/254339532_Climate_Change_A_Disinformation_Campaign/links/5665f58f08ae4931cd62666b/Climate-Change-A-Disinformation-Campaign.pdf) *Weart, S. (2011). Global warming: How skepticism became denial. Bulletin of the Atomic Scientists, 67(1), 41–50.* [https://doi.org/10.1177/0096340210392966](https://doi.org/10.1177/0096340210392966) *Franta, B. (2018). Early oil industry knowledge of CO2 and global warming. Nature Climate Change.* [https://doi.org/10.1038/s41558-018-0349-9](https://doi.org/10.1038/s41558-018-0349-9) *Mulvey, K., &amp; Shulman, S. (2015). The Climate Deception Dossiers: Internal Fossil Fuel Industry Memos Reveal Decades of Corporate Disinformation. Retrieved from* [https://www.ucsusa.org/global-warming/fight-misinformation/climate-deception-dossiers-fossil-fuel-industry-memos](https://www.ucsusa.org/global-warming/fight-misinformation/climate-deception-dossiers-fossil-fuel-industry-memos) *Muffett, C., &amp; Feit, S. (2017). Smoke and fumes - The Legal and Evidentiary Basis for Holding Big Oil Accountable for the Climate Crisis. Retrieved from* [https://www.ciel.org/wp-content/uploads/2017/11/Smoke-Fumes-FINAL.pdf](https://www.ciel.org/wp-content/uploads/2017/11/Smoke-Fumes-FINAL.pdf) *Supran, G., &amp; Oreskes, N. (2017). Assessing ExxonMobil’s climate change communications (1977-2014). Environmental Research Letters, 12(8), 1–18.* [https://doi.org/10.1088/1748-9326/aa815f](https://doi.org/10.1088/1748-9326/aa815f) *Anderson, D., Kasper, M., &amp; Pomerantz, D. (2017). Utilities Knew: Documenting Electric Utilities’ Early Knowledge and Ongoing Deception on Climate Change from 1968-2017, (July). Retrieved from* [https://drive.google.com/file/d/0B8l-rYonMke-NG5ONVZkZVVJMG8/view](https://drive.google.com/file/d/0B8l-rYonMke-NG5ONVZkZVVJMG8/view) *Brulle, R. J. (2014). Institutionalizing delay: foundation funding and the creation of U.S. climate change counter-movement organizations. Climatic Change, 122(4), 681–694.* [https://doi.org/10.1007/s10584-013-1018-7](https://doi.org/10.1007/s10584-013-1018-7) *Farrell, J. (2016). Corporate funding and ideological polarization about climate change. Proceedings of the National Academy of Sciences, 113(1), 92–97.* [https://doi.org/10.1073/pnas.1509433112](https://doi.org/10.1073/pnas.1509433112) *Boussalis, C., &amp; Coan, T. G. (2016). Text-mining the signals of climate change doubt. Global Environmental Change, 36, 89–100.* [https://doi.org/10.1016/j.gloenvcha.2015.12.001](https://doi.org/10.1016/j.gloenvcha.2015.12.001) *Dunlap, R. E., &amp; Jacques, P. J. (2013). Climate Change Denial Books and Conservative Think Tanks: Exploring the Connection. American Behavioral Scientist, 57(6), 699–731.* [https://doi.org/10.1177/0002764213477096](https://doi.org/10.1177/0002764213477096) **Good podcast on the climate change disinformation campaigns of the fossil fuel** **industy:** [https://www.criticalfrequency.org/drilled](https://www.criticalfrequency.org/drilled) # Please note that more than half of all emissions were released after these disinformation campaigns began: Frumhoff, P. C., Heede, R., &amp; Oreskes, N. (2015). The climate responsibilities of industrial carbon producers. Climatic Change, 132(2), 157–171. [https://doi.org/10.1007/s10584-015-1472-5](https://doi.org/10.1007/s10584-015-1472-5) &amp;#x200B; So please, go back to the drawing board to find some more convincing red herrings, or better yet, read the given sources and inform yourself (assuming you're not a shill).<fjccommish>: For leftists, the solution is generally a tax.<Phent0n>: What is the right wing response? They're not putting forward policies or rethoric about giving consumers more control over their power generation or consumption. <fjccommish>: The right wingers certainly are putting out a valid response - government do less. Shrink the government. Get rid of regulations. <Ataru13>: Uh, how would deregulating do anything other than make the problem worse?<fjccommish>: I deny your premise that only government regulations can make things work.<Ataru13>: That isn't an answer dude; I already know you disagree with me, what I'm interested in hearing is HOW deregulation is going to solve the problem.<fjccommish>: How is regulation going to stop it? We've had regulation, and all we hear is \"we're doomed!\" The zealots have just shown that in practice, when the rubber hits the road, they know it's all about the sun.<NitroHyperGo>: I think the joke is that he doesn't actually have an answer, u/Ataru13.<fjccommish>: I disagree with your premise that something must be done. Leftists love to play the control the premise game. \"Something must be done.\" Then the only alternative they accept is \"something must be done.\" <Phent0n>: Your view of government, regulation and the economy doesn't sit well with the existence of almost all other current governments, history, and common sense. Having governments doing more things than stopping citizens from killing each other and protecting land rights and capital isn't a crazy leftist idea. It's what governments do. Also as an aside what's your opinion on US Military expenditure? <fjccommish>: Government interfering in every aspect of life is a crazy leftist idea. It has been a proven failure time after time. History shows that Conservative ideals are a rousing success - they resulted in the greatest nation in the world's history, America. Let's not jump past that to another subject.<Phent0n>: You're basing America's global success on American Conservatism? Nothing to do with the state of the other Great Powers after the war? Nothing to do with its geographical security? Nothing to do with its vast natural wealth and huge military spending? <fjccommish>: What war? \"Nothing to do with its geographical security? \" - Leftists want to give up that security with open borders and globalism. Your example proves my point. \"Nothing to do with its vast natural wealth and huge military spending? \" Leftists want to give away that wealth because they claim it's unfair. Leftists are against a strong military, national defense. Every time we fight, leftists say it's the wrong thing to do. Your examples/questions prove my point.", "num_messages": 20, "avg_score": 1196.5}
{"start_date": "1544590893", "end_date": "1544776274", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 23, "text": "[deleted]: Poll: Over Half of Russians Don't Believe America Landed on the Moon [deleted]<I_Love_Booty_Pics_>: They don't wanna believe they are really #2. Sad!<datNomad>: Had u ever heard about Yuri Gagarin?<the_fungible_man>: We're currently discussing manned lunar landings, not first to space or first to Earth orbit. The Soviets were kicking America's ass is the \"space race\" until about 1966. But their heavy lift booster, the N-1, was 0-4 in test launches. Have u ever heard about the Saturn V?<datNomad>: such sad that some of u trying to praise your country for achievements that all humanity is responsible for, while shit on other nations, that's the point, didn't want to offence someone<the_fungible_man>: There were only 2 nations with significant space programs in the 1960's: the USA, and the USSR. I'm sure both countries received technical and logistical assistance from countries friendly to them in the very divided world of that time. &gt; for achievements that all humanity is responsible for, What are these achievements you speak of, for which all humanity is responsible? Could you list a few of them for me?", "num_messages": 6, "avg_score": 3.8333333333}
{"start_date": "1544688590", "end_date": "1544708484", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 1052, "text": "<Mass1m01973>: Astronomers find that dark matter dominates across cosmic time <RogueGunslinger>: This is kind of silly. So they've found one galaxy that has the expected amount of dark matter. And they are comparing it to another galaxy that was found around the same time frame that doesn't have the expected amount of dark matter. All this is saying is that the time frame might not determine the amount of dark matter in a galaxy. But either one could be an outlier. Maybe wait until they come back with a study done on a few hundred or thousand of these things before drawing any conclusions like \"Dark matter dominates across cosmic time.\" and making articles with that sort of title. Edit Just to be clear here: I'm not coming down on the researchers or their original paper. But the article which is making outlandish claims based on that paper.<sirfafer>: You must be a physicist yourself the way you denounce the findings of people who spend their hours understanding the universe. <Renaissance1500>: How about you engage with his argument instead of attacking his character first? Be nice, people!<sirfafer>: I’m standing up for the scientists. these people spend an incredible amount of time and effort to understand the universe. Article isn’t the journal published, peer reviewed, final draft, but rather just an announcement of the discovery and a little synopsis of how they got there. I think it’s rather brash to discredit them and all their hard work. Just as much as OP says they’re wrong, they could be right. We can agree there isn’t enough info, but this is an important process of getting to that point. This discrepancy between these two galaxies are providing answers to questions we didn’t necessarily ask, and we should be more supportive.<Renaissance1500>: See you should say that to him!<sirfafer>: It is what i said just drew it out for you cause you thought I attacked his character<Korprat_Amerika>: They are extrapolating from incomplete data<sirfafer>: Or rather, the only data they have had the resources for.<Korprat_Amerika>: so, incomplete data. exactly what I said. <sirfafer>: But if required to come to a conclusion based on data, is sufficient.<BrovaloneCheese>: 2 data points is NEVER sufficient to come to such a significant conclusion. Come on now. I could plot a line between two data points and exclaim \"Aha! The relationship is clearly linear!' but all it takes is one more data point to very easily disprove that assertion.", "num_messages": 12, "avg_score": 87.6666666667}
{"start_date": "1543647812", "end_date": "1543648818", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 6, "text": "<iamvarunthomas>: The last manned mission to moon was on 1972(i think it is correct).Since then,there were no such manned mission to moon.Why?? [removed]<RSTLNE3MCAAV>: Expense and a lack of desire to do so. The moon is actually fairly boring to study, and the Apollo missions satisfied our curiosity enough that the risk and expense of going back wasn’t worth it. Especially since the US won the Space Race we proved our scientific dicks were larger than the Soviet’s so the political pressure to launch moon missions was reduced. <iamvarunthomas>: some people is sceptical about this and they said the manned mission was a fake and it was recorded in an artificial studio...Last day,i saw some youtube videos about this,so i confused, that's why i am asking..<SpartanJack17>: Those youtube videos are made by idiots. Basically, going to the moon is just very expensive and after the Apollo program ended there wasn't support to spend all the money needed to design new systems for getting people to the moon.,", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544711853", "end_date": "1544938083", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 550, "text": "<nasa>: We’re NASA scientists and engineers on the Mars 2020 rover mission. Ask us anything about the mission or its landing site on Mars! NASA has chosen Jezero Crater as the landing site for its upcoming Mars 2020 rover mission after a five year search. The mission is scheduled to launch in July 2020 and will not only seek signs of ancient habitably conditions – and past microbial life – but the rover will also collect rock and soil samples and store them in a cache on the planet’s surface. Jezero Crater – the selected landing site – offers geologically rich terrain, with landforms reaching as far back as 3.6 billion years old, that could potentially answer important questions in planetary and evolution and astrobiology. Getting samples from this unique area will revolutionize how we think about Mars and its ability to harbor life. Learn more: https://www.nasa.gov/press-release/nasa-announces-landing-site-for-mars-2020-rover - Kenneth Farley – Mars 2020 Project Scientist - Kenneth Williford – Mars 2020 Deputy Project Scientist, - Briony Horgan – Co-Investigator, Mastcam-Z instrument on Mars - 2020, and Assistant Professor, Purdue University - Michael Meyer – Lead Scientist, Mars Exploration Program - Al Chen, Mars 2020 Entry, Descent and Landing System Lead, NASA’s Jet Propulsion Laboratory <Proof>: https://i.redd.it/1qcaxtvj4w321.jpg<LeDerp_9000>: What does NASA (in general, or your Project directly) do to help limit the spread Earth based pathogens (bacteria, viruses, or other life) to Mars? <nasa>: From Ken Williford: NASA, and our project, works very hard to limit the contamination of other worlds with Earth-based life. We call this Planetary Protection, and in fact there is a Planetary Protection Officer at NASA whose job it is to oversee all of this. For our project specifically, we use the same approach MSL used for the Curiosity rover to clean spacecraft parts before, during, and/or after assembly, and then to collect \"swabs\" that are analyzed for microorganisms. We pay special attention to what we call \"spore forming\" organisms (e.g. Bacillus) -- these organisms can survive environmental extremes like heat and radiation that would kill most other living things, and thus these are the most likely to survive a trip to Mars. We pay attention to all the organisms, but we track the spore formers specifically and keep them below a tight lower limit. It's not currently possible to completely sterilize a spacecraft as complex and capable as Mars 2020 without destroying it, so we work very hard to get what we call the \"bioburden\" down to a very low level that we do not believe will affect our ability to do astrobiology at Mars during our mission and in the future.<mattd1zzl3>: How do you feel about the possibility of dozens of humans possibly being on mars in the next decade, dumping bags of human waste on the surface after all this hard work? :)<Blarg_117>: If you think we’ll just dump random waste on the surface of Mars, you have MUCH to learn.<mattd1zzl3>: Here do some learning with this source: https://www.popularmechanics.com/space/moon-mars/a13598/is-there-poop-on-the-moon-17630231/ Human spaceflight sites are garbage dumps. Full of discarded experiments, packaging and waste. For the same reason that Mt. Everest is a garbage dump: When you're in mortal danger, ecological protection takes a back-seat.<SpartanJack17>: At the same time, remember the only example of human spaceflight sites are from the 60s and 70s, when concerns like that weren't as prevalent. While you're right that people wouldn't care about ecological protection if they were in danger, I'm not sure that would apply to people in a base on Mars. Yes, if something went wrong they could all die, but that would be unaffected by what they did with their poo. It would be entirely possible to use a system that didn't involve putting it exposed on the surface, and that would have no effect on the dangers of the mission.<mattd1zzl3>: Thats true, but dont forget my Mt Everest point. Go there in 2019 and you're going in a sea of shit, corpses, discarded oxygen bottles, flags, clothing, food wrappers and millenials taking selfies. Exploration is inherently wasteful. Spacex depositing 75 peope on mars on 2 ships (something i see as likely, or at least possible) is going to ruin mars as a pristine, earth-sterile world.<SpartanJack17>: But Mt Everest is almost fully unregulated and visited largely by people with no qualifications or real knowledge of what they should be doing. There's also no alternative there. Making a system for Mars that properly disposed of waste would be easy, and at least at first Mars would be populated by experts who would understand the necessity of keeping i as sterile as possible. Exploration does not have to be inherently wasteful, and Mt Everest is not an example of exploration. A better example would be the research stations on Antarctica, which do take real steps to protect the ecosystems they're studying.<mattd1zzl3>: &gt; A better example would be the research stations on Antarctica, which do take real steps to protect the ecosystems they're studying. *Googles furiously for antarctic bacterial growth papers*<SpartanJack17>: I'm not saying there would be no impact, I'm saying they'd most likely take steps to minimise the impact.", "num_messages": 11, "avg_score": 50.0}
{"start_date": "1543626530", "end_date": "1543667403", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 32, "text": "<MaryADraper>: The European Space Agency has named Oxia Planum on Mars as the landing site for its ExoMars rover, due to set down in 2021. <PM_ME_UR__UPVOTE>: Would be funny if they send a rover after people got there. I know its unlikely but would still be odd to even send it at that point. <Sarilho1>: Not really. Exploration doesn't have to stop just because you have people in another place of the planet.", "num_messages": 3, "avg_score": 10.6666666667}
{"start_date": "1544697375", "end_date": "1544711107", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 86, "text": "<xxxGametrader420xxx>: Geminid meteor shower and bright comet team up for super sky show <ragamufin>: Completely overcast here in Austin, couldn't see a darn thing. Next best chance is the 15th right?<fvsparkles>: Today and tomorrow are the best days, hoping for a clear sky.", "num_messages": 3, "avg_score": 28.6666666667}
{"start_date": "1544739156", "end_date": "1544783437", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 10, "text": "<CaesiumBoom>: How are Blue Origin confident (and rich) enough to build the New Glenn when they have no orbital rocket experience? SpaceX have had years of experience, development and genuine business income, yet still have failures occasionally. Their claims and designs for Starship are founded on evidence. I just don't see how it makes business sense for Blue Origin to make such a huge leap straight to New Glenn from essentially zero orbital launches and landings. <Edit>: Not sure why all the downvotes. I'm not trying to be contentious or a SpaceX fanboy. I'm simply asking a reasonable question about how a company can justify to their business investors that they can brazenly dive into the heavy lift rocket market with no orbital experience. Money isn't all you need: space exploration is famously very VERY difficult and practise makes perfect. A genuine discussion would be appreciated, so thanks to those who have made the effort. <Kallikrein5>: What kind of dumb question is this? Bezos has way more money that Musk. And companies never have experience; they hire engineers who have experience. <CaesiumBoom>: There's no such thing as a dumb question. You seem to equate wealth with operational ability. Its akin to a lottery winner saying \"hurr durr I'm now rich enough to build the next LHC!\" despite not having a clue what they're doing. Yes they MIGHT be rich enough to hire people to do it, but it does seem outlandish. Perhaps start smaller? SpaceX employees are the ONLY engineers with experience landing an orbital rocket. Where is Bezos recruiting his then? Startup companies generally have to demonstrate ability and success to investors. Its crazy to think he has enough money that he can bypass that procedure and just jump right to rivalling NASA. <CTCPara>: &gt; SpaceX employees are the ONLY engineers with experience landing an orbital rocket. Where is Bezos recruiting his then? Possibly from SpaceX? SpaceX is known to have a reasonable employee turnover rate. Though to be fair I don't know if that includes any higher up people/engineers etc. <EDIT>: https://www.reuters.com/article/us-space-blueorigin/bezos-throws-cash-engineers-at-rocket-program-as-space-race-accelerates-idUSKBN1KO0HN &gt;The recent hiring binge has focused mainly on throwing talent at the New Glenn, and has included more than 60 engineers who worked previously for SpaceX.<CaesiumBoom>: Thanks for the link. Glad to see plenty of people are sceptical at their timescales. Also nice to see how many employees they're recruiting.", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1543958005", "end_date": "1543991130", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 422, "text": "<clayt6>: The Geminid meteor shower (which is arguably the year's best shower) begins tonight. <JimothyTrickington>: Does geographical location matter? (North vs south hemisphere) or time of night? Would like to get my daughter out to see it. <pintscc>: Yes, it can matter. You can use this interactive map to find the best time for your location. Around 2 am (in most areas) is considered to be the best viewing time for this shower. [https://www.timeanddate.com/astronomy/meteor-shower/geminids.html](https://www.timeanddate.com/astronomy/meteor-shower/geminids.html) &amp;#x200B; Peak activity is on the 13-14th of December, but a couple of days either side should still be ok. &amp;#x200B; They are a truly spectacular sight, especially if you can find some dark skies.<michaelbarfoot>: stupid question, but when you say 13th/14th do you mean like anytime after midnight? so like on the 13th i should look anytime after midnight? or even just being nighttime will work?<pintscc>: Not a stupid question at all. Those dates are for the night between the 13th and 14th. So, the 14th at 2 am should both be great viewing. This shower is usually still great a few nights either side. At your location earlier than 2 am might be fine. For example, last year at my location I saw plenty before 2 am, but in southern Australia people reported they saw very few until 4 am. It's a good idea to start observing earlier if possible to give your eyes time to adjust to the dark anyway. <Edit>: I should add for the some parts of the world the dates for peak are 14-15th", "num_messages": 5, "avg_score": 84.4}
{"start_date": "1544732762", "end_date": "1545078637", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 42, "text": "<MarshallBrain>: NASA Doesn't Have Enough Nuclear Fuel For Its Deep Space Missions <panick21>: Its an utter embarecement for our society that we are not jet a real nuclear society. There is no fucking reason we should lack resources like this. Also NASA knew that this was a problem 30 fucking years ago. However the jumped on the same anti nuclear bandwagen as the rest of society.<ItsAConspiracy>: Agreed. We've got the technology now to get a person's entire lifetime energy supply from a piece of fuel the size of a golfball, but we're still wrecking the planet with a power source we started using 250 years ago.<panick21>: And instead of doing that we transition to trying to gather ultra low density resources ...<ItsAConspiracy>: ...when we're already pushing planetary boundaries on land usage.", "num_messages": 5, "avg_score": 8.4}
{"start_date": "1543656510", "end_date": "1543751647", "thread_id": "t3_a20c4r", "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 28, "text": "<konohasaiyajin>: Aren't smallsats like 1m^3 ? That would be one tiny missile.<I_Automate>: Well, you can fit a 20 kiloton nuke into a 155mm cannon projectile, so it's not like you really need a whole lot of volume. Use the satellite's maneuvering capability to orient the missile and make the munition itself as dumb as possible. No reason to duplicate complex guidance packages when you already have one aboard. Basically just a warhead, a known impulse de-orbit rocket, and enough heat shielding/ airframe to make it through the atmosphere in a sufficiently predictable fashion. <Odd_so_Star_so_Odd>: Have fun aiming and guiding that one \"home\" lol. You could achieve the same from the ground or without flying into space, far far cheaper too.<I_Automate>: Also....not really. A strike from orbit could have much shorter defence response times than one from inside atmosphere. Think the difference between stopping a cruise missile, and stopping incoming ICBM warheads. One is coming in, at best, mach 2 or 3. The other is moving 7+km/s. Entirely different ballgame. Also, getting the warhead on target is not unrealistic. Again, ICBM warheads have had that technology nailed down for decades. All that this idea does is use a satellite as the warhead bus, instead of a dedicated booster <Odd_so_Star_so_Odd>: To deal damage you'd need it to explode in the lower atmosphere and travelling there at that speed isn't possible without the object disintegrating on its own from the forces at play before making any impact or detonation. Either it'll be slowed down or it doesn't make it and either way the shielding would shadow the warhead if you were to try. There's too many challenges and unanswered questions to consider it when we have a better cheaper alternative already. Don't forget as well that there's a very real concern towards keeping space free of weaponry in order to avoid Kessler syndrome.<I_Automate>: While I have no argument against keeping weapons out of space, that won't help if war breaks out. Communication and recon satellites make good targets for ASAT systems. Past that, though.....we already have plenty of experience getting warheads (and people, who are far more fragile) through the atmosphere. Like....lots. Accurately, too. Ever heard of a M.I.R.V.? Or a fractional orbital bombardment system, such as certain variants of the SS-18? Where are you getting your information from? Some reading for you, because I think you have some gaps. <https>://en.wikipedia.org/wiki/Multiple_independently_targetable_reentry_vehicle <https>://en.wikipedia.org/wiki/Fractional_Orbital_Bombardment_System <https>://en.wikipedia.org/wiki/Atmospheric_entry <https>://en.wikipedia.org/wiki/Anti-satellite_weapon<Odd_so_Star_so_Odd>: I'm aware, thank you, the point still stands that it's unnecessary and the fact that speed is somehow attractive while we're talking nuclear warheads - it's the least of all to worry about or view as something that is gained instead of added challenge. It takes a lot to put something into orbit and launching a missile that you intend to come down again anyway, it's just much easier and cheaper to have it ready on the ground instead of parked in orbit. When launched you can choose whether you want it to go high into space before coming down or fly across the sky through the atmosphere. Of course it's all MAD and a waste of time and money to have arms races while people suffer and live in fear of the \"other\" while lacking purpose. <I_Automate>: I don't think you understand the basics of modern missile technology, defense systems, or nuclear war in general at all there, stranger. On top of that, this entire thread is concerned with the plausibility of weaponizing a fleet of satellites that you already intend to launch. That scenario kinda implies that you're OK with the extra cost and complexity associated with that. High incoming velocities make warheads more difficult to intercept. There are definite benefits to pre placed warheads in orbit. A ground launched missile can be detected during the boost phase and it's trajectory accurately plotted, while cruise missiles can take hours to reach their targets, allowing your targets to GTFO, and their much lower velocities make intercepts far easier to achieve, to the point where conventional radar controlled guns can do the job in many cases. Orbital weapons can be on-target in minutes or less, with minimal launch signature, very high velocity, and, consequently, very small intercept windows. Those two categories of weapons really don't have much overlap. Cruise missiles are air-breathing, ballistic missiles are not. Again, where are you getting your information? Because....not much of it checks out. Read up on F.O.B.S. They weren't taken out of service because they didn't work. They got taken out because they worked far, far too well for anyone's comfort. <Odd_so_Star_so_Odd>: &gt; They weren't taken out of service because they didn't work. They got taken out because they worked far, far too well for anyone's comfort. Also don't forget you could achieve the same for a fraction of the cost, but altogether it's why even as a plausibility this idea is idiotic and you'd be stupid to want to go back to MAD. Like what are you or this plausibility trying to accomplish? Given my stance I think it's a waste of time to discuss or lend any credence to any of it. Make love not war.<I_Automate>: M.A.D. never went away, and the F.O.B.S. that were developed were based on standard ballistic missiles, basically just with a modified upper stage attached. So, pretty well the same cost as standard delivery systems. Cheaper system costs overall, possibly, because you'd have fewer hostile A.B.M. intercepts, so a higher percentage of your launched warheads could make it to their targets. Also, if you have such an issue with the hypothetical posed here.... why did you even start commenting in this thread, in the first place? YOU brought yourself here, then pretended to be knowledgeable regarding subjects that you obviously don't know much about at all. That isn't my fault. If you can't accept being corrected, or are unwilling to actually back up your arguments, consider maybe not making them in the first place.<Odd_so_Star_so_Odd>: &gt; possibly I don't disagree with you but I think you're the one who has to back up your claims that it's cheaper, if that were the case, it would've happened but since you can't maintain stuff in space like you can on earth, it hasn't. The technical stuff you're so obsessed with is besides the point I'm trying to make and it's pretentious of you to argue I don't know anything when It's you who can't keep up. It's not economically feasible and if we arm space pretty soon there won't be any to worry about or explore.<I_Automate>: You were arguing over technical matters, in a thread ABOUT technical \"what if?\". That was literally the conversation you jumped into. Definitely cheaper, or, at least not much more expensive per unit. Doesn't stay in space, just uses it to get to the target. If you'd read the basic overview I helpfully provided, or even thought about the designation, \"Fractional\" Orbital Bombardment System, that would be clear. But, no. Hop into a technical discussion, pretend to have knowledge, and, when confronted with actual accurate information, try to claim that the conversation never really was about the tech, after all. Typical<Odd_so_Star_so_Odd>: Fine, let's forget the politics and finances then and I'll repeat and elaborate my original comment here: 1m^3 isn't enough to deliver a warhead from space since you need something to steer and have a shield for reentry. You might as well put more warheads inside the big heavy object you end up with, thus getting us what you're so eager to make your point with, except it doesn't prove anything, it just shows what you end up with if you took this idea into reality.<I_Automate>: Your actual re-entry vehicle doesn't have to be all that much larger than about a 6\" artillery shell, including the heat shield. Why do you think it needs to be larger? A 500 kiloton, 2 stage thermonuclear RV is less than 1 cubic meter, and we don't need 500 kilotons, or the ability to withstand being launched from a cannon. Replace the steel case with a heat shield, add a known impulse rocket, sufficient to de-orbit the munition, and you're in business. My original comment also pointed out that you really don't have to steer it. You already have attitude and maneuver thrusters on the satellite bus, as well as telemetry and guidance. Your reentry vehicle could be fully ballistic once its' de-orbit burn is complete. That isn't particularly difficult math to do. We understand ballistics and aerodynamics quite well. I gave my reasoning, now give yours. Why do you think that your RV needs to be massive? The actual \"physics package\" can be as small as a 10×20cm cylinder (possibly smaller, but that's the smallest I've seen in open literature), including the fuzing and arming mechanism. I can give you a source for that. Modern heat shield materials are also pretty amazing stuff, and you wouldn't need it to last long, because you could use a reentry profile that would place unacceptable forces on anything less stoutly put together than something designed to be shot out of a cannon. You'd have to make a bit of room, nothing is free, of course, but it wouldn't take up anywhere near the total volume of the satellite. Call it a cylinder 20 cm wide and a meter long, at the most, including rocket, spin stabilization system, and heat shield.", "num_messages": 14, "avg_score": 2.0}
{"start_date": "1544766434", "end_date": "1544769961", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 14, "text": "[deleted]: Penpal needed [removed]<WhirlyTwirlyMustache>: I heard you can have your phone now as long as you don't use it during training. <rock3tbird>: Other branches get there phones after phase one and only at certain times. The Marine corps doesn't allow you to take your phone.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1543649927", "end_date": "1543962518", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 842, "text": "<SharkFilet>: Astronomers Are Tracking Four Potential Interstellar Objects Now In Our Outer Solar System <Hello_34>: I know it’s most likely nothing but if it could be aliens I’d shit myself..<TheGreat_Danton>: Eh these are objects stuck in solar orbit, the one that accelerated unexpectedly is the one with the best shot. We calculated out the Drake equation with the best current estimates for each variable in a class recently and the numbers point to there being life and intelligence being advantageous. The biggest unknown variable is how long communicable civilizations last on average, do we just keep making more and more ways to wipe ourselves out until one finally happens? Or do we transcend to the stars? If intelligent life is common, we’ll be getting our first replies here soon. Any replies are reaching just reaching us from the nearest stars since we started broad casting 200 years ago. <badon_>: &gt; the Drake equation with the best current estimates for each variable in a class recently and the numbers point to there being life and intelligence being advantageous. Intelligence is probably extremely rare. It has evolved on Earth in ideal conditions only 1 time in 4 billion years: * [No other animal has matched humans - Is encephalization the great filter? | Grand Strategy: The View from Oregon : r/GreatFilter](https://www.reddit.com/r/GreatFilter/comments/9pro4p/no_other_animal_has_matched_humans_is/) Intelligence of humans is also apparently on the way out: * [If encephalization is the Great Filter, Mankind may be in trouble - If Modern Humans Are So Smart, Why Are Our Brains Shrinking? : r/GreatFilter](https://www.reddit.com/r/GreatFilter/comments/9vryl3/if_encephalization_is_the_great_filter_mankind/) Smart boys tend to get into more mischief than less smart boys. The old saying \"boys will be boys\" reflects historically forgiving attitudes to the mischief boys would get into, because those troublesome boys would eventually grow up to be highly productive. Science, technology, and industry advanced rapidly, and now that we have it, everyone seems to have forgotten how we got it. Feminism took over the world, and the feminists want what the boys earned. Instead of being forgiving, Mankind now has the prestigious distinction of sending more of its boys to prison than to college. Worse, feminist civilization revels in public shaming, so they're registering the boys in a background check system to permanently block access to education, housing, and employment for the rest of their lives. All that to ensure boys never again compete with feminists for jobs. It's working, and Mankind could be on the verge of extinction because of it, all so some complaining feminists can complain some more about all the endless things they never stop complaining about. &gt; The biggest unknown variable is how long communicable civilizations last on average, This is based on radio SETI, which had its heyday from the 1960's to the 1990's, and is now obsolete. &gt; do we just keep making more and more ways to wipe ourselves out until one finally happens? Or do we transcend to the stars? Just keep putting the workforce in prison, and wonder why economic problems keep happening. &gt; If intelligent life is common, we’ll be getting our first replies here soon. Again, radio SETI is obsolete. If intelligent life were common, it would be everywhere. You wouldn't need a telescope to see it, you could just look around you. Intelligent life probably isn't common. If it were, it would have evolved on Earth more than one time. But it didn't - it evolve very recently, and we're already losing it because intelligent people do not prosper. &gt; Any replies are reaching just reaching us from the nearest stars since we started broad casting 200 years ago. The first working radio communication system was invented in 1879 by David Edward Hughes. Early radios all worked on low frequencies that could not penetrate the Earth's ionosphere. High power radio transmissions at higher frequencies did not become common until the 1940's. So, Earth's \"radio diameter\" is usually thought to be around 80 to 100 light years. However, radio SETI is obsolete because we now know there are much easier ways to detect and observe a technological civilization at that range.<TheGreat_Danton>: Not necessarily true, we have been dismissing animal intelligence for sometime because they don't have the same tools we do. Orca whales have been shown to pass down certain hunting techniques in certain pods, whale culture if you will. We're trying to judge an animals intelligence by human standards of the fine articulation and motor skills we have for speech, writing, crafting et cetera. If humans never had evolved opposable thumbs, you might look at them and say that aren't intelligent because they don't use tools, or make art or any of the ear marks we have for ourselves. Language and agriculture seem to be the foundation of society and the group intelligence/info that comes from it. Just like how a computer made of thousands of individual parts (people) is essentially just a paperweight until you give it a power supply (agriculture) and an operating system (language) but once you do the capabilities are near limitless. I think intelligence is advantageous, but the physical adaptions that determine the level at which an organism can take advantage of intelligence are up to chance. With no fine motor skills, orcas can't articulate sounds into different words or create tools or make any mark that won't be washed away. If humans lived underwater with fins and gills, there would be a good chance we'd still be roving in hunter gatherer groups, just like orcas do in pods. While radio based intelligence detection is obsolete, our radio waves are still the farthest information we've sent out. Odds are an advanced civ would have more several more magnitudes of energy at their disposal and gravitational waves would be viable and by far the best bet at long distance communication. With our current level of tech we couldn't detect the remnants after hitting the ionosphere, but I don't think its too far of a stretch to assume an extra-solar species has the capability of distinguishing them from the universal background radiation. Assuming advanced enough tech for our audience, were at around a 150 lyr bubble and big enough that millenials would be around to hear a reply if there is intelligent life in the nearest stars. And I don't know how this became about feminism, but I do believe the pendulum has swung too far and we're now seeing the backlash with trump, proud boys, et. My main issue that men are being blamed for the system (aka patriarchy) while these gender roles were created by SOCIETY, including women. Men didn't beat their wives into subservience until 1000 years ago, love and empathy still existed. These roles constructed are just as damaging to a man's psyche as a woman's independence. There's a reason the suicide rate of men is 4x that of women. There's a reason some little girls with daddy issues end up strippers and some little boys with mommy issues end up serial killers. The fundamental human need of intimacy is (at least perceived to be) in the woman's hands. In general, women are the gatekeepers of relationships. Up until the 20th century, almost all jobs with high enough pay to support a family were physical in nature. A job a woman physically could not do, so she needs a man to support her family and a man needed a wife at home to house keep while he was working all day. It wasn't perfect but it worked and got us where we are today. If we are going to right the injustices, we need to look at the roles that give women privilege just as we have men. But the problem I've found is a lot of soft-core feminists want all the plus sides of gender roles (big, strong, protective and providing man; rock to lean on; choice of mate within your league) while wanting equality in all other areas. Until we start talking about the toll \"the patriarchy\" has taken on men, we're going to keep seeing anger bubble up like this and ignoring the fact that it does is what's causing the anger. I think it boils down to that it is nearly impossible to have a perfect balance of power. The people with the power at any given time will seek to keep it while those without seek change (conservatives vs. progressives) and we're finally getting to the point women have more power in society (a la equality except when it benefits me). But I don't think it means the decline of civilization. The global IQ is still going up and acknowledging men's plight would solve a lot of the anger and discontent stirred up in men today.<badon_>: &gt; I think intelligence is advantageous, but the physical adaptions that determine the level at which an organism can take advantage of intelligence are up to chance. That might be the key defining difference. It's one thing to be smart. It's another to build a technological civilization. Either way, there are still no animals that can compare to human intelligence, even if they do have some tricks of their own that might be impressive. For example, despite all their intelligence, you can't teach an orca enough for them to be able to do things a typical or even bad human student can do. &gt; While radio based intelligence detection is obsolete, our radio waves are still the farthest information we've sent out. Deliberately sent out, yes, but evidence of the presence of a technological civilization on Earth has been visible (at visible wavelengths) for at least a thousand years, and probably much longer than that. &gt; Odds are an advanced civ would have more several more magnitudes of energy at their disposal and gravitational waves would be viable and by far the best bet at long distance communication. I have never heard this before. Why would gravitational waves be better than electromagnetic waves? &gt; I do believe the pendulum has swung too far [...] I think it boils down to that it is nearly impossible to have a perfect balance of power. I personally do not believe harmonious balance is impossible. It's a strong feature of East Asian culture, for example. However, from a fundamental scientific perspective, maybe you're right: * [What if sustainability is an impossible equilibrium (Great Filter) in the universe? - American Astronomical Society : r/GreatFilter](https://www.reddit.com/r/GreatFilter/comments/95m9p8/what_if_sustainability_is_an_impossible/)<TheGreat_Danton>: The gravitational force is so weak that it becomes infinitesimal compared to the other forces. It’s why you can see a star much further outside its sphere of gravitational influence. If you could devise a way to create a directional gravitational wave directed at a star or galaxy (I.e. focus pure energy) they would be detectable as there is virtually no background gravitational waves and local interference can be accounted for by two detectors in different locations. This does take orders of magnitude more energy than we are capable of producing as a species, but that is the one thing we can be fairly sure an advanced species would have. I’d equate to trying to shout to someone on the other side of a lake. There is so much going on in the air (EM spectrum) that no matter how big of a megaphone you build it’s always going to be noisy or borderline destructive. But instead you get a giant hammer and start slamming it into the water. You could communicate through a code of splashes. The wind creates small ripples and disturbances (just like em radiation does in the gravitational field) but is negligible to a large enough splash. Essentially it comes down to the orders of magnitude of the fundamental forces. <badon_>: That sounds like a terrible idea. Gravitational waves being hard to detect doesn't make them superior to electromagnetic waves that are easy to detect. Background noise is not the limiting factor in communicating with electromagnetic waves, and gravity waves have no advantage in terms of noise. In both cases, the limiting factors are output power for the transmitter and collecting area for the receiver. Gravity waves have both of those problems, PLUS the fact they're extremely difficult to detect, and extremely difficult to generate, and they require literally astronomical amounts of energy just to reach the threshold of detectability, without even transmitting any information. I see no advantage to gravity waves for communication. None whatsoever. They fail spectacularly in every category compared to electromagnetic waves. It would be easier to literally communicate with lake splashes, like you described by analogy.<TheGreat_Danton>: The gravitation field does have an advantage when it comes to noise, it is the most consistent and predictable out of all of them. Nothing can decay and appear that will create a meaningful gravitational reading, it’s almost purely deterministic. And background noise is a limiting factor, it what determines your needed power output and receiver size. If there were no background interference you could communicate with a single ray of photons. And it does transmit information. Everything is information. All you need is a protocol and the waves themselves are the info. One wave short and one long, now you’ve got gravitational Morse code. It does take extremely precise and powerful equipment, but once you have the tech it’s trivial and you can have a much cleaner, quieter form of communication. The nature of the universe isn’t going to change much in our time here but our technological precision and power output will almost certainly rise as long as we do. &gt; Background noise is not the limiting factor in communicating with electromagnetic waves, and gravity waves have no advantage in terms of noise. In both cases, the limiting factors are output power for the transmitter and collecting area for the receiver. You made these assertions without evidence or reasoning to back it up or even understanding that the power of the transmitter/sensitivity of the receiver is partially determined by background noise. And it seems your understanding of the principles of wireless communication are shaky at best. Until we can have an evidence based assert and refute discussion, I’m done here. <badon_>: &gt; The gravitation field does have an advantage when it comes to noise, it is the most consistent and predictable out of all of them. I'm skeptical of that. There is plenty of gravitational noise, and some of it is detectable with current technology like gravimeters. &gt; Nothing can decay and appear that will create a meaningful gravitational reading, it’s almost purely deterministic. I'm not sure what you mean by \"decay and appear\". Gravitational fields are constantly changing, just like electromagnetic fields. The difference is electromagnetic fields are much easier to detect at far lower energy requirements. For example, a sensitive gravimeter can detect snow accumulating on a rooftop. To modulate that gravity signal, you would need to rapidly move the matter in that snow to create a gravity wave. Oscillating a few hundred kilograms of snow at a few kilohertz to create gravity waves is much more difficult than oscillating electrons to create electromagnetic waves. You could do it, but why? It would require enormous amounts of energy, and it would be far less detectable at far shorter ranges than electromagnetic energy. The background noise would wipe it out quickly, even if you had a receiver sensitive enough to detect it. &gt; And background noise is a limiting factor, it what determines your needed power output and receiver size. No, that's not how it works. Background noise is negligible compared to path loss. &gt; If there were no background interference you could communicate with a single ray of photons. No, that's not how it works. You CAN communicate with \"a single ray of photons\", but in a focused system like that, background noise is almost completely eliminated. Over long distances, you can still communicate that way, but then the idea of \"a single ray of photons\" loses meaning because of the inverse square law, which says your \"single ray\" will expand to enormous size. In other words, it's not distinguishable from an isotropic radiation pattern. &gt; And it does transmit information. Everything is information. I have no idea what you're talking about. &gt; All you need is a protocol and the waves themselves are the info. One wave short and one long, now you’ve got gravitational Morse code. No, that's not how it works. What you're trying to describe is called modulation. Modulation requires bandwidth. Bandwidth requires power. And Shannon's Law tells us information capacity is dependent on both bandwidth and power. That means, in your example, the best you could do is slow on-off keying, which has a very limited information carrying capacity. If you have to expend many megawatts of power to oscillate hundreds of kilograms of matter, AND then try to modulate it, all just to communicate a few characters per minute or hour over a distance of only 10 meters...that's not very productive. &gt; It does take extremely precise and powerful equipment, but once you have the tech it’s trivial and you can have a much cleaner, quieter form of communication. No, none of that is as simple as you think it is. I don't think anyone realizes it, but we DO have the technology to do this. It's not trivial, and it would not work well. You're right it would require extremely precise and powerful equipment, and you wouldn't get much out of it. I'm not sure what you mean by \"cleaner, quieter form of communication\". It would be probably the worst form of communication ever invented, as far as I can tell. I have no idea what it would be useful for. &gt; You made these assertions without evidence or reasoning to back it up or even understanding that the power of the transmitter/sensitivity of the receiver is partially determined by background noise. If you were as smart as you think you are, you would know free space path loss accounts for far more signal energy requirements than background noise level, especially over long distances: * [free space path loss - Google Search](https://www.google.com/search?q=free+space+path+loss) \"the power of the transmitter/sensitivity of the receiver is partially determined by background noise\" is not correct. In fact, background noise is completely unrelated to those things. You might mean another kind of noise that you're not yet familiar with. &gt; And it seems your understanding of the principles of wireless communication are shaky at best. Compared to who? You? I'm sorry, but I'm not impressed yet. Insult me more. Maybe that will work. &gt; Until we can have an evidence based assert and refute discussion, I’m done here. You're going to have to do that by yourself. I'm not interested. I just wanted to share some educational information with you, but you seem to think you are too superior to learn anything new from me.", "num_messages": 10, "avg_score": 84.2}
{"start_date": "1542362200", "end_date": "1542493219", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 38457, "text": "<mvea>: Humans need Mars as a 'plan B' to avoid extinction, says physicist Michio Kaku: \"The dinosaurs did not have a space program and that's why they are not here today to talk about it.\" <Memo_moto>: If we go to Mars with the same issues of inequality, corporate capitalism, despot government rule and degrading human connection, then we'll have exactly the same problems we have over here. &amp;#x200B; I love space, and the idea of humans living on Mars, but issues like global warming are a thing because of the current state of capitalism. 100 corporations are responsible for 71% of global emissions. What's being done about it? [https://www.theguardian.com/sustainable-business/2017/jul/10/100-fossil-fuel-companies-investors-responsible-71-global-emissions-cdp-study-climate-change](https://www.theguardian.com/sustainable-business/2017/jul/10/100-fossil-fuel-companies-investors-responsible-71-global-emissions-cdp-study-climate-change) &amp;#x200B; &amp;#x200B;<Caputtohsi>: Isn't equality what's holding us back now? Maybe if we stopped treating everyone as equals and put our resources into the hands of intelligent people we'd be on Mars already. <Drbillionairehungsly>: Quite the opposite! There are plenty of those whose potential for greatness is stifled by not having anything at all; as there plenty with more than they need who do nothing with it to help this status quo. Equality doesn’t mean that everyone has the same everything; but this wide and growing disparity is definitely more an issue than the attempts to close that gap. <Murk_Squatch>: He is speaking of equality in terms of intelligence between individuals. Intelligence is a highly heritable trait, the lowest estimate is 56% and new studies have shown it to be around 80% in the west. I say in the west because no one is starving here and thats the only environmental factor we know about that affects intelligence.<Drbillionairehungsly>: The things you are saying are highly debatable and unproven. Not to mention, there are absolutely poor, food deprived children in the west - properly providing food for poor, underprivileged schoolchildren has been an ongoing issue in the US for years. Where are you gathering these facts? I’d love to see some sources, if you don’t mind backing up those assertions. [deleted]: &gt;The things you are saying are highly debatable and unproven. You're simply wrong. It's not highly debatable or unproven, is is highly proven and people only debate it because, like you, they don't want to admit the truth and will do anything to ignore it. You're doing it right now. &gt;Not to mention, there are absolutely poor, food deprived children in the west - properly providing food for poor, underprivileged schoolchildren has been an ongoing issue in the US for years. I bet you think you're real smart huh? All those dumb scientists who study IQ have no idea how to control for factors? You are such a genius, coming up with this rebuttal and pointing out their methodological flaws! Again, your ignorance shows. Studies that show that IQ is highly heritable have already controlled for these factors. They control for education, upbringing, and other aspects of the environment.<Drbillionairehungsly>: It sounds like you’ve had a rough morning, judging from the tone and content of your reply. I hope your day gets better, so your contributions today in public discourse can do the same [deleted]: Not an argument. You aren't fooling anyone with your smart ass remarks. It's clear you have absolutely nothing to say and don't know how to respond so you resort to passive aggressive insinuations.<Drbillionairehungsly>: Still so aggressive, and for no reason other than what you make up in your head. Maybe spend less time on the internet and more with people. Trust me, you’ll be better for it. <Edit>: I just realized you were referring to my comment as an argument - which it clearly isn’t! You didn’t posit anything in your comment; you simply spouted off nonsense directed at an image in your head. That requires no rebuttal :) [deleted]: &gt;Still so aggressive, and for no reason other than what you make up in your head. Maybe spend less time on the internet and more with people. Trust me, you’ll be better for it. Still projecting and making passive aggressive remarks. Still no argument relevant to the issue at hand. You just like ignoring empirical evidence when it doesn't suit your world view. The fact remains that there is plenty of evidence supporting the idea that intelligence is largely heritable.<Drbillionairehungsly>: I’m sure there is, which is why I asked for sources regarding this. That makes it easier to research both opposing and supporting theories and paint a better picture regarding hereditary intelligence and overall biological potential. Did you have anything of use to add, or are you still just going to continue frothing? On that last token - I’m not sure what you think I’m projecting, considering it’s exactly what I’ve been saying to you the last few comments. Pardon that my civility in saying so was misunderstood for passive aggression. I understood you to be more on the ball, but clearly, I was just as wrong as you. [deleted]: &gt;I’m sure there is, which is why I asked for sources regarding this. That makes it easier to research both opposing and supporting theories and paint a better picture regarding hereditary intelligence and overall biological potential. Google exists. That is what people do when they're not being deliberately disingenuous, they actually look things up to find out for themselves if there is any evidence to support them or not. I am not writing a report to someone in order to affect public policy, I don't need to provide sources to back my claims. If you actually gave a shit, you would just look it up. &gt;On that last token - I’m not sure what you think I’m projecting, considering it’s exactly what I’ve been saying to you the last few comments. Pardon that my civility in saying so was misunderstood for passive aggression. I understood you to be more on the ball, but clearly, I was just as wrong as you. Apparently in your opinion actively avoiding the argument at hand and basically just saying \"u mad bro\" in a more verbose manner is somehow not passive aggression or the use of irrelevant snide remarks.<Drbillionairehungsly>: You keep saying “argument” as if you’ve said anything worthwhile. I’m not sure how help you understand you haven’t written anything of substance, so what are you possibly expecting in response? If you can’t realize that after this long, it’s clear you’re just not going to. Hope your future conversations fare better for you than this. Cheers! [deleted]: &gt; You keep saying “argument” as if you’ve said anything worthwhile. I’m not sure how help you understand you haven’t written anything of substance, so what are you possibly expecting in response? Yeah the argument presented from the beginning was that intelligence is heritable. After which you failed to respond in any way that was not mere deflection, irrelevant passive aggression, or insinuations that people who present such arguments are wrong, without explaining why. You have no idea what you're fucking talking about.<Drbillionairehungsly>: The mind boggles.. Original commenter posits. I reply asking for sources. I receive reply with sources. Commenter is thanked and all is well, as I can research further, as expected in debate. You, however, comment with insults and assumptions, then expect some form of rebuttal? It’s not too hard to understand. You presented nothing and get nothing in return. Original commenter replies with substance and got it in kind. Pretty elementary stuff.. I really can’t imagine going through life with a mind like yours.. I’ve got enough handicaps as is. That said, maybe now you’ll understand. Doubtful, as you’ve already proven that you can’t think that far in this context. [deleted]: Holy fucking shit you're a disingenuous little fucker aren't you? Our conversation exists within its own comment thread, it has nothing to do with whatever you replied to the other guy, because that was not what started our argument. It is not even possible for me to know what you replied to someone else, unless I keep refreshing your user page, which is obviously something that nobody does. Furthermore what started OUR argument was me addressing the issue at hand, after you told the other guy, without having any knowledge on the topic, that he was wrong and that his assertion was unproven. After which I replied telling you you're wrong. And then YOU started this conversation between us by not addressing the issue at hand, which is the heritability of intelligence, but instead by passively aggressively insinuating like a little dweeb that I've had \"a rough morning\" or something. All while completely ignoring the actual topic of discussion, which I ADDRESSED with my first post to you.<Drbillionairehungsly>: That’s quite the diatribe! Maybe break up the text so it’s more readable, as it’s a bit hard to follow. Take a breath, and try again. :)", "num_messages": 18, "avg_score": 2136.5}
{"start_date": "1544717502", "end_date": "1544740048", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 68, "text": "<pipsdontsqueak>: Virgin Galactic flies its first astronauts to the edge of space, taking one step closer to space tourism <BigBoyAndrew69>: &gt;nearly 83 kilometers. That isn't space. When will he realize he can't redefine the Karman line?<blueshirt21>: It's what NASA and the US Military goes by FWIW. The X-15 pilots who got their astronaut wings I don't think passed the line. <Fabri91>: [Two](https://en.wikipedia.org/wiki/X-15_Flight_90?wprov=sfla1) [flights](https://en.wikipedia.org/wiki/X-15_Flight_91?wprov=sfla1) did.<WikiTextBot>: **X-15 Flight 90** Flight 90 of the North American X-15 was a test flight conducted by NASA and the US Air Force in 1963. It was the first of two X-15 missions that reached space, along with Flight 91 the next month. The X-15 was flown by Joseph A. Walker, who flew both X-15 spaceflights. *** **X-15 Flight 91** X-15 Flight 91 was a 1963 American manned mission, and the second and final flight in the program to achieve sub-orbital spaceflight—a flight over 100 km in altitude—which was previously achieved during Flight 90 a month earlier. It was the highest flight of the X-15 program. It was the first flight of a reused spacecraft, as plane number three flew the previous sub-orbital flight on July 19. This mission was piloted by Joseph A. Walker on August 22, 1963, with the air-launch occurring from a modified Boeing B-52 Stratofortress support plane over Smith Ranch Dry Lake, Nevada, United States. *** ^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/space/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^] ^Downvote ^to ^remove ^| ^v0.28", "num_messages": 5, "avg_score": 13.6}
{"start_date": "1544729389", "end_date": "1544738259", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 31, "text": "<readerseven>: Virgin Galactic rocket ship reaches space in test flight, setting stage for tourists to boldly go <lloo7>: \"Space\". 80 km isn't space, at least internationally<money_sandwich>: It's reasonably close to the Kármán line. Let's not diminish their achievement because of technicalities. It was still plenty impressive.<56143>: And they didn't even perform a full burn", "num_messages": 4, "avg_score": 7.75}
{"start_date": "1543656467", "end_date": "1543686867", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 1746, "text": "<Apollo15CMP>: This footage from Saturn is surreal <YourTearsYum>: this is amazing but would be better with the background noise <InterstellarDiplomat>: That noise is the radio emissions produced by Saturn's auroras. <https>://www.nasa.gov/mission_pages/cassini/multimedia/pia07966.html<earthmoonsun>: So, if space had an atmosphere like on earth and I were a few thousand miles away from Saturn, I would hear that?<InterstellarDiplomat>: Sadly(?) no. It's heavily resampled to make it audible for us: &gt; Time on this recording has been compressed, so that 73 seconds corresponds to 27 minutes. Since the frequencies of these emissions are well above the audio frequency range, we have shifted them downward by a factor of 44. <Scriblon>: Besides the fact that the sun would drown out any other sound from space. The sun's sound would be 100dB ~ 120dB on earth. <https>://www.reddit.com/r/askscience/comments/33xuxu/if_sound_could_travel_through_space_how_loud/?utm_source=reddit-android<Wolfmilf>: Holy fuck, that would be terrifying.<InterstellarDiplomat>: [Makes this Rick &amp; Morty bit more relevant](https://www.youtube.com/watch?v=Rvvsw21PgIk)", "num_messages": 8, "avg_score": 218.25}
{"start_date": "1544741857", "end_date": "1544811891", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 32, "text": "<Gnome_Sane>: Here's Your Proof That We Landed On The Moon, Steph Curry <serialkillerpod>: I do believe we landed on the Moon. But I feel I would be remiss if I did not try to be the Devil's advocate here: - Laser beam reflectors only proves that a machine (manned or *unmanned*) landed on the Moon. It's not proof of *humans* landing on the Moon. - The photos of the lunar module still being where NASA left it some 60+ years ago are all made by NASA. AKA not a third party observer, and thus could have been faked. All the stories of third party observers claiming plans to photograph the remains of the Apollo missions (f.ex. the VLT) have not resulted in any actual photographs. - The soil samples the astronauts brought back are of the same materials that the earth is made of (the moon was probably created when a large object impacted the early Earth and made it split into the Moon and the Earth; so it's made of the same stuff). So we only have NASAs word for it that the rocks are actually from the Moon. Also, I think there was a story recently about how one of the Moon rocks given to some museum somewhere was actually a petrified piece of wood. I am not a scientists, so I do not have the answers. But I do know that if the Moon landing was a lie, it would be the largest conspiracy ever; involving literally hundreds of thousands of people. I do not for a second think that so many people would be able to keep their stories straight. What I find really odd is that we haven't been back to the Moon since the 1970s. There is a potential military advantage in staying on the Moon and the scientific advantage of being able to create a base there before trying to build one on Mars is surely useful. Also, several billionairs have voiced a deep desire to go to the Moon. Going there today with Today's tech would be much cheaper than going there over 60 years ago. <bearsnchairs>: Chandrayaan 1 imaged the Apollo 15 landing site. <https>://m.phys.org/news/2009-09-indian-satellite-moon-scientist.html Lunar rocks are also covered in micrometeorite impacts that earth rocks aren’t because of the atmosphere. <https>://agupubs.onlinelibrary.wiley.com/doi/pdf/10.1029/JB076i023p05770 <serialkillerpod>: Just to be a dick: The link doesnt have any photo. Just a guy saying they found it. <itshonestwork>: It’s more than that. https://en.m.wikipedia.org/wiki/Third-party_evidence_for_Apollo_Moon_landings The clearly manually flown decent footage during the last moments of the Apollo 11 landing matching crater for crater, rock for rock, crater feature for feature with the LRO NAC imagery shows that not only did hardware land on the moon, but human piloted hardware did. The massive quantity of lunar rock returned also shows that it was formed in 1/6th gravity. It may be made of the same “stuff”, but it was clearly not formed in the same way. I know you’re playing devils advocate, but anyone nitpicking over such small things to me is clearly extremely ignorant of the scale of Apollo. It was more than Amstrong and Aldrin landing on the moon. It’s shit loads of photographs and video that is consistent. It’s hours and hours of radio and transcripts that are often mundane and yet still all check out. It’s pages of flight manuals and schematics that all still check out. It’s the hardware that was built and still exists that you can go and see that is completely capable of doing everything claimed of it. It’s tantamount to saying NASA created all the hardware and procedures for landing on the moon, with all the right calculations, trajectories, navigational tools, rocketry, fuel requirements, life support, suits, training and simulators, but then just didn’t go, and somehow invested even more money in faking it, including the physics of how dust being kicked behaves in an era before CGI, that still stands up to scrutiny today, despite how special effects from the best movies of that era—or even 10-15 years ago—have clearly aged. Every PAD, every picture, every bit of maths checks out. For every time they went. To be a “sane” and rational hoax believer, you have to acknowledge that NASA worked out exactly how to get to and land on the moon, created all the hardware to do it, trained extensively in how to operate the machinery to do it, worked out every bit of math required, even launched that hardware, but then just didn’t go anyway. Lastly, to wonder why we haven’t been back goes beyond playing devils advocate, and just seems to suggest you don’t know the politics behind why we went in the first place. Satellites and space stations offer far more millitary advantages than being perched on a rock too far away to see anything. <WikiTextBot>: **Third-party evidence for Apollo Moon landings** Third-party evidence for Apollo Moon landings is evidence, or analysis of evidence, about Moon landings that does not come from either NASA or the U.S. government (the first party), or the Apollo Moon landing hoax theorists (the second party). This evidence serves as independent confirmation of NASA's account of the Moon landings. *** ^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/space/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^] ^Downvote ^to ^remove ^| ^v0.28", "num_messages": 6, "avg_score": 5.3333333333}
{"start_date": "1544670864", "end_date": "1544776638", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 558, "text": "<ye_olde_astronaut>: Mars Colony Prize - Design the First Human Settlement on Mars <Zarnywoop>: Closet space. You just can't have enough storage. <Gr1mmage>: More to the point, make sure you provide more than enough power sockets. I don't know that anyone has ever complained because they had too many choices on where to plug in electrical devices but god damn is it annoying when there's no outlet in reach without having to craft some unholy chain of extension leads. <VagiantPenisMonster>: And please, please, please have one standard of power sockets on Mars. I don't want to travel a few hundred kilometers and have to buy a stupid converter at Space 7-11.<Gr1mmage>: *insert argument about how every different country has the best power socket design here*<James2603>: As long as it has three prongs I’m happy and whether those three prongs go into our come out of the wall really doesn’t bother me. 2 prongs just don’t give enough stability.<ReasonablyBadass>: Stability for what? What are you doing with your cables you can't use two prongs?<James2603>: Two prongs never ever fits nicely for me; if it’s a wall plug it always looks unsafe and looks like it’s getting pulled down<ReasonablyBadass>: Weird. Here in germany plugs have a support structure independent of the prongs. Puts pressure etc. on the structure around the actual connectors.<James2603>: Well whichever way that stability is implemented I’m all for it. I just don’t want any flimsy ass plugs.<ReasonablyBadass>: I think that plug design and electrics in general on Mars will depend on the dust issue. Depending on how easy or hard it is to handle the dust, designs will change.", "num_messages": 11, "avg_score": 50.7272727273}
{"start_date": "1544755997", "end_date": "1544812584", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 37, "text": "<AltDaddy>: Salyut 7 - movie about the Soviet \"Apollo 13\" The movie is currently on Amazon Prime and... it's excellent. Russian dialog with subtitles, but not tough to follow. Stands up well to similar western movies. [https://www.imdb.com/title/tt6537238/?ref\\_=nv\\_sr\\_1](https://www.imdb.com/title/tt6537238/?ref_=nv_sr_1)<DesignerChemist>: Loved this movie! I was totally blown away and amazed that its not more popular. The spacewalk scenes are equal to if not better than those in Gravity. You might also like to check out another russian movie, Spacewalk: https://m.imdb.com/title/tt6673840/ Also great! <AltDaddy>: Totally agree! The subtle differences between a Russian film and one made in the west like music, pacing made it feel fresh and different. Will look for Spacewalk and thanks for the suggestion.<vee_lan_cleef>: Ever see Solaris? It's more of an existential type sci-fi by the great Andrei Tarkovsky, it's a long haul but rightly considered one of the greatest sci-fi films of all time, that movie will really get you thinking. The Hollywood remake isn't terrible but doesn't do the original justice at all.<AltDaddy>: I have seen the original, but it's been a long, long time. Thanks for reminding me that I need to go back and give it another go!", "num_messages": 5, "avg_score": 7.4}
{"start_date": "1543660102", "end_date": "1543665553", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 74, "text": "<AtomicFrontier>: NASA and ESA are using Earth-based caves to prepare for space mission. I was lucky enough to be able to spend several weekends exploring UK's cave systems. Here is what we learned about colonising this new frontier. <KapnK3>: This is great!! Hope a lot of people watch this. Whenever I get in a conversation about colonizing worlds, I always mention that the safest and most cost effective living conditions are in cave systems on these planets, especially volcanic lava tunnels.<GegenscheinZ>: Yeah, those are the first places we lived on earth, so it makes sense", "num_messages": 3, "avg_score": 24.6666666667}
{"start_date": "1543660328", "end_date": "1543691770", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 18, "text": "[deleted]: Russian Space Corporation Blames Elon Musk for Hijacking Its Clients [deleted]<DanaEn803>: NASA wants to shut him down so they can keep the SLS running for their friends, Boeing is hiring PR companies to badmouth SpaceX, ROSCOSMOS can't compete and wants Putin to save the day (Good luck with that), Politicians don't want to risk their Super-Pac money contributors from Old-Space, ULA cant compete with SpaceX prices even though they are backed by both Boeing and Locmart. Hell Elon must be doing something right :)<prhague>: At this point, all the efforts to take down Musk are futile; because even if successful, Blue Origin just picks up the baton a couple of years later. And because of Mr. Bezos being the richest human who has ever lived, you can’t choke off their funding sources. The comfortable space monopolies are dead and there is no going back.<DanaEn803>: If Spacex looks like it is in trouble, Bezos shares the Oneill dream and would probably buy it out. Lock stock and BFS.<prhague>: Maybe. Because their goals differ their technology differs - primarily in whether or not its best to use hydrolox or methalox when in space. <DanaEn803>: Both Raptor and BE-4 are using Methalox, once they set up a fueling station on Mars, Callisto(Jupiter), Titan(Saturn), Titania(Uranus), and Triton(Neptune) both companies will be able to travel the entire Solar System. Bezos wants to make space travel affordable to move people to Space Colonies, Musk has his sights firmly set on Mars but has no problem going wherever his ships can go. And the real prize is Psyche-16 in the Asteroid Belt with all those Rare Metals we have to Strip Mine for here on Earth at a few Billion per BFS Return. [$700 Quintillion Asteroid Ignites Space Mining Gold Rush Between Mars and Jupiter](https://www.outerplaces.com/science/item/17778-700-quintillion-dollar-asteroid-space-mining-gold-rush-mars-jupiter)<prhague>: That’s what I said “in space”. BO is aiming for the moon so they haven’t reused BE-4 in the upper stage, they’ve gone hydrolox <DanaEn803>: Sorry, I was thinking about the much rumored New Armstrong. The most frustrating thing about BO, since he doesn't need others financing him, he doesn't need to advertise what he is actually planning.<prhague>: To me they seem so quiet as to be in “stealth mode” where a company tries to lay low so as not to alert the competition. I wouldn’t be surprised if BO publicly report almost none of their progress right up to the point where they are wheeling a flight ready New Glenn our of their factory.<danielravennest>: There are plenty of photos of their Florida rocket factory, and the launch pad work in progress. The pad is on the coast, so it is not like you can hide it.<wintersu7>: Still, they are announcing almost nothing of their long term plans. Almost all their publicly known stuff are the things that simply cannot be hidden", "num_messages": 11, "avg_score": 1.6363636364}
{"start_date": "1544725006", "end_date": "1544782644", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 31, "text": "<treelover153>: Virgin Galactic's SpaceShipTwo Reaches Space for 1st Time in Historic Test Flight! <EphDotEh>: Well, only in America, 82.7% to space anywhere else in the world. The [Kármán line](https://en.wikipedia.org/wiki/K%C3%A1rm%C3%A1n_line) is 100 km up. <hyrkan30>: now to be fair. they do have the most advanced space programs in the world. so i think their definition counts. <Houston_Here>: Wait, we have a separate definition of space? <hyrkan30>: based on what ive read so far 80km for US and 100km for everyone else.", "num_messages": 5, "avg_score": 6.2}
{"start_date": "1544538834", "end_date": "1544775365", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 430, "text": "<EdwardHeisler>: We have the technology to build a colony on the moon. Let’s do it. By Robert Zubrin &amp; Homer Hickam The Washington Post, 12.10.18 <agate_>: What? Zubrin's pushing for a moon colony? When did he change his tune on that? When I was reading his stuf a decade or two ago, he was adamant that the moon is a trap, a distraction from the goal of getting to Mars. His books were full of good points about how the Moon has damn near zero useful resources for a spacefaring civilization, and isn't even useful as a refueling station, since the fuel you burn to get there is less than the fuel you can pick up. \"Even if there were pre-made cans of rocket fuel sitting on the Moon ready to go\", he'd say, \"it wouldn't be worth stopping to pick them up.\" Ironic to see folks like /u/TheClayrooAtWork criticizing this article using *exactly the same points* Zubrin used to use. Zubrin's at least staying true to form in pushing back against NASA's tendency to do incremental baby steps. Maybe he's decided that if the consensus is that we should do the Moon before Mars, we should at least *actually go to the moon* rather than building a pointless halfway-house.<NorthernRedwood>: Moon is ideal for launching nuclear powered rockets and ships, launching them on earth is not popular, cause if they explode they will spread radioactive material, but on the moon? Who cares!<LurkerInSpace>: As I understand it, one part of why Mars is favoured is that an incremental improvement in a colony's abilities is more feasible. Going from launching pre-made re-usable chemical rockets, to building chemical rockets, to building nuclear rockets is more feasible than skipping to the third step in that. The other part is just that Mars has more stuff for growing food. A colony could try to start on pre-made, re-usable nuclear rockets, but I'm not sure how possible that actually is - or how much fuel gets consumed by a launch. It would be a big ask for a colony to have uranium enrichment facilities right from the start.<SmaugTangent>: Mars is very, very far from Earth in terms of how long it would take a ship to get there in case of emergency. Mars also has much less sunlight than Earth or Luna because it's farther from the Sun. Luna is very close by in case you want to do stuff that's too dangerous to do on Earth, or benefits from a low-g environment (perhaps certain manufacturing processes). For growing food, the Moon is surely better: there's plenty of sunlight, and the only other things you need to provide are water, nutrients, and a habitat with an atmosphere (you don't need soil). It would certainly be much easier to build hydroponic greenhouses on the Moon than on Mars.<LurkerInSpace>: The reduction in sunlight isn't as big a problem as you might think; it's about the same as the sunlight which makes it through the surface of ocean to a depth of 1m - which is obviously enough to grow plants in. The need for nutrients and water is what makes the Moon so difficult; you need to import them from Earth, and you need to keep importing them as the colony grows. With Mars the colony can grow using Martian resources and only rely on Earth for manufactured goods. I agree that the Moon would let us learn more and test the sorts of techniques we'd want to use on Mars anyway - and has its own advantages such as for manufacturing in vacuum. And being close-by is indeed helpful in an emergency. But if we want to go anywhere else in space we'll need ways of coping without that support in any case.<SmaugTangent>: &gt;The need for nutrients and water is what makes the Moon so difficult; you need to import them from Earth That's completely false. Water was discovered on the Moon not long ago, and there's likely a lot of it. For other nutrients, you're probably going to have to import some of those from Earth to Mars as well; it's not like Mars has Earth-normal soil. And you don't need that many nutrients to grow food, and you can recycle them. <LurkerInSpace>: There's about 600 million tonnes of it, which sounds like a lot but is really only the quantity of a small lake - and most of it is craters near the poles. Mars, in contrast, has a quantity of water comparable to Greenland. And while its soil isn't normal the nutrients are there to extract, which is a lot easier than getting them from Earth. Recycling nutrients doesn't help for actually growing the colony - it means that you need to import some everytime a new colonist is added. This is fine at first when every colonist comes from Earth, but it's not sustainable if anyone is born in the colony (which granted, we don't know the viability of that).<SmaugTangent>: &gt;This is fine at first when every colonist comes from Earth, but it's not sustainable if anyone is born in the colony (which granted, we don't know the viability of that). Not only do you not know the viability of that, that's so far in the future that it's not worth worrying about at this point. What's worth worrying about now is: where do we establish our first colony, likely within the next few decades? Moon is close and convenient, and that's what's really important right now. Don't forget, before too long we'll have asteroid mining, so you'll likely be able to get minerals, nutrients, etc. from asteroids; you don't need them to actually be on the surface of whatever body you build a colony on. Longer term, it would make more sense to have colonies in artificial structures in space, rather than on some low-g body. Then you can completely control all the environmental conditions (most especially gravity), which you can't do on a planet or moon. <LurkerInSpace>: If it's an actual colony it absolutely is worth worrying about how it can grow. If it's just a base then the Moon is pretty sensible, but its proximity doesn't necessarily make up for the lack of fuel (though oxidiser is plentiful). Building rotating habitats requires huge quantities of resources - one that had an internal area equal to Singapore would require &gt;40 billion tonnes of material. That can be got from the asteroids, but to get to the point that we're mining such huge quantities we will, in my opinion, need a substantial colony - a country in its own right - on either the Moon or Mars.", "num_messages": 10, "avg_score": 43.0}
{"start_date": "1544724221", "end_date": "1544750693", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 252, "text": "<thesheetztweetz>: Video from inside the Virgin Galactic spacecraft Unity's cockpit, as its pilots float in microgravity at the edge of space <delphi_edict>: Is that a rear view mirror? Are they expecting traffic?<Nytelock1>: I mean there is at least one car up there now right?<delphi_edict>: I don't think that one's in orbit.<Monkey1970>: It is. But this ship isn't.<a2soup>: It's in solar orbit, not Earth orbit.", "num_messages": 6, "avg_score": 42.0}
{"start_date": "1544573093", "end_date": "1544651044", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 607, "text": "<Thorne-ZytkowObject>: A grueling, 7 hour and 45 minute spacewalk is now complete. Cosmonauts used knives and other tools to cut a 10-inch chunk out of the International Space Station. It will be brought back to Earth and investigated for clues to the cause of a small hole in the Soyuz capsule found back in August. <OptimusSublime>: One of the most wild and thrilling EVAs I have ever witnessed. All that debris, the early frustrations, the space stabbing, the eureka moment...all of that was beyond awesome. <SWGlassPit>: One of the most pointless EVAs. All that risk and effort and not much to gain from it.<breadedfishstrip>: Can you believe these guys just walked into the void of space for no reason? What idiots! /s<SWGlassPit>: Did you actually watch it? It was an utter shitshow. 1. They spent an hour longer than planned trying to get the foot restraint to work. 1. When they got into position and tried to use the shears, the foot restraint didn't work. Oleg was flopping all over the place. Sergei ended up having to manually restrain him so he could work. The only nearby tether point was a loop on the fabric exterior. 1. The shears couldn't cut the MLI. Oleg ended up removing it by slashing it with a knife. 1. The process of removing the MLI sent FOD everywhere. It was a mess. 1. They used the knife as a pry bar to get the shears under the MMOD shield. 1. While trying to pry back the MMOD shield, the knife was being flung around, tethered, but unsheathed. Ever play tetherball with a knife? 1. After finally using vice grips to peel back the MMOD shield, they couldn't find the hole! They had missed it by about two inches. 1. Their efforts to grab a sample were less than fruitful. All they managed to grab was some of the epoxy they used to form the patch. If that was what they wanted, they could have easily simulated it in a vacuum chamber on the ground. 1. They got so far behind the timeline that they didn't have time to place any replacement insulation. The bare pressure wall is just hanging out in the breeze for the next week. 1. Information gained from this EVA is unlikely to be useful for any practical operational purpose. Meanwhile, the risks were numerous: increased vulnerability to MMOD and thermal extremes, sharp edge hazards threatening the Orlan suits, a not-insignificant risk of dislodging the patch or creating new, harder-to-repair damage to the pressure wall. It was by far the most insane thing I've ever seen in spaceflight, and I don't mean that in a good way. Actual translated quote from MCC-Moscow: \"Oleg, please be careful! Do not be so harsh. I know this is hard for you, but I need you to stay calm.\"<SPOOFE>: Sounds like they were doing a buncha stuff they’d never planned on doing and had to make due with inadequate tools and unprecedented methodology. I bet if they spent $100 million and five years with teams of engineers and practice runs and specialized equipment on capsules that were designed with this eventuality in mind they could make it go without a hitch. I wonder why they didn’t do that..... ;)<SWGlassPit>: Probably because there was no actual engineering benefit to be gained from doing it. This was window dressing.<SPOOFE>: Well, yeah, it was for a forensic investigation, not engineering.<SWGlassPit>: Yeah, that's a stupid reason. You don't put a $100B vehicle and the lives of 6 crew at risk to find out which scapegoat to send to the gulag. As long as this is Russia's approach to quality problems, it will only get worse.<SPOOFE>: Oh yeah, determining the source of a problem has no value whatsoever. Uh-huh.<SWGlassPit>: The problem was on the ground. This won't provide useful information.", "num_messages": 11, "avg_score": 55.1818181818}
{"start_date": "1543663452", "end_date": "1543802127", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 14, "text": "[deleted]: Neil deGrasse Tyson under investigation at Fox after 3 women accuse him of sexual misconduct [deleted]<RealStalker>: So, once again not the slightest piece of evidence? Just accusations?<youreanoxygenthief>: We're you not informed we **#BelieveAllWomen** these days.<DonnieMoscowSwine>: Kavanaugh still lied and doesn't have the character for a SCOTUS justice. <nevernate>: Since it’s a lifetime appointment, when do we move on?", "num_messages": 5, "avg_score": 2.8}
{"start_date": "1544724736", "end_date": "1544756618", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 15, "text": "<EdwardHeisler>: SpaceX's Gwynne Shotwell says we'll be on Mars within 10 years <Kallikrein5>: Their lunar flyby isn't even planned until 2023 and SpaceX has never completed a project on schedule. Talking about Mars in 10 years is crazy town. I thought Shotwell was the responsible one. <BlazingAngel665>: Their lunar flyby is in 5 years. There's 3 launch windows to Mars between that and 2028. If Starship and Super Heavy slip by as much as Falcon Heavy did there's still 4 months before the close of the Mars launch window. Gwynne is the responsible one. Elon says we'll be on Mars by 2024.", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1544544023", "end_date": "1544607387", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 19179, "text": "<NewHorizons_Pluto>: Hi, I am Alan Stern, head of NASA’s New Horizons spacecraft on its way to explore Ultima Thule, a Kuiper Belt object one billion miles beyond Pluto! AMA Hello Reddit. I’m here with members of the mission team to answer your questions about NASA’s New Horizons mission to Pluto and beyond. Just three years after our historic exploration of Pluto in 2015, New Horizons is speeding toward a New Year’s Day encounter with the Kuiper Belt object nicknamed Ultima Thule – the farthest spacecraft flyby in history. Ask us anything about plans for the Ultima flyby or our mission of discovery and exploration in the farthest reaches of the solar system! - New Horizons mission website: http://pluto.jhuapl.edu - Alan Stern’s Wiki Page: http://en.wikipedia.org/wiki/Alan_Stern We are: - Dr. Alan Stern, Principal Investigator of New Horizons - Dr. Amanda Zangari, New Horizons Science Team Co-Investigator - Dr. Simon Porter, New Horizons Science Team Co-Investigator - Ms. Helene Winters, New Horizons Project Manager - Some good New Horizons resources are: - [Why visit the Kuiper Belt?](http://pluto.jhuapl.edu/Ultima/About-the-Kuiper-Belt.php) - [More about the spacecraft mission](http://pluto.jhuapl.edu/) - [Where is New Horizons right now?](http://pluto.jhuapl.edu/Mission/Where-is-New-Horizons.php) - [New Horizons Image Gallery](http://pluto.jhuapl.edu/Galleries/Images.php) - [NASA’s New Horizons mission page](https://www.nasa.gov/mission_pages/newhorizons/main/index.html) <Proof>: https://i.redd.it/ceecgblbbh321.jpg <ALL>: We have to go back to our preparations for the Ultima flyby, which is now just three weeks away! But we’ve had a lot of fun answering your questions. Keep up with the discoveries at the websites we've listed here, and on Twitter at @NASANewHorizons. See you on New Year’s Eve! - Alan and the New Horizons team <ozzymanii>: As a ham radio operator, I have to ask how the heck you can effectively send and receive signals to something so far away. I'm guessing antenna design is a big deal. How powerful are the transmitters involved? Thanks.<NewHorizons_Pluto>: On Earth, we use the three NASA Deep Space Network 70-meter dishes in California, Spain, and Australia, combined with some artisan crafted receivers. On the spacecraft, we have a 2.1 meter dish, driven by an ultra-stable oscillator. You can track when we're talking to Earth at: https://eyes.nasa.gov/dsn/dsn.html and looking for \"NHPC\", our DSN callsign. -Simon<halosldr>: That’s....amazing, really no other words for it.<ichegoya>: Absolutely! That's incredible!<random_fucktuation>: Look at the distance to Voyager 2 -- it took 41 years to go that far, and it's **still** 40 thousand years away from the nearest star (assuming it was going in that direction).<StonerMeditation>: Do you happen to know in mph how fast it's going, now that its left our solar system? <ReePoe>: if i remember its like 30,000mph and voyager 1 is like double that.<SmokinDroRogan>: Dude what the fuck. That is beyond mind-blowing. I thought for sure you were off by an order of magnitude or more, so I looked it up. 35.9k 38.6k for Voyager 2 and 1, respectively. Going that fast and barely being out of the solar system, making almost no dent on the Galaxy, which is one of 100 billion+. My mind is fucked. <EBtwopoint3>: Space is fucking huge. You know the famous Hubble deep field photo with all the galaxies? That was taken with long exposure focusing on a tiny portion of the sky that is completely empty to the naked eye. It was chosen as the area to look precisely because of how empty it is. <SmokinDroRogan>: My stomach hurts. I did not know that it was such a small, empty spot. It's also fucky thinking that logically, the universe never existed at one point, or it's **always** existed.<Marksman79>: http://imgur.com/gallery/dem9j Really helps you visualize it. <AbstinenceWorks>: Here's a mindfuck. Zoom. In on a dark part of the Hubble Deep Field. You'll still see faint pixels lit up by even more distant galaxies.", "num_messages": 13, "avg_score": 1475.3076923077}
{"start_date": "1543666708", "end_date": "1543790239", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 254, "text": "<Ex_Pessimist>: 360 degree photo of Mars <Pluto_and_Charon>: Removed- Image posts are only allowed on Sundays (UTC) It's a cool panorama though, try posting again tomorrow<Ex_Pessimist>: I cannot post again as it says the link was already posted.<Pluto_and_Charon>: usually when it redirects you to the previous post there's a button that says something like 'post again anyway' at the top of the screen (at least, on pc)", "num_messages": 4, "avg_score": 63.5}
{"start_date": "1543591735", "end_date": "1543667368", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 21, "text": "<MaryADraper>: In total, there are over 12,000 items in orbit - this just includes items created by humans. The US has the most amount of debris in Space, with 4,037 items, followed by Russia with 4,035. China has 3,524, France 334, India 81, Japan 52, Canada 5, and the UK 1. <ScaleneDragon>: So what is that one piece of junk from the UK, I'd like to know how that happened<ArthurDenttheSecond>: I'm assuming it was the Prospero satellite, the only satellite to be launched on a British rocket.", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1543668198", "end_date": "1543749859", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 79, "text": "<Musical_Tanks>: The next week is packed with planned rocket launches [Source1](https://www.rocketlaunch.live/), [Source 2](https://spaceflightnow.com/launch-schedule/) December 2nd 18:31 UTC (1:31 PM EST) Falcon 9 small satellite launch out of Vandenberg Dec 3rd 11:31 UTC (6:31 EST) Soyuz MS-11, Russian, Canadian and American astronauts going to the space station, pretty important launch too given the last failure. Dec 4th 18:38 UTC (1:38 PM EST) SpaceX CRS-16 (cargo resupply to space station) launched from Cape Canaveral Dec 4th ~20:37 UTC Ariane 5 launch from French Guiana, meteorology and communication satellites Dec 7th? Two launches from China, one being a lunar rover (UTC 17:30?) Dec 7/8th Delta IV heavy ~04:19 UTC, classified payload The list goes on into December with Electron, Proton, Soyuz, an Indian launch and more Falcon 9 launches. The closer we get to each launch date the better the times will get pinned down, but could also slip due to weather or technical issues. Most of these launches are going to be streamed live, SpaceX on their youtube channel, the manned Soyuz launch on NASA TV, Arianespace on their youtube (i think?), ULA has their own streaming for Delta IV, usually they link that through their website. <dutchbob1>: when I read the title, my first thought was: *\"oh God, that post better NOT be on /r/politics\"* <Dogon11>: I'm curious what that would mean in that context.<dutchbob1>: the military crisis in the Ukraine has lead to nuclear war between Russia and Nato. or India and Pakistan finally go *all out* against each other, or the Korea's clash, and trigger US and Chinese intervention, or Iran attacks Israel, or any combinations of the above?", "num_messages": 4, "avg_score": 19.75}
{"start_date": "1543502313", "end_date": "1543668237", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 566, "text": "<Mass1m01973>: The first stars born in the Universe may have been completely unlike anything we see in our present. Now we may soon be able to see the first supergiant stars in the Universe <smashing3000>: Why isn't the night sky totally bright from all the stars that must have existed? Will it one day be as bright as day? <bearsnchairs>: Because the universe is expanding faster than the speed of light over large distances and has a finite age. Even if the universe wasn’t expanding at the current rate there might not be enough time for distant light to reach the earth yet (this will depend on the actual density of stars). Since the universe is expanding faster than the speed of light there is light from distant objects that will never reach us, and over time more and more objects will be redshifted and recede from our view.<ZES_4>: I thought the speed of light was the speed limit?<the_newdave>: the speed limit for matter and energy, yes. but spacetime itself isn’t constrained by the laws of thermodynamics. think of it like an ant crawling across a balloon. that ant has a top speed and can’t go faster than that. but if the balloon is blown up, then the ant is still going at it’s top speed, but its destination will still get further and further away.<pyropulse209>: The speed of light isn’t emergent from the laws of thermodynamics. <thetaburned>: Is it emergent from the laws of quantum dynamics?<Hedshodd>: No, we stumbled upon it through Maxwell's equations of electromagnetism, way before the inception of thermodynamics. Because, with those equations, if you want to figure out how a tiny perturbation in the electromagnetic field propagates through a vaccuum, you get a wave as a solution (an electromagnetic wave, what we now call photons), and part of that solution is that this wave travels at a fixed speed. &amp;#x200B; <Edit>: In fact, the fixed speed of light only really came into the picture for quantum mechanis when Dirac combined quantum mechanics with special relativity (which then gave birth to quantum field theory.). It was implied at some points in quantum mechanis, but those instances were few and far between.<pyropulse209>: A photon is technically the smallest perturbation of the electromagnetic field, and that only happens because of its discrete (quantum) nature. Or put another way, a photon is a quanta of the electromagnetic field. I’m sure you knew this, but for everyone else.", "num_messages": 9, "avg_score": 62.8888888889}
{"start_date": "1543665752", "end_date": "1543714614", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 235, "text": "<mvea>: Moon exploration is back in fashion as nations vie in space race <waiting4singularity>: it starts to feel like the big players are re-enacting the last century.<danielravennest>: Except this time it is not a political dick-waving contest (Captialism vs Communism). It is more about science and potential industry. And we have vastly better technology today, so it won't cost near as much.<ForgottenMajesty>: Yet we're still aiming for the target with the largest symbolic impact and the least tangible benefit. Not political dick-waving? Coulda fooled me.<Sittin_At_TheRollTop>: I think the benefit lyes in the experience. Baby steps! <ForgottenMajesty>: Maybe so, and I have no problem with symbolic milestones as long as we actually *keep* whatever cultural momentum spawns from it, but my fears are that if we don't take this seriously then it becomes another stifled false-start with the ensuing PR lashback as people lose interest and we have another few decades of industry disruption. Going to the moon isn't a very realistic place to start with the commercialization and domestication of space.<Sittin_At_TheRollTop>: Why wouldn’t our closet neighboring celestial body be a good start, I wished Apollo never faded out. <ForgottenMajesty>: It basically makes no sense to bother with another celestial body. It sounds good, but from a practical perspective the moon doesn't offer us much relative to the trouble of going there and getting up from or down to the surface. Earth orbit is the real start line, and the next logical step after that is to try and obtain then process materials in space. NASA under the Obama administration had a roadmap for capturing, sampling, and even redirecting near-earth asteroids (asteroids \"nearby\" traveling in an orbit effectively parallel to the earth's). THAT'S exciting, THAT makes sense, and that's exactly what's necessary to expand the orbital infrastructure which will be a critical to reduced cost and increased capacity for going everywhere else in the solar system, especially very sensitive and serious undertakings like trying to colonize other planets. As a bonus, there isn't a single lesson about sustainably living in space that couldn't be applied to living on a terrestrial colony, and those lessons would be far broader and more helpful than those we might learn trying to live on the moon.<Sittin_At_TheRollTop>: OSIRIS is due to make some cool history. I think we are on a good course. NASA using commercial means to achieve LEO frees up their budget to focus on the science aspect of it all. Space X is going to fill Delta and Atlass’ shoes. I’m not really on board with the whole methane substituting hydrogen but it makes sense for cost effectiveness. Establishing a permanent presence independent of Earths grasp will take time. So many variables", "num_messages": 9, "avg_score": 26.1111111111}
{"start_date": "1542631755", "end_date": "1542666223", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 16744, "text": "<MaryADraper>: NASA's InSight Mars Lander Touches Down 1 Week from Today <Mossbackhack>: If successful, this will be only the 4th propulsive landing to touch down to the surface of mars. Others were Viking1, Viking2, and Phoenix. (Beagle2 appears to have landed but did not deploy solar arrays or communicate back) Other successful landings have used other methods like air bags or in Curiosity 's case a sky crane. So fingers crossed. I hope this is successful! <Edit>: As some have pointed out (thanks) Beagle 2 was an air bag landing so it was not a propulsive touch down. So, this will truly be only the 4th ever, if successful. Pretty exciting stuff!<jofwu>: Sky crane doesn't count as \"propulsive landing\"?<Mossbackhack>: I said propulsive landing to touch down on the surface. Sky crane did not do that although I do think it was one of the most innovative and coolest solutions to land a large payload. It was even more complex than a propulsive touch down.<baconator955>: Interesting. Why did they choose this method of delivery if it's more complex than a propulsive landing? You'd think they wouldn't take any chances on equipment this expensive.<Lizzard84>: https://m.youtube.com/watch?v=Ki_Af_o9Q9s that’s a great video which answers your question <dynamically_drunk>: That's incredibly more dramatic than it needs to be.<bandman614>: I'm not going to downvote you, but I disagree. When that came out, it was the best video NASA had released to date. It actually got people to care about what they were doing, and it did it in a way that communicated the people behind the mission and the difficulty of what they were accomplishing. Then they live streamed the landing, both in telemetry and at Mission Control at JPL, and tons of people watched. <nagumi>: Yep, it was amazing. Here's the livestream: [27:35](https://youtu.be/ER_WF9UI8vg?t=1655) 10 seconds to beginning of \"Seven Minutes of Terror\" [29:25](https://youtu.be/ER_WF9UI8vg?t=1765) Communication reestablished with Curiosity after initial reentry. [30:11](https://youtu.be/ER_WF9UI8vg?t=1811) Live (minus lightspeed delay) telemetry is received confirming health [32:15](https://youtu.be/ER_WF9UI8vg?t=1935) Parachute deployed! [32:53](https://youtu.be/ER_WF9UI8vg?t=1973) Ground radar acquired [34:11](https://youtu.be/ER_WF9UI8vg?t=2051) Here's where it gets real: powered flight. The parachute has been detached and Curiosity is descending on rockets. 1km altitude [34:40](https://youtu.be/ER_WF9UI8vg?t=2080) Curiosity has selected a landing location - nice and flat. 40 meters altitude [34:53](https://youtu.be/ER_WF9UI8vg?t=2093) Skycrane deployed! [35:24](https://youtu.be/ER_WF9UI8vg?t=2124) **TOUCHDOWN CONFIRMED!** Pandamonium in control room. *\"Time to see where our Curiosity will take us.\"* [36:24](https://youtu.be/ER_WF9UI8vg?t=2184) Data incoming! [37:36](https://youtu.be/ER_WF9UI8vg?t=2256) Pictures start arriving [38:01](https://youtu.be/ER_WF9UI8vg?t=2281) \"It's a wheel!!\" I love this video so much<narwhalsare_unicorns>: I will always remember watching that live. Due to timezones I was awake till early morning and when they finally got the touchdown confirmation I cried so much haha<nagumi>: haha same. I also watched MER 1 and 2. Great stuff<Darkphibre>: Oh man, memories! I went to a university campus to watch the Climate Orbiter, and left quite sad. Always nerve-wracking to watch a landing attempt!", "num_messages": 12, "avg_score": 1395.3333333333}
{"start_date": "1543670130", "end_date": "1543684062", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 199, "text": "<altheist>: Triton, Not Pluto or Eris, Is The Kuiper Belt's Largest World <PsiCopAl>: From the first sentence: &gt; Our Solar System is arguably the most well-studied corner of the Universe, They lost me right there.<BioLogicPodcast>: \"Arguably\" I'd like to meet the guy whose going to argue that star HD1893734 in a nebula halfway across the galaxy is actually more well-studied than our \"corner of the Universe\". <PsiCopAl>: I think the bigger problems are: a) They're making a claim about the entire universe, instead of simply limiting discussion of what's been done to where it's been done, which would be the norm. b) They're simultaneously disregarding what MIGHT have happened ANYWHERE else in the entire universe. It's just a ridiculous claim to start a supposedly science-based article with.<bradcroteau>: And an example of the horrible habit news has developed of hedging fact statements on every subject. Never will they just straight up say that it’s raining anymore. Actual truth aside, it would just be nice for a news outlet/journalist to speak their opinion with some confidence. If they can’t then maybe they should keep that opinion to themselves. If Apollo 11 happened today Walter Cronkite instead of stating authoritatively that man has just stepped foot on the moon and nearly weeping at the beauty of the event, would be dispassionately reading the teleprompter saying something like, “according to unnamed officials/experts/arm-chair-analysts at or in the parking lot of NASA, a so-called Astronaut has allegedly stepped on what is apparently called the Moon. Whether or not it is “the” Moon is contested by some scientists. This doubt was retweeted by the President at 3am last night and his staff did not respond to several requests for comment made at the ungodly hour of 3:05am. Next up, our reporter goes in-depth with an exclusive look into some random shit nobody but the person who shat it cares about.” Gah!!", "num_messages": 5, "avg_score": 39.8}
{"start_date": "1543671744", "end_date": "1543685727", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 9, "text": "<TheNectarineGuy>: If the chance of alien life in the Universe is high, what is the chance of there being interstellar hunters like from the movie Predator? <deplorableinWV>: I would say the chances are pretty good. But that's not what scares me. What scares me is that we might encounter an alien intelligence the looks at us the same way that we look at ants. You know, \"oh how cute, look what they're building, they are so industrious. Use that spray and wipe them out.\" Nothing malicious, or mean-spirited, just that we would be so unevolved and primitive to them that we look like insects.<abracatastrophe>: I guess that perspective might arise in beings with a more advanced consciousness. Imo it seems much more likely however that significantly advanced consciousness will have outgrown such rigid hierarchical thinking. Possibly even out of necessity. After all, such a sense of superiority is a mistake in logic based in a popular misconception of evolutionary theory. Much like the abomination that is social Darwinism. Our fear of the alien (terrestrial or not) is more a product of us projecting our own tendency to brutalize the \"other\" than actual likelihood. All said, we simply don't have the means to approximate or accurately theorize on the nature or disposition of a truly alien consciousness. I mean, if an alien consciousness can't express characteristics such as empathy while exploring the unimaginably vast resource pool of space to which it has access, how advanced could it really be? <Edit>: spelling, punctuation<deplorableinWV>: My point is that a sufficiently advanced civilization might not even consider us as thinking sentient beings if we're unable to communicate with them. Ants are an incredibly complex society, they have hierarchy, and they're able to perform magnificant Feats. But we routinely wipe them out because we consider them to be insects. Imagined a race that was capable of interstellar flight, but communicated through smells, instead of sights or sounds. How long would it take us to figure something like that out, figure out how to communicate with them, and then make it understood that we are a species that deserves to survive as well? And then, will they even listen. It wouldn't be anything malicious, it would might simply be seen as Pest Removal. Or we might not even rise to the level of notice. And as far as traveling Interstellar distances. That is not likely to be a scientific endeavor, on the whole. It would likely be an expansion of their culture, race, Empire. The same way we didn't exactly come into North America to destroy everything. Europeans came here to explore and exploit resources. The near total decimation of the native population was mostly an unintended consequence of diseases. Of course there were malicious elements to the occupation of North America, I'm not saying that there wasn't. I'm just sane that the majority of the deaths that occurred were from populations being ravaged by diseases they had no immunity for.<abracatastrophe>: I get what you're saying. But, a significantly advanced consciousness will be capable of relating to simpler life forms. Similar to our ability to anthropomorphize non-humans, yet far far more advanced. Buddhism is an entire religion based upon this capacity for the extension of \"self\", and that was created thousands of years ago by humans less \"advanced\" than us. As far as historical colonization/resource-competition scenarios are concerned, I don't think they apply. We, as simple and inefficient as we are, occupying one little moldy rock around an average star, are capable of synthesizing various forms of exotic matter, ion drives, splitting subatomic particles, bending space-time, etc. All with only a handfull of centuries applying empircal method and industrial technology. It seems like a stretch to me that another sentience more advanced than that would find it worth their time to do anything but observe an inhabited planet. Resource competition will most likely be a non-issue to an interstellar civilization. The building blocks for any resource they might need are in excess abundance in any galaxy. I'm not saying the scenarios you propose aren't possible. Just saying that they exist alongside several other slightly more likely scenarios.<deplorableinWV>: I think perhaps you misunderstand my meaning about resources. As far as Metals, water, and various other materials go the asteroid belt would be a much better solution to Resource acquisition. The resource most likely needed for a civilization traveling Interstellar would be a place to land, and food. Sure, we anthropomorphize animals. But we also eat them. A lot of times you try to kill them as humanely as possible, but we still kill and eat them. We can do this because they don't rise to our level of intelligence, and we consider them not to have souls. Just imagine an Interstellar species that was extremely xenophobic in their views of any other race they encountered.", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1544447911", "end_date": "1544508824", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 17372, "text": "<zac428>: NASA’s Voyager 2 Probe Enters Interstellar Space <Fizrock>: For anyone wondering, here is the full list of man-made objects on an escape trajectory from the solar system: - Voyager 1 (escaped) - Voyager 2 (escaped) - Pioneer 10 (Lost contact but is farther out than Voyager 2 so maybe escaped) - Pioneer 11 (99 AU) - New Horizons (40 AU) - Pioneer 10 third stage booster - Voyager 1 third stage booster - Voyager 2 third stage booster - New Horizons third stage booster - 2 yo-yo de-spin weights on wires from New Horizons <Totallynotatimelord>: New horizons speed really shows here, it’s rapidly closing on pioneer 11<InvaderDem>: I believe NH is gonna' wake up soon and give us some pictures of some objects in the Kuiper Belt, too.<Totallynotatimelord>: Yup! There's a scheduled flyby of a Kuiper belt object on New Year's Day<PM_Me_Ur_Plant_Pics>: Thank you so much for that reminder!<jay9909>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<Brainkandle>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<cool3647>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<DinoCow>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<TheRealMavsZane>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<cristinolda>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<DingDong_Dongguan>: RemindMe! December 31st, 2018 Throw out the milk<buku>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<firesword14>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<Lawc17>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!<yup_i_did>: RemindMe! December 31st, 2018 New Horizons Kuiper belt fly-by!", "num_messages": 17, "avg_score": 1021.8823529412}
{"start_date": "1537197088", "end_date": "1544788264", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 7, "text": "<badgrenola>: Juno Observer - Explore NASA’s Junocam images on a 3D Jupiter <badgrenola>: Hello! This is actually my own website, which was released into beta last week. It’s taken months of work to align the imagery so it can be presented in this way, and I thought r/space might enjoy it :) If anyone has any questions, just shout. And if this post is in the wrong place/breaks any rules, just let me know. Cheers!<shthed>: This is awesome, thank you! Exactly what I was looking for, great way of viewing the imagery :) Any chance you could share this as a .kmz file we could load in Google Earth? I'd love to see all the imagery overlaid at once", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1544788586", "end_date": "1544952536", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 14, "text": "<FilippRomanov>: Geminid meteor shower: live stream of maximum activity <MoleKing801>: This is really cool but I don't have the patience while currently at work. Do you have some time stamps of some of the bombardments? I love the idea of this livestream!!<FilippRomanov>: Thank you! There were dozens of them. The very first meteor - 03:12; the last - 04:29:13; the brightest - 02:19:07. Visually, I saw about 200 meteors in 4 hours of observations.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1544736776", "end_date": "1544798609", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 6, "text": "<colefo6>: Trying to find a specific website that showed radio waves traveling from Earth, and what you would hear from certain distance away from Earth. Anyone know the link? <OldGreyTroll>: Well, there is [this](https://www.dailymail.co.uk/sciencetech/article-2107061/Earth-calling-Tiny-yellow-dot-shows-distance-radio-broadcasts-aliens-travelled.html). Or [this](https://zidbits.com/2011/07/how-far-have-radio-signals-traveled-from-earth/).<colefo6>: Neither of them, but thank you for digging. It was more of an animation that brought you from earth to space, displaying the year a song was made, and where in space the radio waves have traveled within that time frame. <Piscator629>: All I have ever seen is illustrations. I have never heard of an updating website doing this.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1543673824", "end_date": "1543715354", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 82, "text": "<un0m>: InSight may have just landed, but let's not forget Curiosity (2247 Sols on Mars) &amp; Opportunity (5280 Sols on Mars) - Latest photo from Opportunity (taken Sol 5104) <Benlikesrockets>: Yeah I think the dust storm might have killed opportunity :( <InformationHorder>: Well considering NASA didn't wanna commit the time to find it again... we'll never know if it could have been saved. <Cornpwns>: They attempted reboots for a while. It never had enough power to send a signal back.<InformationHorder>: Yeah they figured the clock got reset, so if it tried to make contact it was doing it at the wrong time. But they could have lent it some extra bandwidth to be listening for off-time comm attempts<Cornpwns>: For sure. It was, however, declared to not be worth the resources trying to resume contact so NASA are longer trying. That's what I meant by its dead even though I got downvoted for some reason. We won't be getting any more data from the rover. Curiosity is a much more diverse rover and is still happily chugging along so while the news is sad it's not devastating. Opportunity did what it was meant to do and much, much more.", "num_messages": 6, "avg_score": 13.6666666667}
{"start_date": "1543675172", "end_date": "1543692093", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 23, "text": "<casualphilosopher1>: The ESA Would Not Like A Divorce With The UK Space Program <bearsnchairs>: ESA is not an EU organization, so there is little reason to change the relationship with the UK after Brexit. The UK has a lot of aerospace experience that is crucial for future ESA programs.<bongotrench>: ESA might not be an EU organisation, but the EU is the largest source of funding. The EU generally has quite strict rules about where it's money can be spent so even if ESA wants to fund projects involving teams in the UK, they might not be allowed.<bearsnchairs>: Do you have a source for the funding? It seems that EU members are the largest source of funding, but do they pool money into the EU which then distributed to ESA or do they pay ESA directly?<bongotrench>: Just Wikipedia! Looks like a bit of both, so there is direct funding of ESA from the national space agencies and then also more from the EU which is obviously indirectly from each national budget.<bearsnchairs>: ~~That is what I’m talking about though. When you look at the funding section their it shows all the member countries and their contributions and it addds up to 100%. The individual country contributions add up pretty much to the reported total budget. The section where it says the EU pays ~80% of the budget seems to be the combined individual contributions of all EU countries.~~ Never mind I see now. The EU was ~ 1.3 billion out of 5.6 billion and is the largest single contributor.", "num_messages": 6, "avg_score": 3.8333333333}
{"start_date": "1543677558", "end_date": "1543707173", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 34, "text": "<OutOfOdds>: Beautiful space terms Hi space lovers! Can we share some beautiful and inspirational Space, Astronomy, Astrophysiscs terms. Thank you! &amp;#x200B;<reckoner_oh>: Spaghettification<PsiCopAl>: Is this REALLY a formal term? I thought the word for that was extrusion.<ProfessorRGB>: Yes, waiter, I would like the extruded wheat carbonara. Just taking the manufacturing term extrusion as my basis, I don’t think it would be correct, since it implies the use of a die. As opposed to simply stretching something. <PsiCopAl>: Oh. I think the only time I heard spaghettification used was for someone being sucked out a hole in a spacecraft.<ProfessorRGB>: That would be extrusion. But spaghettification refers to the effect of the difference in gravity between your feet and head (if you were falling feet first toward a black hole). As you get closer, the difference becomes greater. First your toes, then feet, then legs, etc get stretched out. You eventually end up as a just stream of matter falling toward the singularity. But don’t worry, you’d likely be dead before you noticed any of this going on. <https>://en.m.wikipedia.org/wiki/Spaghettification [deleted]: I've always thought that's pretty interesting. On a flat surface with extreme gravity, you'd get squished. In open space you'd have the exact opposite happen.", "num_messages": 7, "avg_score": 4.8571428571}
{"start_date": "1543673671", "end_date": "1543692228", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 200, "text": "[deleted]: How long it would take to fall off the Empire State Building (comparing gravity of the earth, moon and sun) [deleted]<gazuk23>: Any planet that has pull that means you could survive it? <ILoveVaporwave>: Perhaps, I didn’t calculate that. Would have been an interesting addition! I may add that in a future video.<Oryxhasnonuts>: Was curious about the same thing Title it. You can fall from the Empire State Building and Surive<ILoveVaporwave>: That sounds like a fun challenge. I may do that.<Oryxhasnonuts>: It involves Math thus I am sidelined to help", "num_messages": 6, "avg_score": 33.3333333333}
{"start_date": "1543589478", "end_date": "1543766277", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 13, "text": "<moderatelyremarkable>: Visiting space centers around the world If you’re interested in space exploration then you can take your passion one step further and visit a number of cool space facilities and some neat space infrastructure around the world. I’ve listed below the sites I visited, together with some links and practical info for each one. **Baikonur Cosmodrome** *Description*: One of the world’s most important space centres, and currently the only one sending people into space (with the exception of China’s manned launches; this is bound to change soon as the US resumes manned launches as well). Used by Roscosmos for manned and unammed missions, including currently all launches to the ISS. Lots of historical missions were launched from here, including the launch of Sputnik and Gagarin’s first trip to space. There’s lots of cool infrastructure, space history and museums to be seen; you can get closer to most of these than in other places, and it is not swarming with visitors. *Can you see a rocket launch?* Yes, Proton and Soyuz rockets are launched from here and you can see a live launch from a lot closer than in other places. For this, contact the company above and arrange your visit during a launch, they will know the details. Of course, launches can be delayed, so keep your expectations in check *How to visit*: The cosmodrome is a restricted area, so I booked a 6-day tour with a Russian company called [Country of Tourism](http://www.bestrussiantour.com/space/tour_baikonur), which did a fantastic job. They took care of all the permits and arrangements fort the cosmodrome and at Baikonur. You will need a visa for Russia, but not for Kazakhstan if you fly directly from Moscow. *What will you see?* This was definitely my coolest space center visit. The highlight was watching a live rocket launch of a manned Soyuz rocket to the ISS from less than a kilometer away (Soyuz TMA-09M). It was an amazing experience. Related to that, I also got to see the rocket rollout to the launch pad from a few short metres away; view the rocket on the launch pad before launch; attended the crew press conference and pre-flight report. There’s lots of history and lots of other cool stuff at and around the cosmodrome. I visited the Energia-Buran launch pad, N1 transport vehicles, the History of Baikonur and the Baikonur cosmodrome museums, Yuri Gagarin’s house, the International Space School and a Buran vehicle, among others. *More pictures [here](http://worldtravels.ro/?projects=kazakhstan) and a writeup [here](http://worldtravels.ro/?p=3037)* **Guiana Space Centre** *Description*: space center used for launches by the European Space Agency, launches unmanned missions on Vega, Ariane and Soyuz rockets (the latter bought from Russia). Very cool setting in the middle of the jungle. How to visit: The space center is a restricted area, so a tour needs to be booked in advance (you might be able to book on site, but I would definitely not risk it). Tours are free and contact info for booking is available [here](http://www.arianespace.com/spaceport-facility/practical-information/). They might be slow to answer, so don’t give up and do call if you don’t get a reply by email. French Guiana is pretty remote, so it will be slightly more complicated to make travel arrangements (these will include a mandatory yellor fever vaccine before travel – do your research). *Can you see a rocket launch?* Yes, if you time your visit right. Check out launch schedules on one of the many resources available online (i.e. Spaceflight Now). Of course launches may be delayed, so manage your expectations accordingly. Watching the rocket launch needs a separate booking which must be made in advance (no exceptions). Booking contacts are available [here](http://www.arianespace.com/spaceport-facility/practical-information/). They might be slow to answer, so don’t give up and do call if you don’t get a reply by email; use any of the phone numbers listed on the page if necessary, until you reach the right persons for booking. You will need to fill out a form and provide a number of details for the booking. *What will you see?* This was also one of my best experiences visiting a space center. I watched a live rocket launch – Ariane mission VA240 delivering four Galileo positioning satellites to orbit; very cool experience watching the launch from an observation point in the middle of the jungle (the launch was a few kilometres away). The space center tour was also very interesting, and included launch pads for Vega, Soyuz and Ariane, the control center for Ariane and Vega and the main Jupiter control center. The mix of hi-tech space infrastructure with rainforest flora and fauna was very interesting and gave the place a edge-of-the-world scifi feel. There’s also the Musee de l’Espace, which features a full-scale Ariane 5 model, but the exhibits and information are unfortunately dated and don’t include ESA’s more recent accomplishments. *More pictures [here](http://worldtravels.ro/?projects=french-guiana-france-new)* **Kennedy Space Center** *Description*: primary launch center for NASA. Major historical missions were launched from here, including the Apollo and Space Shuttle missions. KSC is one of the most well known space centers in the world and inclused an extensive visitor center. *How to visit*: Very easy to visit, as the visitor center is open to the public. Tours of the actual space center require booking, details [here](https://www.kennedyspacecenter.com/info/tickets). *Can you see a rocket launch?* Yes, if you time your visit right. Check out launch schedules on one of the many resources available online (i.e. Spaceflight Now). Of course launches may be delayed, so manage your expectations accordingly. Details for viewing a launch available [here](https://www.kennedyspacecenter.com/info/tickets). Viewing spots are limited and KSC gets very crowded during launches. *What will you see?* There’s lots of cool history at KSC. You can see launch pads 39A and 39B used for the Apollo missions and the Space Shuttle, the famous Vehicle Assembly Building and the Space Shuttle landing strip; you will not get very close to those, though, and the bus tour is pretty short. You can also see a full-size almost-flown real Saturn V Rocket, the actual Atlantis Space Shuttle, an Apollo command center and lots of space exhibits. The visitor center is very well organized, but very crowded compared to all of my other space center visits. I also watched a live rocket launch – the Orion EFT-1 mission, a test of the Orion Multi-purpose Crew Vehicle; rocket used was the awesome Delta IV Heavy – the most powerful rocket currently in operation. *Some pictures in my US travel album, [here](http://worldtravels.ro/?projects=united-states-of-america)* **Tsukuba Space Center** *Description*: Headquarters of the Japanese Space Agency, JAXA, and primary location for Japan’s space operations. *How to visit*: Easy to visit in if you're in Japan, via a short 70km train ride from Tokyo (and bus or taxi ride from Tsukuba train station). There’s an exhibition hall (no reservations required, public access availalbe); guided tours are also available, but reservations are required. Details [here](http://global.jaxa.jp/about/centers/tksc/). *Can you see a rocket launch?* No. Japan’s rocket launches take place from other sites. *What will you see?* The exhibit hall has lots of cool tech related to Japan’s space program, including a full-size replica of Japan’s Kibo module on the ISS and models of rockets and space missions. There’s also a 50-metre rocket on display outside the exhibit halls. Guided tours were not offered when I visited, but currently it seems you can visit the Kibo control center and an astronaut training facility. *A few pictures in my Japan travel album, [here](http://worldtravels.ro/?projects=japan-new)* **European Space Research and Technology Centre (ESTEC)** *Description*: main technology development and test centre for spacecraft and space technology of the European Space Agency *How to visit*: Easy to visit, via a short 50km train ride from Amsterdam; space exhibition is open to the public, but visiting the space centre is only possible during “open days” events. Details on the space expo [here](https://www.space-expo.nl/en); for info on open days events check [here](https://www.esa.int/About_Us/ESTEC). *Can you see a rocket launch?* No. No rocket launches happen from ESTEC. *What will you see?* The open day event was cool (but crowded). When I went in 2017 there were presentations and models of ESA’s most important missions (including the world famous Rosetta mission which included the Philae lander that landed on a comet); a view of ESTEC operations including a centrifuge experiment and the assembly of the actual BepiColombo mission on route to Mercury, a model of the IXV space plane or a cool experiment that showed cosmic rays in action. If you can’t make it to ESTEC’s open day, you’ll find the Space Expo nearby which is open year round and hosts more cool stuff, including a mockup of ESA’s Columbus module on the ISS, models of missions and other assorted space gear. *A few pictures in my Netherlands travel album, [here](http://worldtravels.ro/?projects=netherlands)* **Jet Propulsion Laboratory (JPL)** *Description*: NASA center operated by Caltech for development and operation of planetary space missions; also conducts Earth-orbit and astronomy missions, and operates NASA’s Deep Space Network. *How to visit*: Easy to visit, via a short 25km drive from Los Angeles. I visited a longer time ago when public tours were possible with advance booking. Visiting JPL nowdays is almost impossible, unfortunately. Details [here](https://www.jpl.nasa.gov/events/tours/views/). *Can you see a rocket launch?* No. No rocket launches happen from JPL. *What will you see?* My tour included visiting a command center for planetary missions, a clean room for development of space probes and an exhibition with models of famous space missions. **Space museums and other sites of interest for space exploration enthusiasts** * The National Air &amp; Space Museum in Washington is one of the mosts interesting space museums I have ever visited and included real and models of space capsules, gear and launch vehicles and a lot of very interesting space exhibits (such as the ALH84001 meteorite). * The Museum of Cosmonautics in Moscow is another great space museum focusing on missions and accomplishments of the Russian space program, with models of many important historical missions, a model of a Mir space station and more. * Shanghai Science and Technology Museum in Shanghai. Displays a few exhibits and models related to China’s space program, which are pretty interesting considering the country’s space centers are not opened to the public (some limited access to the China’s main space center is currently only available to Chinese nationals). The Shanghai Aerospace Enthusiasts Center includes some models of Chinese rockets. * Hong Kong Space Museum in Hong Kong displays some more exhibits on China’s space program but was dated and in need of updating. The Hong Kong Science Museum had a much more interesting and modern special space exhibit when I visited, which included China’s Lunar program, but it no longer seems to be available. * California Science Center, Los Angeles. Includes the real Space Shuttle Endeavour, including the shuttle’s tank, the capsule used in the Apollo-Soyuz mission and a small number of other space exhibits. * SpaceX office in Hawthorne, California. Displays the first-ever recovered rocket stage outside the office building. The SpaceX office cannot be visited. * If you’re in Arizona visiting the Grand Canyon, you can make an interesting stop at the Arizona Meteor Crater, which can be visited. * If you happen to be in Bucharest, Romania, you can see a Soyuz space capsule at the National Military Museum. The capsule carried Romania’s only cosmonaut to space as part of a Russian space mission. Let me know if you have any questions. <wintersu7>: I have no idea on the history of how the place came to be, but the Cosmodrome in Hutchinson, KS is an awesome visit as well. They somehow managed to get the largest collection of Soviet space artifacts in the US (using the word artifact there isn’t the word I would like, I just can’t come up with a suitable word I like better) It’s a good visit <Edit>: it’s Cosmosphere, my apologies<moderatelyremarkable>: interesting space museum, I didn't know about this one. <wintersu7>: I was surprised by it as well. Basically the last place I would expect a serious and well rounded space museum. But there it is", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1543679004", "end_date": "1543760110", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 122, "text": "<stereomatch>: In a first, AI robot accuses fellow astronaut of being mean to it (HAL-like maneuverable robot on ISS) <Athox>: if (person.isMeanToMe()) say(\"stop being mean to me\") Am I doing it right? I'm an AI programmer now. Robots are going to take over.<Mosern77>: Yeah - if you manage to program: person isMeanToMe say Then, yes - you're an AI programmer.<Athox>: I am. I can even do it in Javascript, which makes me an ubermensch.<Aior>: Maybe there is some hidden inner complexity that you're not seeing.<Athox>: I think you're missing the difference between artificial INTELLIGENCE and environment detection.<Aior>: No, I'm not. However I think (I'm a software architect) that even this seemingly simple detection has a lot of hidden complexity that you're not seeing, perhaps because you've never actually tried to do it, while I tried, and failed - the technology simply is not here, yet. Perhaps you're not considering that this algorithm needs to work even if there are some constraints, even if the situation is more complex and also complex emotionally speaking, even if the power is low, etc.", "num_messages": 7, "avg_score": 17.4285714286}
{"start_date": "1542373570", "end_date": "1543686755", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 33, "text": "<MaryADraper>: Creation of Space Force will carry price tag in the ‘single-digit’ billions. Lead Pentagon official working on the Space Force, expressed confidence the project would come to fruition. <sgh616>: I still don’t know what their purpose is supposed to be. What are they supposed to do?<Throow123>: Manage the current orbital constellation, and likely administer the efforts aimed at new, decentralized platforms hardened against enemy space attack. In the long term, possibly play space traffic control. Mattis has also hinted at offensive capabilities, though.<Datengineerwill>: There's also some mid level talks of using the BFR as a transport and staging platform. A general litteraly mentioned that it carries twice the payload of a C-5 , cost less per flight per pound and can drop whatever you need any where in less than 45 mins. Probably 8 mins if that equipment is already staged in orbit.<Throow123>: Ah, so I’m not buried in tinfoil. Thing is, Project Ithacus poked holes into the concept, holes that are inherent and that the BFR is subject to - vulnerability to enemy fire, difficulty in vehicle retrieval once it lands, significant issues with terrestrial landing in random locations rather than launchpads (issues more pronounced than on Mars, even). <Edit>: https://www.defensenews.com/space/2018/08/02/one-possible-job-for-spacexs-bfr-taking-the-air-forces-cargo-in-and-out-of-space/ &gt;Everhart has a reputation in the Air Force community for talking about big — and some critics would say ill-advised — technological leaps such as **autonomous or stealthy aerial refueling tankers**. My kind of guy.<Datengineerwill>: I would bet the BFR military transport version would get a laser scaled up from the ones going on C-7s and C-130s for missile defense. As for landing it would drop off it's bigger shipments at Theater Airbases. But it's not inconceivable that a few standard size drop pallets (read pods) could be easily developed to drop smaller loads nearly anywhere.<Throow123>: Those C-7/C-130 ones can’t really burn through [something that’s already heated up hotter than an acetylene torch.](https://youtube.com/watch?v=rk9mvLFNqMQ)<Datengineerwill>: You're correct. They are designed to take out MANPADS and SAM missiles. A BFR would be facing a ASAT which would require a bit more power thus the scaled up statement. But also won't have to fight atmospheric attenuation as much.<Throow123>: Lower dwell time, though. Not to mention the smaller SAMs have inrared seekers, so you’re mot actually out to destroy the missile, merely blind it.<Datengineerwill>: Actually assuming the BFR is at 1200 miles altitude the ASAT missile would spend 4 mins &amp; 32 seconds above atmosphere @ 15,000 mph. Also ASATs do use an IR seeker. The notional BFR laser would have nearly twice the dwell time, when compared to a C-130 vs a MANPAD, at minimum and still only have to soft-kill the missile via the seeker. all according to [https://en.wikipedia.org/wiki/ASM-135\\_ASAT](https://en.wikipedia.org/wiki/ASM-135_ASAT)<Throow123>: The old air-launched ASAT missile is pretty low on the totem pole, I’m thinking closer to the Nudol, which has to handle hypersonic ascent through the troposphere and likely relies on radar guidance. This means higher peak velocity; the 1200 mile MEO is a weird choice for the BFR itself, but OK. Your unrevealed calculations for effective laser range are dubious, as current militarily-useful lasers are heavily limited by optics and diffraction, not just atmosphere. Thus I feel no obligation to not argue that the Vual cosmosol canisters launched by the attacking vehicle would absorb and scatter laser fire - or that the attacking vehicle will likely be satisfied with coming within about 30 miles and setting off an X-ray-enhanced megaton-class nuke.<Datengineerwill>: I chose 1200 miles because its usually above the engagement envelope of most ASAT systems and is an easily attainable orbit for the BFR. My calculations are simply (altitude of intercept-height of atmosphere)/Velocity of interceptor. This gives me the minimum laser dwell time as i'm assuming the lasing cannot begin until the missile has entered whats defined as space and that the missile is already traveling at its max velocity at this point. &amp;#x200B; This previously selected orbit is already well above the Max engagement altitude of the Nudol (560 miles). Also its predecessor only carries a 10kt nuke. Assuming the Nudol retains a nuclear ABM capability (despite removing it from the A-135) the payload is likely not going to be more than 100kt as the warhead would be far to much mass for an interceptor. &amp;#x200B; Even if we assume the Nudol can reach an altitude of 1200 miles (more than double its stated max altitude), carries a 100kt nuke (10x larger than its predecessor and a highly unlikely capability), gets past BFR laser defenses and then strikes within 30 miles. Nukes do very little damage in space since there is no medium to carry its destructive shockwave or the massive amount of heat. You're left with the radiating effect in the IR thru X-ray spectrum which dissipates very quickly from blast center. &amp;#x200B; &amp;#x200B;<Throow123>: &gt; Nukes do very little damage in space since there is no medium to carry its destructive shockwave or the massive amount of heat. If you're dealing with an ordinary nuke. Antimissiles use tailored-effect neutron or x-ray munitions. The Spartan's megaton-range warhead with a gold tamper had an effectve kill range of 35 miles against hardened warheads.<Datengineerwill>: And lifting a megaton nuke to 1200 miles at intercept velocities would require a big ass fuck all kind if missile. Which needless to say would be prohibitively expensive. The Spartan only had that megaton warhead because it performed the intercept in the last 10 seconds or so before impact. Even the best ABMs of today lift at most a 10kt warhead to 700 miles.<Throow123>: &gt; The Spartan only had that megaton warhead because it performed the intercept in the last 10 seconds or so before impact. No wholly relevant. The Spartan was still used for exoatmospheric intercept - so it would still reach about 600 km high, and that's with optimization for the aforementioned brief intercept time.", "num_messages": 15, "avg_score": 2.2}
{"start_date": "1544677948", "end_date": "1544694365", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 115, "text": "<grexior>: Parker Solar Probe: Sun-skimming mission starts calling home <dubaimalayali>: The bright dot is jupiter for anyone thinking <Ehralur>: What are the dark dots? It's moons?<ThatAnnoyingDutchGuy>: Do people even read the articles? &gt;The bright dot is actually far-distant Jupiter. The black dots are repeats that occur simply because of the way the picture is constructed. &amp;#x200B;<Ehralur>: Normally I would, but I figured this was just a picture post. Didn't even realize there was an article.", "num_messages": 5, "avg_score": 23.0}
{"start_date": "1544723417", "end_date": "1544755681", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 18, "text": "<EdwardHeisler>: Robert Zubrin to Discuss Moon Direct Proposal on FOX Business News today 12/13 at 1:50 PM EST <Kallikrein5>: I'd like to know why he changed his tune on the Moon being a dead end. <EdwardHeisler>: Zubrin never indicated the Moon is a \"dead end\" and that humans should not resume the exploration of the Moon nor any other planets and moons outside of Mars and its moons. Check out these links. Dr. Robert Zubrin - Why a lunar base is better than LOP-G - 21st Annual Mars Society Convention <https>://www.youtube.com/watch?v=buLzhqgQbpA&amp;feature=youtu.be Moon Direct A purpose-driven plan to open the lunar frontier<https>://www.thenewatlantis.com/publications/moon-direct <Kallikrein5>: Those are both from this year. In *The Case for Mars* (1996), he wrote an entire chapter about how the moon is useless as a waypoint for further exploration. The entire Mars Direct plan is based on not wasting delta-V. Going from a transfer orbit to the moon's surface and back is a total 5km/s dV. That's enough to land on Mars instead. Or put in orbit of Jupiter. <EdwardHeisler>: Using the Moon as a \"waystation\" to Mars is a waste of money and time to send human explorers to Mars. Why do you think that is necessary and Mars Direct shouldn't be pursued?<Kallikrein5>: &gt; Using the Moon as a \"waystation\" to Mars is a waste of money and time to send human explorers to Mars Yes. &gt;Why do you think that is necessary and Mars Direct shouldn't be pursued? I don't think the moon station is necessary. I don't think it helps to get anywhere else, Mars included. <EdwardHeisler>: I agree.", "num_messages": 7, "avg_score": 2.5714285714}
{"start_date": "1543666818", "end_date": "1543757603", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 455, "text": "<DrWhiteApe>: \"The Great Silence\" - LEMMINO <Proxy_PlayerHD>: This guy is the definition of quality over quantity<OllieUnited18>: It amazes me that there are channels out there run by one or a few people that can put out multiple Lemmino-quality videos in a week.<Sparcy63>: Lemmino puts out videos bi-monthly not weekly.<OllieUnited18>: Yeah that's what I'm saying. His videos are awesome but infrequent. Some channels put out quality videos 5 times the speed of Lemmino.<Sparcy63>: Examples? Need content to watch.<OllieUnited18>: Well, for starters, if your a fan of astronomy, aliens, and futurism, John Michael Godier will be a fun rabbit hole. Only downside is that his videos aren't the most visually stimulating despite his content being super well researched and interesting. Isaac Arthur is a similar channel although his ideas are way more hypothetical and abstract. Lastly, just in case you haven't heard of it, Kurzgesagt does amazing videos similar to Lemmino with fantastic animation on some pretty hot topics in science, politics, and futurism. Hope this helps.<DrWhiteApe>: I strongly, **strongly** recommend \"exurb1a\". He makes philosophical videos, which are also visually appealing, many times about space. Him and Lemmino are my two favourite YouTubers of all time, with Tierzoo and Casually Explained coming after them.<jacebam>: Tierzoo’s style is unique and exciting. I agree with OP", "num_messages": 9, "avg_score": 50.5555555556}
{"start_date": "1543593457", "end_date": "1543680968", "thread_id": null, "subreddit": "space", "subreddit_id": "t5_2qh87", "total_score": 35, "text": "<yoshi1911>: The Great Silence | LEMMiNO <therewasnolight12>: That guy is supertallented check his other vids put<yoshi1911>: Yes I love his vids. Very informative and very well researched.", "num_messages": 3, "avg_score": 11.6666666667}
