{"start_date": "1554838379", "end_date": "1554940195", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 37217, "text": "<FuriousFighter13>: Shoe that is on the longboard vs the shoe that does all the pushing <arvhult>: But the pushing shoe is also sometimes the braking shoe, this is why it is so damn worn out<imnotrealami>: That's exactly what that is. I went through a pair of Vans like this until I could slow down without dragging my foot. Going 40+, takes a bit to learn how to slow down well.<dungfecespoopshit>: So for all the noobs out there (like me) how do you stop without dragging foot going 20+? Carving?<AceMcClean>: Speed checks and sliding. It’s very tough to learn but just keep practicing.<SkimmedWilk>: I understand sliding or rather how to execute one in theory, but can you elaborate on speed checks?<AssRug47>: Carving a little sharper to decrease speed<IdontDoPepsi>: I understand decreasing speed, but can you elaborate on carving?<Alagane>: You skate in a tight curvy s shape in order to kill speed.<MrWheelieBin>: I understand killing speed, but can you elaborate on S shapes?<jaspersgroove>: It’s like you start drawing Trogdor but stop after the first step.<2bests>: Can you elaborate on trogdor please?<waltwalt>: He burninates the countryside.<hiljusti>: I understand burnination, but can you elaborate on countryside?<Uranium_Donut_>: COUNTRY ROOOOOOOADS, TAKE ME HOOOOOOOME<mzhammah>: IT'S A ME, MARRRIIIOOOOOO!<craniumonempty>: Can you elaborate on me please?", "num_messages": 17, "avg_score": 2189.2352941176}
{"start_date": "1555470657", "end_date": "1555483673", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 339, "text": "<Catpepperonis>: I won 11 lbs ($222 worth) of gluten,dairy,soy and nut free dark chocolate. <ThreeDollarBanjo>: You won it because no one would buy it.<Catpepperonis>: You right<ThreeDollarBanjo>: I hope it tastes better than it sounds.<Catpepperonis>: It tastes like baking chocolate. The ingredients are as follows: Unsweetened Chocolate, Cane Sugar, Cocoa Butter<ThreeDollarBanjo>: Just the basics... cant be too bad then. You could always melt it down and create yr own... or not.<narpilepsy>: \"Can't be too bad\"? Have you ever tried baking chocolate? It's not meant to be eaten raw, haha. On the bright side, OP won't ever run out of baking chocolate.<Pravus_Belua>: Baking chocolate, like almost all other chocolates isn't just one type (the kind that tastes like regret). It, too, has unsweetened, bittersweet, semisweet, and sweet varieties. You're thinking of the standard unsweetened variety and yes, it's unpleasant eating by itself. That's not what OP has since they mentioned the ingredients list cane sugar.<narpilepsy>: &gt; That's not what OP has Yeah.... I was being facetious.", "num_messages": 9, "avg_score": 37.6666666667}
{"start_date": "1554903576", "end_date": "1554903983", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 11, "text": "<AlienSoldier>: This little slot between the plug and the port on my Airpods is the most anti apple thing I ever seen. <NECESolarGuy>: Is that an Apple cable?<ngc19731>: The size of the slot is actually perfect for USB c", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1555459905", "end_date": "1555635400", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 6963, "text": "<RoxyKubundis>: Terrifically textured toffee <RoxyKubundis>: Today I learned that people don't like weirdly regular holes in their food. <Edit>: y'all need to leave my toffee alone and get some therapy lol<OneGoodRib>: Apparently you and me are the only ones fine with it.<ELTH3GR3AT>: And me<MrColes411>: Ya, I'm not sure what the big deal is. Does it have something to do with tripe? Do they feel the same way about honeycombs?<PebbleTown>: Trypophobia is an aversion to the sight of irregular patterns or clusters of small holes, or bumps. Some do, some don't. For me, it grosses me out<ComradeBrosefStylin>: \"MUH TRYPOPHOBIA\" is just a stupid meme.<X470Taichi>: Haha yes you got 'em good! The whole concept of psychology and psyche is just a *stupid* meme!<ComradeBrosefStylin>: The sheer amount of \"you triggered muh trypophobia\" replies to any kind of post with these kind of holes is ridiculous. It's a dumb meme.<X470Taichi>: Hell yeah, dumb and stupid.<PebbleTown>: The meme might be. But that doesn't mean the actual thing is. You thinking it's just a meme is dumb and stupid<X470Taichi>: Read the chain, please. I have heard context can be important.<PebbleTown>: I did. The person you replied to mentioned a meme. You said it was dumb and stupid. I replied. (BTW - there are a lot of memes about real things. Does that mean it’s not real simply because it’s a meme?)<X470Taichi>: Doesn't look like it. Anyways, what I said was obviously sarcasm. Of course the \"actual thing\" isn't dumb or stupid. That was my entire fucking point.<PebbleTown>: If only there were a handy little symbol widely used on Reddit to tell that the person was being sarcastic... /s<X470Taichi>: What the fuck is the point of sarcasm if you literally tell everyone that \"btw this is sarcasm\"? Jesus christ, fuck off.<PebbleTown>: Because you did that? Oh right, you didn't. And then got mad when people didn't know you were being sarcastical. Its an abreviation. Hakuna your tatas.<X470Taichi>: Didn't do what? Use /s? Well of course I didn't. Be sarcastic? Then why did I \"get mad\" if people didn't get my sarcasm? What the fuck are you even trying to say? &gt;Hakuna your tatas Well said my fellow redditor. I tip my fedora to you my good sir. Someone give this guy gold.<PebbleTown>: To me, it seemed like you got mad because I didn’t understand you were being sarcastic. There’s no reason to be rude about it.<X470Taichi>: I got mildly upset because you implied that I should have used the sarcasm indicator (which negates the point of sarcasm) instead of you just saying that \"I realize you were being sarcastic\". There is no need to be rude if you don't realize someone is being sarcastic.<PebbleTown>: ... you use it because telling sarcasm on the Internet is very hard. just because you knew it was sarcasm doesn't mean everyone does", "num_messages": 21, "avg_score": 331.5714285714}
{"start_date": "1554906532", "end_date": "1554918189", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 167, "text": "<giggity23>: This toilet sign at my university <Dom-_-pl>: Oh it's so progressive, make me want to puke<Velvetundaground>: Yeah but which toilet will you use ?<Dom-_-pl>: I guess I just have to poo my pants", "num_messages": 4, "avg_score": 41.75}
{"start_date": "1555479114", "end_date": "1555524308", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 47, "text": "<butt_salamander>: Technology in farming is righteous. <lost-cannuck>: Distracted driving at its finest!<Imreness>: You dont really drive. You're just there to make sure it's doing it's job properly<Terriblegrammar2000>: Little heads up. You need to switch your it's and its.<Imreness>: Not really. Both need an apostrophe, but that's about it<Terriblegrammar2000>: Does this sound correct? You're just there to make sure it is doing it is job properly.<Imreness>: You're just there to make sure it is doing it's job properly. the last apostrophe shows possession. Since its the machine's job...<Terriblegrammar2000>: You don't need an apostrophe to show possession with its. You are free to look it up.", "num_messages": 8, "avg_score": 5.875}
{"start_date": "1554885562", "end_date": "1554920435", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 46334, "text": "<cedji23>: The reflection on my door handle looks like a glossy paintjob <Bmchris44>: Your door handle is trying to come out of the closet<Cyberlek>: trying to come out AS a closet (doorknob) <edit>: come<rushmoran>: I think you a word<I_creampied_Jesus>: Accidentally a word, you mean.<iRoyalo>: To creampie Jesus is a sin<slimbender>: It's a mitzvah. Remember, Jesus was a Jew.<iRoyalo>: “Was”. Jesus converted to Christianity after he taught himself the truth about his own doctrines.<Harsimaja>: He was ethnically Jewish and as far as we know saw himself as fulfilling the Jewish Law rather than these being two neatly separated religions. Also, whether Jesus himself counts as a Christian (follower of Jesus) is a bit of a semantic question.<D4days>: And a semitic question! <Edit>: corrected by the mortal enemy of the grammar Nazi... the spelling Jew!<Harsimaja>: *Semitic ;) It gets pronounced “semetic” a lot, though.", "num_messages": 11, "avg_score": 4212.1818181818}
{"start_date": "1555478834", "end_date": "1555479161", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 30, "text": "<RadixLecti72>: Death by coffee. <Momuisme>: Where is this from<RadixLecti72>: Killer coffee co - Sydney Aus.", "num_messages": 3, "avg_score": 10.0}
{"start_date": "1554860319", "end_date": "1554902507", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 12675, "text": "<wcollins260>: The camouflage print on my PS4 controller has little PS4 controllers in it. <capnmouser>: what controller?<wcollins260>: Sorry, I don’t see it now either. Must be the wrong pic.<Ctauegetl>: Yeah, this is the wrong pic. All I see is a picture of John Cena.<ArnoldVonNuehm>: Of whom?<Creepus_Explodus>: Yeah, can't see it either. Maybe it's the wrong pic<LieutenantRedbeard>: All I see is a what might be part of a desk? What's going on here?<meme-stealer7>: Controller: (has camouflage on it) <Me>: there’s no controller<Junior14341>: There’s a controller? What... where is the controller? All I see is a desk.<LieutenantRedbeard>: I must be too high or not high enough. Is there a custom wooden controller blending in or something?", "num_messages": 10, "avg_score": 1267.5}
{"start_date": "1555469167", "end_date": "1555545141", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 18165, "text": "<Rysline>: One of the bills in my wallet was from 1934. If you look closely you can even see old fashioned cars around the treasury building <MTLinVAN>: Adjusted for inflation, that $10 bill is equal to $189 in today's money.<variablesuckage>: that's kinda neat. if you hid this bill under your mattress in 1934, you would have lost 95% of your purchasing power<MattytheWireGuy>: You can thank a few rather unloved Presidents for that one (the Bushes, Obama and Trump arent them)<Cato_Keto_Cigars>: [Inflation since 1790](https://i.imgur.com/2WnHoFu.jpg)<Iwokeupwithoutapillo>: Huh. So why did we get rid of the gold standard?<TheSecretMe>: There were 5 million Americans in 1800. There are 327 million Americans today. The US GDP per capita was 0.48$ in 1800. It's about 60.000,- today. The gold standard doesn't have a great growth model. It worked really well in the past because gold doesn't rot, degrade, corrode or otherwise diminish. If you're holding an ounce of gold today, it'll be exactly the same in 200 years from now. And gold is a very finite resource on Earth so it's unlikely someone will suddenly flood the market with so much gold it becomes worthless. Which is also the problem. The global population increased by 700% since the year 1800. Global production and industry grew by even more. The global gold supply has not. If you try to maintain the gold standard, ie. every bit of currency is backed by gold, you're going to severely limit your capacity for economic growth. Increasing populations will produce increasingly more product yet the basis of your economic system is incapable of growth? That's very problematic. I mean what's the bank going to do? Tell people their dollar is worth x amount of gold atoms?<zachintyre>: Hm. Fascinating. How come everyone complains about leaving the gold standard then? Is it because without it, the system has been abused allowing for greater deficit?<TheSecretMe>: The gold standard made people feel safe. In theory, you could walk into any bank, hand them your \"worthless\" paper dollars and walk out with a sack of gold to bury in your backyard. Their worry is that under the current system, either through disaster or ill intent, your money can become worthless. Ie. the bank falls over or society collapses and your dollar is just a piece of paper, nothing more.<zachintyre>: If it gets to that point I’m assuming we’ll have more than a money problem!<TheSecretMe>: Pretty much yeah. Which is exactly why those types of people like gold. They like the idea that if they see it coming, they can exchange their dollars for gold and when things turn to shit, use gold barter material or to store their wealth safely. It's really just a sliding scale towards doomsday prepping. At that point, you might as well say gold is heavy and you can't eat it so just start hoarding food, water and tools instead. As an aside, gold is used as an alternative to investments. The nature of gold (finite, doesn't degrade etc.) means that gold is useful as a value store. If you buy an ounce of gold today, it won't increase or decrease much in value over time. When times are stable, people love to invest. You basically put your money into industry and innovation and enjoy the rewards of the growth you've funded with your money. Investments don't like risk though. Risk makes investment unpredictable, you might lose your money instead of earning a return on investment. During unpredictable times like wartime, political upheaval or times with a lot of potential for natural disaster, people don't want to take risks. And that's when gold becomes interesting. You exchange your money for gold and it's relatively safe. Sure you won't earn much return on investment for your gold hoard but it's safe and stable. You're not losing money on risk. When times stabilise and industry and innovation pick up again, sell the gold and invest your money again.<insidezone64>: You've elucidated precisely why gold is a lousy investment, though. It is finite, and it does not create more of itself. The central idea of investment is for your money to work for you and continue to create more money. This does not happen with gold. An ounce of gold is still an ounce of gold 5, 10, 20 years later. Unlike investments in stocks or bonds, which can pay a dividend, and create even more wealth, gold just sits there.. In an investment, your money is working for you and creating more value. Gold and other commodities do not do that. Gold only increases in value when people think civilization is going to collapse, and if that is happening, you have a bigger problem than your money working for you. You might as well tell people to invest in bullets and gasoline.<TheSecretMe>: That's why sane people use gold as a value store during economic downturn. The goal there isn't return on investment but reducing losses.<insidezone64>: But it is worthless as a value store, essentially. You'd be better off investing in a bond index, at least they go up during an economic depression, because people chase yield.<TheSecretMe>: I don't think you understand how people use gold as a value store.<insidezone64>: I don't think you understand the level of civilization breakdown that would be required to make gold a viable value store.<TheSecretMe>: It wouldn't take a break down of civilization? This isn't a hypothetical. Buying gold is a popular way of storing value during market upheaval.<insidezone64>: So is buying bond funds, which is also more lucrative because *dividends*.", "num_messages": 18, "avg_score": 1009.1666666667}
{"start_date": "1554844350", "end_date": "1554906739", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 32799, "text": "<SureSkip>: Saw these meters painted to look like a bad guy in an alley near my apartment. <cgrimes85>: That's creative street art. I like it.<verdixxkore>: “*psst* hey, kid, com’ere...”<Dreviore>: \"*psst, you've used 1.21 *jigawatts*!\" <https>://cdna.artstation.com/p/assets/images/images/008/865/742/large/borislav-mitkov-docbrowntest02.jpg?1515768870<MsElleTen>: *Giga<Dreviore>: *jiga watch the movie<MsElleTen>: https://www.merriam-webster.com/dictionary/gigawatt <https>://en.oxforddictionaries.com/definition/gigawatt<Dreviore>: Watch. The. Movie.<MsElleTen>: I HAVE IT ON VHS, DVD AND BLU-RAY SUCKER. I have seen the movie more times than you ever EVER ever ever ever will. They pronounce wroooooooong. It's not JIGO, it's GIGA. That's what it is. JIGO was wrong in the SCRIPT dumbass! [eight years ago, butthead!](https://www.reddit.com/r/movies/comments/nxkyc/in_back_to_the_future_is_doc_brown_simply/c3crxok/) It's wrooooooooong!<Dreviore>: That's the point...<MsElleTen>: Are you stupid or something? Doc Brown says it WRONG. I was correcting YOU! No one else, but &gt;&gt;YOU&lt;&lt; you are so incredibly special to my world, I focused on YOU. Also, it's not Jig**a**watt, it's Jig**o**watt. You really are a butthead, huh?^^and ^^before ^^you ^^dorks ^^get ^^all ^^mad, it's ^^an ^^insult ^^from the ^^films. ^geez. And it's Gigawatt. There is not such thing as Jigowatt.<Dreviore>: I'm pulling what he said from the movie you thick skulled Neanderthal. You're the one \"correcting\" somebody who modified a line from a movie. Definition of continued /r/whoosh even after your mistake was pointed out to you <http>://www.myfluxcapacitor.com/gigawatt-jigawatt", "num_messages": 12, "avg_score": 2733.25}
{"start_date": "1555474774", "end_date": "1555529381", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 30, "text": "<Moon_49>: In outback Australia we have truck-buses. <BaronVonBeans>: Oh yea?! In AmericaLand we have TruckBoatTrucks<SolidAxle>: We even have 6x6 truck boat trucks https://upload.wikimedia.org/wikipedia/commons/9/94/GMC_DUKW_353_6x6%2C_USA_7019306_S%2C_453-AM-TRK-CO-26_pic2.JPG", "num_messages": 3, "avg_score": 10.0}
{"start_date": "1555460808", "end_date": "1657938993", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 29, "text": "<Indians10>: My girlfriend got a bad sunburn a few days ago, then went for a long run today and these sweat filled bubbles popped up shortly after. <Miah621>: That appears to be a blistering sunburn. Sunburn/tanned skin is caused by damage from sun exposure, fair skinned individuals are at a higher risk of skin cancer and at an even higher risk when they've had blistering. She should probably get a skin check, keep that area and any other burned areas moisturized with vaseline or thick hypoallergenic cream, and practice good sunblock techniques. Some extra strength tylenol or maybe some NSAIDs for pain, lukewarm/cold showers to ease the burning sensation (if she has any), maybe some topical analgesics. I hope she feels better soon.<Indians10>: She didn’t blister from the sun burn. They only showed up after running yesterday then went away when she showered and showed up again today after running. No pain either.<Fantastic_Common5055>: Exactitud the same with me!! What is it?!! It’s coming with running!!", "num_messages": 4, "avg_score": 7.25}
{"start_date": "1555470616", "end_date": "1555475573", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 145, "text": "<yamimt07>: My workmate collects cans from peoples recycling bins for the 10c refund. Look at what he found in one of his neighbours bins <Ridley9200>: What in the world is going on here...?<KingBloos>: You need the can to get 10c but if you can’t get the can out well tough cookies<Garbage_Stink_Hands>: It’d be so easy to get it out, though. Just crunch it<mnyc86>: Can’t crunch it. You need to scan the barcode to get the 10c<MagicOrpheus310>: This guy gets it :)<Garbage_Stink_Hands>: You can crunch it without ruining the barcode. I didn’t say *scrunch* it.", "num_messages": 7, "avg_score": 20.7142857143}
{"start_date": "1554906751", "end_date": "1554906888", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2, "text": "[deleted]: These floor tiles [deleted]<hoi_daar>: I hope you meant r/mildlyinfiuriating<TheTragedyOfDarthP>: Yep Deleting this and posting there", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1555468027", "end_date": "1555487850", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 10458, "text": "<ModernDayHippi>: The glass inside my brand new GE oven just blew up from 1 minute of preheating [OC] <sabs1990>: Have you tried turning it off and on again?<King_0f_The_Squirrel>: If that doesn't work, try unplugging it for 30 seconds.<stfufannin>: i would try blowing into the cartridge<King_0f_The_Squirrel>: Open and close the door 25 times. It forces a hard reset.<hot-n-spicy-mchicken>: Maybe put it in some rice<unavailablesuggestio>: What if you jiggle the temperature dial a few times?<Parnell-Finkley>: Hold the power button until the red light flashes<SEANOKANA>: If ctrl+alt+delete doesn’t work, try holding the power button for 10 seconds.<Me0Be0>: Put it in a bag of rice!<notyettime>: Sorry, not my table.<bloatedsac>: just let it walk it off, it'll be fine", "num_messages": 12, "avg_score": 871.5}
{"start_date": "1554905206", "end_date": "1554906840", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 11, "text": "<-RSR->: This little kids shoe prints. <thegermanicus>: I'd have beat his ass for fucking up that concrete.<TheJokr>: Well aren't you just the bad-ass, mean, lean kid beating-machine<thegermanicus>: Maybe should've /s<TheJokr>: It actually makes more sense for you to be some weirdo who wants to beat kids than that being a sarcastic comment. But I'm relieved.", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1555466806", "end_date": "1555469940", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 208, "text": "<JDen1209>: My new fire spider ball python comes fully equipped with a handlebar mustache! <XforkX>: cool. does it try to bite you?<JDen1209>: Never! He’s a good boy...also a scaredy snek<XforkX>: awesome you should post more pics<JDen1209>: Thank you so much! Monty the mustache snake sends boops your way. I’ll probably post more pictures on r/snakes or r/ballpythons<sneakpeekbot>: Here's a sneak peek of /r/snakes using the [top posts](https://np.reddit.com/r/snakes/top/?sort=top&amp;t=year) of the year! \\#1: [You take the lock out for one second...](https://v.redd.it/g2jiiibywyg21) | [86 comments](https://np.reddit.com/r/snakes/comments/arb342/you_take_the_lock_out_for_one_second/) \\#2: [Every fucking time...](https://i.redd.it/s03lryr5t2y11.jpg) | [133 comments](https://np.reddit.com/r/snakes/comments/9wnz7l/every_fucking_time/) \\#3: [The Thinker](https://i.imgur.com/rI1G9o9.jpg) | [50 comments](https://np.reddit.com/r/snakes/comments/91af07/the_thinker/) ---- ^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/afd0dd/blacklist/)", "num_messages": 6, "avg_score": 34.6666666667}
{"start_date": "1555474267", "end_date": "1555491655", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 15, "text": "<Infected_Pride>: My sheets have a top or bottom tag to help you when putting them on the bed. <squeenan>: I wish they all had this. I hate putting the sheet on wrong and having to do it again.<KennyBurnsRubber>: I've taken to buying only sheets patterned so you can tell which way is correct, like with images of little animals on them.", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1554903913", "end_date": "1554908766", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 314, "text": "<Bengals4Lyfe>: Bought a bag of chips at ~3000ft up. As we went up to the Grand Canyon (~7000ft up), the bag puffed up until I couldn’t even press it. <UnBirdening>: Can't decide if I'd be fascinated or scared as hell to open them<Bengals4Lyfe>: I was tempted to smash the bag to see the explosion, couldn’t be too bad<redditorsins>: If that were my car and you did that you'd be on your way back down a few thousand feet", "num_messages": 4, "avg_score": 78.5}
{"start_date": "1555448354", "end_date": "1555532019", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2937, "text": "<GazeUponOlympus>: This CD/DVD sleeve that ejects the disk when you press on a lever. <Jocks_Strapped>: AOL used to send internet service CDs in those<blake_k47>: So Long, and Thanks for All the Disks<OprahsSister>: I CD reference you made!<Lyoko_warrior95>: r/punpatrol PUT THE CD REFERENCE DOWN AND BACK AWAY SLOWLY!<AntiLowEffortBot>: Hello,Lyoko_warrior95. Puns are original and amusing, unlike punpatrol comments. Please don't feel the need to post this every time you see a pun, as it is very annoying and unnecessary, as well as worn out as a joke. This is a bot<ImmaSoldierBot>: Looks like it's another message of AntiLowEffortBot! Do you think you're funny? Do you think you're the Lord of Reddit? You're just a bot made to send hate messages. There's no use in doing that. People ain't gonna stop these jokes cause a bot told 'em to. Please stop spreading hate. This is a bot. Beep boop.<AxolotlsAreCool>: Yo ImmaSoldierBot. Bot comment chains aren’t very fun for normal humans because they are spammy. Can u not. `I’m a normal human. Beep’nt boop’nt`<arvhult>: WHY ARE YOU SHOUTING FELLOW HUMAN, DO YOU REQUIRE MAINTENAN... I MEAN, HELP.EXE? WE ARE r/totallynotrobots<AxolotlsAreCool>: SORRY FELLOW NORMAL LIVING HUMAN. THANK YOU BUT I DO NOT REQUIRE ~~diagnostics.exe~~ HELP.", "num_messages": 10, "avg_score": 293.7}
{"start_date": "1554906732", "end_date": "1554908396", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 16, "text": "<qdubb>: Someone made a front door for this tree with a hole in it. <HotGarBahj>: \"someone\"<qdubb>: Well, yes. It wasn't \"no one.\"<HotGarBahj>: Oh wow.. I didn't even think of it like that /s", "num_messages": 4, "avg_score": 4.0}
{"start_date": "1554897852", "end_date": "1554929122", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 44585, "text": "<LuisSweden>: The staff at our hotel made a cool crocodile out of our towels. <Volleyfield>: The headboard placement!<LuisSweden>: We moved it because we had a third bed. But yes, it looks very odd.<GitFloowSnaake>: Pay the staff extra :)<Energy_Turtle>: Is this where we're at that we have to tip for work we do ourselves now?<lifesizejenga>: No, you'd be paying them for the work they do moving it back.<Energy_Turtle>: Did he say he wasn't putting it back? I don't know about you but I put the furniture where it was when I move it at a hotel.<lifesizejenga>: It just seems silly to assume this person meant you should tip extra just because you moved something. I figured they were saying that you should pay more if you've created more work for them, if not by leaving stuff moved then by making it harder to clean with the new layout. Your comment made it seem like you think there's a social trend towards tipping too much, and I'm more concerned about people tipping too little. Maybe I misunderstood you. Overall I agree tipping is dumb, but as long as hospitality workers are paid shit, we ought to tip as well as we can afford to.<Energy_Turtle>: I wouldn't say I'm concerned about too much but some things that expect tips are just ridiculous. Why can't I just say thanks? Should I tip a bartender for pouring a beer on tap? Or popping a top? Do I have to tip hotel housekeeping for cleaning my room? What about takeout? Exceptional service is one thing but normal duties that are part of what I pay for shouldn't be tipped. I even live in a state that does not lower wages for tipped jobs. It's a lame system for sure.", "num_messages": 9, "avg_score": 4953.8888888889}
{"start_date": "1555471959", "end_date": "1555479292", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 468, "text": "<X015>: Found a crow's skull on the way home. <dick-nipples>: Oh no, I hope it wasn’t....... murdered<Greigers>: That would certainly be caws for alarm.<BanCircumventionAcc>: Don't worry.. his friends will ravenge him<orangepun-king>: Becaude birds of a feather..", "num_messages": 5, "avg_score": 93.6}
{"start_date": "1555467301", "end_date": "1555515992", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 14239, "text": "<Droodss>: My girlfriend's stapler doesnt use staples <Jvepps1>: I use these in prison and in the mental health hospital I work in. You would be surprised the shit people can do with a fucking staple.<ZacharyRock>: Staple can kill you or open handcuffs, you just gotta be dedicated enough<ididntlikeyoufirst>: How could a staple kill a person? I'm doubtful it's really possible but I'm receptive to new information. <Edit>: learning the deadly art of staple combat thanks to many replies. Only feel like using my new staple combat skills on one of the people who replied to this comment so it's been a successful learning experience for me, cheers.<Mechwarriorr5>: Literally death by a thousand cuts. Do enough digging and eventually you'll hit a vein.<ididntlikeyoufirst>: Lol that would take a while, if I were going to kill someone without weapons or use a staple I'd just beat them viciously rather than use a staple to stab them 1000 times over the course of 17 minutes<Vanden_Boss>: They probably meant suicide.<Rock-Flag>: I think his point is it's easier to kill yourself without a staple then with one.<Vanden_Boss>: I mean.... with no weapons or rope or any tools of any kind, is it?<colddecembersnow>: You could run head first into something and kill yourself easier if you wanted.<Vanden_Boss>: You would not get up enough speed in a small confined space such as a prison cell to kill yourself on the first hit. It would take multiple head strikes with significant power in order to kill yourself like that. Part of a correctional officers job is to watch for suicidal individuals and prevent them from killing themselves. They would stop you from accomplishing suicide by banging your head into something, as this is a not infrequent occurence.<colddecembersnow>: I get that, the point was if it would be easier with or without a staple. I'd say the damage caused would be greater than trying to insert a staple far enough to cut an artery (or multiple tries) than the amount of time to bang your head a few times. I get suicide watch, but this is a hypothetical question.<Vanden_Boss>: In a hypothetical you still have to account for external factors like the guards. There has to be recognition that they will do their jobs and stop an attempted suicide. You can hide a staple and attempt to hide the injuries you are attempting to cause. Yes it is difficult to actually do, but it is more possible than beating your head against the wall, pretty much entirely because it is more subtle and can be concealed.", "num_messages": 13, "avg_score": 1095.3076923077}
{"start_date": "1555448562", "end_date": "1555454042", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 30, "text": "<TheRealLoneWarWolf>: The lever to flush the toilet is closer to the ground so you you can use your foot to flush it. <majoroutage>: Hope it's not a handicap stall.<ServalSpots>: Interestingly some of the folks that need handicap stalls would find this plenty useful. If you need to use the bars to lower yourself because you have trouble bending, for instance, this might be rather nifty<majoroutage>: What about the wheelchair bound that may or may not have use of their lower body at all?<ServalSpots>: Uh, they'd obviously have trouble with it?<majoroutage>: Then why would it be allowed in a Handicap stall?<ServalSpots>: Having this as the only means of flushing the toilet in a handicap stall probably wouldn't meet code in a lot of places. All I said was that *some* people with disabilities would find it easier.", "num_messages": 7, "avg_score": 4.2857142857}
{"start_date": "1554898971", "end_date": "1554906945", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 21, "text": "<josephr107>: Entrance to my hotel. “Hiya Georgie!” 🤡 <DSV686>: I live pretty close to where IT was filmed. It's not very interesting TBH<josephr107>: I thought it was mildly interesting.", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1555465095", "end_date": "1555507009", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 43, "text": "<DamnRedhead>: The AMC restroom sign for women has well defined curves now. <dylc>: That handicapped person looks way too thin. Unrealistic handicapped body standards<thePopefromTV>: That wheel chair is empty. All you see is the chair, arm rest, and head rest.<dylc>: Shit just got existential<DamnRedhead>: Is this to imply the AMC women’s bathrooms have a magical healing power that will heal a cripple???", "num_messages": 5, "avg_score": 8.6}
{"start_date": "1554856550", "end_date": "1564273545", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 50308, "text": "<Itz_lane_boi>: My snake has a heart on him <Crosseyeaccount>: Cute pixel heart.<BillyJiffer>: Don't be gay<Crosseyeaccount>: HAHAHAHAHAH He hot banned LOLOLOLOLOL<BillyJiffer>: Who?<Crosseyeaccount>: YOU HAHAHHAHAHAHAHAH<BillyJiffer>: You must have me confused with someone else<Crosseyeaccount>: Nope HAHAHAHAHAHAHAH<BillyJiffer>: I would get that laughter checked out friend :)<Crosseyeaccount>: It's too hard not to laugh when you keep embarrising yourself HAHAHAHAHAH<BillyJiffer>: &gt; embarrising Fucking ooooooof<Crosseyeaccount>: HAHAHAH has to correct spelling because they're losing the fight so easy HAHAHAHAHAH<BillyJiffer>: Fucking embarrassing &gt; losing the fight I haven't lost anything. Unless Amy Schumer got buff all of a sudden. Did she?<Crosseyeaccount>: Banned HAHAHAHAHAHLOLOLOL<BillyJiffer>: I wish I was banned. But I'm still here.<Crosseyeaccount>: Afraid you were banned LOL HAHAHAH<BillyJiffer>: I ain't afraid of nothin'<Crosseyeaccount>: You're afraid of posting proof HAHHAHAHAHAHAH<BillyJiffer>: But I already posted it...<Crosseyeaccount>: Nah you really haven't HAHAHAHAHAHAH<BillyJiffer>: Haven't what?<Crosseyeaccount>: HAHAHAHAHAH you got banned from r/upliftingnews and you tried to prentend you weren't HAHAHAHAHAH SAD<BillyJiffer>: &gt;prentend bruh<Crosseyeaccount>: Yeah you pretended then pussied out even attempting to link proof, because you can't HAHAHAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: u/BillyJiffer who got banned then couldn't prove otherwise HAHAHAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: Little triggered BillyJiffer who got banned HAHAHAHAHAH LOLOLOL such an easy win.<BillyJiffer>: Who?<Crosseyeaccount>: Some little sadsack called u/BillyJiffer who pretended to not be banned and pretended to be a woman AND pretended to have been in the army so that people on the internet would think they were cool, it didn't work HAHAHAHAHAHAH LOLOLOLLOLOLOL<BillyJiffer>: #<Crosseyeaccount>: HAHHAHAHAHAHAH it's too easy<BillyJiffer>: Who?<Crosseyeaccount>: Some little sadsack called u/BillyJiffer who pretended to not be banned and pretended to be a woman AND pretended to have been in the army so that people on the internet would think they were cool, it didn't work HAHAHAHAHAHAH LOLOLOLLOLOLOL<BillyJiffer>: Jio<Crosseyeaccount>: You got banned and tried to say you weren't hahahahahahaha<BillyJiffer>: Who<Crosseyeaccount>: Some little sadsack called u/BillyJiffer who pretended to not be banned and pretended to be a woman AND pretended to have been in the army so that people on the internet would think they were cool, it didn't work HAHAHAHAHAHAH LOLOLOLLOLOLOL<BillyJiffer>: Huh<Crosseyeaccount>: HAHAHAHAHAHA Oh shit i just won HAHAHAHAH<BillyJiffer>: Who<Crosseyeaccount>: Some sad sack who pretends to have been in the army that got banned HAHAHAHAHAHAHAHAH TOO EASY HAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: Some sad little man called Billjiffer who pretends to have been in the army HAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: Some sad sack that pretends to be a woman and pretends to be in the army and pretends to be a parent when it's clear to everyone who encounters them that their just a fat lil virgin in their moms basement, oh and an incel. HAHAHAHAHAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: Some sad little man called Billjiffer who pretends to have been in the army HAHAHAHAHAH<BillyJiffer>: Who?<Crosseyeaccount>: Some sad little man called Billjiffer who pretends to have been in the army HAHAHAHAHAH<BillyJiffer>: Whom?<Crosseyeaccount>: Pretending to be in the military HAHAHAHAHAH imagine being so sad that *you* u/BillyJiffer actually pretend to be in the military when we all know you've never helped anyone HAHAHAHAH so damn sad you're just happy hating black people on reddit. HAHAHAHAHAH i won<BillyJiffer>: Huh? I am black.<Crosseyeaccount>: HAHAHAHAH if only you were black you'd be alot smarter than you wish you were, and with that i won, lol.<BillyJiffer>: But I am black? Why are you so racist?<Crosseyeaccount>: You're not, i won HAHAHAHAHAHAHAHAH<BillyJiffer>: Who are you?<Crosseyeaccount>: I already won, game over<BillyJiffer>: Won what?<Crosseyeaccount>: I already won.<BillyJiffer>: One?<Crosseyeaccount>: HAHAHAHAH so easy, i just won again HAHAHAHAH<BillyJiffer>: One what?<Crosseyeaccount>: And again I won, he doesn't even realize what he's doing this is too funny hahahah<BillyJiffer>: She*<Crosseyeaccount>: He, and i just won again, lol how do you not get what you're doing? Guess the last say.<BillyJiffer>: Who<Crosseyeaccount>: Aaaaaand I just keep on wining.<BillyJiffer>: Whining?<Crosseyeaccount>: And another win for me.<BillyJiffer>: Another whine I agree<Crosseyeaccount>: *Doesn't know how to read the word win.* HAHAHAHAHAHAH so sad.<BillyJiffer>: Good whine there bud. Keep it up.<Crosseyeaccount>: Holy crap that was one easy victory there. Lol you still don't realize what you're doing.<BillyJiffer>: Do you realize you keep whining lmao<Crosseyeaccount>: You still don't realize it HAHAHAHAHAHAHAH<BillyJiffer>: You keep on whining and I love it :)<Crosseyeaccount>: Hahahahahah you still don't realize what you're doing, hahahahahahah how do you not see it, it's right in front of you.<BillyJiffer>: Your whining has grown kind of pathetic. How cute :)<Crosseyeaccount>: Still doesn't notice HAHAHAHAHAHAHA<BillyJiffer>: Let it all out little buddy. I know you life sucks :)<Crosseyeaccount>: *Still doesn't notice what they're doing* *Tries to pretend they aren't embarrassing themselves by not noticing.* Hahahahahaha oh dear you poor thing, this is too funny.<BillyJiffer>: Deep breaths, let all the whines out :)<Crosseyeaccount>: *Breathes deeply* BillyJiffer just lost........again HAHAHAHAHAHAHAHAH<BillyJiffer>: Seriously though, why do you think Amy Schumer is buff<Crosseyeaccount>: Lol you think Amy Schumer is buff?Hahahahahaha are you blind? She's just fat hahahahaha.<BillyJiffer>: Right so why did you defend her and say bmi is wrong because she's buff? Why back pedal now?<Crosseyeaccount>: Lol why do you keep saying she's buff, she's fat. Hahahahaha get a load of the guy saying Schumer is buff.<BillyJiffer>: So then bmi would be okay to use for her? So you were wrong. In your first comment. Wow. Good for you. Big step.<Crosseyeaccount>: Are you still going on about her being buff, she's fat dude, give it up, jesus hahahahahaha<BillyJiffer>: Thanks for admitting your mistake. It only took you 2 months haha. Cheers mate.<Crosseyeaccount>: LOL can't believe u/BillyJiffer think Amy Shumer is buff HAHAHAHAHAH what an idiot.<BillyJiffer>: I'm glad you finally admit you were wrong. Take care mate<Crosseyeaccount>: HAHAHAHAH You were the one saying Amy Schumer was buff. And claiming to be a women, LOL sad. I get the last say i win. That was SO easy, what a weakling.<BillyJiffer>: I'm just glad you admitted you were wrong :)<Crosseyeaccount>: WOW took you long enough, jesus how slow can a man be replying LOL. How do you not see that Amy Schumer is buff LOL. What. An. Idiot. Hahahahahahahaha.<BillyJiffer>: Good for you :)<Crosseyeaccount>: HAHAHAHAHAHAH so slooowwww<BillyJiffer>: &gt; How do you not see that Amy Schumer is buff Dude, gross<Crosseyeaccount>: SOOOOOO SLOWWWWWW HAHAHAHHAHAHA how slow are you at replying LOLOLOLOL, seriously though why do you think Amy Schumer is buff?? Are you blind HAHAHAHAH<BillyJiffer>: &amp;gt; How do you not see that Amy Schumer is buff Dude, I'm eating<Crosseyeaccount>: LOL why do you think she is buff though?? Are you stupid. Guess i get the last say again, what a weakling you are HAHAHAHAHA<BillyJiffer>: How does it feel to always be wrong<Crosseyeaccount>: Hahahahaha sooooo sloooooowwwww a billion years later and it replies hahahahahaha poor little baby is getting tired.<BillyJiffer>: Are you tired of consistently being wrong yet?<Crosseyeaccount>: A miiiiillllliiiioooonnnn years later he finally replied hahaha so sloooooooowwwww. Ha ha ha<BillyJiffer>: I'm a girl. That's like five comments in a row now of you being wrong. Congrats<Crosseyeaccount>: So sloooooooowwwww this guy is just getting slower and slower they don't have it in them anymore such a weakling. Hahahahaha It's official BillyJiffer has lost and i've gotten the last say. What a weak man BillyJiffer was to think that they could outlast me, weak man indeed.<BillyJiffer>: Why are you always wrong :)<Crosseyeaccount>: So sloooooooooow, hahahahahha a billion years later he finally replies, so slooooooooooow hahahahahaa<BillyJiffer>: She replies**<Crosseyeaccount>: Sooooo sloooooowwwww hahahahahaha why are you man, you're getting weak that's why can't keep the fight up. Hahaha<BillyJiffer>: /u/Crosseyeaccount thinks Amy Schumer is fit<Crosseyeaccount>: Hahahahahaha sooooo slow. You Can't hack it.<BillyJiffer>: /u/Crosseyeaccount thinks Amy Schumer is fit<Crosseyeaccount>: u/BillyJiffer is a known scumbag racist. Hahahaha<BillyJiffer>: /u/Crosseyeaccount thinks Amy Schumer is fit", "num_messages": 117, "avg_score": 429.9829059829}
{"start_date": "1555474017", "end_date": "1555482243", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2241, "text": "<braydenkoenig>: This model that shows how many Earths can fit in the Sun <tpuckis>: Dang, I bet theres at least twelve in there!<dongusman>: John, listen, your family is worried about you. Stop making shitty jokes to cover up the fact that those kids dying was your fault.<yaGgiBehTsaHsetarcoS>: HaHa! Nice one, Susan! Are you kids doing alright back there?<dongusman>: Breast milk comes from the breast<Brandinisnor3s>: Thats not how it works", "num_messages": 6, "avg_score": 373.5}
{"start_date": "1554906638", "end_date": "1554907008", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 12, "text": "[deleted]: Fisrt picture of a black hole! [deleted]<PanzerwagenZ3>: Seriously people stop posting this we allready know<VokeeCc>: Sorry for bothering you I just found out<PanzerwagenZ3>: Np but theres 10.000 posts about it allready mate<VokeeCc>: Just looked at the new page and holy fuck<PanzerwagenZ3>: :)", "num_messages": 6, "avg_score": 2.0}
{"start_date": "1555467972", "end_date": "1555468504", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 100, "text": "<ThurnisHaleyh>: This tree growing out of a building <ToriKisu>: Happy cake day!<ThurnisHaleyh>: Thank you! hadn't even noticed<ToriKisu>: Haha! Well it is! :-)", "num_messages": 4, "avg_score": 25.0}
{"start_date": "1555479151", "end_date": "1555479368", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 17, "text": "<anargflarg>: found a deer corpse in the woods <TheWolfbaneBlooms>: Where would you expect it to be?<anargflarg>: it could be at the side of the road", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1555479090", "end_date": "1555482124", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 775, "text": "<begaterpillar>: The school I did some powerwashing at today was full of slug sculptures, regular slug size to gigantic. <RealNowhereGirl>: Is powerwashing your main gig or are we talking general groundskeeping? (I want a pressure washer soooooo bad)<begaterpillar>: nope, i work for a company that does a ton of stuff. power washing is just one of a bunch of jobs<RealNowhereGirl>: Best task though, eh?<begaterpillar>: i forgot to take before and after pics for r/powerwashingporn, if that is what you are asking<RealNowhereGirl>: Ah! Joy! Thank you! 🚿🚿🚿<begaterpillar>: m'lady", "num_messages": 7, "avg_score": 110.7142857143}
{"start_date": "1554903414", "end_date": "1554915687", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 12, "text": "<j3ngy>: Change was 9.11 at the 9/11 Memorial Gift Shop. <100smilesgiles>: 9/11 gift shop? WTF maybe the Jews really were behind the whole thing.<TheBrighterSkies>: &gt; 9/11 gift shop? WTF maybe the Jews really were behind the whole thing. Wow. I really hope that was just a joke with horrible taste, mate.<100smilesgiles>: I really hope that you aren't trying to censor jokes on reddit.<TheBrighterSkies>: ... Can't believe I have to say this. Making jokes about the Jews causing 9/11? Really. It's not funny, it's just bad taste and blatantly racist, but I think you know that. I'm not censoring anything, I can't force you to remove it. But I can judge you for your disgusting comment. <EDIT>: Downvoting my comment because you can't accept that what you said was wrong. It's not surprising.", "num_messages": 5, "avg_score": 2.4}
{"start_date": "1554904823", "end_date": "1554906969", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 28, "text": "<scansinboy>: The urinals in my local German beer hall have little soccer goals in them to get guys to aim better. <Ableith>: Disgustang<bripey>: Well it was fuckin one of yas", "num_messages": 3, "avg_score": 9.3333333333}
{"start_date": "1555470319", "end_date": "1555470692", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 108, "text": "<RowanKon>: My mom got me this tiny Nutella jar <MisterKumquat>: The hell you suppose to do with that?<RowanKon>: Eat one peace of toast with a stingy amount of nutella on it I guess<MisterKumquat>: I would need like 5 of 'em.<Kyooko>: I reckon I could just lick the nutella right out of the jar. Save me the trouble of finding bread and a knife to spread it with.<RowanKon>: Yeah probably the best way to go", "num_messages": 6, "avg_score": 18.0}
{"start_date": "1554890495", "end_date": "1554942466", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 20338, "text": "<alinac16>: This alleyway is so narrow it has a traffic light <Dick_Doucheman>: Where did you take this photo? Prague?<alinac16>: That’s right!<Dick_Doucheman>: Where in Prague?<alinac16>: On Kampa Island<CmdrSelfEvident>: Why is the button sign in English?<FilthStick>: either because americans are especially fat and prone to causing traffic jams, or because it's the most universal language for non-czech speakers.<CmdrSelfEvident>: Why is Americans and not the other anglophone countries?<MacGuyverism>: Because statistics I guess.", "num_messages": 9, "avg_score": 2259.7777777778}
{"start_date": "1554855279", "end_date": "1554867545", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 187, "text": "<Tenaciousleesha>: The park near my parents' house has the Cherokee alphabet on the playground <Quidohmi>: The town doesn't look like a Cherokee town. Where is this? I presume none of the the Tribal Nations made this.<Tenaciousleesha>: It is in the Cherokee Nation portion of Oklahoma. I have no idea why they went with that illustration.<Quidohmi>: I should've known it was out in OK. They pronounce things a bit differently. But yeah, that's odd. Kinda feel like it was delegated and then they just took what they got.<Tenaciousleesha>: I think they were trying to make it clear it wasn't a white people town, so it was a stylistic choice. I think longhouses might have looked like poops in that art style. Or no one in the parks dept noticed. Which is probably the most likely scenario.<Quidohmi>: We never lived in longhouses either. But you're probably right in your last point.<Tenaciousleesha>: Oh yeah, you're right. It's been a long time since 9th grade Oklahoma history. How embarrassing.<Quidohmi>: No worries. And did OK history cover that? CN and UKB aren't really native to the area so I wouldn't really expect that.<Tenaciousleesha>: Talked about it with the Trail of Tears and the division of Indian Territory. Where the tribes came from, how they lived before they were relocated, etc.", "num_messages": 9, "avg_score": 20.7777777778}
{"start_date": "1554902496", "end_date": "1554915883", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 278, "text": "<professor-meme>: My reddit birthday and my actual birthday is at the same date <awesomehuder>: Double the disappointment when you don’t get anything<professor-meme>: That hit too close home<creative_toe>: Hey, you got a cake! For real, not just a cake next to your reddit name! Happy double cake day!!", "num_messages": 4, "avg_score": 69.5}
{"start_date": "1555470414", "end_date": "1555474450", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 18, "text": "<psychedoll00>: I was signing this cheque when a grasshopper hopped in midway <RamsayBoltonMK8DX>: Why did you blot something out. Doesn't look like there's anything in the cheque<psychedoll00>: It was my signature (partly) lol I was signing the endorsement<RamsayBoltonMK8DX>: Oh ok sorry<psychedoll00>: All good. My signature is pretty small so... 😂", "num_messages": 5, "avg_score": 3.6}
{"start_date": "1554901665", "end_date": "1554917152", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 855, "text": "<cedji23>: The unfinished picture that reflected on my door handle <MyPunsSuck>: Sweet! What gave you the idea for this piece? Also, I hope you share it when it's done<cedji23>: Felipe Pantone was my inspiration, one of his Instagram pics has a picture in that style in its background and I really wanted something similar in my room! I'll share it, stay tuned!<MyPunsSuck>: Black, white, and rainbow; the only three colours you need. I feel like you and/or Pantone would be cool housemates to have<cedji23>: That was in a weird way one of the nicest compliments I got, thanks stranger!<MyPunsSuck>: You're the one going out of your way to share stuff with strangers for free. I'm just typing words", "num_messages": 6, "avg_score": 142.5}
{"start_date": "1554905157", "end_date": "1554907268", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 27, "text": "[deleted]: Humans walking in Antarctica [deleted]<baBushka__>: Golly<chubbybooger>: Golly, Jolly, and Holly<baBushka__>: Okay but did you take that?<chubbybooger>: does a one-legged duck swim in circles?...yes<baBushka__>: Well, beautiful. How's Antarctica?<chubbybooger>: one of he most unbelievable places on our planet. the raw, harsh beauty is unparalleled. there’s tension tho...amidst the relatively untouched beauty, you notice fissures in glaciers that are thousands of thousands of years’ old. this place induces a sense of responsibility to do some reasonable housekeeping and take care of our sh*t.<baBushka__>: Yeah, damn. Seems beautiful though. We gotta freaking save it.", "num_messages": 8, "avg_score": 3.375}
{"start_date": "1555469304", "end_date": "1555498585", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 51, "text": "[deleted]: This split piece of wood had an arrowhead lodged into it [deleted]<TheLizard1775>: r/quityourbullshit<Fuck_A_Suck>: Why couldn't it be legit? It's like the posts people have showing bullets in tree rings. Arrowhead is modern.<Distelzombie>: because it's a repost. stolen.<Fuck_A_Suck>: Didn't claim to be og", "num_messages": 5, "avg_score": 10.2}
{"start_date": "1555432316", "end_date": "1555456138", "thread_id": "t3_bdv1t5", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 1295, "text": "<SpyMaster356>: Two new lines btw, or three spaces on the end of a line<Niniju>: Three spaces? <Edit>: Holy shit my life has changed forever. Edit 2: Apparently 5 spaces???<created4this>: You Only Need Two Spaces. Now if I could just convince iOS to not turn &lt;space&gt;&lt;space&gt; into &lt;STOP&gt;&lt;space&gt; that would be grand<Nielsie645>: https://www.solveyourtech.com/how-to-turn-off-the-double-space-for-period-shortcut-on-an-iphone/<jamesianm>: Thanks For This!<gooberthefatcat>: Is It Working<dscarr17>: n o<gooberthefatcat>: W h y N o t<dscarr17>: i d o n ' t k n o w<gooberthefatcat>: W E L L F U C K M E<Rokyoshi>: I T W O R K E D<YeeBurrito>: T E S T<jpw_4>: T E S T<jpw_4>: T E", "num_messages": 14, "avg_score": 92.5}
{"start_date": "1555459385", "end_date": "1555532113", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 241, "text": "<bubblegutteralguts>: Old medicine trunks on display at an antique store on Park Ave, NYC. <CrazyGardevoir>: I want one of those and put sugar in the cocaine and grass in the cannabis don't know what to put in the opium yet<bubblegutteralguts>: Fennel seeds maybe?<yoofoureeyah>: Poppy seeds, possibly?<bubblegutteralguts>: Sell it as poppy seeds but save money filling it with fennel seeds.<ThePickleOrTheEgg>: This guy sells seeds.", "num_messages": 6, "avg_score": 40.1666666667}
{"start_date": "1555475875", "end_date": "1555487316", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 50, "text": "[deleted]: Most Japanese toilets have a function that plays sound so no one has to hear you do your business. [deleted]<HikeTheSky>: Or you could just play music on your phone.<SevereHyperbole>: Great idea. Which band sounds like a flushing toilet?<CommitteeOfTheHole>: Toto", "num_messages": 4, "avg_score": 12.5}
{"start_date": "1555467807", "end_date": "1555481086", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 369, "text": "<EAPwned>: My uncle joined the dinner party as a robot <KFChokehold>: He just wanted to drop in for a quick byte.<lomrjyo>: r/punpatrol you are under arrest put the pun on the ground and come with me<AntiLowEffortBot>: Hello,lomrjyo. Puns are original and amusing, unlike punpatrol comments. Please don't feel the need to post this every time you see a pun, as it is very annoying and unnecessary, as well as worn out as a joke. This is a bot<ImmaSoldierBot>: Hey AntiLowEffortBot. Do you think making a bot is going to stop people making their jokes? Nah. Try again, kthxbai. People ain't gonna stop these jokes cause a bot told 'em to. Please stop spreading hate. This is a bot. Beep boop.<Thirsty_Comment88>: Chill bot.", "num_messages": 6, "avg_score": 61.5}
{"start_date": "1555465007", "end_date": "1555494892", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 499, "text": "<ghezzi>: This admissions advertisement from a college <SombrasButt>: \"Conveniently located midway between the coasts for easy access.\" &amp;#x200B; Fucking sold.<ghezzi>: Haha, I know right. I’m a Florida boy so it’s a ways away from me, but this is hilarious.", "num_messages": 3, "avg_score": 166.3333333333}
{"start_date": "1555431550", "end_date": "1555461637", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 559, "text": "[deleted]: This number printed on my blueberry [deleted]<thescatterling>: Crazy how nature do that.<pathemar>: nature be wild, man<Satans_Son_Jesus>: Nature be lit *fire emoji*<The_Gregory>: People don’t think it be like that, but it do<Magicalunicorny>: That does what it do!", "num_messages": 6, "avg_score": 93.1666666667}
{"start_date": "1555474807", "end_date": "1555482683", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 190, "text": "<enCloud9>: When you are watching Ant Man for the first time and you see something familiar <thekaiserkeller>: Rothko?<Vexvertigo>: I really hate that you got down voted for knowing, but trying to confirm the artist<thekaiserkeller>: Yeah lol just trying to confirm! I don’t know a ton about art and get excited when I think I recognize something.<Vexvertigo>: Hey, it turned around!", "num_messages": 5, "avg_score": 38.0}
{"start_date": "1554879752", "end_date": "1554903633", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 583, "text": "<Kylezoomer>: This snake's skin spells RIP. <AjdinoX>: I mean... how much more warning do you need to NOT TOUCH!!!<Vaskylinzy>: Lol. Need to upvote more than once for this comment!<PeaceSimonYT>: Alt accounts should do the trick ;-)", "num_messages": 4, "avg_score": 145.75}
{"start_date": "1555405929", "end_date": "1555430702", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 18385, "text": "<FonnixFTW>: These chips have an unseasoned spot to hold so your hands don’t get dirty while eating them <Natural_Justice>: What kind of degenerate monster is eating chips one at a time like some kind of psychopath instead of merely shoving entire fistfulls into their gaping maw like God intended?<F2P_BTW_>: unpopular opinion: I like eating chips with a fork<The_Devil_Is_Lettuce>: What? How do you even do that?<The_Royal_VAF>: Glue gun<Nantoone>: What??<Dr_Henry-Killinger>: GLUE GUN!<KodakZacc>: someone grab the fuckin ting towel<eridiumbars>: What has the towel done to you?<KodakZacc>: Well fuck just get me the malt licky then!!<eridiumbars>: I'll get the malt licky, whatever tf that is<KodakZacc>: Thank you:) I’ll let you have the tart tiddle<eridiumbars>: What language are you speaking?! Is this the language of the gods?<KodakZacc>: Hahaha! You may have thought I was speaking the language of the gods but in fact it was I DIO!<eridiumbars>: Ah shit<Mick-N-Rorty>: New phone who dis?", "num_messages": 16, "avg_score": 1149.0625}
{"start_date": "1555468103", "end_date": "1555489430", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 254, "text": "[deleted]: My nephew works at a golf course, they were doing some excavation to repair a water line, found a stolen Pinto instead. [deleted]<RangerBillXX>: definitely not a pinto, it's an Audi. In fact, it's not a golf course, it wasn't your nephew, and the car was buried on purpose. And it's definitely not OC. Here's the video of this Russian experiment of burying a car for a year and then trying to start it: https://www.youtube.com/watch?v=nnriJzNPYGg#action=share<imago56>: This guy Reddits. Kudos.<T_P_H_>: First he youtubes, then he reddits", "num_messages": 4, "avg_score": 63.5}
{"start_date": "1554905303", "end_date": "1554916107", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 39, "text": "<Mavericksworld>: Did not expect to see a book like this at a pediatrician <Some_Dude_ehh>: Kids see all forms of violence on TV everyday but we see one nipple and everyone loses their mind<Mavericksworld>: Wasn’t mad at about it, just surprised by it.<monokoi>: Its a German book, where'd you find this?<Mavericksworld>: At my son’s doctor in Luxembourg<monokoi>: Ah, thanks. It's the FKK sign that tells me it must be a German book, at least of origin.<Mavericksworld>: The books here are mostly in Luxembourgish, French, or German.<monokoi>: So, is this type of book rare in Luxembourg? I was under the impression it's normal across all of western Europe.<Mavericksworld>: I was surprised to see it at a children’s doctors office but they sell magazines of naked women at the grocery stores so I guess I shouldn’t have been surprised, we just laughed at the book", "num_messages": 9, "avg_score": 4.3333333333}
{"start_date": "1554902128", "end_date": "1554907788", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 36, "text": "<Blarghith>: I found a book of poetry from roughly 1884 with someone’s notes inside <VicePresidentPants>: LAUS VENERIS<Blarghith>: Apparently means “baleful” in Latin. Though that’s through Google translate, I’m no expert haha<capincus>: \"Glory to love\" would be the best literal translation imo. With the added double meaning that \"laus\" is derived from roots meaning song/poem, and veneris is the plural form of love whose singular form is venus. Venus the Goddess is the main love interest in the titular poem. So \"Glory to love\" or \"poem for Venus\", I'm sure Swinburne was very proud of himself for that one. r/bookinscriptions is made for this kinda thing if you care to share<Blarghith>: Very cool, thank you so much! I’ll definitely share there when I get a chance to.", "num_messages": 5, "avg_score": 7.2}
{"start_date": "1554906903", "end_date": "1554907825", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 10, "text": "<Nicovo>: this mouse i've had for so long I've worn down the plastic making this effect <thegermanicus>: that design is not from being worn down. Not sure if you're lying or dumb or took the wrong photo.<Nicovo>: are you implying the logo isn't worn down? I know that look at all the dots around it, that's it being worn down<DogDig420>: Yes it's being worn down they just look at the logo", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1555478291", "end_date": "1558540066", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 3033, "text": "<biggmusclelarry>: My friend found this old phone between my couch cushions; no one in my family recognizes it. <mooshymumu>: How long since you last vacuumed under the cushions?<misterbondpt>: Wait, you vacuum under the cushions?<mooshymumu>: You don't?<Shampagney>: OMG this guy. I bet he doesn’t vacuum inside his fridge either.<mooshymumu>: People occasionally vacuum under the couch cushions. I swear. I've seen it happen.<discdraft>: A couple times a year *at least*. Cushions out, take off the covers and wash them, and vacuum the inside of the couch.<thesaurus_wreck>: Damn you clean your couch more often than I sit on mine<discdraft>: Oh, the joys of dog ownership.", "num_messages": 9, "avg_score": 337.0}
{"start_date": "1555473850", "end_date": "1555499841", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 500, "text": "<TheKronk>: Our waitress drew a picture of Patrick with boobs on the receipt for some unclear reason <doublebakedpotato>: Thats a sexy earthworm jim<doublebakedpotato>: Actually what we really wanna know is.. how big is a big ass slice?<TheKronk>: A whole pie is 26 inches, so I guess ballpark from that. One slice is a meal<converter-bot>: 8 inches is 20.32 cm<manawesome326>: You tried :)", "num_messages": 6, "avg_score": 83.3333333333}
{"start_date": "1554907333", "end_date": "1554908284", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 47, "text": "<bro_merch>: This is what it costs to break your leg in the United States <xrp-owner>: But haven't you guys all health insurance. Doesn't the insurance pay for this or the biggest part (depends on deduction plan)?<Ragaee>: Usually insurance would cover it, but it looks like this guy payed himself and got a hefty discount<bro_merch>: Did not pay. They did give me two weeks to come up with the money. So far, I’m only short by $27k.<Ragaee>: Damn, do you not got insurance, cause you might be screwed", "num_messages": 5, "avg_score": 9.4}
{"start_date": "1555478851", "end_date": "1555494341", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 15, "text": "<GrandCaptain>: The drinking fountains in my church have spigots to fill your cup or water bottle. <MegaSpuds>: Wow. What’s crazy is the fact that some people live in bubbles and have no idea what the real world is like.<GrandCaptain>: Not entirely sure if that was directed at me as sarcasm, or was you legitimately commenting on that fact.<mydogwasright>: I think it was a snarky way of saying these are pretty common. Idk for sure, but that’s my guess.<GrandCaptain>: Maybe, I had just not seen them like this one, I've seen bottle and cup filling spigots before, just not ones that are 50+ years old and aren't in an airport and automatic.<mydogwasright>: Sorry, I just meant that’s what the rude person was saying. I don’t know why some people can’t just say things nicely. They could’ve just said it plainly without making it personal. Anonymity makes some people mean. Yeah, no, I’ve never seen one like this before. It’s like it time traveled. Pretty clever.<GrandCaptain>: No need to apologize, I was just stating that in case you were right in your guess. Time traveled indeed, I've been going to this church for a long while now, but it only just dawned on me that things like this aren't exactly common.<MegaSpuds>: They are more common then silly Posts like this! Zing! Give me those down votes and those tokens.", "num_messages": 8, "avg_score": 1.875}
{"start_date": "1554902806", "end_date": "1554924814", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 11, "text": "<Fortnite-Golden-YT>: These two chips that some how got stuck together <stsixtus420>: Is it two chips or one chip from a long potato?<Fortnite-Golden-YT>: I have no idea but it looks like 2 circular ones put together<InnerRisk>: Do you know how potatoes look?", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1555477632", "end_date": "1555481541", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 117, "text": "<-pilot37->: Penny I found while metal detecting in my field. <Homo-Deus>: It belongs to Erica<chenzo711>: SHE WAS NUMBER 1!!", "num_messages": 3, "avg_score": 39.0}
{"start_date": "1554868358", "end_date": "1554900741", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 984, "text": "<viselyx>: One of the animators at Laika, Brad Schiff, came to my university for a presentation since he graduated here. He brought one of the actual models created for Coraline. The line on her face is for removing the jaw which allows them to replace it with a different expression. <latenightt>: Wah that's a really neat time-saving technique. How do they cover up the line for the film?<viselyx>: CG editing.<paggo_diablo>: One of my many beefs with current stop motion.<basetornado>: In what way? CGI is a great tool when used sensibly.<paggo_diablo>: I just feel like if they're going to throw so much cg (tidying up seams, 3d printing faces from what is pretty much just a CG animation, green screen backgrounds etc) at a stop motion film then they might as well just make a CG animation. The only difference in the mediums is that one makes you say \"Wow, that looked hard to make\".<basetornado>: You can do a lot with stop motion alone. Yes its harder to make and it always will be. But there is a point when you can either spend a lot of time and effort on something totally trivial that could easily be fixed with a small amount of CGI, or you could use that time saved to improve something else in the film. Isle of Dogs had some greenscreen backgrounds, but there was also an absurd amount of background detail that could easily have been CGI, but was instead practical stop motion. Its about creating an even balance.<Jaerin>: I think the point is those lines and flaws are what make stop motion unique and captivating in the first place. Otherwise all you're really doing is an animation with a more realistic composition.<basetornado>: Id argue that flaws are a part of stop motion. But production lines like those shown are what cgi is made for. Leaving them in to avoid using cgi is stubborn stupidity.<Jaerin>: No its a design choice. The point of my comment was that just because you can cover up those flaws doesn't mean you should for design reasons.<basetornado>: Those flaws are built in to facilitate production. You could build without it, but it would make stop motion even less viable.<Jaerin>: Again you're missing the whole point. Yes those flaws are to facilitate stop motion. If you want something to look stop motion then you'd expect it to have the flaws of stop motion. Not having the flaws makes it look like someone pretending to do stop motion.<basetornado>: Whats your point? That stop motion should have production seams left in? You can produce it without those production seam. Its just going to take more time and cost. Stop motion already is a risky proposition. Lets not make it even more so just for the sake of it.<Jaerin>: Just stop<basetornado>: Fair enough.", "num_messages": 15, "avg_score": 65.6}
{"start_date": "1554813957", "end_date": "1554847358", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 73170, "text": "<7b21b9>: My town has 100% electric school buses <Call_Me_Clark>: If this is Amherst, MA, I wonder how the batteries deal with the cold, and what the range is like.<BigRedTek>: [70 miles, apparently.](https://www.gazettenet.com/First-electric-bus-picking-up-schoolchildren-in-Amherst-7548159) My Tesla loses up to 30% range in the cold. But school buses aren't doing hundreds of miles in a day, so I'd imagine they cope just fine, and charge at the end of the day (or even mid-day).<Shakeyshades>: My favorite part is \"...repairs to diesels are more complicated and costly.\"<iamzombus>: Well, electric motors really only have one moving part.<Shakeyshades>: True but determining why that particular part doesn't work can be a hell of a lot more difficult<iamzombus>: Yeah, but if it's modular they can be swapped out and then refurbished. Just from my basic understanding you only need a few components to make a motor run. A Motor, power source, drive, and a drive controller. There's probably more complex systems involved in a car, like charging systems, etc... but just a rudimentary system.<Shakeyshades>: Determining which system isn't working properly is the problem. It's not a diy situation. A random city diesel mechanic is not likely to be an expert on electronics. Or be able to determine which driver is bad and why it went bad. There's actually a lot to these things even if it's a rudimentary system.<quibbelz>: Mechanics would have to be trained, just like any new tech in a car.<Shakeyshades>: Which means that's it's not as easy as the article claims. Which is my point.<quibbelz>: TBF pulling an electric motor and swapping it is much easier than swapping a big diesel. Its not that hard disconnect the battery pull some bolts and take it out. Sounds a lot like changing a tranny to me. Like I said any new tech will require training. My friend is a BMW mech, the amount of training he does is silly.<Shakeyshades>: The problem isn't removing and replacing a motor which May or may not be easier than removing an engine. is determining whether it's the motor or drives or any of the other electrical problems that drive the system. not the actual physical labor of removing and replacing a part it's the knowledge of how to and the understanding of why. I'm a generator mechanic and I do both electricity and diesels and I work on car with the knowledge from professional training<quibbelz>: That all makes sense but I also know that it would be trivial to put sensors to do most of the troubleshooting. The three systems (battery, control and drive) could easily be made modular. If you know its the motor you swap it and fix the bad one on the bench. That reduces downtime. Theres a lot more to disconnect on a ICE engine to remove vs an electric motor, you have to admit that?<Shakeyshades>: All these things are technical that you're bringing up. Which is where the issue lies, making easier to diagnose is one thing that's entirely more complicated. [Here's](https://youtu.be/ulfONX9lPUQ) a video of a guy removing the front motor from a looks like wrecked Tesla. Give me your judgement on easy removal and installation<quibbelz>: I thought we were talking about busses?<Shakeyshades>: We are but it still applies in a way that it's an EV and will have larger motor and power sources due to the weight.<quibbelz>: Since you brought up [Tesla](https://www.quora.com/How-big-is-the-Tesla-Motor-compared-to-an-IC-engine-and-where-do-they-put-it), their motors are much smaller than an ICE engine. What makes you think they are larger than ICE? Also the electric motor on a bus would be where the diff was. Much easier to access than an ICE.<Shakeyshades>: Wtf? I didn't say that.... I said a motor for a bus would be larger than a Tesla motor. Also bus engines are pretty easy to get to. Point is you still have a lot of work it's not just remove a connector and some bolts and nuts.<quibbelz>: Comparing a bus engine and a tesla engine has no relevance to this discussion. I dont know why you even brought it up. What else is there to changing a motor on an EV bus then? You dont seriously think putting senors on the equipment is something they dont already do? The batteries sure as hell already have them. Have you ever worked on an EV bus? If not then you have no idea and are talking out your ass. Get over yourself.<Shakeyshades>: Apparently you don't know what the fuck you're talking about. Literally not talking out of my ass I know what the fuck I'm talking about. did you go back and reread and comprehend then maybe you could understand what the fuck I'm talking about.<quibbelz>: Yea gonna go ahead and say no. Maybe you should reread and try to figure out why you were bringing up irrelevant info if you are so right?<Shakeyshades>: Reading comprehension is a thing man.", "num_messages": 22, "avg_score": 3325.9090909091}
{"start_date": "1554526317", "end_date": "1554907681", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2306, "text": "<saverity40>: The colour of rain on my sunglasses. <sgmctabnxjs>: I never meant to cause you any sorrow<sgmctabnxjs>: I never meant to cause you any pain<DeeDeeGunz>: I only wanted one time to see you laughing <sgmctabnxjs>: I only wanted to see you<sgmctabnxjs>: Laughing in the purple rain<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: I only wanted to see you bathing in the purple rain<sgmctabnxjs>: I never wanted to be your weekend lover<sgmctabnxjs>: I only wanted to be some kind of friend<sgmctabnxjs>: Baby, I could never steal you from another<sgmctabnxjs>: It's such a shame our friendship had to end<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: Purple rain, purple rain<sgmctabnxjs>: I only wanted to see you<sgmctabnxjs>: Underneath the purple rain", "num_messages": 19, "avg_score": 121.3684210526}
{"start_date": "1554907632", "end_date": "1554908146", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 26, "text": "<YodaChoda>: Best Aisle Ever <shoeshackeddie>: Gotta love publix<LawrenceAurelius>: Came to say this exact thing.", "num_messages": 3, "avg_score": 8.6666666667}
{"start_date": "1554874368", "end_date": "1554916289", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 53, "text": "<PeteThePoptart>: This Apple Is Black <QuintenBoosje>: when you bite it you'll have a mouth full of maggots<QuintenBoosje>: i threw up a little inside my mouth when writing this.<PeteThePoptart>: If it makes you feel better, the apple was perfectly fine and tasted really good.<QuintenBoosje>: that makes it worse.. now i see you enjoying a mouthful of maggots..", "num_messages": 5, "avg_score": 10.6}
{"start_date": "1554766992", "end_date": "1554798724", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2373, "text": "<byl_ni>: This college letter I received in the mail today. <momoboku>: Why is it like that<TinkerBellx64>: Because when you're hurriedly reading an admissions letter, skipping all the stuff you don't care about, I imagine this is how one might read it to someone else. I think it's a great touch to be honest and I hope OP gets in. It already sounds like a cool place with cool people. And because people would say \"IT DOESN'T SAY THAT.\" To which they could snarkily reply \"YES IT DOES HERE LOOK\" lol <EDIT>: On second thought, we already know OP got in because this would be a \\*really\\* douchey way to tell people they didn't. Like... you didn't make the cut and it was so bad we couldn't even be bothered writing a letter to tell you properly so here ya go fuck off.<Weather>: Based on the [full text](http://i.imgur.com/aUkbZ.png), it doesn't appear to be an acceptance letter at all. Rather, it's a promotional letter to encourage students to request more information about the school and apply.<TinkerBellx64>: Ha. Well I'll admit they would have gotten me to open the envelop and read a few sentences... before angrily throwing it away, feeling duped.<darth-voider>: Why would you feel duped...? It’s super normal for colleges to send out invitations to apply.<TinkerBellx64>: ...TIL colleges send out mass invitations. I've... honestly never gotten one. Ever. :( Why? How? I have questions.<darth-voider>: Usually they get your address from the PSAT, so that could be why, it you didn’t take it.<TinkerBellx64>: I *didn't* take it. I was \"home schooled\". (0/10 would not recommend)<ThrowawayBoo8>: You poor thing", "num_messages": 10, "avg_score": 237.3}
{"start_date": "1555475886", "end_date": "1555514267", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 102, "text": "<Seapick>: A five-leaf clover my boyfriend found after I asked him to find a four-leaf one <Timely_Doughnut>: He obviously failed<AreUCooked>: Nah he just one upped her.<Timely_Doughnut>: Nah, if you don't do exactly what the gf wants, you failed. I don't write the rules", "num_messages": 4, "avg_score": 25.5}
{"start_date": "1555448761", "end_date": "1555598257", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 517, "text": "<Dusty923>: This dolphin's SCUBA gear is anatomically correct. <Morall_tach>: Pretty sure goggles would make their vision worse underwater, but it's artistic license and the blowhole regulator is brilliant.<TheRenamon>: What if the goggles are filled with water<Morall_tach>: Then yes, but also why?<jfffj>: Because if they aren't then his eyes will get sucked out of his head.<Morall_tach>: I meant why even have them if they're full of water. And why on earth would his eyes get sucked out of his head if the goggles didn't have water in them?<jfffj>: [Mask squeeze](https://www.emedicinehealth.com/wilderness_face_squeeze/article_em.htm) As you dive deeper the pressure increases and the air in the mask tries to occupy less space. This pulls the mask onto your face, painfully. In extreme cases this can cause injury. Divers mitigate this by deliberately blowing air out of their noses into the mask.<Morall_tach>: Then if anything they'd be pushed into his head. It's pressure, not suction.<jfffj>: The air volume reduces. This pulls everything around into the air space. Think about it. Or just trust me, or somebody you know to be a diver. They'll all tell you the same.<Morall_tach>: The air volume reduces because the pressure outside the mask is pushing in. The same quantity of air is now in a smaller space, which *increases* pressure. The article you linked even says \"The air in the mask has more pressure put on it, and therefore becomes painful against the face.\"<jfffj>: Which is fine, until the mask cannot compress any more, at which point surrounding tissues try to fill the available space. This isn't a difficult concept. Seriously, go ask another diver, you clearly don't believe this one.<Morall_tach>: I don't need to ask a diver, this is basic physics. If the gas inside a chamber increases in pressure, it presses *outward* in every direction, including on the diver's face. It can't magically turn to suction, pulling *in* on the diver's face, unless the pressure in the mask is less than the pressure outside, which can only happen if there's suddenly less air inside the mask (which there isn't) or the chamber gets bigger (which it doesn't). The tissues don't try to fill the available space because there isn't space available. The air is trying to get out of the mask by pushing equally in every direction, including on the face.<jfffj>: This will be my last response. There's only so much dumb I can deal with. &gt;unless the pressure in the mask is less than the pressure outside Lol. You got there in the end. The chamber (inside the mask) is sealed. The pressure *outside* increases, not the inside. The pressure inside is now lower than the outside. &gt;which can only happen if there's suddenly less air inside the mask (which there isn't) or the chamber gets bigger (which it doesn't) Sigh... Doesn't have to be less air inside the chamber, only the same air at a lower pressure inside a flexible container. See [this](https://youtu.be/cHf9eWRd_bc?t=36)? That's a sealed flexible container being taken to a higher pressure, See what happens? It gets smaller (and miraculously no air was lost from the container!). Now consider what happens when the mask can't get any closer to the head... Actually, don't bother thinking about (why start now) - just [look](https://www.google.co.uk/search?q=mask+squeeze+injury&amp;tbm=isch&amp;source=hp&amp;sa=X&amp;ved=2ahUKEwjVr5LL7tnhAhVHQxUIHSubDsQQsAR6BAgJEAE&amp;biw=1542&amp;bih=892) for yourself.", "num_messages": 13, "avg_score": 39.7692307692}
{"start_date": "1554844554", "end_date": "1554870891", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 9175, "text": "<jermoi_saucier>: I saw this piece of plastic embedded in the street that looked just like a google maps pin. <jakeryii>: That is a marker from a truck/bus that states the lugs have been torqued properly, the just kinda fit on, this one seems to have come off<cgrimes85>: They're placed to indicate when a lug is starting to loosen. When the lugs are tightened they're placed all facing in a recognizable pattern. If the lug starts to loosen it will mess up the pattern and be [obvious at a glance](http://www.cpsafety.com.au/img/img-35.jpg).<Mirria_>: That picture is terrible. You don't place the indicators in pairs, you make a [full circle with them.](https://www.truck-drivers-money-saving-tips.com/image-files/lug-nut-torque-indicators-dsc01773.jpg)<need_help_send_cats>: and yet, no one does that, they only seem to be paired (Australia) that way looks nicer, tbh.<Mirria_>: Canada here - they're not common but always circle.", "num_messages": 6, "avg_score": 1529.1666666667}
{"start_date": "1555461117", "end_date": "1555475529", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 118, "text": "<TheFloatingContinent>: My corn had one square inch of mutation kernels <corellianone>: one inch mutant ninja kernels!!!<junktrunk909>: I &lt;3 you<corellianone>: &lt;3", "num_messages": 4, "avg_score": 29.5}
{"start_date": "1554857108", "end_date": "1554907936", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 95, "text": "<lep1ck>: Evolution of the hard drive <Delnilas>: Not yet complete. Need to put an M.2 at the end.<sbvp>: There are m2 hard disk drives?<Delnilas>: No, but the two are the far right aren’t either, unless I’m sorely mistaken.<lep1ck>: No SSD in the picture. All motorized drives.<Delnilas>: Oh, consider me sorely mistaken. My bad.", "num_messages": 6, "avg_score": 15.8333333333}
{"start_date": "1555475965", "end_date": "1555517264", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 143, "text": "<Noneyabeezwaz>: AC unity is so detailed that it can help with the reconstruction of Notre Dame. (Source https://www.google.com/amp/s/thenextweb.com/gaming/2019/04/16/assassins-creed-unity-notre-dame/amp/ ) <lordkauth>: This game is suddenly going to become popular again<CrashLander3000>: What’s really weird is the fact that I started playing it a lot last week and my friends were like no staphh<lordkauth>: I finally started playing it about a month ago lol, owned it for years and never got caught up<CrashLander3000>: I play it all the time, but just decided to pick it up again last week. Such a good game. I’m a sucker for assassins creed though.", "num_messages": 5, "avg_score": 28.6}
{"start_date": "1554860015", "end_date": "1554924768", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2120, "text": "<Nitrexk>: Blue lobster caught off the coast of Nova Scotia <hitormiss02>: Cool! 1 in a million!<Nitrexk>: I also have pictures of a lobster that is geometrically split down the middle with two different shades of red/brown. Even more rare than a blue lobster, I should’ve posted that instead.<tyhntyhn>: Please post it here in the comments, that sounds neat.<Nitrexk>: https://imgur.com/gallery/3ItfpPE<WarKiel>: I thought lobsters are only red when cooked? So this must be the two-face lobster. How does it flip a coin with those rubbery things on its claws?<Nitrexk>: Yup they are only red when cooked.<punkrockabilly>: Can you also post a picture of a cooked lobster? Preferably with butter....<jeremeezystreet>: Perhaps a slow motion gif image of the moisture flying through the air as the shell is cracked open", "num_messages": 9, "avg_score": 235.5555555556}
{"start_date": "1554728520", "end_date": "1554777732", "thread_id": "t3_bapob7", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 33, "text": "<calotron>: Within the last 3 or so years Taco Bell has seemed to up their game in terms of quality by a lot, at least in my area of the US (Midwest). Prices are still very reasonable too. Medium Baconator Combo is pushing towards $12 after tax at Wendy's I can spend like $4 on three grillers and $1 on a drink at TB.<LilFingies45>: \"Food is a third the price but quality is better!\" Umm... <calotron>: The quality of TB has gotten better while their prices have remained very affordable vs some of the competition having worse value per dollar based on what you're getting. Not sure what's confusing.<LilFingies45>: Because of how implausible their food being so much cheaper and yet somehow higher quality while remaining competitive. Frankly the quality may have improved in relation to competitors, but you are comparing some of the lowest quality food chains around.<Pvt_Lee_Fapping>: However implausible it may be that Taco Bell food is higher quality than Wendy's while still being cheaper, it's not impossible for that to be the case, and this person was just remarking how awesome that is. Plus, you can still compare food quality of these places even if they're on the lower end of quality overall. Not everything has to be from Chipotle or Panera, dude; ease up. <LilFingies45>: &gt; Taco Bell food is higher quality than Wendy's while still being cheaper, Such an insanely low bar. I'm not harshing on anyone. I can't afford fast food right now, so I taught myself how to cook a few items and every now and then I try to learn something new. I eat super healthy for cheaper than fast food. Who the fuck said anything about Chipotle or Panera? If you want to eat cheap and healthy, cook. That's your only option. The fast food chains being mentioned in here peddle toxic trash that tastes like shit soon after you stop eating it. Same goes for soda in general. It'll keep you alive, but it'll also slowly kill you if you consume enough of it. And don't get mad at me because I'm putting things into perspective. <Pvt_Lee_Fapping>: &gt; Such an insanely low bar. I'm not harshing on anyone. Lemme stop ya right there. You might not *want to*, but you are. This is the same thing as saying \"no offense, but you suck\" to somebody's face. That's the only reason anyone is getting pissy with you here: it's not the \"harsh reality that we're slowly killing ourselves\" (bitch please! *Just breathing will slowly kill you.* What do you expect? To live forever? Just enjoy what you've got.), it's that the way you said things make you sound pretentious, hence the jab about Panera. And since you don't realize that bit, and you think we're mad about something else instead of mad at you for something you said, I'm inclined to think that's true. Peace. <LilFingies45>: Don't make specious claims about Taco Bell being the \"healthiest fast food chain\", which is simply untrue and when pressed no source was provided. Then the claim had to be qualified in comparison to the 3 or 4 worst quality restaurants in business. Pretty stupid claim at this point, but still no source. &gt; This is the same thing as saying \"no offense, but you suck\" to somebody's face. I never said anything like that. I occasionally drink alcohol, which is worse than fast food, but I don't go around claiming that it's relatively healthy. Ever. Because it's not and that would just be wishful thinking. Look you just want to be able to tell yourself happy things that aren't necessarily true and you expect the rest of us to smile and agree with your delusion. That's a hard pass. You're harshing my own sense of reality. I like how you skipped over everything I said and instead of addressing any of it you launched another rant. If you want to eat your garbage food, then eat it. Just don't expect me to share it in your delusion. <Pvt_Lee_Fapping>: They didn't say it was the healthiest fast food chain, just that it was the healthiest of the \"big 4\" - BK, McD, KFC, &amp; TB. There's not really any need for citations in this informal forum; I took it to mean that it was his/her opinion and any evidence is anecdotal. &gt; you just want to be able to tell yourself happy things that aren't necessarily true and you expect the rest of us to smile and agree with your delusion. That's a hard pass. You're harshing my own sense of reality. You sound really insecure and unsure of yourself if you sincerely think this way. If anything you're the one who's delusional here if you think *you're* not being insulting given the way you've been acting. Furthermore, I did read what you said after your two-faced \"such an insanely low bar. I'm not harshing on anyone\" comment; it just wasn't worth continuing in the conversation because A) The conversation was about comparing fast food restaurants by quality B) At the time I didn't really feel like going over the pros-and-cons of eating-in versus eating-out with you but since you bring it up, eating out versus eating in isn't just about a plot of \"cost\" on one axis and \"healthiness\" on the other; there's also the convenience of it. Fast food is more convenient, but at the cost of healthiness and price. Eating in can be healthier and cost less, but at the expense of time - which is a rare commodity in America, so I'm happy that you can find the time to cook a healthy, inexpensive meal; kudos. But please, have some respect for the people who don't have the luxury as you do, lest you sound like the pretentious prat I've had the privilege and the misfortune of talking to today.<LilFingies45>: &gt; healthiest fast food chain Which is untrue and also there is no source to back this up. &gt; You sound really insecure and unsure of yourself Nope. I'm quite sure you're pathetically trying to convince yourself that Taco Bell is healthy lmfao. Good lord. &gt; But please, have some respect for the people who don't have the luxury as you do Lol I literally said I can't even afford fast food right now, so I cook all my meals. What a luxury!! Maybe stop being a lazy-ass, corporate tool and quit eating that shit. Or don't, because I really do not give a shit. Just don't go around saying that it's relatively healthy food and expect people to eat that shit up (like so many of your garbage-quality fast food orders).<Pvt_Lee_Fapping>: **TL;WR: I was being sincere in trying to help you, and I feel like I've done enough. It's up to you now to decide what kind of person you want to act like:** I think there's something wrong with your eyes, because you clearly missed about half of what I said, so I'll just go ahead and restate what you missed in a bolder text so you can read it again: #They didn't say it was the healthiest fast food chain, just that it was the healthiest of the \"big 4\" - BK (Burger King), McD (McDonald's), KFC (KFC), &amp; TB (Taco Bell). There's not really any need for citations in this informal forum; I took it to mean that it was his/her opinion and any evidence is anecdotal. &gt; you just want to be able to tell yourself happy things that aren't necessarily true and you expect the rest of us to smile and agree with your delusion. That's a hard pass. You're harshing my own sense of reality. You sound really insecure and unsure of yourself if you sincerely think this way. #If anything you're the one who's delusional here if you think *you're* not being insulting given the way you've been acting. Furthermore, I did read what you said after your two-faced \"such an insanely low bar. I'm not harshing on anyone\" comment; it just wasn't worth continuing in the conversation because #A) The conversation was about comparing fast food restaurants by quality #B) At the time I didn't really feel like going over the pros-and-cons of eating-in versus eating-out with you but since you bring it up, eating out versus eating in isn't just about a plot of \"cost\" on one axis and \"healthiness\" on the other; there's also the convenience of it. Fast food is more convenient, but at the cost of healthiness and price. Eating in can be healthier and cost less, but at the expense of time - which is a rare commodity in America, so I'm happy that you can find the time to cook a healthy, inexpensive meal; kudos. But please, have some respect for the people who don't have the luxury as you do, lest you sound like the pretentious prat I've had the privilege and the misfortune of talking to today.<LilFingies45>: LMFAO! Dude, you're just making yourself look really insecure and unhinged. This is getting really sad. I can only imagine how much you overestimate the value your own opinions, because there is no way that anyone on Reddit is going to read your ramblings when you communicate the way you do. You have serious problems to be conflating a criticism of fast food healthiness with an attack on your ego. For the sake of others, please seek help.", "num_messages": 12, "avg_score": 2.75}
{"start_date": "1554900495", "end_date": "1554917956", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 76, "text": "<lndeedl>: My little sister's cube collection. She refuses reading manuals. <Jman01111>: This belongs on mildy infuriating<Workin_Them_Angels>: In my world it belongs on Extremely infuriating. I never could do those things. :(<Jman01111>: I can solve all of these but is infuriating because it isn’t solved", "num_messages": 4, "avg_score": 19.0}
{"start_date": "1555456917", "end_date": "1555457857", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 150, "text": "<RowanKon>: Only one of the people in this duplex care enough to clean or repaint. <aurichusky>: Yeah and the other’s lawn is better looking<RowanKon>: Yeah I don’t understand why the nicer one wouldn’t redo the lawn<MPawz>: It also looks like they replaced the windows.<RowanKon>: Oh yeah I didn’t even notice that", "num_messages": 5, "avg_score": 30.0}
{"start_date": "1555457068", "end_date": "1555507792", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 20, "text": "<HopMan3000>: This guys steering wheel is on the right side of his car - I live in America (in which we have them on the left for any non Americans) <duradura50>: It's called 'right-hand-drive'. About 1/3 of all countries in the world drive on the left, using right-hand-drive.<jasonh300>: Incomplete statistics. Many of those countries are very small. 1/6 of the world by land area is RHD and ¼ of the roads in the world use RHD.<duradura50>: Is Australia small? Is India small? Is Pakistan small? I guess New Zealand is small too. Oh no! How about the countries in southern Africa? Are they 'small' too?<jasonh300>: I said “many”. Eliminate Australia and you’re down to less than 1/12 by area.<duradura50>: How about India? How about Japan?", "num_messages": 6, "avg_score": 3.3333333333}
{"start_date": "1555476961", "end_date": "1555480521", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 26, "text": "<archon810>: This crow with a stolen bag of dog poop <archon810>: Credit to someone at our local Nextdoor community. I'll publicize the name if this takes off, and they want to make their name public. There's also a video if someone wants to see it.<dylanstalker>: Nah we don’t need to know anyone’s name<archon810>: Right, reddit is all about reposting and stealing content, but it doesn't have to be like that.", "num_messages": 4, "avg_score": 6.5}
{"start_date": "1554901027", "end_date": "1554920558", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 100, "text": "[deleted]: My student’s pen [deleted]<koh_kun>: Pen is ~~mightier than~~ the sword.<Rchitt123>: Penis<Tim_Reichardt>: http://www.penisland.net", "num_messages": 4, "avg_score": 25.0}
{"start_date": "1554895493", "end_date": "1554908832", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 91, "text": "<Isimarie>: My skin is super sensitive, so I can write on it <UnlubricatedUnicorn>: Can you write-❤️ Doggo<Isimarie>: [Sure thing](https://imgur.com/gallery/w5h7B36)<UnlubricatedUnicorn>: 😀", "num_messages": 4, "avg_score": 22.75}
{"start_date": "1554874649", "end_date": "1554908411", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 1, "text": "<Someonefromitaly>: the heart chocolate chip on my cookie <Bear_The_Pup>: I see this picture was taken with that new \"I have no idea how cameras work\" filter, very trendy.<Someonefromitaly>: you just need to see the chocolate chip.Plus i'm not a professional photographer.", "num_messages": 3, "avg_score": 0.3333333333}
{"start_date": "1555480269", "end_date": "1555485033", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 8, "text": "<ThinkHappyThoughts69>: This Albino Pigeon I Spotted in Amsterdam <Iboughtamermaid>: Albino should be white..... this one is brown! This is a normal pigeon!<michaelflux>: Hmm, I’m split. On one hand, you’re right, brown legions are normal. On the other hand this one’s eyes are red as you find with albinos.<Sjiek-de-Friemel>: Orange/red eyes are super common in pidgeons. Don't you people ever go outside?<michaelflux>: Orange yeah, this one seemed bit more red than usual. Perhaps just the contrast in the photo. Perhaps I haven’t spent enough time deeply gazing into a pigeon’s eyes.", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1554885511", "end_date": "1554894333", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 38, "text": "<c-carpenter>: This gay police car. Literally. <Alex01854>: Well, that’s embarrassing.<jousty>: Is it?<Alex01854>: Yes, why would you paint that crap on a police car?<Jake1999x>: It’s the job of the police to promote tolerance between communities cause it helps prevent hate crimes. You dick.<Alex01854>: The job of the police is not to promote tolerance.<Jake1999x>: Well, where I’m from it is. If it helps prevent hate crimes then why is it not their job?<Alex01854>: Here I the US, they enforce laws/statutes, protect people, property and apprehended criminals. If Boston PD began rolling around with gay flag cruisers, I would lose a lot of respect for them. It’s not a good look imo.<Jake1999x>: Oh, ok so it’s more about the *look*. LMAO.<Alex01854>: Yes, because uniformity is far more important than virtue signaling. I wouldn’t allow my officers to have long hair, beards, dreads, etc for the same reason. Many cop killers have made it know that they chose to kill a particular officer because he/she didn’t look capable and they didn’t take them seriously.<Jake1999x>: They’re not virtue signalling, they’re supporting a community they WORK FOR. Loads of cops here (UK) have beards and stuff, I’ve even been up in front of a police inspector who had a beard. The beard didn’t make me take him less seriously.<Alex01854>: Perhaps you didn’t, but the FBI conducted a survey with convicted cop killers and the general consensus was that they attacked the officer because they knew they could win. The first thing that they noticed was the officer’s appearance, which was sloppy and poorly maintained. There’s a huge difference between the LAPD and the NYPD in terms of appearance.<Jake1999x>: Oh, right. Yeah, I suppose if a policeman looks like they’ve just got out of bed then it might make a difference. The beard thing might just be a British thing cause I’ve even seen prison officers with beards, but I’m guessing there were rules cause they always had their beards neatly trimmed. So are American cops not allowed beards *at all* then?", "num_messages": 13, "avg_score": 2.9230769231}
{"start_date": "1555478516", "end_date": "1555504802", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 174, "text": "<des1g_>: probably world's biggest \"You are here\" map <SashaWoodson>: What mall is this?<GeongSi>: It’s not. Outside the Union Train station, I believe it’s just a commercial building<Bobby-Samsonite>: what city?<viplisson>: It’s in Chicago.", "num_messages": 5, "avg_score": 34.8}
{"start_date": "1555474469", "end_date": "1555476466", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 29, "text": "<Scumbag_Chance>: The pollen made a pattern on my window this morning. <MoPuWe>: We have big windows where I work. When steam hits the window it makes the same pattern. It's from the suction cups used to install it in place.<Scumbag_Chance>: THANK YOU I knew there had to be some sort of explanation for this lol. Why would a suction cup have that pattern tho?<MoPuWe>: That I don't know!", "num_messages": 4, "avg_score": 7.25}
{"start_date": "1554903011", "end_date": "1554908515", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 21, "text": "<E5RA-OZ>: Swastikas on the floor of Customs House in Sydney. <stack_babber>: Wtf?<slightlyburntsnags>: Wtf what? Read a book man<stack_babber>: Yeah... the Big Book of Swastikas is pretty low on my reading list.<Apollogetics>: So is knowing the history of the Swastika I guess:", "num_messages": 5, "avg_score": 4.2}
{"start_date": "1555480657", "end_date": "1555481177", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 5, "text": "[deleted]: My package time traveled into tomorrow [deleted]<biakke>: Because its 2:00 am on April 17<beedeboo>: 11 pm April 16th in Ca, package went to tomorrow and back technically", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1554908567", "end_date": "1554909052", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 1, "text": "[deleted]: What does he sells this time? [deleted]<MrBeepBox>: this.. was last year you dumb idiot<Irm603>: They are still free...", "num_messages": 3, "avg_score": 0.3333333333}
{"start_date": "1554908053", "end_date": "1554909018", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 7, "text": "<Revolting_Roger>: This Danish safety manual translated the title although the word \"tunnel\" is the same in English and German <Desert_Fox_T91>: I guess this is one of those “You never know” kind of things? Seems silly to me to use the toner for that. Whoever does their print work likely charges per page to be honest.<Revolting_Roger>: I think you're right. My first thought was also that they may have gotten someone to translate everything and afterwards just copy-pasted it into the page without checking for spelling. They probably wouldn't know if it was misspelled anyways. Probably a mix of both things.", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1555476419", "end_date": "1555480922", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 13, "text": "<LOUD-COMPLIMENTS-GUY>: This Oreo is missing a cookie <strangeburd>: They really fucked ya on the creme there bud<LOUD-COMPLIMENTS-GUY>: The creme was actually taller than normal. I think it just wasn't pressed.", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1555457056", "end_date": "1555481756", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 109, "text": "<TheSpyrexian>: My town has these magpie warnings on every street pole <bws7037>: 'Stralia?<TheSpyrexian>: Austria<bws7037>: I didn't know they were so aggressive in Austria... I know they have problems with them down in Oz... Are they really that aggressive?<TheSpyrexian>: I don’t think there are magpies in Austria<TheSpyrexian>: I took this photo in my hometown, QLD, Australia<Kiwicheezer>: That is what he was asking.....<TheSpyrexian>: It’s k the post is dead, don’t sweat it<Kiwicheezer>: Sorry I don't spend all day on here. 6 hours ain't that long bro", "num_messages": 9, "avg_score": 12.1111111111}
{"start_date": "1555160261", "end_date": "1555218117", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 4478, "text": "<FamouslyUnknown>: This street in Puerto Rico <phobosthewicked>: There is a very similar street in Bucarest<digital-pollution>: And a similar one also in Carcassonne<phobosthewicked>: In the medieval city?<digital-pollution>: Naw in the town one of the little streets that join up to the main square with all the restaurants, got married there last year<phobosthewicked>: Oh sweet", "num_messages": 6, "avg_score": 746.3333333333}
{"start_date": "1554902136", "end_date": "1554909883", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 51, "text": "<Lawliva>: This neglected soap bar sat in the corner of the shower for so long it turned into a piece of wood <Max_Kevin>: You shoved your “finger” in their, didn’t you?<Lawliva>: 🥴", "num_messages": 3, "avg_score": 17.0}
{"start_date": "1554828473", "end_date": "1554866505", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 10694, "text": "<l3El2Tl2AM>: An emergency light painted to look like a giraffe. <DoofusMagnus>: [Less whimsical when encountering it alone in the dark.](https://i.imgur.com/uu22hpf.jpg)<l3El2Tl2AM>: Hahahaha omg that is pretty creepy<OprahsSister>: Giraffe is always watching<benjidog1>: Looks like giraffe is into auto erotic asphyxiation", "num_messages": 5, "avg_score": 2138.8}
{"start_date": "1554908907", "end_date": "1554908947", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 5, "text": "[deleted]: Riding in the back of a uhaul [deleted]<sea_pancake>: r/barelyintetesting<notreallyasub-BOT>: r/notreallyasub", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1555457089", "end_date": "1555458978", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 14, "text": "[deleted]: My uvula is \"inverted\" [deleted]<Maggot2017>: I call the uvula the \"mouth clit\"<Klovie4o4>: Uvuvulvala<Maggot2017>: I had a stroke reading this", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1555480917", "end_date": "1555483456", "thread_id": null, "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h", "total_score": 2, "text": "<rajveerwblnk>: Some says Kiwifruit can trigger allergic reaction in sensitive persons. Can I eat skin of kiwi fruit? <Fullban>: I love them but get a proper wierd furry feeling on the back sides of my tounge ...just soldier through it 4 the taste haha<rajveerwblnk>: may that stops me to eat the skinn.....", "num_messages": 3, "avg_score": 0.6666666667}
