{"start_date": "1543581178", "end_date": "1543702979", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 29662, "text": "<dreamteamreddit>: The final moments of Zabit Magomedsharipov vs Kyle Bochniak <cgoldsmith95>: That’s sportsmanship <RemindMeToBlink>: Or retardation. They’re all going to be mentally handicapped in their futures. Sad really. <SentientScrubJay>: MMA fighters last a lot better than boxing. Do you have a source to back up the idea that they are all retarded or they will be mentally handicapped in the future?<MrKoontar>: i dont think MMA is old enough for conclusive data on CTEs<CaptainK3v>: It's been around for like 25-30 years<MrKoontar>: Relative to boxing and football thats infantile, CTE research studies take decades and sample sizes of at least thousands (much of the conclusive data coming from donated brains after death)<SentientScrubJay>: I think that there's already been clear comparisons drawn and boxing is just decidedly much worse. While the data set may be much smaller, you can already make initial comparisons between someone who's been in MMA for 10 years vs someone who's been boxing for 10 years.<MrKoontar>: has there been? i have yet to read this study, if you could find it again and provide it id love to see it. if you're going based off of simply \"hurr durr he hit his head more\" then im sorry to inform you there are many mechanisms involved in concussion and brain trauma that can cause encephalopathy just as often as taking a punch to the head, how often does a football player get punched? in MMA you can take knees, elbows, get ground pounded, get suplexed into the mat etc etc<CaptainK3v>: https://journals.lww.com/cjsportsmed/Citation/2016/07000/Combative_Sports_Injuries___An_Edmonton.12.aspx You can buy it there or the relevant summary is here <https>://www.thejournal.ie/the-journal-factcheck-mma-boxing-safety-injury-2713577-Apr2016/ I'll reproduce here &gt;Head injury Probably the biggest concern about MMA (and boxing) is the prevalence and long-term effects of blows to the head, concussion, and traumatic brain injury. So how do the two sports compare on this score? Only one peer-reviewed scientific study has included a comparative analysis of injuries across MMA and boxing in the same study – a 2015 paper by Dr Shelby Karpman from the University of Alberta in Canada. The research, which attracted widespread media attention last autumn, found: Professional boxers were more likely to sustain no injuries in a given contest MMA fighters were more likely to sustain injuries in general, but those injuries were more likely to be relatively minor (bruising, and so on). Professional boxers, on the other hand were significantly more likely to suffer severe injuries, including loss of consciousness and serious eye injuries such as retinal detachment. Boxers were almost twice as likely to sustain a concussion that involved a loss of consciousness Average medical suspensions for boxers were 26 days, compared to 20 days for MMA fighters, which also suggests a higher prevalence of serious injuries You should drop the thesaurus and focus more on making cohesive arguments instead of trying to sounds smart. &gt;then im sorry to inform you there are many mechanisms involved in concussion and brain trauma that can cause encephalopathy All this shit is getting bonked in the head. Bonk head, bruise brain, brain work worse. Boxing bonk head lot, brain break more. Why does it matter if you got knocked out by a punch, kick, door, car, whatever? Or did you just want to use the word encephalopathy since you just learned what it meant watching Greys Anatomy?<MrKoontar>: why does it matter how you get knocked out? because the force that a punch transmits to your brain \"bonking around\" is smaller than if your head hits the ground or you take a knee to the head Also if you actually bothered to read even the summary the data compiled is a post-fight analysis, nothing in this study has shown any definitive proof of increased incidence of CTEs (which as a mentioned earlier is definitively examined post-mortem) which going back to my original point that there is not enough significant data collected on the relatively infantile sport of MMA to show conclusive evidence that MMA fighters dont end up \"retarded\" as often as boxers. Just last year we had Parsons become the first MMA fighter to die at the age of 25, and guess what, he was diagnosed with CTE post-mortem. im sorry if my diction flies over your head, i dont usually copy/paste articles verbatim to get my point across, they discourage that in medical school<CaptainK3v>: Right sorry, makes perfect sense. Every punch, kick, knee, baseball bat, tackle, and slam all hit with consistent force. Since they're all the same every single time, it totally makes sense to nitpick over the tool used to apply force to the skull. Too bad you can like measure the amount of concussions people have practicing in a given sport. Not that it would matter, it's not like there's a link to concussions and CTE. <MrKoontar>: but...you cant definitively measure the amount of a concussion. concussion protocols are growing almost every year with more understanding but the methods used are still for the most part rudimentary and not specific/sensitive in diagnosing the amount of damage actually done <CaptainK3v>: 0&gt;1?<MrKoontar>: i guess concussions are all the same to you, go figure, sounds like you've had plenty<CaptainK3v>: Have fun at \"med school\"!", "num_messages": 16, "avg_score": 1853.875}
{"start_date": "1544733205", "end_date": "1544760949", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 19190, "text": "<handlit33>: U.S. Military Honors Sacrifices Of NFL Players By Wearing Jerseys Throughout December <Eric_Fapton>: They are out there making millions of dollars to play a sport they love. They are making no sacrifice. I don’t get it. I have an idea, let’s honor all the billionaires who sacrifice their humanity and the environment in the name of profit. God Bless them. Edit Lol. The Onion. Just noticed lol. Im a jackass.<DrButtLicker69>: Are most soldiers doing it or free? No, they are getting paid what they are worth, just like the NFL players. If you don’t like that you don’t like capitalism or America. <Livy_the_Modern>: Soldiers are not being paid what they are worth in the same sense as a football player. The army isn’t a business or run by capitalist principles. It does not create wealth. It’s literally the exact opposite, it’s a drain on wealth. But then you can argue it protects wealth and so on. That being said you can hold the sentiment OP holds and still love capitalism, a Soldiers worth is not measured in quarterly sales. (even though it’s the Onion and his opinion was out of place to begin with.)<DrButtLicker69>: The vast majority of soldiers join up because of the pay and benefits, which is often the most they can get with their education and skill level. In that context they are getting paid exactly what they are worth. <Livy_the_Modern>: Is the nfl any different? By your argument I have a higher education than most players, but I’m in the Army and making waaaaaaaaaay less than the average nfl player. On average 80% of Majors have a masters or higher and still get paid waaaaaaay less than an nfl player. That being said higher education does not equal intelligence or competence. <DrButtLicker69>: NFL players are world class athletes and their job generates billions. There are only a few thousand people in the world that can play NFL football. Any schmuck with a high school education can join the army. <Livy_the_Modern>: You are the one that brought up education. Now you’re deflecting to skill. The NFL is a business, the Army is not. Your worth is not based on the income you create because it’s not the purpose to create any. Any schmuck can’t join, There are still requirements and one if the reasons less than 1% serve. It’s the same reason the retention rate is very low as you move up in ranks. To get anywhere above E7 or O4 requires some of the best and smartest leaders in the world within the profession of the military. People who can manage hundreds to thousands of Soldiers and millions of dollars of equipment on and off the battlefield. You’re dumbing down the Army based on false presumptions and assuming the army only consists of private’s with no training.<DrButtLicker69>: Less than 1% serve because most people with better options take those options. Which is why they typically don’t get the best and brightest to sign up. Sure there are some great and talents people. But most are bottom of the barrel guys who would be working at McDonald’s if the army didn’t take them. <Livy_the_Modern>: The NFL is what you see after filtering out all the rest, decades of lower level playing, highschool, competitive leagues, college then pro level. You only see the best at this point. The army doesn't have a lower level to train before you're a Soldier. We are bunched together from the start. I train the new Soldiers ( think high school player) to hopefully become a NCO or field grade officer (pro player) all the while we work together, no separation by leagues. The Army, over time, creates the best or you don't make it. Everyone cannot make it 20 years in the Army. 1% of the 1% make it. To go back to your initial statement, again, just because many join instead of going to college does not make them stupid or incompetent. Just today I had one of those \"mcdonalds\" level Soldiers working on a $25,000 piece of commo equipment and fixed my problem. There is a very small group of Soldiers I've met that joined because they had no other option, your opinions are coming from 0 experience and lots of action movies and false assumptions like this dumbass idea that they'd only be able to work at mcdonalds. <DrButtLicker69>: I grew up in a navy family. Both my parents are navy vets. My brother has been in the army for 12 years. I know exactly what I’m talking about. He was an idiot, barely passed high school, and would have likely ended up in jail if not for the army getting him out of trouble when they wanted to send him to Iraq. Every guy I grew up with that went into the army was an absolute moron with nothing else going for them. Granted they all joined during the Iraq war when the army was desperate. <Livy_the_Modern>: Wow you had family that served that must give you lots of experience. I apologize for trying to teach you about the military; Thanks for your service! /s you know exactly | | that much. =/ AGAIN! Joining the NFL doesn't make you smart. Giving me a few examples of dumb people joining the Army does not reflect the entire army, especially when I just explained the training process leading to a pro player compared to a Soldier or sailor. You are generalizing. I've made my points and you haven't countered a single one with any facts. &amp;#x200B; Also are you parents complete idiots too? Like going to jail if they didn't join?<DrButtLicker69>: 99.99% of people in the military would quit if given the choice between the military or playing in the NFL. Ipso facto NFL players are better. <Livy_the_Modern>: K, guess you win. Now \"better\" means what you'd rather do. =/ So back to my question, your parents? Complete dumbasses; felons?<DrButtLicker69>: They are definitely not educated. But they are fine people. Probably upper tier for military folk though. <Livy_the_Modern>: \"Upper tier for military folk\" So probably much smarter than you or the average American. Because upper tier is at least a masters and more than likely a PHD; probably in business or something like Logistics Management. Plus Naval war college? Maybe trained at a foreign military institute to broaden their training, and I'm assuming commanded a vessel or at least close it it?<DrButtLicker69>: Nah they got out into the private sector. Because they are smart. <Livy_the_Modern>: Okay so they are smart! They joined the military as an intelligent person; weird huh? Have a good night!<DrButtLicker69>: Yeah they did. I said 90+% of military folks are morons. Not everyone. Most people join because it’s their best option, and if it’s your best option you likely suck.", "num_messages": 19, "avg_score": 1010.0}
{"start_date": "1544755548", "end_date": "1544805343", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 38, "text": "<StalkingDwarf>: 'It's ok not to be ok'. Celtic F.C. fans tribute striker who undergoes a break from football due to personal issues. <JohnnyKay9>: Context<HalcyonDaysAreGone>: Scotland and Celtic striker Leigh Griffiths has recently been given a break away from football by his club to give him time to deal with personal issues he's been having off the field. The details of the issues have been subject to much speculation, but Celtic's manager described them just as mental health issues. There are plenty of rumours, but because they are just rumours I won't repeat them - if you really want to see them they're not hard to find. \"It's OK not to be OK\" is a statement used to try and take away the stigma of talking openly about suffering from mental health issues, and to combat the idea that somehow it is a fault in the person if they're not feeling okay sometimes. Putting it all together: the banner held up in the picture is from last night when Celtic played FC Salzburg in the Europa League. The game was held at Celtic Park and it was held up by Celtic fans as a showing of empathy and support for their player. Griffiths wears the number 9 shirt for Celtic, and the picture is from the 9th minute of the game when cheers of support were made by the fans, and the camera broadcasting the game showed the banner on TV. And that's all the context you need, and probably more than you wanted!<JohnnyKay9>: Awesome description, thanks for replying. Hope he feels better.", "num_messages": 4, "avg_score": 9.5}
{"start_date": "1543609662", "end_date": "1543632021", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 11, "text": "<buoyak>: Kareem Hunt's Hotel Attack Aftermath <Snizzysnootz>: how is this not a bigger news story? disgusting this guy should be banned for life and NFL fined millions for ignoring this<DIRTYDAN555>: Yeah that won't happen. NFL won't suspend players for getting in fights with random people. If this were a guy no one would care. It's not domestic violence either since they didn't know each other. <FlyNSubaruWRX>: He was cut..", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1544626279", "end_date": "1544651701", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 60736, "text": "<boi_thats_my_yeet>: Goal keepers header in the 95th minute wins the game for his team <nobo71>: He’s like “Yeah all you bow down to me”<poopellar>: \"Look at me, I'm the forward now\"<susheelr>: Speaking of the dramatic, I feel like not many instances can top this - https://youtu.be/PrFOTT_y8C0 <The_DayGlo_Bus>: If I remember right, this goal was even more dramatic because they were facing relegation- a loss or a tie would have seen them demoted a league.<htx1114>: Speaking as an American, that whole leagues thing seems so fucking confusing. My British/English (idk which to say) brother in law even tried to explain it to me but that was during my bachelor party so not much of what he said stuck with me...<The_DayGlo_Bus>: Picture it like this: your favorite MLB team finishes the season as one of the 2 worst teams in the league, bottom of the standings- they get sent down out of MLB and become a AAA minor league team, while the 2 best AAA teams get promoted to MLB. That’s why it was crazy when Leister City won the English Premier League a few years ago- it would be like a AA team jumping up 2 leagues in 2 years and winning the World Series.<kokell>: Or if you’re CFB inclined, the worst two PAC12 teams switch spots with the top two of the Mountain West<owlbrain>: This example works better than baseball. <luzzy91>: Not really. MW and PAC12 are both still college football. Baseball is literally a premier league and then the lesser league. The difference in real life skill level doesn't matter for a comparison like this. Also, more people have heard of major and minor league baseball as opposed to mountain west college football.<owlbrain>: Well except the minor league teams are effectively owned and operated by the major league teams. That's not how the tiers work overseas. A minor league team couldn't compete against a major league team no matter what as all the good player would be reassigned to the main team. In CFB mid major teams beat major teams all the time. Also in college football the power five conferences get automatic invites to (better) bowl games that the MWC doesn't. Which would be very similar situations to getting invited to the champions league and things like that overseas.<luzzy91>: Idk, I agree with you but I still think that in a comparative, uh, descriptive sense, a single A team going to AA, a AA going to triple, and a triple going to the \"premier\" league makes more sense. The real life skill difference doesn't matter in a for-fun comparison like this.", "num_messages": 12, "avg_score": 5061.3333333333}
{"start_date": "1543591979", "end_date": "1543856231", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 90, "text": "<TooShiftyForYou>: Boston's David Krejci got his tooth knocked out on a big hit from Thomas Hickey <dazedporpise97>: aren't these the hits to the head that the NHL wants to avoid? or is it just when a player gets knocked out do they care <GTOfire>: Yeah Hickey leaves the ice with both feet on that hit, I thought that was one of the criteria for a Charging penalty. Most of it appears clean, keeping the elbow down and not even leaning into it that much where there would be only a tiny point of contact, but it's definitely a high hit, made higher by jumping up into Krejci.<dazedporpise97>: plus if he's knocking a tooth out with the hit, the head is definitely in the point of contact. Glad Krejci didn't get hurt<crzycanuk>: Not downplaying the fact that there was head contact but there is a good chance it was just the crown knocked off a dental implant. Someone who has been playing pro hockey that long prob has a few of them. The crowns come off rather easily compared to knocking out a real tooth. I used to take mine out before playing so I wouldn’t lose it.<dazedporpise97>: yeah not saying it's not easy to dislodge an implant but the fact that there's still contact to the point that something was dislodged creates an issue that should've had it looked at", "num_messages": 6, "avg_score": 15.0}
{"start_date": "1544490151", "end_date": "1544562366", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 3672, "text": "<TooShiftyForYou>: Basketball player tried to hold off on committing a lane violation <seeking_horizon>: The total lack of anybody in the clip reacting really sets this apart<Jimmy6shoes>: It was the third time this game she did it<Dangermommy>: You just reminded me of a girl I played volleyball with in high school. She was super tall. I think her height was listed as 6’2 on the roster, but she was probably really 6’ even. Super tall for a girl our age. Freshman and sophomore years, she was a good player. Senior year, she came back from an intensive summer program and was full on awesome. Got a scholarship to a state university even. But junior year, she was not so great... She played her position just fine. But for some reason, she could not serve the ball to save her life. I don’t mean she hit the net or served out of bounds sometimes. I mean she went full on physically retarded every time she tried to serve. Sometimes she’d toss it up and whiff it, complete swing and a miss. Sometimes she’d sail it 15 feet out of bounds on the far side. Quite often, she’d send some weird angle shot into the stands, or hit the bench. Sometimes she’d just tip the ball and it would sort of roll away. It was fucking terrible. We all got completely used to it. You just had to watch your back instead of the other team when she was up to serve. Otherwise, we’d barely react either. Other teams and fans, however, never seemed to think it got old. That poor girl put up with a lot of razzing for it for the whole season. But then she came back the next year with a serve like a fucking laser beam of death, so she showed them in the end lol. Edit for typo <canesfan2269>: She had the yips. It's weird but happens all the time. <phl_fc>: I had a roommate in college who got the yips and forgot how to throw a baseball. His mechanics looked like the way you throw when you try to use your non-dominant arm, just really jerky and mostly he spiked the ball into the ground. It was hilarious, he claims he used to play ball in high school. <JaxJags904>: This happened to me. I played catcher and could throw kids out at 2nd, but need me to toss it back to the pitcher with everyone watching? Couldn’t do it consistently <El-Dude>: Rube? You ever try reading Playboys?<JaxJags904>: Love that movie lol. But yeah that was me. Literally. I started playing outfield because of it<El-Dude>: I feel ya. Freshman year of HS I couldn't throw a ball within 15 feet of the first baseman from shortstop. The yips are weird man.<JaxJags904>: It’s a very real thing. It was something about that distance. In warm ups I’d be fine at first, then as you back up I’d hit a spot where I start to overthrow/underthrow, and then you get further and I start putting the ball on your chest again. I always made sure I was the one without a fence behind me so bad throws didn’t make the other guy run lol", "num_messages": 11, "avg_score": 333.8181818182}
{"start_date": "1543516478", "end_date": "1543554303", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 9451, "text": "<TooShiftyForYou>: Muay Thai fighter KO'd his opponent and the referee <Thpanth>: Time for an AMA with that ref<mrubuto22>: He didn't survive <ctwagon>: F<RespondsWithFBot>: F<_Deacon_>: F<Chaotictanker>: F<RespondsWithFBot>: F<Lugnut7>: F<RespondsWithFBot>: F<Nelorus>: F<RespondsWithFBot>: F", "num_messages": 12, "avg_score": 787.5833333333}
{"start_date": "1543409953", "end_date": "1543593031", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 20568, "text": "<PM_me_your_pee_video>: Cowboy Cerrone flips off Nathan Diaz, Nathan returns the favour two rounds later <SwankyTiger10>: Does Nate have a disease that prevents him from looking like he has muscles?<plethora-of-pinatas>: Yeah it's called, \"everybody's on steroids.\"<SwankyTiger10>: I mean this one time, I went to the gym for like 2 months straight and looked a Lottt more defined than Nate hah. I'm honestly amazed he can do workouts (not necessarily lifting weights, idk what he regime is) and not look toned in even the slightest.<Mr-Noir>: It's just genetics that effects how you look. He doesn't look strong or ripped but that doesn't matter because he obviously has great strength, conditioning, and endurance in order to be such a good fighter. <TheRealOwnerOfReddit>: &gt; It's just genetics that effects how you look No it is isn't this is straight up retarded. Genetics effect muscle insertions and attachment points, but actual looks are dictated by bod fat percentage and muscle mass. Anyone can be jacked, blaming genetics is the lazy man's way out of hard work and diet.<ExGoldenChild>: I have a buddy who's been hitting the gym strait for yearsss and is on a strict diet + cardio. I can hit the gym for a month and looked more ripped and I'm a bum. I think you're the \"strait up retarded\" one. I can tell by your response, retard.<brainiac2025>: No offense, but his response is backed up by science, so I don't know how the fuck you're the upvoted one here. Literally anyone can look ripped, that's why there are literal workout routines targeted for aesthetics. If you track your macros and lift and cardio accordingly, you will be ripped, it doesn't matter how shitty your genetics are. It may be harder for some people, but that doesn't mean shit in the long run. <SwankyTiger10>: So are you implying that Nate just does not workout or something?<brainiac2025>: No, I'm not saying that. I'm saying that arguing some people can't get ripped is fucking idiotic and untrue. Literally everyone on the face of the Earth that is not disabled is able to work out and get a defined physique if that's what they choose to do, that's just not important to Nate.<SwankyTiger10>: But for some people it IS harder for some people to get ripped compared to others correct (to varying degrees ofc)?<brainiac2025>: Harder, yes, the other poster claimed it was basically impossible because some people just don't have those genetics, which is complete and utter bullshit.<SwankyTiger10>: I don't think he was saying it was impossible, just varying degrees of difficulty to get ripped. And one degree being, someone can workout 30min a day 3 days a week for half a year and barely look toned.", "num_messages": 13, "avg_score": 1582.1538461538}
{"start_date": "1543616309", "end_date": "1543621853", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 7, "text": "<khamulscience>: What body hair should a male athlete remove from his body (thigh, underknee-foot, fist, forearm, joints...). I selected soccer as flair but I would appreciate it if you mention for archery, martial arts &amp; for track and field too. <Neylag>: Some swimmers remove hair to reduce water resistance. It’s otherwise useless to remove hair for anything else. <w1n5t0nM1k3y>: It's customary for road cyclists to shave their legs. Some claim aerodynamic effects, others say it helps healing in case of road rash. Others say it makes leg massages better. Others just do it for looks or to conform with everyone else . Whatever the reason, that's just the way it is.", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1544703722", "end_date": "1544742694", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 7619, "text": "<rcarney12345>: Imagine turning up on a Sunday morning hungover and see Paul Scholes is lining up for the opposition <captnmcfadddn>: I read somewhere the absence of career football created a massive hole in his life. He struggled mentally as a result<geetupsausage>: I'd say him and every other bloke who played till 34.<captnmcfadddn>: Especially when you've been soaked in glory <gingerninja005>: Absolutely dripping<BrotherBodhi>: Some would even say he was *wet*<gingerninja005>: Pure, unbridled wet filth <Ri2850>: Calm down lads! You'll make a mess. <gingerninja005>: Too late bud, I've filthed my pants harder than a Scholesy banger against barca", "num_messages": 9, "avg_score": 846.5555555556}
{"start_date": "1543623635", "end_date": "1543696604", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 7876, "text": "<TheKillerRabbit1>: Grandpa watches his grandson make his NHL debut <jll657>: Every rural Canadian grandfather's dream.<SilkyGazelleWatkins>: It's funny that's it's grandfather. Like it took two tries and an extra 25 years because the son is a disappointment. <pmvail>: Gotta love your cynicism. Are you single?<SilkyGazelleWatkins>: I'm married. Wasnt being serious it was a joke. <pmvail>: I know you were joking. That’s what attracted me to you. <SilkyGazelleWatkins>: If I wasn't already married...", "num_messages": 7, "avg_score": 1125.1428571429}
{"start_date": "1543621211", "end_date": "1543642335", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 681, "text": "<PhantomHunter69>: After the video of him kicking a women was released, someone changed Kareem Hunts position to Kicker on Wikipedia <leonard017>: The chargers might actually trade for him now.<Dream_Now>: He is no longer a chief, anyone can take him, but he's still not playing the rest of the season.<ervfizzledout>: I think you missed the joke<Dream_Now>: Haha yeah it went right over my head, I see the play on words now.", "num_messages": 5, "avg_score": 136.2}
{"start_date": "1539743180", "end_date": "1539891864", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 1202, "text": "<TooShiftyForYou>: Jamie Benn and Miles Wood let the punches fly <Keyboard_Gene>: I've always wondered, wouldn't that hurt? I mean his helmet comes off eventually, but beforehand you're wildly swinging and just as likely to hit his face as you are his helmet, wouldn't that hurt..a LOT?<Loplopool>: Not really, you gain majority of the power from punches from your lower body, they can’t get enough traction to get a proper strike the majority of the time <wary>: don't believe that for a minute. I agree that you get more power through your lower body, but shoulder and hip turn generate more than enough power to devastate someone. <nate1235>: Someone doesn't physics. Every action has an equal and opposite reaction. When you punch an object, the force is literally coming from either your body's change in momentum, or from the friction of your feet on the ground. <TheFlyingSaucers>: You are aware that players can control their friction by adjusting the position of their skate blades right?<nate1235>: Yeah, and they seem to be doing a fantastic job of that in the video.. <TheFlyingSaucers>: Because every person has the same amount of fighting skill...Jamie Benn is a skill player who is also super tough. The really good fighters will put theirs skates at an obtuse angle for power. Here’s an example from a while ago: <https>://youtu.be/yJJPivHWy2k Skip to 1:13 for fight<nate1235>: Dude, you're missing the point. Someone said earlier that the power of a punch comes from the torso, but all I'm saying is that the torso merely transfers the force from the friction of the ground to the offending party's face. <TheFlyingSaucers>: It seemed like you were saying they couldn’t get friction though <nate1235>: Obviously they can. These guys aren't doing a great job of it, though. I would say that they would hit harder if they had shoes on and weren't standing on ice.", "num_messages": 11, "avg_score": 109.2727272727}
{"start_date": "1543607511", "end_date": "1543705845", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 40, "text": "<davidtarr>: Kareem Hunt Kicks Woman in Hotel Elevator Video <HBoriginal>: This doesn’t deserve punishment. Maybe a slap on the wrist.. a little fine or one game suspension tops. I watched all the interviews with his friends and the woman, and it appears as tho the young lady was the aggressor, slapping him and using racial slurs. She kept coming back for more. <Issuesjustus>: Quit justifying domestic violence. It isn’t okay to hit a woman ever just like it isn’t okay to use racial slurs<HBoriginal>: If you’re being attacked by a woman, it’s very okay. No pass. Equality, right?<Issuesjustus>: I mean he’s a NFL player who is a lot stronger and faster than she is. It’s pretty simple, just walk away. <HBoriginal>: I agree he should have. However, she kept coming towards him. She learned a valuable lesson: Don’t slap a pro-bowl NFL Running Back. <Issuesjustus>: Especially when he’s a high profile player like he is. He has everything to lose. She doesn’t. <Commonsbisa>: Because no team will hire him now. /s", "num_messages": 8, "avg_score": 5.0}
{"start_date": "1544321287", "end_date": "1544760567", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 15, "text": "<buckeyes2121>: Kyler Murray wins <requisitename>: OU has become Heisman Quarterback U. 2003 - Jason White, 2008 - Sam Bradford, 2017 - Baker Mayfield, 2018 - Kyler Murray! Boomer Sooner for my alma mater.<replyrealquick>: nfl bust U// manziel also no?<requisitename>: awwww, is somebody feeling left out? Bite me. Manziel went to Texas A&amp;M<replyrealquick>: brain damage<requisitename>: I love that your user name is replyrealquick, but you're replying to a comment I made four days ago. So, there really is some brain damage? lol<replyrealquick>: maybe i dont spend my life on here and just use the name to....idk make a quick reply at times", "num_messages": 7, "avg_score": 2.1428571429}
{"start_date": "1544759555", "end_date": "1544761191", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 12, "text": "<Nerdlinger>: How Craig James went from the voice of college football to TV pariah to seminary graduate <MyDogFanny>: &gt;James, 57, made a flurry of inflammatory statements, including that gays “would have to answer to the Lord for their actions” and that being gay is “a choice.” He criticized an opponent for taking part in a gay parade: “Right now in this country, our moral fiber is sliding down a slope that is going to be hard to stop if we don’t stand up with leaders who don’t go ride in gay parades.” Even Los Vegas won't give odds on whether or not James is gay. <Fiveinchtaint11>: I wonder if Las Vegas would?", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1543626355", "end_date": "1543635960", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 19, "text": "<still_good_milk>: Dude came into my shop with a John Daly signature. I'm honored. <MudandWhisky>: Good Lord. It looks like a 55 year old toddler lesbian wearing her grandfather's pants on stilts.<still_good_milk>: I.e. POTUS<Galbert123>: I know I’m in the minority, but these jokes are old af", "num_messages": 4, "avg_score": 4.75}
{"start_date": "1544573168", "end_date": "1544958839", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 502, "text": "<TooShiftyForYou>: The Cowboys couldn't find an elbow brace big enough for Tyron Smith's arm so he wears a knee brace instead <puppykittenstarwars>: I’m not a football player but a friend of mine watches. He told me that an elbow is like an arm knee. <Al_Pacino_Tick>: Oh, my cousin wasn’t a doctor. He said the same. <slasian7>: I can lick my knee. Can you?<Alcott_Yubolsov>: I can canoe! Can you canoe?", "num_messages": 5, "avg_score": 100.4}
{"start_date": "1543627234", "end_date": "1543684119", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 58, "text": "<DizzleSlaunsen23>: The game the NFL wants you to forget. Bad referees, disgruntled fans and an all around bizarre game and outcome. <DHydraLauncher>: Seen it before. Still great vid tho...<DizzleSlaunsen23>: Sorry just came across it while on YouTube earlier and found it interesting I had never heard of/don’t remember this game taking place. But it’s a cool video either way Imo <DHydraLauncher>: It is great. I really like KTO", "num_messages": 4, "avg_score": 14.5}
{"start_date": "1543602209", "end_date": "1543627645", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 30, "text": "<dreamteamreddit>: This scorpion goal by Agustín Canobbio (Peñarol) was voted goal of the year on the Uruguayan league <henryhyde>: These commentators are fighting the stereotype. Zero hype on an amazing goal.<cogentrock>: It’s a recap of the game, not the live commentary", "num_messages": 3, "avg_score": 10.0}
{"start_date": "1544762747", "end_date": "1544895890", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 14909, "text": "<TooShiftyForYou>: Chargers score a TD with 4 seconds left and go for 2 and the win vs Chiefs <jfurt16>: How the fuck was he so open<AnyLamename>: Crossing route, both defenders went with the same guy?<tacos>: but before that, they didn't even try to check the catcher like they each made up their mind before the play started, or at least the defender on the outside<thatwasntveryraven>: &gt;catcher<tacos>: well they're all receivers, but one of them actually caught the ball, so he's the catcher<thatwasntveryraven>: So one that doesn’t receive is still a receiver, but one that doesn’t catch is not a catcher?<tacos>: in our arbitrarily-defined football lingo, yes also, I have no idea of the sexual preferences of either player<GoPadres69>: Football? I have never understood how this sport is called football, when the ball is thrown? More like National Handball League. <WompSmellit>: Football is a very old term for a game played on foot, rather than on horseback. There are a lot of kinds of football: American, Australian, Gaelic, Association, Rugby, probably more. They're all descended from British schoolboy games that were called football because they were played on foot. <GoPadres69>: Then why isn’t tennis, racquet ball, basketball, baseball, etc., also called football? Aren’t those sports played on foot? They all use a ball too. Any idea? <WompSmellit>: They didn't evolve from British schoolboy games called \"football\"? [I mean, I'm not making this up, this is where the name comes from.](https://en.wikipedia.org/wiki/English_public_school_football_games)<GoPadres69>: I hear you. But I did some research and the actual understanding or qualified term is the act of kicking a ball to make a goal. The term has derived into different variations today. <WompSmellit>: Read the article I pointed to. In the **17th century** they were talking about \"football\" that was more like rugby or US football: &gt;There is a reference to \"get hold of the ball before [another player] does\" or to \"snatch\" it (Praeripe illi pilam si possis agere) suggesting that handling of the ball was allowed. It is clear that the tackles allowed included the \"charging\" and pushing/holding of opposing players (\"Keep him out\" above, \"drive that man back\" in the original, \"repelle eum\" in original Latin). This game is likely to have been similar to rugby football.<GoPadres69>: Interesting. However, I have also read sources stating football dates back as far as the 9 century. Nonetheless, I know many people will say it’s my personal view; but I consider true football using the feet. To each his own. I find the NFL very slow and boring, plus all the commercials are a killer. <WompSmellit>: Watch what you want, I don't care. I'm just talking about where the name comes from. \"Football\" = \"game played with feet\" is probably a false etymology, is all I'm saying. Anyway, I'm done. Enjoy your kickball. <GoPadres69>: Football, not kickball. And enjoy your throw ball", "num_messages": 17, "avg_score": 877.0}
{"start_date": "1543511323", "end_date": "1543536438", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 38285, "text": "<conez420>: Edson Barboza KOs Beneil Dariush with a perfectly timed flying knee at UFC Fight Night 106 <wuapinmon>: That was so fast I had a hard time pausing it to see what he had done. <5under6>: Almost as fast as the ref to stop the fight!<Rubthebuddhas>: Yep. Ref knows that shooting in and meeting a knee with a face is usually an end to an evening. Good job by the ref. <dirtyharry2>: He actually peels off even before the ref gets there. Normally you fight until the stoppage, but that was a no-doubter.<Lord_Moody>: you had the chance to say no-brainer there for comedic effect<cyclicalbeats>: And what kind of animal says no-doubter? Get your shit together Eastwood<ZendrixUno>: Gwen Stefani fans?<pragmatics_only>: Nah, Stefani fans don't speak.<PhillyDilly23>: Nice<pragmatics_only>: Mfw you didn't respond with \"I know just what you're saying\" :(<FunnyReference69>: Lyrics chains are the devil though. <pragmatics_only>: Yes but this is more than a lyric chain. It is objectively the correct response. [Observe in low effort meme format](https://imgflip.com/i/2ns8mg)<FunnyReference69>: I mean, it is a lyric and also a continued reference *in that instance* but it encourages someone to post “so please stop explaining” and we are circling the drain. The juice ain’t worth the squeeze in this case.", "num_messages": 14, "avg_score": 2734.6428571429}
{"start_date": "1543628968", "end_date": "1543644900", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 111, "text": "<DrMudo>: Wrong State Printed on Hat. (In Maryland) <DrMudo>: The back of the hat said Badgers lol<MrInternetDetective>: You planning on keeping it?<DrMudo>: I didn't buy it.<barricadeNG>: I would have definitely bought it. Even though I have no ties to either state<DrMudo>: Yeah I know man. I thought about it the entire time I was at the store.", "num_messages": 6, "avg_score": 18.5}
{"start_date": "1543629747", "end_date": "1543630802", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 14, "text": "<IndoorBurrito>: Why Kareem? We had such a good thing going. <DangerNoodle94>: Rip fantasy leagues across the nation if true. <IndoorBurrito>: Got it from their official Facebook page. <DangerNoodle94>: Jesus Christ man. Such a shame. Shitty to think of the long trend of big time NFL players in the spotlight over violence in public. <IndoorBurrito>: Dude could have been a long time Chief and potential HoFer if he kept it up. Fucked it all up. <DangerNoodle94>: Honestly less about that, more about CTE really rearing its head. Wouldn't be surprised if this guy has trouble leading a normal life after another two years in the league, probably has a hard time dealing with anything to this day. Classic symptom of CTE is acting out of character, short tempers, can't deal with emotions... Poor guy, poor girl, every part involved man. Big time big succ. But, let's be honest. Even if the chiefs drop him for good, he's too good to not get picked up. He'll be off the commissioners exempt list in no time and starting rb for a new team. <IndoorBurrito>: You’re right. That crossed my mind too. Just crazy we’ll never see him play another down in red. <DangerNoodle94>: Definitely crazy for sure. After the disappointment rg3 brought to the team a few years ago, it was awesome following the league again and seeing the hunt-mahomes combo just light it up made me so happy.", "num_messages": 8, "avg_score": 1.75}
{"start_date": "1544674332", "end_date": "1544699743", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 46332, "text": "<TooShiftyForYou>: Dallas Mavericks Luka Doncic got left hanging and high fived himself <appolo11>: He is absolutely the future of the NBA. Smart, uber talented, doesn't get into trouble, funny. This is the best 19 year old you will see for a long time. <gunsof>: Did he used to play for the Real Madrid team or is it a different guy?<appolo11>: Yep, he has been playing pro for 3 years already, even though they consider this his Rookie year. <yoloGolf>: Pro at 16? Sorry but that's too young. <appolo11>: Really? Why do you think?<Buffaloheartknowles>: I think it depends on the training. I know he has professional trainers and a well equipped staff behind him, but if he goes through constant stress and training it could really affect his body. Not that the NBA is really physical in game like the NFL kinda contact (no hate just fact), dude just needs to be careful with himself. Also the notion of school is brought up. But that’s more personal belief so I won’t go into it. <appolo11>: Your body is meant to be used to its fullest capability in its prime, which is where he already is. Not everyone grows and matures at the same rate. This guy was obviously developed physically and mentally before most people. Body wise, living in any other century outside of the 21st would have more than likely been MUCH harder on a human body. And he has the best nutritionists and trainers and physios to keep him healthy. School?? Seriously? You go to school so you can learn a marketable skill that can support you in life. This guy already has this mastered. He is already wildly more successful than 99% of people ever will be. He can read Proust when he's good and ready. Until then, I dont care if he is illiterate and needs help ordering off of a McDonald's menu. He isnt getting paid to read us bedtime stories, or solve an organic chemistry formula. He is paid to play basketball, which is why we all watch him. You let me know the next time the 4 foot 0 inch asian chem/bio double major hits a shot like Doncic. Because with that logic, the chem major should ALSO be forced to pass some high level physical text to be qualified to be a good chemist.<Buffaloheartknowles>: No need to go off. I said school was a personal belief so I wouldn’t bring it up. So yeah, I agree, he doesn’t need school. Chill. As for physical, sure you’re right. Trainers and nutritionists probably got him covered and he’ll be fine. Not like he’s going through NFL contact. So yeah I take the whole comment back and I’ll go back to lurking. <appolo11>: Don't go back to lurking buddy!!! Debate and difference of opinion is what we are all here for!! You're all good!!<Buffaloheartknowles>: For sure man. Just felt it got heated for a sec lol. What I was gonna say is I used to play lacrosse year round when I was in high school, which in no way was as much work as being an NBA athlete, and I pulled my groin cutting. Still bothers me 6 years later after physical therapy for it and all. I think this could easily happen to anyone and I like seeing Luka play, and he seems like a funny dude, so I just wouldn’t wish something annoying like that upon him. <appolo11>: Dude, I've tore my calf twice and my hamstring once. All in my 20s. Still bothers me to this day. Lol. But we never see specimens like us in pro sports because the hurdle to compete there has weeded us out long before we got there! Lol<Buffaloheartknowles>: Oh dude fair enough. That absolutely sucks and I’m sorry for ya. Lol. But yeah you right. Pro athletes are a totally different breed. Actually the funny part is I didn’t even know he was only 19. And I totally forgot that he was THAT RM kid. He’s always been crazy.<appolo11>: Yep! He is a verifiable veteran at this point! Lol", "num_messages": 14, "avg_score": 3309.4285714286}
{"start_date": "1543629909", "end_date": "1543630105", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 8, "text": "[deleted]: Kareem Hunt, former Chiefs running back, has been released for brutalizing woman. [deleted]<DParson24>: Someone will pick him up. That’s how the NFL works.<y2jkamryn>: Dallas", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543629975", "end_date": "1543647466", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 360, "text": "<AnukkinEarthwalker>: Chiefs release Kareem Hunt <dinklberg1990>: That leaves tyreek hill whos offense was way worse still on the team but hey nfl doesn't care unless it happens under there brand.<Tayxbeatz>: No, the NFL doesn’t care unless it’s on video as seen by the 10 month delay in him being suspended.<MasterNich>: Joe Mixon?<jankadank>: What did the nfl to to mixon <MasterNich>: There was video of that brutal display. It’s a shame he is still able to play, especially if Kareem Hunt is purged because of this altercation. <jankadank>: Like I said.. what did the nfl do to mixon <MasterNich>: They did nothing<jankadank>: Exactly <MasterNich>: I guess I’m confused on your stance <jankadank>: Obviously", "num_messages": 11, "avg_score": 32.7272727273}
{"start_date": "1541624072", "end_date": "1541638074", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 146601, "text": "<Scaulbylausis>: Little kid outplays Rodger Federer with a perfect lob shot <DayManFanatic>: That big grin on Federer’s face is what it’s all about!<Biggie909>: The next serve came in at 140mph. <Zizerix>: *Child dies from tennis ball wound.*<_lord_kinbote_>: It was the exit wound that really did him in.<kopecs>: I thought it was the blood loss?<kmoose1983>: No, he was already dead... he just didn't know it yet<Beaniehobo>: \"Omae wa mou shin deru\"<Taldius175>: *Nani?!*<lesser_panjandrum>: ***high pitched tennis sounds***<2Cthulhu4School>: sorry sorry sorry sorry<ssamja_dance_king>: Shawty shawty shawty shawty", "num_messages": 12, "avg_score": 12216.75}
{"start_date": "1543520304", "end_date": "1543522436", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 34, "text": "<upo_kalabasa>: XFL is bringing pro football back to St. Louis in 2020 <mazerbean>: \"pro\"<Khazir>: I mean, as long as you're paid for a job it makes you a professional lol. <w1n5t0nM1k3y>: Their salaries aren't far off from CFL.", "num_messages": 4, "avg_score": 8.5}
{"start_date": "1543557885", "end_date": "1543569179", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 451, "text": "<Stonefree2011>: Justin Gaethje times his right hand against his opponent and brutally finish him. <Destino2018>: Damn didn’t even look at him when he threw that. Just pure instincts and timing did all that damage. <MeGrindlok>: Pretty sure he was peeking down through his guard at the other guy's sternum to know where his center was, and had enough time in the match to know where the head level was relative to his own shoulders. Justin lulled him into not moving his head by being turtled, because fighters can get lazy when they think they're not going to get counter-struck, so he had center and elevation locked when he fired. Other fighter didn't even have a guard up with his left. He dropped his left when he swung hard right, and, boom, down you go. If he was swinging from the outside-in for a while, he was ripe to get clocked right down the middle.", "num_messages": 3, "avg_score": 150.3333333333}
{"start_date": "1543533139", "end_date": "1543543974", "thread_id": "t3_a1hgzg", "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 7, "text": "<Speerik420>: Drivers commit a lot of this \"detail\" to subroutines and it only takes a few split seconds to check on stuff like oil pressure or roll bar strength for example. Ive raced with an f1 wheel in vr and it was only a few laps in that I could scroll through the menu and check on stuff, while maintaining pace and holding a conversation. Now multiply that by years and hundreds of thousands of laps in both sim and RL. Btw their heartrate gets to about 170 on average throughout a race, which is higher than seen in most other sports. And they lose anywhere from 2-3L of water during a race through sweat. All because they are in a 650kg demon from hell flying at nearly 190mph at times. How they even react to things is mind boggling but the engineering on those cars is out of this world good<IvyGold>: I'm a newbie to VR -- how do you go about getting a F1 wheel and what game do you use to play it with? That sounds like a LOT of fun. <Speerik420>: In my city we have VR arcades with rigs you sit in and it moves. Its a wild experience<IvyGold>: Cool! I didn't know such things existed. I'll have to check around now.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1544755786", "end_date": "1544781372", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 74, "text": "[deleted]: Andrei Vasilevskiy makes an absolutely inhuman save in his first game back from a left foot fracture [deleted]<Bababooey_100>: Great time to be in Tampa. Go lightning. They are destroying everyone.<IDidntParkHere>: 7 game win streak without our starting goal tender.", "num_messages": 3, "avg_score": 24.6666666667}
{"start_date": "1544767228", "end_date": "1544827176", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 100, "text": "<kjampala>: Chargers receiver Mike Williams and Chiefs cornerback Orlando Scandrick are two sides of the coin after a TD catch <AssembledInKansas>: Can’t cover a guy when he’s 6’4” and pushes off pretty hard... definite miss call there. The refs were terrible (for both sides) in this game.<YeezuzDeezNuts2020>: Yeah rivers got crushed by a helmet to helmet after he was already down like 2 minutes before this happened. Refs swallowed their whistles for no reason<AssembledInKansas>: The whole game was a crap fest.", "num_messages": 4, "avg_score": 25.0}
{"start_date": "1543630753", "end_date": "1543634099", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 21, "text": "<skeenz>: Joe Mixon and Tyreek Hill talking to Kareem Hunt <BanAMarvel79>: Don’t forget Jameis Winston.<jvavx>: Jameis didn’t stop after college tho", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1543632306", "end_date": "1543634679", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 31, "text": "<josephpage160>: Does anyone know who signed this ball? I think it might be someone from the knicks <Kylo-Ball2>: That’s Marcus Camry signature <chadlumanthehuman>: He’s almost as good as his brother Marcus Corolla. <Kylo-Ball2>: LOL my autocorrect", "num_messages": 4, "avg_score": 7.75}
{"start_date": "1544727950", "end_date": "1544738995", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 56, "text": "<yarblls>: Traina Thoughts: Stephen A. Smith's Chargers-Chiefs Breakdown Is Filled With Fake News <O_vJust>: It's Stephen A Smith lol<Spicoli69>: Lmao He just spews nonsense it’s wild", "num_messages": 3, "avg_score": 18.6666666667}
{"start_date": "1544713034", "end_date": "1546531104", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 47, "text": "<HealthyDoughnut>: A disturbing look at food served at professional sporting events. <shapu>: Ick. <EDIT>: Nvm Busch Stadium is much cleaner than the surrounding area and is in the top third of all venues. Also fuck Stan Kroenke.<jacobj9>: Fuck kroenke<LordStigness>: Fuck kroenke", "num_messages": 4, "avg_score": 11.75}
{"start_date": "1543630272", "end_date": "1543642254", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 65, "text": "<mods_blow_goats>: The dark lord wins again <Xingua92>: Thanks for your submission to /r/sports, unfortunately your post was removed because it does not comply with the following rules: Rule 1: Low effort posts will be removed. All content must be related directly to sports. No memes or joke posts. After you review our rules, if you still believe a mistake was made message the moderators *in modmail*, including a ***link to the removed post.***<mods_blow_goats>: Lol. 64 karma but low effort. <Xingua92>: This is literally the definition of low effort. <mods_blow_goats>: It’s genius to be honest", "num_messages": 5, "avg_score": 13.0}
{"start_date": "1543573407", "end_date": "1543594189", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 4030, "text": "[deleted]: Europa League at it's best [deleted]<Pyraptor>: I find the goalkeeper and defender hitting each other hilarious, kinda cartoonish. Defender is like.. \"are you fucking serious\"<themagpie36>: What a fucking idiot the defender is too, he thinks its going in and just stops playing. Fucking run for the ball, you don't just stop playing.<PM_ME_YOUR_RADISH>: In his defence, the goalkeeper was in his way, closer to the ball, and can do a far better job at saving that.<ITendToBeKurt>: &gt; In his defence Can confirm, Europeans are here :D<Not_KGB>: &gt;Europeans It's Euroupeans, kthx.<DukeSilverSauce>: i think you you Ureupayans, for serious, thanks.", "num_messages": 7, "avg_score": 575.7142857143}
{"start_date": "1543375536", "end_date": "1543449466", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 121, "text": "<the_hug_event>: 2018 NBA leading scorers by zone <predictingzepast>: What is the need to separate the Kemba Walker area? <RondoCowboy>: Cause they're two separate areas.<predictingzepast>: Well yeah but the same person covers both<AshtonKusher>: Durant's 642 points this season make him the leading scorer. Why not just put a giant Durant over the whole court in that case?<predictingzepast>: He's the highest scoring in all areas? That's why..", "num_messages": 6, "avg_score": 20.1666666667}
{"start_date": "1542993955", "end_date": "1543638598", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 1151, "text": "<TooShiftyForYou>: High School team converts on 4th and 19 to win the State Championship <RollForName>: Great double block to give the QB some breathing room!<SasquatchAstronaut>: Those blocks were beautiful<nopethis>: Better late than never I guess?<SasquatchAstronaut>: Pobody's nerfect.", "num_messages": 5, "avg_score": 230.2}
{"start_date": "1543612979", "end_date": "1543635667", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 5, "text": "<beyphy>: Korean man sets world record on hardest song in Pump It Up dancing video game <shhshshsjwjwiwiw>: Good for him. Bet he worked really hard to be able to see it pay off.<beyphy>: Yup. He's played for several years. As far as I'm aware, he's the only person in the world that's beaten this song \"break on.\" That means that his lifebar never went to zero. If it did with break on he would have failed and it would have been game over. That's what the star at the end indicates. That he beat it with break on.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543166539", "end_date": "1543205535", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 55, "text": "<KrisTheRabbit>: 7 OTs and the highest scoring game of college football history! <toe0011>: *FBS history Division II had a 93-68 game in 2008.<jms14b>: Heck yeah, and the team that scored the 93 is now D1<frick-me-in-the-butt>: Who?<jms14b>: Abilene Christian University. FCS school in the Southland Conference", "num_messages": 5, "avg_score": 11.0}
{"start_date": "1543638018", "end_date": "1543639695", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 14, "text": "[deleted]: SI headline for the win! [deleted]<kg12z>: Am I only one who thinks everyone is over reacting? She called him racial slurs and he pushed her and barley kicked her. There was no lasting damage and while hunt was in the wrong this should be just a 2-4 game suspension.<TheSilentDivide>: “Barely kicked her” is the problem here. It was mostly just a shoving match, but when he walked over and kicked her while she was crouched down on the floor, it was no longer a defensive stance. He became the aggressor. That’s indefensible IMO<kg12z>: Yea fair enough I’m letting my fantasy team get in the way of my morals here<TheSilentDivide>: I hear you bro!", "num_messages": 5, "avg_score": 2.8}
{"start_date": "1544743532", "end_date": "1544815173", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 80, "text": "<IamRocko>: First high school girl to dunk in a Colarado basketball game. <baller_chemist>: Video starts with the white team in possession but y'all new who was gonna dunk it<GiveMeBackMySon>: [MR seeing it start with the white girls](https://media.giphy.com/media/145HxsPPPgOSR2/giphy.gif)", "num_messages": 3, "avg_score": 26.6666666667}
{"start_date": "1543464867", "end_date": "1543584276", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 15118, "text": "<steeZ>: NHL equipment manager with the (unofficial) assist. <IAmMojojojo06>: The announcer nailed it with the calls as well. Made this video about 3x better :)<thebest99>: I find that even the shittier NHL announcers are better all other shitty ones from other sports.<Aanon89>: It's weird, right?<tasteslikesardines>: i think it may be because the sport moves so fast that the announcers have less time to come up with stupid shit<troutpoop>: Agreed, but the intermission report people have plenty of time and you bet your ass they say a lot of dumb shit. Lookin at you Mike Mulbery <LimpNote5>: The guys got nothing on Don Cherry<yolochengbeast>: No ones got anything on Don Cherry<Noir24>: Is he actually a real sports analyst/talker-thing? I mean he looks and sounds like a damn parody<puckstop101>: Don cherry is a culture icon in canada's hockey world. Love him or hate him you have to respect what he has done for the game<Noir24>: I actually have no idea what he's done, I don't have a lot of knowledge of hockey history and personalities. But what I see and hear is a very strange person, that aside I have no other opinions of him.<puckstop101>: He is a very strange person, a heavily eccentric person who says whats on his mind. The typical old guy with no filter which has gotten him to some huge hot water in the past. Its hardto really cover what he has done for the game in a comment field tbh. Actually i would heavily recommend watching the 2 part documentry on him called the wrath of grapes. It is a very good one out out by the cbc<Noir24>: I'll definitely look it up, thanks! :)", "num_messages": 13, "avg_score": 1162.9230769231}
{"start_date": "1544553744", "end_date": "1544720987", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 251, "text": "<holyfruits>: Steph Curry Called Out by Educators for Spreading Moon Landing Conspiracy <IMissTheGoodOlDays>: When did it become cool to question science/historical facts? I know religious people have been doing it forever but no one ever considers the pope to be hip. But now we have athletes who some look up to as gods and often try to imitate them but they probably got coddled their whole educational career so who knows how much they actually learned during their athletic scholarship at whatever university/college they went to. Now they're trying to say they don't think something happened (Kyrie flat earth is another example)? Bro you weren't even born yet when the moon landing happened. Ask your pops who watched the damn thing on TV live. Or ask your mom. I know saying \"stay in your lane\" is bad ever since that lady said that to Bron about politics but in this instance Steph does need to stay in his lane. Spreading fallacies like this does nothing but dumb down the population and the only moon landing conspiracy I believe in is that the rich are trying to make the poor spend time thinking about conspiracies versus trying to think about how to vote to better their situation. <EDIT>: To add I would love if someone in 50 years claimed that Steph and the warriors never went back to back or won 3 of 4 because they weren't alive to see it and they think all the video evidence, documentation of it, and first hand tales of witnessing it are doctored...<evers_island>: You stated that so fucking eloquently that i am definitely borrowing that when this comes up. <batdog666>: No they didn't, Catholics were a major patron of science and the first person thrown under the bus here was the pope. Motherfucker then goes after Kyrie for spreading ignorance while doin it themself.<evers_island>: Catholic’s reputation isn’t the way it is for no reason. The pope comparison is symbolism for the church as a whole. Knowing today’s pope is considered to be fairly progressive maybe makes this point somewhat incorrect but you can easily discern what he meant. Historically speaking the Catholic Church is laughably anti-science, though i do realize the actions of the church over the last few hundred years doesn’t determine where they have gone since. I can still see why people may think of Catholic’s as anti-science. <batdog666>: &gt;Historically speaking the Catholic Church is laughably anti-science Why were there so many scientists monks, why does the Catholic church have a science department and why is the main example of Catholicism clamping down on science Galileo (a known asshole). What is your evidence of them being anti-science?", "num_messages": 6, "avg_score": 41.8333333333}
{"start_date": "1542665121", "end_date": "1543360452", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 39160, "text": "<58Josh>: Father gets emotional when his son scored goal first time <Turbosoldier>: I don’t I don’t sound ignorant but the dad is a total homo for crying... come on, what kind of a man are you dude?<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: If he tried something I’d punch him and he’d probably cry<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t need to know who he is, he’s a giant puss<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t need to, he’s a crybaby whoever he is <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t care about some crybaby, I’d kick his ass<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t care who he is, he’s a pussy,no self respected man cries<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: He’s not a man, he’s a crying little bitch I don’t need to know who he is. <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t need to know who he is... he’s a man that cries, as far as I’m concerned he’s not a man at all. Big puss<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t care to know who he is, some washed up ex hockey player. All we know is that he’s a crying lil bitch!<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I really don’t need to though, you keep saying it but I don’t care who that is. He cries that’s all I know, and that makes him a bitch in my eyes<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: You keep saying that man, but even if I knew who he was... some ex shitty hockey player I’d still call him a big fat pussy!<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I don’t care who he is, he’s a cry baby little bitch! <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: You must be his boyfriend, you’re defending him much <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I’d say it to your face and your boyfriends face<Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I would say it to his face and your face you pussywillow <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: I would make him cry <Thy_Eksiled>: Lol you obviously don't know who Loui is and you probably wouldn't say to his face<Turbosoldier>: Loui’s a big fat pussy and you’re his loyal boyfriend!", "num_messages": 34, "avg_score": 1151.7647058824}
{"start_date": "1544659223", "end_date": "1544725546", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 287, "text": "<TooShiftyForYou>: Bayern Munich's Thomas Muller sent off after a high kick <badfishbeefcake>: Was the guy really hurt, he seems to have turned his body enough to avoid the hit. <_Markness_>: They stapled the wound and after some treatment he was able to resume the match. He even scored the 3-3 in injury time, but it wasn’t enough for Ajax to win the group. Great match though!<badfishbeefcake>: How was it an opened wound?<_Markness_>: https://youtu.be/_q5yXPxlwCM This video shows a little more.<badfishbeefcake>: ouch!", "num_messages": 6, "avg_score": 47.8333333333}
{"start_date": "1543644297", "end_date": "1543667452", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 55154, "text": "<conez420>: James Harden no look blocks DeMar DeRozan <UnfriendlyEar>: Harden playing D??<i_only_eat_nachos>: Had Harden missed, he would’ve been playing Harden.<pperiesandsolos>: I don't get it<harsh389>: Its Harden’s move to rip through player’s hands when they reach on drives to get free throws<Trvp_Kxng>: I don't get how people call that flopping when it's the defense fault for reaching. <Sixtydotnine>: Cuz it's boring to watch tho technically correct<Trvp_Kxng>: What is? Harden getting to the rack or him getting fouled?<dayrocker>: The ripthrough is dumb no matter which player does it.<Trvp_Kxng>: So they should leave the ball where players can get a clean swipe at it?<dayrocker>: I don't think you understand what a ripthrough is. So, the player with the ball gets covered by an opponent. Taking open shots is better than taking contested shots, so logically you wanna pass when you get boxed out. A ripthrough is when, instead of passing or attempting a shot, the player does a shooting motion, intentionally \"ripping through\" the defender's arms. The ball does not go anywhere near the net and flies off haphazardly. This tactic usually results in a foul.<MundungusAmongus>: I feel like, if I’m a defender, someone could only do that if I’m playing overly aggressive defense <Endless_Summer>: You're supposed to play the most aggressive defense you can without fouling. And what he's describing happens to defenders literally standing there with their hands straight up. The shooter then flails wildly into them, creating an offensive foul that's almost always called as a defensive foul. <sloburn13>: Sounds like the NBA needs better refs.<Endless_Summer>: Every sport does", "num_messages": 15, "avg_score": 3676.9333333333}
{"start_date": "1543546084", "end_date": "1543664875", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 29, "text": "<SounderBruce>: Atlanta United FC advance to their first-ever MLS Cup final, which they will host <RememberHalo>: They will probably break the Record 75,000 crowd for a Soccer game in America too. MLS playoffs have lived up to the Hype for sure!<ElSucioGrande>: MLS is trying to sell tickets for upper deck tickets at $200+ at face. There will be empty seats <fratastic1865>: No, those are resale prices. I've seen them going for $50-$70 in the upper deck.", "num_messages": 4, "avg_score": 7.25}
{"start_date": "1543647432", "end_date": "1543651106", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 147, "text": "[deleted]: LeBron “Sniper” James from DEEP [deleted]<SNAFU_rider>: Fanboy post. All these downvoters never heard of Steph Curry? And somehow one shot like above every year, or two makes LeBron a sniper?! Y’alls logic is as sound as the dumbass in the Oval Office. <realsonder>: Ch'yeah.", "num_messages": 3, "avg_score": 49.0}
{"start_date": "1543580480", "end_date": "1543732971", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 12, "text": "<FrOdOMojO94>: Huge fail by Scottish player against Fiji as he crosses the try line during the Dubai Rugby 7s <BoomMeta>: Seems a huge fail by the organizers for having a confusing yellow advertising hoarding IN FRONT OF the line...<Aussie18-1998>: What are you on about. It's no fault but his own for the fuck up. He should have just placed the ball down as soon as he crossed the line.", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1544655881", "end_date": "1544718098", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 161, "text": "<TurnBasedCombat>: Tony Hawk does the 900 (HD 60 FPS) <JolinAmishMafia>: I remember the day this happened. I was watching it live. Amazing watching him keep attempting it till he got it<MostStefanitely>: Came here to say this. Man, I felt the electricity through the TV. This dude’s video games, and Gigantic Skatepark Tour, are solely responsible for some of the best times of my life. Now, at 33, I wish I still skated. It’s not that I can’t still do tricks, but adulthood got in the way.<DisscoStu>: I remember watching too, and thinking, well that was close, he landed on his wheels and only 1 hand, next time will be perfect, then everyone just agreed he did it. Big hand touch there", "num_messages": 4, "avg_score": 40.25}
{"start_date": "1533253150", "end_date": "1533282927", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 74407, "text": "<commoninternetuser>: I caught a ball. <tI-_-tI>: Let this be a lesson to pay attention at baseball games. If he can look up from his job when potential danger is present, you can look up from your phone.<commoninternetuser>: It’s also my job to look beyond the camera. That is a key element to shooting sports. <Chamale>: Does the camera have a screen that shows you what's on it? How hard it is to multitask between checking that screen, and anticipating where to move the camera next?<commoninternetuser>: Yes. The camera has a viewfinder to show me what I’m shooting. It’s an acquired skill to get used to looking at the game and then back to monitor. The hard part is keeping it in focus. <Chamale>: How do you get into sports videography? Did you study journalism or film or anything like that?<commoninternetuser>: I went to school for broadcasting and got lucky to become connected with people in the industry. <Chamale>: That makes sense. I'm always amazed by how good the camera work is in televised sports, you have a cool job.<commoninternetuser>: Thanks. It’s a lot of fun to do this job. <S0N_0F_K0RHAL>: Thanks for participating in this impromptu AMA <commoninternetuser>: My pleasure :) <Ghost_of_Trumps>: As a cameraman do you think that Managers/Umpires should be mic’d up?<Kylezar>: As a cameraman &amp; graphics operator I think the Umpires/referees/managers should have comms to the director, even just one way. That way the director can tell his cam ops where to shoot so no action is missed and he can cut to it. When I'm preparing substitution gfx during a football match, it's a pain in the ass to have to keep one eye on the monitors to see who's preparing to come on field, who'se coming off - and then copypaste the names and put the graphics on air. I've requested someone pitch-side to relay that info to me so i can prepare the gfx faster. <Ghost_of_Trumps>: The graphics operators are amazing, it’s almost like magic.", "num_messages": 14, "avg_score": 5314.7857142857}
{"start_date": "1543650569", "end_date": "1543691316", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 5, "text": "<Idealistic_Crusader>: 7 years ago I worked on the sidelines for the greatest game of football I have ever witnessed. It was the college finals the night before the Grey Cup, and it was a game so amazing, I will remember it forever; 2011 McMaster vs. Laval, for the 47th Vanier Cup. <Kanuck88>: Mac Attack ! Go Marauders ! That was such a great game. (McMaster Alumni) <Idealistic_Crusader>: Amazing, so stoked you found this post. &amp;#x200B;", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543564772", "end_date": "1548517491", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 14, "text": "<berserk4>: John Cena Named 2018's Sports Illustrated Muhammad Ali Legacy Award Recipient <Fiveinchtaint11>: He should have shown up to accept it. I’m disappointed in him. <berserk4>: He did", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1542312595", "end_date": "1542337451", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 55466, "text": "<Hash43>: Prospect demonstrates his confidence and slickness. <_676767676767_>: Hes gonna get caught one day, and it won't be pretty. However, guy is clearly talented. <BassFromThePast>: When that time comes he’ll **probably** stop doing it because he’ll realize he’s no longer vastly better than the competition at hand. <Edit>: Roy Jones<farnzz>: Roy Jones says hi. <comickidd77>: The difference is jones wasn’t all flash his slips and taunts and sets up had meaning, put you in a bad position footwork wise, make you over step, or see red and made you pay. <farnzz>: But when he got older. Lost a step. He got destroyed. He had to change it up. He had to use better fundamentals. <Hash43>: Yup Roy was IMO the best boxer ever in his prime, all the amazing things he did was because he was one of the most athletic fighters ever. Once he aged his style didn't age well with him, you need very solid boxing fundamentals like Bernard Hopkins to fight well late into your 40s, you can't just dominate people with athleticism because athleticism doesn't last forever. <edit>: I realize this guy isn't getting any credit so I wanna throw this in one of the top comments: His name is Jaron Ennis and he fights on Showtime tonight.<GigaJuice>: &gt;Yup Roy was IMO the best boxer ever in his prime I got this guy named Mike Tyson you should check out.<hi_imryan>: Popular opinion. Wrong, but popular. Sugar Ray Robinson, Joe Louis, Ali, Chavez...there’s a huge list of guys that rate higher than iron mike, Jones jr included. <babyboyblue>: How are you not going to mayweather here?<Trydson>: Honestly I've only seen two guys say that Floyd is with the absolute elite of boxing, you and Floyd himself.<babyboyblue>: Clearly you’re ignorant then. I don’t like the guy at all and he’s not exciting to watch, but if you don’t have him in your top 5 at least then you don’t know boxing. He mopped the floor with his opponent in every fight especially any Mexican fighter.<Trydson>: &gt; Clearly you’re ignorant then. Me and the bast majority of the people, then, since almost nobody names Floyd in the top 5. And is not like he went against a shit ton of good mexican oponents, aside of Marquez, the rest of the mexican we fought against were not that good at all.<babyboyblue>: The majority of lists you see are from before Floyd was retired. He will definitely be on all the new lists in the future. Your last comment just proved you don’t know what you are talking about. Canelo, De la Holla(technically born in LA), Guerrero, Vargas, Chavez, corralles and more I’m sure I’m forgetting.<Trydson>: &gt; Your last comment just proved you don’t know what you are talking about. Canelo, De la Holla(technically born in LA), Guerrero, Vargas, Chavez, corralles and more I’m sure I’m forgetting. Floyd did not fought against all of those, only against Apodaca, Jesús Chávez, Felipe García, José Luis Castillo(x2), Jesús Chávez, Juan Manuel Márquez, Canelo and De la Hoya, who was clarly past it at that moment. Out of all of those, really only Marquez and De la Hoya would be great, but again, the second was past it.", "num_messages": 15, "avg_score": 3697.7333333333}
{"start_date": "1543654333", "end_date": "1543660100", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 41, "text": "<poorhomiezzar>: Even a dog can be the GOAT sometimes <mcr1166>: Are we just going to ignore the topless girl playing?<OrangeJuiceAlibi>: 1. She's not topless 2. Yes, because we're not 12.", "num_messages": 3, "avg_score": 13.6666666667}
{"start_date": "1544465591", "end_date": "1544555299", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 44702, "text": "<TooShiftyForYou>: Kansas City's Patrick Mahomes looks to his right while throwing to his left <d_mcc_x>: So? My three year old does all the time...<LORD_BIKO>: oh pls<OohMatron>: You've never been playing with friends and done this? This has never occurred to you? Come on. <Bradytyler>: I think there’s a bit of a difference between doing this against friends and a fucking NFL defense. One of the best NFL defenses too. <OohMatron>: Yes there's a bit of a difference. But this isn't this astoshing thing people are trying to hype it up to be.<KarlHungusIII>: By a bit of a difference, you mean an entire universe of difference. This was an incredible play. <OohMatron>: LOL. Okay. Other than the fact that there was no one around him and he wasn't going to pass to anyone else I'd say that defense was indeed, absolute beasts....<KarlHungusIII>: He evaded the pass rush while keeping his eyes downfield and threw a dart to a receiver whom he wasn’t looking at and was decently covered. You can minimize it all you want, but it’s a great play and just a tad more difficult than picking up your fork without looking directly at it. <OohMatron>: So he: had people move out the way by team mates, threw a pass which is what he does all day every day, and his team mates did their job too. So what HE did was throw a pass. You're right, it is just a tad more difficult. <KarlHungusIII>: Actually, he had to evade pass rushers that his teammates didn’t move out of the way, and then threw a pass across his body WITHOUT EVER LOOKING AT HIS TARGET. If you tried that, guaranteed you throw it in the dirt five yards away from you. I’m not saying other quarterbacks couldn’t make that play, but there’s a reason they don’t (it’s fucking hard and high risk), and it’s hilarious that some Jimmy Lipper on the internet who probably can’t tie his shoes without looking is desperate to downplay it. <OohMatron>: How you never played the sport before? Go try this with a friend. It's not difficult at all. They throw passes to each other all day. He knows the plays he knows where he's gunna be and when. He could have done it with his eyes closed. The reason it's so rare to see this is because players in this sport are just chess pieces. They're not paid to think or have flare and be fun to watch. They're paid to just do that one task they do. He would still have gotten an ear full for doing this even though he made it. Any player reading these comments is probably laughing their heads off or eye rolling. <KarlHungusIII>: &gt; He would still have gotten an ear full for doing this even though he made it. Any player reading these comments is probably laughing their heads off or eye rolling. Chiefs coach Andy Reid: “It’s something to do in a practice, but then you start throwing it in a game, and a game against the No. 1 defense in the National Football League, that’s a little different,” Reid said. “You gotta have tremendous confidence in what you’re doing there. ... I haven’t seen a lotta guys do that. I was around (Brett) Favre, he did some amazing things that way, Donovan (McNabb) and those guys, but no... that umm... No, not quite like that.” So that debunks your theory that he got chewed out for it and that it’s commonplace and not that difficult. Also... &gt; How you never played the sport before? Go try this with a friend. It's not difficult at all. Anyone who has played or just has an ounce of knowledge of football knows trying something with your friend in the backyard is not remotely the same as doing it in a game against one of the top defenses in he league. <OohMatron>: That tv interview he did debunks what happens in a dressing room? This is explains why you think this is some crazy sporting achievement.<KarlHungusIII>: It’s better than your assumption (based on absolutely nothing) that he got reprimanded for making a great, unique play. And your second “sentence” explains why you’re an idiot. <OohMatron>: He threw the ball to the player he was supposed to. What. A. Thilling. Play. It honestly beggars belief that this is only a US citizen watched game when incredible things like this happen. Why is it that Wembley is full of ex Pat's and not British people desperately trying to watch an NFL game? Idiots. Which passes like this happening only ever once, why wouldn't they go? Why isn't this a global game yet? Why?<KarlHungusIII>: Ah, you prefer 90 minutes of running and minimal action when you watch sports. It all makes sense now. <OohMatron>: No I prefer a sport. By athletes who don't require oxygen after each play. A sport where people aren't amazed by catching a pass or gaining a yard. Have you never wondered why the world watches rugby and football and basketball and hockey but not NFL? Wait, hang on, someone just gained two yards!!! I gotta rewatch this and over analyze this for the next ten minutes with some advertising shot in there before we can see them lose the two yards in the next play! Amazing!!!!!<KarlHungusIII>: If you don’t like or know anything about football, why are you here making yourself look dumb? Soccer and basketball are the most popular sports in the world because they’re cheaper and easier for anyone to play. <OohMatron>: I know more than enough about gridiron. I enjoy playing it. But to watch it is absolutely fucking excruciating. Celebrating a catch to gain five yards? Nothing short of sport comedy. <KarlHungusIII>: This was a completion for more than five yards, and it wasn’t just an ordinary throw. Your insistence on shitting on it is odd. It was a cool play you almost never see. Also, everything you’ve said in this back and forth indicates you know a lot less than you think about football. <OohMatron>: Why do you never see this? Answer that question. Just make sure you don't say because it's really hard because you wouldn't see someone like Mahomes make it. You'd have to see someone like Brady do it. If it's that hard how come PM can do it?<KarlHungusIII>: Mahomes is different than Brady. He’s a better athlete with a stronger arm, which is why he was able to throw on the move and across his body and not lose much velocity. As far as the no-look part, that’s just an instinct that Mahomes has. You never see other quarterbacks do it because it’s risky to throw where you’re not looking, but Mahomes has a penchant for free styling. Mahomes can do a number of things Brady can’t or just doesn’t do. Even Andy Reid, who has been around some great quarterbacks and improvisers, said what Mahomes did is unique. I’m not even sure what argument you’re trying to make anymore.", "num_messages": 23, "avg_score": 1943.5652173913}
{"start_date": "1544803665", "end_date": "1544923945", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 1123, "text": "<RiCriostoir>: Leon Lawson (Andre Dirrell's Coach) sucker punching Jose Uzcategui <mostly_sarcastic>: *former coach That's assault and should warrant not only criminal charges, but a permanent ban from the sport. <EDIT>: I'm getting some context from other Redditors, and it appears the boxer was DQ'ed for conduct in the ring. The coach who sucker punched him was furious over his conduct. Okay, well, he was DQ'ed, so his conduct was punished. Sucker punching a person is simply unacceptable. Especially from a coach.<FartIntoMyButt>: He was suspended, then the suspension was lifted. Felony charges dropped. The boxer who got sucker-punched is *furious*<notathr0waway1>: I can't believe it. There's an unspoken rule that you don't physically assault a competitor who just got done with an event. Even if the guy is highly trained, he's totally drained and essentially at a huge disadvantage to someone who is \"fresh,\" and didn't just fight a fight/drive a race/play a game. The punishment for attacking a competitor after an event should be much harsher than a random attack. IMO.<TheTrenchMonkey>: &gt; There's an unspoken rule that you don't physically assault a competitor who just got done with an event There is also written laws that cover the same thing in all situations... <dirtbaghiker>: There are\\*<Merrine>: I think this is the wrong sub to act smart my friend.<dirtbaghiker>: Too many head injuries?<Merrine>: 99% of the people in here have never once stepped in to a ring, they are just little boys surfing the testo high.<Backstreat>: This guy fucks", "num_messages": 10, "avg_score": 112.3}
{"start_date": "1543187986", "end_date": "1543207777", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 125, "text": "<TooShiftyForYou>: Denver's Phillip Lindsay makes a smooth recovery <OlliePollie>: Can we get that in reverse please?<BlueGallery>: Yes", "num_messages": 3, "avg_score": 41.6666666667}
{"start_date": "1543594059", "end_date": "1543598768", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 71, "text": "<Destino2018>: Kevin Gastelum turns Michael Bisping’s lights off with a clean combination <AdmiralBarackAdama>: I'm not a UFC guy, so this is probably a dumb question, but is it normal to go to the ground and continue pummelling a guys head after it's clear he's knocked out? Dude dropped straight down and was clearly out.<-SandorClegane->: The ref is supposed to stop the fight. It's quite possible that he didn't see Bisping's head wobble since he was standing behind Gastelum when the punch landed. Yes, Gastelum could have shown a bit more class here and walked off after that lovely strike, but the guy is in a fight. In the heat of the moment, you do what you are trained to do. In this case, opponent goes down = ground and pound. <AdmiralBarackAdama>: Thanks for the explanation!<-SandorClegane->: Sure thing. If you want to see what a classy walk off KO looks like, [here's a video](https://www.youtube.com/watch?v=7v-vysyQUG0) of Mark Hunt doing it in 5 different fights. Hunt spent most of his early career fighting in Japan and he's as bushido as it gets in MMA. <AdmiralBarackAdama>: Nice! The walk off knock out is so much more bad ass.", "num_messages": 6, "avg_score": 11.8333333333}
{"start_date": "1543660194", "end_date": "1543675953", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 3, "text": "<BodheeNYC>: Make Football. More Agile, but Less Kinetic <ferrisfares>: I agree too. But would people want to watch it? <BodheeNYC>: Ratings are sky high due to NFL shootouts with very little defense. I think this has been the plan for a while and old school blood, sweat and tears football seems to be dying a quick death. And it’s not as if an enterprising coach can change strategy because the rules now dictate this style of play.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1544663389", "end_date": "1544756783", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 8, "text": "<4waystreet>: Monday Night Football: Has Jason Witten ruined a US television institution? <darth_vander_esch>: Witten can't be the GOAT at *everything*....<yoshman7>: or anything<darth_vander_esch>: except that he is...", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1544807238", "end_date": "1544817695", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 58, "text": "[deleted]: St. Louis Blues has a new player practicing. [deleted]<michlmichlmotorcycle>: Don’t be fooled people. This is a ploy/stunt. Not more than 48 hours ago they were beating the shit out of each other in practice, and I don’t mean they were having a spirited hockey competition. They were literally fist fighting each other. IN PRACTICE... Against each other. <4PrideAccomplishment>: So they brought in a therapy puppy?<michlmichlmotorcycle>: That’s what I took away from it. Two teammates got in a brutal fight in practice. And the next day this puppy was there.", "num_messages": 4, "avg_score": 14.5}
{"start_date": "1544807976", "end_date": "1544859334", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 12690, "text": "<Keychain33>: Connor McDavid of the Oilers is fast going ~24 mph. <whatsthehappenstance>: Usain Bolt hit 27.8 mph in 2009<finemustard>: Huh, I had no idea he could skate.<last_of_the_pandas>: Not saying it’s not impressive to go that fast on ice, but I bet it’s harder to do on foot. <DMann420>: They're both difficult. On foot you have to fight against the friction of the ground, but our bodies have evolved to carry that momentum quite well. On ice you have to carry all that equipment and all of your thrust must be directed into two 4mm blades (even less so since it's just edges on those blades). The reduced friction of ice helps, but the ice is also beaten to absolute shit because all of these players with jacked up legs are digging into it to get speed. <kid-karma>: it is 100% easier to skate fast than it is to run fast, there's no comparison. the weight of the gear? are you kidding me? you fucking fly on ice compared to how fast you run.<Scameron313>: The gear is definitely a factor. Have you ever worn hockey equipment?<kid-karma>: have you? it's not limiting at all<Scameron313>: Yes, I have and still do. That's an absurd statement, even if you genuinely think that's accurate. Adding extra weight is always limiting.<kid-karma>: one push of your leg one ice and you're already moving at a jogging pace<Scameron313>: And if you weren't wearing equipment you would be moving faster. What aren't you getting?<kid-karma>: The point is that it's easier to skate fast than run fast, and actually hockey equipment doesn't even need to factor into it. You can skate without equipment. What aren't you getting about that?<Scameron313>: Just because it's easier to go faster on skates doesn't mean equipment isn't limiting. Since this is a video of McDavid playing hockey with equipment on it is does factor into it. It's pretty straightforward.<kid-karma>: That's not even what we were discussing, it was about skating vs running lmao <Scameron313>: Yep, and one factor in skating is that you wear equipment<kid-karma>: It's like talking to a dumb wall<Scameron313>: You're the one that thinks wearing equipment doesn't affect speed lol moron<kid-karma>: Re-read this converstion<Scameron313>: &gt;have you? it's not limiting at all -you<kid-karma>: that's not even the discussion we were having lmaoooo<Scameron313>: Literally quoted you lol you're retarded <kid-karma>: You have zero reading comprehension<Scameron313>: &gt;it's not limiting at all -retard", "num_messages": 23, "avg_score": 551.7391304348}
{"start_date": "1543548541", "end_date": "1543663568", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 29, "text": "<vaguely_specific1>: Floyd Mayweather charged with cryptocurrency fraud <mazerbean>: Are you required to disclose that you are paid to endorse a product? [deleted]: I think the rules are a bit different becuase cryptocurrencies are considered securities", "num_messages": 3, "avg_score": 9.6666666667}
{"start_date": "1543668088", "end_date": "1543672001", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 3, "text": "<NNN0124>: Where does Larry Bird rank amongst the all time greats ? Larry Bird Net Worth, Age, Career, Bio, Awards. <NNN0124>: For example my friend ranks him the 6th best of all time and I say 5th.. what is it for you ?<TMars78>: He's up there, but I think he's sliding down on the list. I usually try to think of guys I'd pick over someone else. The list of people I'd pick before him has been growing.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1544813684", "end_date": "1544835909", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 80, "text": "<keitsock>: The LA Chargers twitter isn’t playing around after win against Chiefs <ku-fan>: Of course they're gonna have a good burn ready... They've had 5 years to work on it! [deleted]: Nate Kaeding vintage burn", "num_messages": 3, "avg_score": 26.6666666667}
{"start_date": "1544816126", "end_date": "1544856680", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 73920, "text": "<Smorespoppin>: Man Discovers Hockey for the first time <Actually_Im_a_Broom>: &gt;The goalie just said Fuck it and left? Awesome. <GenXer1977>: All this time we thought it was strategy, when really it’s just been goalies peacing out on us!<azk3000>: \"Coach he rage quit again\" \"Oh for fucks sake fine, just put another skater on the ice and hope nobody notices.\"<dangshnizzle>: *How the strategy actually began and all teams followed suit.<kenlane>: Advanced analytics saying goalies should be pulled 5 min from the end of the game are just analytics bros covering for goalies having shorter tempers.<Jewrisprudent>: As a baseball fan who doesn't get much into hockey analytics, are there metrics that show this might be the case? Kinda like how teams should actually go for the 2 point conversion all the time or just start 5 Jacob deGroms?<FLthrowaway15>: I believe the actual optimal time is something like 2:32 for a 1 goal deficit and like 3 something for a 2 goal deficit. There has been some research on it<Hip_Hop_Hippos>: There was a study that said something like 5 and 11 mins for a one goal and two goal led respectively. Malcolm Gladwell (yes, I know) actually did a podcast on it. The real issue is that while it increases winning it also increases the likelihood of like an 11 goal loss because once you pull the goalie the only scenario in which reinserting him makes sense is a tie.<kozlee>: Does that make a difference to them whether the loss is by 11 or by 2, as long as you get an extra win or tie over the course of the year?<Hip_Hop_Hippos>: No, not in any sort of rule based sense. It’s not a sport based on aggregate scores or anything. Hockey is a very emotional/chemistry based sport though and having your team play a half a dozen losses like that would probably have an impact that is both negative and hard to quantify.<kozlee>: Interesting. Would a goals against be a tiebreaker if two teams are tied for a playoff spot? Could it hurt him in that way?<Hip_Hop_Hippos>: It is, it’s very low on the pecking order, but it’s technically possible. Winning a single point out of it would make that entirely moot though.", "num_messages": 13, "avg_score": 5686.1538461538}
{"start_date": "1544644364", "end_date": "1544820570", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 46, "text": "<Hash43>: Lomachenko on the offense against Pedraza with awesome camera angles. <SeaBlob>: Not to bash it, but what was the point of that?<Hash43>: ESPN setup a cool camera and wanted an excuse to use it probably.", "num_messages": 3, "avg_score": 15.3333333333}
{"start_date": "1544818783", "end_date": "1544832710", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 30, "text": "[deleted]: Tyson in his prime. This is not sped up, he’s just that fast. [deleted]<cuddle_enthusiast>: Would have loved to see a good Tyson v. Mayweather fight.<SociopathicTendeneez>: [I'm just gonna leave this here](https://youtu.be/Jc2phQYGq2g) for some background info, Mike Tyson was 5'10\" and 217lbs in this fight, Marvis Fraizer (the son of one of the greatest boxer's of all time Joe Fraizer) is 6ft tall and 210lbs both of them are pure muscle compared to Mayweather is 5'8\" and 150lbs and well known for winning by working the point totals with footwork and baby jabs like an accountant (which is why lots of people who aren't really into boxing complain his fights are boring)<Spun_Wook>: Did uh.. did he die? Did I just watch someone die?<SociopathicTendeneez>: Haha no he still had a career after that fight thibk he was 19 &amp; 2 when he retired, feel free to double check though because I'm not 100% on that record.", "num_messages": 5, "avg_score": 6.0}
{"start_date": "1543674953", "end_date": "1543889078", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 30, "text": "<josephpage160>: Any baseball fans? Who's autograph is this? <NDNM>: It's [Ron Darling](https://en.wikipedia.org/wiki/Ron_Darling), formerly of the Mets and A's. Here are a couple examples of his signature: [exhibit A](http://i.imgur.com/bZrcLyd.jpg) and [exhibit B](https://www.collectthemets.com/balls/20140408-RonDarling.jpg)<ReadItWithSarcasm>: Lot of swoops in there for “Ron”<crumplestilskin>: Maybe it's Ronnie?", "num_messages": 4, "avg_score": 7.5}
{"start_date": "1543677594", "end_date": "1543695832", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 0, "text": "<The_DonOfJustice>: Olympic wrestler resorts to punches to the head of his opponent to escape <MeramecFox>: To be fair, that death roll maneuver looks like it feels like hell on the legs and spine. I dont know much about wrestling, but I would question the sportsmanship of trying to remove someone's lower half.<_PenjaminFranklin>: That's literally part of the sport. Not punching<MeramecFox>: I understand you cant punch. Looks like a frantic attempt to prevent injury.<Andy_AUS>: No idea why you are being downvoted. Punching the guy immediately disqualifies him from the match, he most likely injured his leg and was panicking. <PoopDig>: Bc all he has to do is tap and it's over. Punching means it's on, tapping means it's over.<MeramecFox>: And how the hell can he tap while being rolled all over the mat? I'd like to see the context of this match to see if he had tried tapping earlier. Hard to be patient when your ACL/MCL is tearing. I doubt the guy getting punched was more injured than the guy he was rolling.<Meffrey_Dewlocks>: If you can punch you can tap. Lol. If memory serves you can tap anywhere. I’ve even seen someone in a position with arms bound up close to his own body while in a submission of some sort and he tapped his own face. You can tap yourself the mat or the opponent . Or yell tap I imagine. Idk about that last one but this does not look like panic to me. He’s pissed he got caught by the legs and just wanted to punch the dude.<badgerandaccessories>: You can tap anything, you can also call uncle if you cant make a tap. Its not like \"Oh let me grab his hands and he wont be able to quit\"<Meffrey_Dewlocks>: Is it really “uncle” lol. That’d be great. <Edit>: this made me wonder what other languages/country’s word for tapping out is. Anyone know any?", "num_messages": 10, "avg_score": 0.0}
{"start_date": "1541378187", "end_date": "1543679162", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 103, "text": "<Meatprint>: New Orleans Saints WR Thomas Pulls Off a Throwback to Joe Horn's Phone Celebration <torkoal666>: I wasn't watching but listening in and it really sounded like a skit off of key and peele<CarliRodriguez>: Peele was there so maybe he will use this .<Decesus>: You might enjoy this Key and Peele sketch then: <https>://www.youtube.com/watch?v=RGJb2iLvOKE", "num_messages": 4, "avg_score": 25.75}
{"start_date": "1543583169", "end_date": "1543683675", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 27, "text": "<Mental_Duck>: Australian boxer Jeff Horn knocks out Anthony Mundine in the first round <joshpereira91>: Anyone got the footage?<PM-ME-YOUR-BEARDS>: https://www.foxsports.com.au/boxing/jeff-horn-v-anthony-mundine-live-live-updates-of-river-city-rumble-fight-start-time-card-video/news-story/4249c29787e3b163580aefd433fa3ca5<GiggsMiggs_15>: Unavailable outside Australia", "num_messages": 4, "avg_score": 6.75}
{"start_date": "1543249265", "end_date": "1545243742", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 23808, "text": "<Stonefree2011>: Ruthless Robbie Lawler stares down a battered Rory Macdonald leading into the 5th round of their legendary war. <Thatchers-Gold>: [Seeing as no one posted a link to the fight](https://vimeo.com/162278173) Password is mma<itzswain>: Mind if I ask you how do you get the passwords and how can I see more fights like this one &amp;#x200B;<G-Shiznit>: I would look at getting a ufc fight pass subscription. They do a week free trial. Then look up the following fights. Robbie Lawler vs Carlos Condit Robbie Lawler vs Johnny Hendrix 1&amp;2 Robbie Lawler vs Nick Diaz Tj Dillashaw vs Cody Garbrandt 1&amp;2 Tj Dillashaw vs Renan Barao 1&amp;2 Pretty much any Donald Cerrone fight Nate Diaz vs Conor Mcgregor 2 Max Hollaway vs Ricardo Lamas Jon Jones vs Alexander Gustafsson There are plenty more but I've just woken up so my brain isn't working really well. Good luck! <mercified_rahul>: Jones vs guftafsson is happening at ufc 232 right? Also How bones jones is back? Wasnt he caught twice using drugs or sth?<G-Shiznit>: The rematch is, yeah. Yup, caught twice and also many other issues. But he's turned \"rat\" for USADA and is giving up his fellow fighters who are 'cheating' so he can get a reduced sentence <mercified_rahul>: I no longer feel to cheer for him... Let's see how the fight goes, btw how is guftaffson(like in good shape?)<G-Shiznit>: well funny enough, Jones has actually fought more recently than Gus. Jones fought DC at UFC 214 in July 2017, Gus fought Glover Teixeira in May 2017. Both Jones &amp; Gus looked great in those fights. Both got KO's, only Jones KO got overturned because he popped for turnabol<mercified_rahul>: Ah, thanks for the info. Then this would be definitely an interesting fight, both coming to fight after long time... Btw who wont the first one i guess jones right? (I have been on and off with ufc therefore ita like i habe forgotten these things.. Need to visit the ufc sub more often.<G-Shiznit>: yeah man, Jones won the first fight but it's widely regarded as his toughest fight and the closest he's come to losing (some people actually thought he lost the fight). Funny enough, it's been told that he didn't train for that fight and spent his whole camp partying *sniff sniff* You should jump over to r/mma. A much better subreddit <mercified_rahul>: Thanks man.. Subbed to that sub.. Since tony vs pettit and khabib's fight i have been drawn back to ufc... Would love a tony vs khabib..<G-Shiznit>: no worries man. Oh yeah, I think that whole sub has been wanting that fight. 4 times (i think) that they've tried to get that fight to happen and it's fallen through. Khabib rushed to the hospital because of his weight cut, Ferguson tripping on a cord and messing up his knee/leg. The mma gods don't seem to want that fight to happen<mercified_rahul>: Haha, but with dana I think anything is possible, if you don't know I would lile to suggest you joe roegan podcast, you will like it.<G-Shiznit>: oh for sure. I always listen to it. Any time Bas Rutten is on is great.<mercified_rahul>: [I found this in my yt recommendation ](https://youtu.be/IJGF6Wl4_w8) /u/G-Shiznit <G-Shiznit>: Sorry mate, just saw this. Yeah can't wait for next weekend. It's on Sunday lunch time where I live (Australia) but luckily I'm not working Monday so it should be a cracker of a day<mercified_rahul>: np atleast you replied haha, :) have a good life bye", "num_messages": 17, "avg_score": 1400.4705882353}
{"start_date": "1543626593", "end_date": "1543707948", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 28, "text": "<sebastianrw>: A 59 secs tribute to Michael Schumacher. The most successful Formula 1 driver of all time with seven world titles, and 91 wins to his name. <crazylsufan>: Is he still alive?<lollery123>: Yea but he’s ina coma from a skiing accident and will likely never recover<cocacola150dr>: He's no longer in a coma.<lollery123>: Oh damn didn’t know that my b<cocacola150dr>: You're good man, no worries.", "num_messages": 6, "avg_score": 4.6666666667}
{"start_date": "1543687793", "end_date": "1543712171", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 109, "text": "<MelangeCo>: Sportsmanship <pillstar>: Bumder😂😂😂😂 inbitweeners <ViperF>: Inbetweeners<RazrDuke1>: Good bot", "num_messages": 4, "avg_score": 27.25}
{"start_date": "1543512974", "end_date": "1543532613", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 92, "text": "<littosimon>: This girl’s letter to Steph Curry got Under Armour to change how they sell his shoes <pretendcontender>: $110 shoes for kids!!! They'll outgrow them in 6 months!<Phil_Ivey>: She's from Napa. $$$<Montague_usa>: Probably; but there are plenty of poor people in Napa, too.<nemo1080>: Not after 6pm", "num_messages": 5, "avg_score": 18.4}
{"start_date": "1543694764", "end_date": "1543694886", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 111, "text": "<Meatprint>: Marquise Brown Being Consoled by a Teammate after Learning He Won't Be Returning to the Big XII Championship Game <Bigdollarbrand>: What happened I literally just turned the game off ? Concussion ? <Meatprint>: It is a foot injury to my knowledge; they taped up his foot, but he limped all across the sidelines before this shot.", "num_messages": 3, "avg_score": 37.0}
{"start_date": "1543697825", "end_date": "1543700664", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 1437, "text": "<KingKnope>: Boomer Sooner <Vinstur>: Defense actually played some of their best this season which was a nice surprise. OU has primarily been a glass cannon this year. <KingKnope>: It looked evident they wanted to show the committee they can hang in the final four. <jmoda>: Too bad they cant. Bama rolls.", "num_messages": 4, "avg_score": 359.25}
{"start_date": "1543468047", "end_date": "1543475547", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 32, "text": "<remorse667>: Pirates' Josh Harrison gets caught in a rundown and avoids the tag <ChemicalExtension>: I thought you couldn’t run onto the grass, could someone explain. <uh_no_>: there's no rule against it. the baseline is defined as something like within 3' of your current location and the direct line to the bag at the time that you try to deviate. when the guy tries to make the last tag when he goes on the grass, does he dive more than 3'? it's a close call.<ChemicalExtension>: Ohh I see thanks. <Mobstastyle>: LOOOTTTTTSS of unwritten rules in baseball...", "num_messages": 5, "avg_score": 6.4}
{"start_date": "1543701664", "end_date": "1543731462", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 53798, "text": "<Fawked>: \"Go Deep!\" <KingdaToro>: There should be a reality show where professional sports teams play each other in the wrong sport. For example, a NFL team vs an MLB team in basketball.<Widowhawk>: I would love to see other professional sports teams try and play hockey... now that would be worth it. Most other sports, anyone can \"play\" at least at a basic level. Hockey requires some skill just to stand up without falling over.<ToLeadYouAstray>: Okay. So the raiders because they are used to contact. GSW because they are extremely coordinated. And the ref is Wayne gretzky because I wanna see how he would react.<vanillaacid>: “What the fuck am I even doing here?” - Wayne Gretzky, probably <OrangeAndBlack>: “Who did my wife pick to win again?” -Wayne Gretzky, definitely <send_noodles_pls>: Don’t know hockey, what this mean?<BathAndBodyWrks>: Gretzky's wife got busted for sports gambling.<d_mcc_x>: She’s been [busted](https://youtu.be/atWtwIiXQKI) more than once <BathAndBodyWrks>: She also got busted by the glass falling on her. Fucking Ulf Samuelsson. <https>://youtu.be/atWtwIiXQKI<jeremy1015>: I’m glad you took the time to follow the other guys link before posting your own. <BathAndBodyWrks>: This is Reddit, I was unaware there was anything beyond those blue text blocks with the underlines!", "num_messages": 12, "avg_score": 4483.1666666667}
{"start_date": "1543701632", "end_date": "1543703746", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 12, "text": "[deleted]: Tua Tagovailoa's dad discussed beating son with a belt on 'GameDay' [deleted]<JolinAmishMafia>: I was born in 1974. I got the belt all the time. It was a different time. Shit wouldn’t fly today<MFAWG>: Right? And the buckle end is when you knew you fucked up.<Superduperbeast>: I got the belt, the sandal, the spatula you name it. That was discipline at its best and I got some cat like reflexes from running and blocking them all the time lol", "num_messages": 4, "avg_score": 3.0}
{"start_date": "1544477868", "end_date": "1544497103", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 28, "text": "<RanardUSMC>: Who’s signature is this? <BlankMyName>: Tom Brady's? That is a deflate gate ball to the extreme.<uhohspaggettios>: Gay<BlankMyName>: Yep.", "num_messages": 4, "avg_score": 7.0}
{"start_date": "1544390002", "end_date": "1544411547", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 37430, "text": "<Meatprint>: The Miami Dolphins Pull Off a Miracle 69 yd Lateral TD to Beat the Patriots! <OmarGuard>: Outstanding play by the Dolphins. I wish laterals were more common in the NFL. I know it's risky but you end up getting some outstanding plays like this. A simple draw and pass could gain vital yards at the end of a run.<Icontrolyourarmz>: this is why i can't get into NFL, as someone who's watched rugby all his life; I don't get it. You've got less than 10 minutes to go, you're down by 16 or something, just start passing like crazy?? Happens in rugby all the time, near the end of the game you don't take your 3 points on a penalty kick, you roll the dice and go for 7... (or 0 if you fail).<sirgoofs>: Except they usually lead to turnovers<Francis_Picklefield>: i imagine they'd lead to less turnovers if teams practiced them<Needyouradvice93>: You imagine wrong.<Show_job>: Please watch rugby it’s basically what a lateral is, all the time. <Needyouradvice93>: Listen buddy, in rugby you can't take out guys who don't have the ball, you can in the NFL. It wouldn't work very well there isn't as much open space. Also losing one possession in the NFL can lose you a game. Dropping a ball in Rugby is no big deal. [deleted]: It's about context, dropping a ball in Rugby can also mean losing the game. <daboswinney123>: But an nfl drive lasts 3 mins at a minimum and a rugby drive lasts a lot less than that. If your down by 10 with 5 mins left and you turn it over the game is over. [deleted]: What's a drive? Don't think it's rugby term, do you mean ruck or maul?<daboswinney123>: it’s just the time you have possession of the ball and are moving it downfield. [deleted]: Not sure if you watch rugby but possession lasts for more than 3mins (actual ball in hand playing time) regularly &amp; especially at the end of the game if the context is meaningful. I'd be surprised if a NFL game had more than 3mins of actual ball in hand game time within the space of the downs(?) - especially as there's only 11mins of game time on average<daboswinney123>: Yes I’m not talking specifically about every play but just clock time being wasted.", "num_messages": 14, "avg_score": 2673.5714285714}
{"start_date": "1543703406", "end_date": "1543797401", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 55, "text": "<TooShiftyForYou>: Oklahoma's Grant Calcaterra makes a one-handed TD catch to seal the Big 12 Championship <CouchPisser>: Clutch<kidzboplord>: More like illegal formation<CouchPisser>: You mad bro<kidzboplord>: Not really. Oklahoma is gonna get smacked by Bama. Just saying that they play was invalid.", "num_messages": 5, "avg_score": 11.0}
{"start_date": "1540215531", "end_date": "1540296135", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 19184, "text": "<TooShiftyForYou>: Kareem Hunt breaks tackles and hurdles a defender <JishtheMish7>: I don’t need to be seeing this right now :(<NeoBomberman28>: Yeah, as a Bengals Fan this is painful to watch.<Hawklet98>: For what it's worth, the Chiefs offense makes everyone look terrible. You should be more upset that your \"high-powered\" offense couldn't do shit against the league's 32nd ranked defense.<just-the-tip__>: Not me broncos <Pyromonkey83>: Agreed, for a game I expected to be blown out by epic proportions, we actually showed some promise there... We still lost... But hey it was close.<teeroy16>: I guess we'll see again next Sunday haha<just-the-tip__>: Yep I live in kc too, so it's always fun being a broncos fan here. <teeroy16>: Yeesh. I can't imagine haha", "num_messages": 9, "avg_score": 2131.5555555556}
{"start_date": "1543703686", "end_date": "1543753193", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 57, "text": "<armstrongalbum>: Neil Armstrong with his mother, and son Ricky holding a pennant for the Houston Colt .45’s (now the Houston Astros) - 1965 <CouchPisser>: Simpler times.<quadrophenicWHO>: Yeah, three years after the Cuban Missile Crisis sure was a simpler time.<CouchPisser>: Compared to today? Yes it actually is smart ass", "num_messages": 4, "avg_score": 14.25}
{"start_date": "1543706730", "end_date": "1543712874", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 35, "text": "<r4816>: Highschool newspaper suspended over 'disruptive' investigation into football controversy <madmaxp0618>: Honestly, completely justified. The newspaper is trying to witch hunt those football players who are obviously trying to better their futures and are being honest about it. I don't know if people around the country are used to transfers, but here in Florida we have many students transfer schools for better athletic opportunities after high school, and those kids shouldn't suffer for choosing to do so. <jewhealer>: I disagree. These students are using academic transfers to bypass rules, and have admitted such. The paper is pointing out these students are knowingly and intentionally violating school policies.<KrebStar9300>: Could this be viewed as a protest to an unfair rule? I mean if it's ok for a gifted math student to transfer to a different school because there is a great math teacher at the other school who could better prepare the student's future (acidemics), why is it not ok for a gifted athlete to transfer to another school with a better sports program that could better prepare the studen't future?", "num_messages": 4, "avg_score": 8.75}
{"start_date": "1543711175", "end_date": "1543715392", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 299, "text": "<Meatprint>: In the 2018 National Title Game, Jalen Hurts was Benched as His Backup Tua Tagovailoa Won the Game. Today, Tagovailoa Was Injured, and Jalen Scored the Go-Ahead-TD in the SEC Championship Game. <Enderium53>: If they don't make a movie about this, then I don't know what Hollywood is doing.<AdamJr87>: It comes out Friday. This was scripted in Saban's contract with the devil<Enderium53>: Hail Saban!", "num_messages": 4, "avg_score": 74.75}
{"start_date": "1543711605", "end_date": "1543715965", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 12, "text": "<comtombstoner>: 'Hurts', dont it? <jasteez>: Honestly the fact that this dude stuck around after losing the starting job makes me that much more happy for him <GillyMonsterz>: Fo shizzle.", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1543714733", "end_date": "1543715195", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 55, "text": "<Ch33sKa>: Christian Wilkins vomits after a intersection <CouchPisser>: I can sympathize. I might vomit too if I witnessed an intersection. Isnt that where a priest takes demon out of people's bodies??<Penguin_of_evil>: I thought it was just a four-way stop or similar", "num_messages": 3, "avg_score": 18.3333333333}
{"start_date": "1531332699", "end_date": "1531351583", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 21245, "text": "<MarsNeedsFreedomToo>: Kieran Trippier opens the scoring with a beautiful free kick goal!! <SanaFTW>: 1-1 now<Shortneckbuzzard>: Can you tell me the final <SanaFTW>: 2-1 croatia leading<Coyrex1>: Final score they won now.<MarsNeedsFreedomToo>: On the plus side, England has won their first penalty shootout and also their first semi-final appearance since 1990. Not a bad run at all in my opinion.<Harden-Soul>: They intentionally lost to Belgium to get in a worse half of the bracket, beat Colombia in penalties and then Sweden before losing to Croatia. It’s not exactly the most storied run, looking back at it.<tehDarkshadE>: Intentionally lost is a pretty big stretch. Both teams were playing backups and just feeling things out. The consolation was no matter what you were through. Losing was never the preferred option but had a nice caveat to it.<Harden-Soul>: Losing was very obviously the preferred option lol, neither side’s fans would deny it at the time. Look at the teams on England’s side and the teams on the other side<tehDarkshadE>: Both teams made the semi finals so it really didn't matter did it? Both teams were good enough to get there regardless of the bracket they faced. Neither team put out slouch squad, and if losing was the goal, they both did an extremely poor job of trying to lose in that game. Took an incredible strike from Januzaj to win that game, so explain to me how they tried to so hard to lose?<Harden-Soul>: I mean, I don’t think England were good enough to make the semis in the other side of the bracket<tehDarkshadE>: I think they were a lot better than both Japan and Brazil which would have meant they would have made the semis on that side. Everyone wants to talk up Brazil but they were awful and lucky to make it as far as they did. If they spend less time trying to get players booked for diving and actually played the game, I would have a different opinion but that's exactly what they did.<Flinko2010>: &gt; I think they were a lot better than both Japan and Brazil You don't know what you are talking about lol You really only got that far because of how weak the lower bracket was. Your wins were shaky and you lost every game against a good team<tehDarkshadE>: I actually know exactly what I'm talking about. Brazil were absolute trash outside Willian. If they would have had proper officiating in their group stage games, they wouldn't have made it out of their group. Neymar too busy rolling around like a baby every time someone got near him. He should have been sent off 3 or 4 times for diving but because he's a big name player, they were scared to do it. It took most of the world making fun of him for his cheating antics before anyone had the backbone to not call fouls on his dives. As for Japan, I don't think they had enough quality to get past the first round of the knockout against anyone. Their coach was reluctant to start Honda which ended up costing them as he was their best chance at scoring. When he and Kagawa were on the field together, Japan looked their most dangerous. e You can shit on the bracket all you want but England still had to win against teams that were good enough to make it through their groups. Croatia deserve to be in the final; they've looked more convincing that a lot of the \"better\" teams in the tournament. In the end, it doesn't matter how much talent a team has; its all about results and execution. England had that up until today.", "num_messages": 14, "avg_score": 1517.5}
{"start_date": "1544585776", "end_date": "1544686529", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 5851, "text": "<TooShiftyForYou>: Blues defenseman Robert Bortuzzo banks a shot off the referee and into the goal <jpd11>: Can’t believe how far it bounce off his abs. Dude must be ripped under those stripes. <ufrag>: I am going to guess and say that they wear some sort of padding under those stripes [deleted]: I know quite a few college refs and none of them wear pads on their torso/stomach. Just shinnies and elbow pads. I know of some refs that will wear an under armour that has built in soft padding but that’s it. <lowcrawler>: Even players have very little (or no) padding in their stomach. (source: am 37, have been playing hockey for 34 straight years including some in various minor leagues)<weeblewood>: which league do you play in?<lowcrawler>: I currently play in the MN Wild Adult League. It's good hockey and people play quite hard at the upper levels...but everyone is looking to go home with all their teeth so that's more compatible with my old man body. In my 'real' playing days I played in the ECHL and at the varsity level in college. (obviously all the MN youth stuff too) Why do you ask? [deleted]: MN wild adult league is the worst if you’re not in A league Bunch of middle aged men looking for a fight, have been asked to “meet me in the parking lot multiple times” once had this loser intentionally shoot a puck at my head. <lowcrawler>: They dropped the A league (which just resulted in B becoming 'A' and C becoming 'B' and so on... it was stupid) A lot of it depends on the refs you get... if you get the scarecrow looking jackass and his partner... yeah, the game might get out of hand because they just want to go home. Ron's good at reading the vibe and keeping things under control, as are a few others. I think a lot of it has to do with the demeanor of your own team, too.... I've been on a few in that league and some had chips on their shoulders and almost every game ended up with a scrum. Then I was on a very live-and-let-live team and we almost never had issues. My current team is in the middle and we only have flair ups a couple times a season. Even then, it's normally just 'pushing' and stuff. In my time in the league, I've only ever once seen a true 'fight' and even that, no one got hurt. That siad, compared to the AHA, yeah... it's got more boneheads. I think part of that is that the AHA is sooooo much more expensive and more strict about appearances that it only attracts a certain type of adult. The MN wild league certainly has it's share of \"still living in a trailer near my parents and re-living my high school glory days\" guys... and they all seem to be pricks. [deleted]: By scarecrow do you mean the red haired guy with no teeth? I haven’t played in that league since summer 2017, it just wasn’t worth the risk of getting injured because some adults can’t control their temper. Not only that but there are a bunch of Gary-go-hards that make dangerous plays, like trying to get body position on an icing while both players are skating full speed. There’s a way to play competitive hockey without it being dangerous. Also I have to get up for work at 5AM so I’m not trying to play an 11:10 pm game on a Sunday, by the time I get back to Anoka it’s nearly 1AM. <LaconicGirth>: Anoka? This is the closest anyone on the internet has ever been to me! I’ve played games at the anoka ice rink before! More on topic, the older leagues have less “try-hards.” My dad plays in the over 40 and over 50 leagues and it’s much more easy going. I think it’s too much testosterone at the younger ages. What level did you play at? [deleted]: I’m only 21 so I was just playing in the “open” I think it’s called, any age can play. We never had problems with guys our age it was mostly the 30ish year olds that were spazzes I actually used to work at the hockey store connected to the Anoka ice arena haha<LaconicGirth>: I shopped there all the time! How long ago? [deleted]: 2014-current,still technically employed but I’m studying abroad right now <LaconicGirth>: We definitely may have run into each other [deleted]: Very likely considering we only have like 5 employees.", "num_messages": 16, "avg_score": 365.6875}
{"start_date": "1544635784", "end_date": "1544654682", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 120, "text": "<dlax15>: Massive open ice hit <hops4beer>: Hockey is fucking crazy<canuckistani_lad>: Right? It’s great :)", "num_messages": 3, "avg_score": 40.0}
{"start_date": "1543717693", "end_date": "1543718431", "thread_id": null, "subreddit": "sports", "subreddit_id": "t5_2qgzy", "total_score": 125, "text": "<conez420>: Galatasaray’s last training session before the Besiktas derby <pandas_on_acid>: Is that safe?<Karimaru>: Probably not, but whatever", "num_messages": 3, "avg_score": 41.6666666667}
