{"start_date": "1543591812", "end_date": "1543670320", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 302, "text": "<stinkbugsaregross>: [B&amp;A] Nothing too dramatic, but I cleared up the CCs on my forehead! <chatt00gagrl>: What in your routine do you think helped you the most? Specifically with the cc's. I'm almost to the point in my journey where I'm ready to focus on mine. <stinkbugsaregross>: I think I saw the biggest difference when I started using both the BHA and AHA. I alternate them, like one night BHA and the next AHA. I like PC for BHA, Stridex I think irritated my skin<chatt00gagrl>: Thanks! I need to look into affordable options for bha. Can't so stridex because my skin hates alcohol...<GarbieBirl>: The red Stridex is alcohol-free, not sure about the other types but for sure the red type <chatt00gagrl>: Ok, didn't realize that. I'll look into it but I have extremely sensitive skin that will break out with inflamed acne and give me months of both PIE and PIH so I usually try to go the gentlest route possible.... I finally have that under control, so I'm terrified to add actives back into my routine. <space_hegemon>: Cosrx power liquid is milder than typical salicylic acid. Probably your best bet if you want to add in acids. <chatt00gagrl>: Thanks for the suggestion!", "num_messages": 8, "avg_score": 37.75}
{"start_date": "1544704823", "end_date": "1544738231", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 137, "text": "[deleted]: [Personal] Azaleic Acid + Tretinoin...wow ok nice very good 👌 [deleted]<pazzaglia1>: I do this too inspired by the pocket-derm or whatever it's called now formulations posted on this forum. I use .1% tretinoin on the whole face, and then follow-up with Skinoren - which is the cream version of your Fincea... sort of - on the T-zone and cheeks (basically anywhere I have giant pores). Anyway, I was blown away as I get less irritation from the tretinoin and my pores are amazing. They're not smaller but hell... they're not full of gunk either. &amp;#x200B; And now that you metnion it... no I have not gotten a single pimple since I've been doing this (about a year). &amp;#x200B; I agree, it's a fantastic combo. Enjoy!!<throwawayacct916>: Your skin doesn’t break out at all? I have mild acne and I want to switch out my adapalene and BP combo for tretinoin and azelaic acid because I think my current combo isn’t working as well anymore. Reading this made me very excited 😆 <pazzaglia1>: Zero, even hormonal. It's a great combo to use together. YMMV - I hope that you will get similar results. Full disclosure: I'm also using an LED light mask three times a week - mostly red LED's for anti-aging but once in a while I use the \"disco\" setting that uses all the colors including blue that theoretically kills acne bacteria under the skin. I think only red and blue LED's have scientific research behind them to support their collagen-building and bacteria-zapping capabilities... but the multi-color \"disco\" setting that flashes a different color every second annoys my husband the most. So I really enjoy using it.", "num_messages": 4, "avg_score": 34.25}
{"start_date": "1543584022", "end_date": "1543622914", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 5, "text": "<ariesaustralia>: [Routine Help] Hi! My skin has always been pretty bad but recently it has got SO much worse. I have really red large pimples on my cheeks that take a long time to go away. My skin is also extremely oily. It's gotten to the point where I am extremely insecure and upset about my skin. I was wondering if the current products I am using are making it worse, I hardly know anything about skincare and would like more advice if possible! Currently I use: -African Black Soap -Apple Cider Vingar (for Toning) -Thursday Plantation Tea Tree Face Wash for Acne -Sukin Oil Balancing Facial Scrub -Sukin Signature Facial Moisturiser<saucylackey>: Seconding what has been said already. I recommend looking for products that are fragrance-free (including essential oils), oil-free, scrub-free, and marketed as noncomedogenic. Let me know if a sample routine would help :)<ariesaustralia>: thank you so much, ill look into it! A sample routine would be great, thank you!<saucylackey>: No problem! AM/PM * CeraVe Foaming Facial Cleanser * Thayers Unscented Alcohol-Free Watch Hazel * CeraVe Moisturizing Cream &lt;-- just a little bit, since your skin is already oily. You'll need to add an SPF into the equation at some point, but I know that's hard to do when your skin is oily and actively breaking out. Is it possible for you to see a derm?<ariesaustralia>: Thank you! I've been wanting to see a derm but I'm not sure if it cost money here in Australia. I'll have to look into it<saucylackey>: I think that would be a really smart move. Good luck, and don't hesitate to reach out if you have any more q's.", "num_messages": 6, "avg_score": 0.8333333333}
{"start_date": "1544725879", "end_date": "1544760018", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 390, "text": "<ChemicalAlia>: [Skin Concerns] Permanently bumpy and rough skin texture that nothing seems to improve <ChemicalAlia>: My temples and forehead have had this horribly bumpy texture that I always assumed was some type of acne scarring from my pre-Accutane teenage years. But most acne scars I've seen pictures of are indentations, rather than raised bumps, so while at the dermatologist last week I asked him to take a look and make a treatment recommendation, if possible. His assessment was that they're not scars, but extremely deeply clogged pores, and that pretty much only something like CO2 laser resurfacing would be able to treat them. &amp;#x200B; I've been considering trying a laser treatment for a few years to improve my skin texture. But due to the high cost and overall terrifyingness, I have first tried several less invasive treatments (like microdermabrasion, microneedling, chemical peels, and improving my skincare routine), with no noticeable improvement. My dermatologist might certainly be right about it being clogged pores, though the bumps never change or go away, like scars. &amp;#x200B; I hope this is the right place to ask, but I've become so self-conscious and frustrated with this issue that I am now seriously considering doing the laser thing. I can barely wear makeup without accentuating my textured skin, and I've worn bangs to try and cover it for as long as I can remember. I've never seen a skin condition that looks like this on anyone else before, and researching online hasn't been much help, so I'm wondering if anyone else has experienced a similar problem, and if you may have had any success with laser resurfacing or another treatment, I would love to hear about it.<ManslaughterMary>: I got some laser therapy done for my overactive sebaceous oil glands, and while it was a bit of a hassle, it really helped my skin. My skin isn't a straight up oil slick by noon. I'm still somewhat oily, but the severe acne lessened. I was a teenager when I got that done. My friend who had bad acne and textured skin (and a brief but rough meth addiction) had laser therapy done to her face, and while some of the scars and textures are still noticable in some areas, some patches completely cleared up. She was 27, and the results were definitely an improvement. Personally, at the price tag laser treatment can come with, I am not 100% sure I feel my skin improved about 1000 dollars worth. There we absolute improvement, so I still consider it money mostly well spent, but I feel like it improved 500$ worth. My friend paid more than me (different laser techniques, different needs) and while her skin improved quite noticably, if I paid what she paid I would still expect more improvement. However, it helped her massively with her confidence, and if it fixes a problem that isn't responding to other treatment, it might be a good choice for you. Either way, good luck! <ChemicalAlia>: Thanks for sharing, that's very interesting! I feel like even if I had a 50% improvement, I would be pretty damn happy. It's pretty much a confidence thing for me, too, and very frustrating. My skin is also very flaky and dry, yet somehow also very oily and at 36 I still deal with a decent amount of acne. I'm glad you had some improvement in that regard! :D The steep price of the laser treatment does make it feel like a bit of a last resort, but when I consider all the money I've dumped into alternate options over the years, maybe it wouldn't be such a crazy investment...<DoesTheOctopusCare>: If you're flaky, dry AND oily... have you tried treating for fungal acne? Do you have dandruff ever? <Laspyra>: Sorry to hijack someone else's thread. You just described my t-zone, eyebrows and hairline/scalp. So much flakiness and dryness and oily. It never made any sense to me. Is this something I have to see a doctor about to diagnose and possibly get a prescription? Or are there anti-fungal treatments I can do. Thanks for your help in advance. <ChemicalAlia>: EVERYTHING THAT IS BAD. Good luck to you!<Laspyra>: Good luck to you too. 😊", "num_messages": 8, "avg_score": 48.75}
{"start_date": "1543554460", "end_date": "1543573198", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 32, "text": "<AutoModerator>: NEW OR NEED HELP? Ask here! - ScA Daily Help Thread Nov 30, 2018 If you're new to SkincareAddiction: welcome! This thread is the best place to start if you have questions about skincare products, your routine, and your skin. Our community is knowledgeable, and we want to help you have the best skin of your life! - #Do you have a question? ###Step 1: Read our resources First take a look at our [FAQ](https://www.reddit.com/r/SkincareAddiction/wiki/faq) and [Wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)! They include product recommendations and advice for skin concerns like [acne](https://www.reddit.com/r/SkincareAddiction/wiki/acne), [pigmentation](https://www.reddit.com/r/SkincareAddiction/wiki/pih), and [dehydrated skin](https://www.reddit.com/r/SkincareAddiction/comments/1akqed/dehydrated_skin_what_is_it_what_it_looks_like_and/). Or search the sub using [this awesome website](https://www.narfar.com/r/skincareaddiction). You might find a solution to your problem there! If you can't find an answer, or you have additional questions after reading, please move on to step 2! ###Step 2: Ask for help To give you the best advice possible, our users need relevant information about your skin and skincare. With your request for help please include: * **The issue(s)** you need help with. * **Skin type**. It's OK to be subjective, how do you feel your skin is? Oily, dry? If you need help clarifying, check out [this guide on skin types](https://theacidqueenblog.com/2016/06/23/skin-types-proclivities-and-conditions/) * **Current routine** with the full names of your products (try to separate it in to Morning, Evening, and Occasionally used) * **How long** you have been using your current routine, or product in question * **Anything new** you’ve introduced or started doing that might change the condition of your skin * **Your location** so we can recommend products/services available to you Thanks for taking the time to include your information! #Would you like to give advice? Firstly, thank you so much for helping out our community, without your knowledge and time ScA would not be the same! Some things we'd ask for you to keep in mind: please don't just downvote someone's opinion or response because you disagree. If you can, please take the time to tell them why you think their advice may be incorrect or harmful. It's better for people to understand why something is a poor choice, instead of just being told that it is one. #[Previous Threads](https://www.reddit.com/r/SkincareAddiction/search?q=title%3AAsk+ScA&amp;restrict_sr=on&amp;sort=new&amp;t=all) ---- *This thread is posted every day at 12:00am ET.* <Husnain_Ijaz>: What is the normal age for having normal acne?<onigiri815>: There is no such thing as \"normal\" acne - all acne is \"normal\" but just has different triggers. People can have acne as a child, ad a teenager and as an adult. <Husnain_Ijaz>: What about adult acne? Is it normal?<onigiri815>: &gt;People can have acne as a child, ad a teenager and as an adult. Yes. It's normal. It can happen. <Husnain_Ijaz>: What i really wanted to ask is that after what age, acne starts to go away/you need to be really worried about acne? (men specifically)<onigiri815>: Can't answer that and not sure if there really is an answer. If you are concerned, it might be worth seeing a GP to clarify this. <Husnain_Ijaz>: Thanks for Replying.", "num_messages": 8, "avg_score": 4.0}
{"start_date": "1544722772", "end_date": "1544760594", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 191, "text": "<liatenshi>: [Haul] My first serious skincare haul thanks this subreddit (The Ordinary) + first rookie mistake <liatenshi>: My skin was never really problematic until a few months ago when my dry skin reached a point where it became super tight and flaking all over. I couldn’t even pencil in my brows properly because the skin was flaking underneath. Ever since, I’ve been lurking here just researching and waiting for my not-so-serious skincare products to run out so I can start a serious routine. I finally went for it two weeks ago and got these: 1. The Ordinary Hyaluronic Acid 2% + B5 2. The Ordinary Natural Moisturizing Factors + HA 3. The Ordinary 100% Plant-Derived Squalane I played it safe and stuck to the recommended regimen for dehydration on the TO website (1+2 in the AM, 1+3 in the PM) but I made the mistake of starting all three at the same time. It’s been two weeks and I’m so glad my skin didn’t freak out. I saw results immediately too and I’m pretty happy with all of it right now. I’m crossing my fingers that this continues! I’m thinking of adding more to this from The Ordinary, mainly to address ancient acne scars (and maybe enlarged pores while I’m at it). I’m only using these currently, plus a cleanser (L’Occitane Angelica Gel) and micellar water (Garnier). Would rose hip seed oil be a good addition if I don’t want anything that may be too strong? <prettypooperino>: I use rose hip seed oil everyday! But my skin is oily and fairly durable (using a lot of different products but doesn’t easily dry out). I like it, and I think it’s really gentle and adds a nice little lightening glow to my skin. I used the Julep one for a while, but recently ran out. <liatenshi>: Great to hear that it's gentle! I'm hoping my skin can take one or two more products since this current regimen is only for dehydration. <prettypooperino>: Yeah, I hope it works for you! Some say to use it morning and night, but I’d try it once a day at first. :3 All the best in developing your routine.", "num_messages": 5, "avg_score": 38.2}
{"start_date": "1543610113", "end_date": "1543629331", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 427, "text": "<zoombified>: [humor] I don't understand why my skin is so dehydrated 😢 <legowife>: Ugh, makeup remover wipes. I use one in an emergency and my skin is screwed for weeks. I recently had this happen while I was part of a wedding.<ImHavingAFlareUp>: How do you get makeup off? Seriously. I’m wondering if this is contributing to my break outs.<legowife>: Oil cleansing! So much gentler on your skin and imo works 10x better!<ImHavingAFlareUp>: Wouldn’t oil make you break out? What kind of oil?<legowife>: Nope, my skin has never been better. Years of products were actually torturing my skin. Definitely check out the side bar and search the sub for OCM. Big game changer for me. Oils don't make you breakout unless they're comedogenic and can be wonderful for all skin types. I use sweet almond oil, spread it all over my face with my fingers \"washing\" with it, then use a warm wet wash cloth to gently remove the oil, makeup, dirt, etc. I follow it with a quick rinse of micellar water, but that's not totally necessary. Some people follow up with a very gentle cleanser as well, but that's too much for my skin and the extra moisture I gain from the oil is important for my skin to keep. <ImHavingAFlareUp>: I will definitely check it out? Where does one buy that kind of thing though? I don’t think I’ve ever seen an oil cleanser at ulta.<legowife>: They aren't necessarily marketed as cleansers. Googling will find some, but it isn't necessary to buy an 'oil cleanser' product. You can use coconut oil (ymmv, some people are slightly allergic topically) or even olive oil in a pinch (feels weird though!). The OCM article has more specifics I think - there are LOTS of different oils to choose from, some with their own skin benefitting properties. I get a bottle of sweet almond oil with a pump from amazon (Viva Naturals Sweet Almond Oil 16 fl oz, 100% Pure and Hexane Free, Ideal for Skin and Hair https://www.amazon.com/dp/B011QHFB4A/ref=cm_sw_r_cp_apa_i_vrEaCbXG0CF27). It lasts forever.<ImHavingAFlareUp>: So I was looking at the sidebar and is sweet almond oil one of the more drying ones? I’ve found that from using differin to treat my acne, my skin has been quite dry :/ <legowife>: I didn't know that actually! Mine is pretty dry/dehydrated as well. Maybe I'll switch it up next time.", "num_messages": 10, "avg_score": 42.7}
{"start_date": "1544735694", "end_date": "1545106163", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 33, "text": "<faintsmilekarii>: [Routine Help] My 2019 goal is to work on my skin. My current issue is with ice pick scarring and blackheads. Any routine recommendations would be appreciated! My laughable routine will be in the comments.. <macramedreams>: Use a gentle cleanser. I like CeraVe hydrating. You should trash that exfoliator - it’s way harsh and causes tearing - and go with a chemical exfoliator. Drunk elephant tlc is amazing but hella expensive. There are many other options you can try though. And always moisturize after cleansing! :) <faintsmilekarii>: Thank you so much for your advice! I’m definitely throwing out the exfoliator, I had no idea it was harsh! [deleted]: instead of drunk elephant you should look into the ordinary products. they make great dupes for DE for under 10 bucks-- and the products are amazing! [deleted]: salicylic acid is really gonna be your friend here. maybe 2 or 3 times a week.<faintsmilekarii>: Thank you for your advice! I’m writing down everyone advice and condensing it into a routine! I have read to introduce new products every week or so in case one make me break out. Do you have any recommendations for a DE dupe? <Edit>: super dumb question but would the de product and acid be the same thing or two different products?<opaldrops>: I’m just going to reply even tho I’m not the one being asked, sorry So with chemical peeling products, I would suggest incorporating up to two at a time bc they are meant to strip your skin and too much of that will burn your skin. Don’t worry tho, by “too much” I mean daily use. Usually with chemical peels, you do them once a week. Also there are different types of peeling acids (if that’s even a term lol). I found that lactic acid works on well on me so far. I have been using The Ordinary Lactic Acid 10% drops. I mix it into serum or moisturizer and apply it. Also, be sure to always use sunscreen when you go out after you use peeling products bc they do make your skin vulnerable to sun rays while they sit on your skin. Therefore, I usually them at night.<faintsmilekarii>: Thank you so much for your advice!!", "num_messages": 8, "avg_score": 4.125}
{"start_date": "1543611759", "end_date": "1543613717", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 13, "text": "<Ferryboat25>: [Routine Help] Would you stop your routine if mila or kp appeared? I have been cleansing with a pretty heavy cold cream the last two weeks. Suddenly it seems i have these milk spots, which i dont believe are closed comedones but milia or kp cause im had them before and they dont really come to a head. Do i persit or do i quit? I am absolutely terrible at keeping a routine when there is any sign of purging but i just dont know. <naw613>: Omg I'd love to meet Mila Kunis!!<Ferryboat25>: Bwahahah god dammit, thank you for humoring me. Me tooo. My girl crush fo sho.", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1544742979", "end_date": "1544800962", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 13, "text": "<Whimsy515>: [Routine Help] If we're supposed to use retinol daily, how do you use AHA then? There are plenty of articles [1](https://www.dermstore.com/blog/how-to-use-retinol/) [2](https://www.paulaschoice.com/expert-advice/skincare-advice/myths/five-retinol-myths-busted.html) where derms say to use retinol daily. On top of that, they want you to use AHA as well. But using together, while doesn't decrease the potency can cause irritation. I use an AHA strictly for bumpy skin. It's taken care of that, it doesn't do a thing for my pores like some have said. This past Oct I began using TO retinol emulsion. And I freaking love it. It really heals my hormonal acne quickly. I was thinking of just sticking with the retinol and using it nightly instead of every other night. But I second guess myself because AHA is supposed to be helpful for the retinol to do it's thing. But again, if we're supposed to be using it every day, then where does the AHA come in and not cause irritation? ETA my routine is simple. Morning wash with raw honey, then moisturize, then sunscreen. Night-micellar water, raw honey AHA or retinol, then moisturize. <chillingambitiously>: Do you really need to use the AHA daily now that you've incorporated the retinol? Maybe cut back to AHA twice a week and take retinol off those days? If anything replace retinol on the AHA days with a hydrocortisone based cream or a soothing serum or mask to calm everything down.<Whimsy515>: I was thinking this. Or maybe try a weekly AHA peel? I feel like I may not need the AHA, but everything I've read said it helps the retinol. But I could cut back on the AHA first, and see what happens. <chillingambitiously>: Once a week will work as well, maybe better. If you have combo skin and tend to dry out after peels go for a lactic based one. If you have oily, problem skin go salicylic.<Whimsy515>: Good to know, thanks! &amp;#x200B;", "num_messages": 5, "avg_score": 2.6}
{"start_date": "1544740541", "end_date": "1544744342", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 24, "text": "<rosewatercereal>: [Skin concerns] People in cold climates, what are you tips for winter? Since November my skin (cheeks, forehead, nose) has been super dry and flaky. I'm experiencing the same on my scalp too. The temperature is barely in the negatives, soon it will be -10, -20, so unless I find some remedies, it will get worse. What works for your skin during winter? I currently use cerave lotion, cerave foaming cleanser, pixi glow tonic and occasional sheet masks. I used to use bravura london salicylic acid, but not since ~september. I remove makeup with MakeUpEraser, but I only wear a full face of makeup like a few times a month - usually it's just eyebrows, mascara, lips. This used to be enough for my skin to feel fresh and moisturised during spring/summer/autumn, but apparently not anymore :(<Aydo040404>: Maybe invest into a humidifier <bschulk>: This. A humidifier makes a huge difference for me.", "num_messages": 3, "avg_score": 8.0}
{"start_date": "1543559472", "end_date": "1543627077", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 18, "text": "<deeadpoool>: [Routine Help] Should I go back to my previous skin routine? Feeling kind of lost and hopeless. So I've struggled with acne for about 7 years (22 years old now). Over the last 4 or so, I went to dermatologists, would get prescribed a retinoid or epiduo and other stuff like BP and clindamycin. Went on doxycycline/minocycline 2-3 times of a couple of months at a time. Throughout this time, my skin has overall been the same. Having anywhere from 3-8 nodules/cysts/pimples. Basically I would deal with my skin as is, at one point it will get extra bad and/or I'll start to lose help of it getting better and I'll visit the derm. I ended moving all the way to the highest strength tazorac, which didn't fully cure me just like the rest. The derm I had at the time said Accutane was the last solution but I was hesitant (but my insurance ended up changing which stopped me from going through with it). Earlier this year, I stopped taking the tazorac to simplify/reset my routine. My skin stayed the same until 1.5 months after (maybe b/c no more tazorac?) and I ended up trying Curology. I've been on Curology for 5 months and although saw improvement earlier on, my skin has been bad lately (but improving now!). I plan on returning to a derm to get a second opinion. But if overall, my skin has gotten worse since Curology, should I cut it or try to change the formula? Current routine: <AM>: * Cetaphil Gentle Cleanser * Solbar Zinc SPF 38 Moisturizing <PM>: * Alternate between Cetaphil Gentle Cleanser and Sulfur Topical Suspension Wash (prescribed) * Apply Curology (10% Azelaic Acid, 1% Cindamycin, 0.25% Zinc Pyrithione). * Solbar Zinc SPF 38 Moisturizing As for my previous routine, I don't remember exactly but I was using the Tazorac along with the Cetaphil Wash, Benzly Peroxide, and moisturizer.<saucylackey>: How long did you stay on each prescription before you lost hope and moved on? Do you remember?<deeadpoool>: Can't say for each. But retina a about 1.5 to 2 years. Epiduo maybe 8-12 moths. Tazorac was 1.5 years. <saucylackey>: Good for you, you gave everything a really fair shot. Where is your acne located? And is it mostly cystic?<deeadpoool>: Mainly around the cheek and sides of my jaw.. I think its mainly cystic? I always had a hard time telling. I will get ones that take forever (if at all) to whitehead that are large and last weeks. Some I get will whitehead and go away in a few days. The longer, larger ones are more common for me<saucylackey>: I'm not a derm, but that has all the hallmarks of hormonal acne. Have you tried Aczone or spironolactone before?<deeadpoool>: Haven't tried either. Will look into it! I'm a male tho if that means anything<saucylackey>: Eh, it just makes me less likely to recommend birth control ;) Personally I'd swap over to the CeraVe Foaming Face Wash and CeraVe Moisturizing Cream. Anecdotally I've heard the Cetaphil can be (surprisingly) irritating. The Curology prescription looks solid to me (although I'm not a derm), and if you feel like your skin is getting better I would stick with it for now. Also, are you a big consumer of dairy?<deeadpoool>: Thanks for the help!! I pretty much avoid dairy unless I eat out and theres cheese or something like that. But generally my dairy consumption is quite low. About 2 years ago I went a month avoiding dairy altogether (not sure if I left cheese, etc. out tho, but definitely less than before) and noticed no improvement. Again, that was two years ago but there was a reason I just went back to not worrying about dairy.<saucylackey>: Kudos to you! It helps some people, but if you didn't notice improvements I definitely wouldn't recommend continuing to eliminate it. Yeah, I think going to a derm for a second opinion would be a smart move. But my ears perked up when I heard you say that you were starting to notice positive changes with the Curology prescription, so I wouldn't give up on it yet or start playing around with other actives. Has it given you the best results so far, out of everything that you've tried?<deeadpoool>: Yea i'm going to hold off on introducing new actives for now. I did order some Acne.org Benzyl Peroxide Treatment because I believe using BP helped keep my acne at bay so eventually i will try incorporating that in. For Curology, my face got a bit worse at the start (purging?), then began to improve, then got worse after I started taking whey protein. About 3-4 weeks after stopping the protein it began to get better and is continuing to do so. I will say that my skin texture has definitely improved since going on Curology! Looks a lot more smooth where I don't have acne. I'm sure cutting back on all the drying products has helped also<saucylackey>: It does sound like the whey got in your way X) I'd definitely stick with the Curology (although again, not a derm!) and try to be gentle with your skin in the meantime. Keep in mind that BP can be very drying. Good luck—it really sounds like you're on the right track.", "num_messages": 12, "avg_score": 1.5}
{"start_date": "1543421356", "end_date": "1543523582", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 160, "text": "<zoeybarkow>: [Product Question] what’s your HG product that you rarely see mentioned here in routines? Mines the Paula’s Choice Moisture Boost cleanser. I have dry skin that is prone to breakouts when I use too harsh of cleansers. The Cerave hydrating cleanser that everyone loves broke me out but this one cleanses without drying. I can’t recall ever seeing it come up in anyone’s routines here! What other products deserve more love?<princepessa420>: Juice Beauty Oil-Free spf 30! It’s the only sunscreen that doesn’t make me break out!! No silicones!<Breakaway9999>: I'm tempted to try this out. I'm using the JB CC Cream right now and have been using it for 2 years so far. It does have SPF 30 but the coconut oil...I'm not sure if that's what causing some of my breakouts. I'd love to have a sunscreen without worrying about blending it out too much like I do with my CC cream. Is it a thinner consistency? <princepessa420>: I’ve really wanted to try their cc and B.B. creams but I’m scared of the oils! I use jojoba but many break me out. Honestly if I was you I’d try it out, I’ve been using it for YEARS! The only ingredient in it that might break you out is an algae type ingredient (algin?) when I ran it through cosDNA. It’s a very thick consistency, like a thick moisturizer. At first it’s very white bc of the zinc but with a little blending I love how it brightens my skin and helps with some of my discoloration. I’m a white Italian so not sure how it would look on darker skin. But it blends in well and the white cast definitely goes away, I’d say it’s more brightening on lighter skin! I love that it’s physical because I feel like the zinc actually helps some of my breakouts go down and after a long day of wearing this and using la roche possay effaclar duo my acne always seems smaller! Let me know if you have any q’s :) <Breakaway9999>: Good to know! This isn't the tinted version is it? When I looked it up, it came as tinted which is fine with me as well, I'd get the sand or tan color since I'm SE Asian. I don't want a white cast that's for sure :) <princepessa420>: It’s the oil free version, the tint has coconut oil, jojoba and I think sunflower oil. I posted pictures below of it first on, rubbed in, and with a flash :)<Breakaway9999>: I just purchased it this evening. I'll try it out first thing tomorrow :) about 80% my face is affected by vitiligo, so this will hopefully brighten the parts that aren't quite there yet. I'll let you know how it works. The ingredients are pretty simple. Thanks for your suggestions and photos too! <princepessa420>: Yay so glad to help :) I really hope it works for you hun it’s my HG sunscreen! <Breakaway9999>: So half day so far. I noticed that it made my cheeks red...otherwise no irritation. Not sure which ingredient is doing that. It blended out well though. Hmm.<princepessa420>: Interesting, maybe it is the fruit acids in it? I think it has apple juice in it! My skin loves the fruit extracts but that might be it<Breakaway9999>: Weird cause my CC cream has apple in it too, I'm pretty sure. The weather is dry and cold here, running the car heater, getting in and out, that could be it too. I really do like it though. Simple list of ingredients and actually lightweight. <princepessa420>: Trueee most juice beauty products have the same basic fruit extracts in them! Could be the weather, hopefully it is! I’m glad you like it, I love the ingredients it’s one of the few affordable sunscreens without aggravating oils or dimethicone 🙏🏻 I always break out from silicones and chemical sunscreens <Breakaway9999>: Let's hope I can use it long term :) thanks again!", "num_messages": 13, "avg_score": 12.3076923077}
{"start_date": "1544739103", "end_date": "1544764398", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 16, "text": "[deleted]: [Product Question] What’s a good extremely gentle cleanser at the drugstore? [deleted]<-Saraphina->: I had the same problem at first when using Differin. I'm not saying my advice is right or the best thing to do, but I honestly found that just powering through and washing my face with Cerave as normal led to the burning and sensitivity going away after a bit. Also moisturise regularly! It really helps. I use the Cerave PM moisturiser. Sunscreen is also so important with Differin. Those are just some things that helped me. I've been using Differin and Cerave hydrating cleanser together for 2 years now and it's had such a good impact on my skin. No extreme sensitivity or burning at all since. :) But of course everyone's skin is different so what worked for me might not work for you.<alexnicoleruss>: Did it make all your other products sting for a bit? I’m nearing the end of week two with Differin and while I haven’t really purged, my skin has gotten so ridiculously sensitive. I’ll oil cleanse, then the CeraVe wash stings, the CeraVe moisturizer stings, the differin doesn’t, but moisturizer afterwards stings. It all just stings for a small but (enough to make me stop rubbing or patting product in and need to fan my face for a bit) I’m not sure if it’s the differin or just my routine.<-Saraphina->: Yeah honestly at first it made my skin so sensitive to everything. My face even looked pretty red all over as well. I know exactly what you mean by having to stop and fan your face! I actually think the moisturiser burned the most for me. I can't remember at which point the sensitivity stopped since it was so long ago. I really don't know if it's normal or whether you're supposed to stop using it. Powering through was just what worked for me personally.<alexnicoleruss>: Thank you so much. I figure it’s just the differin making everything sensitive. The moisturizer definitely burns the worst. I’m so glad to know it’ll go away. Thank you!!<-Saraphina->: Yeah that does seem like the case if you were using the CeraVe with no problems beforehand. If the sensitivity is really persistent though and doesn't go away after like a week or so, I'd say maybe stop using Differin for a bit to give your skin a break. Then try using it 3 times a week instead of every day and see how that goes, and after a few weeks go back to using it daily. And no problem, I hope your skin is just adjusting and it does go away soon!", "num_messages": 6, "avg_score": 2.6666666667}
{"start_date": "1543596420", "end_date": "1543855727", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 10, "text": "<384ChubbyDumpling>: [Acne] Moisturise me- help finding a moisturiser that doesn't break me out So I'm finally getting serious about my skincare and building a routine around my needs but I can't seem to find a decent moisturiser that does what I need without breaking me out. I started using CeraVe Facial Moisturiser for my combination, (verging on very dry in some places) acne- prone skin but, after only a day of using it, I broke out with whiteheads all over my chin and on the apples of my cheeks. I'm pretty sure this isn't just purging. I'm desperate to find a moisturiser that is non-comedogenic, hydrating and suitable for acne-prone skin. Do your thing, gals.<Ellieissokay>: My skin hates Cerave of all forms, and I'm not even that sensitive. Non-comedogenic is subjective.. because everything I have tried labeled as such clogged my pores. I can only use gel and gel creme moisturizers, and a lot of them are super hydrating. The Murad Nutrient Charged Water Gel is one of my favorites. Neutrogena Hydroboost is popular here, haven't used it personally but I hear it's good. Aside from the Murad, I have the Belif Aqua Bomb, Laneige Hydrating Gel and I always have a jar of Chanel Hydra Beauty Gel Creme.. which I know is stupid expensive but to me it is worth every penny. <384ChubbyDumpling>: Is the Murad Water Gel worth it do you think? I've done a little bit of research and a lot of people recommend it. I'm just worried it will be wasted on my sensitive skin, considering the price. <Ellieissokay>: [For reference](http://imgur.com/a/qnOgOHl), I buy and sample a lot of products.. there's more in bathroom cabinets and drawers. Out of everything I try, the products I've mentioned are the select few that adequately hydrate my skin without clogging my pores. Everything gives me blackheads. The Murad sinks in so nicely and doesn't leave any slickness on the surface. It is really friendly with my finicky skin, so I think it is totally worth it!<384ChubbyDumpling>: Wow. I'll definitely check it out. Thank you so much :) <Ellieissokay>: No prob love", "num_messages": 6, "avg_score": 1.6666666667}
{"start_date": "1544712741", "end_date": "1544812515", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7, "text": "<loala2>: [Skin Concern] Itchy, dry eyelids I’ve been having this problem for a while now, my eyelids/area below brows gets dry, itchy, and sometimes red. I cannot figure out if it’s a reaction to any particular product. My eyes also tear up at times, for no apparent reason. Could this be a reaction to tretinoin? I don’t put any too close to my eyes, but I’m wondering if that’s the culprit<vday1989>: This happens to me. It happened before tret, and it was due to dust in my apartment. As soon as I moved, it stopped. I put tret on my eyelids now, and then follow up with aquaphor. Works like magic!<loala2>: Thank you! So was it an allergic reaction for you then?<vday1989>: I think so! I never got it confirmed because it went away. At first I thought it was just a sign of aging, until someone pointed out that I probably had an allergic reaction. As soon as I moved out of that apartment, they went back to normal.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543622225", "end_date": "1543629597", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 44, "text": "<PenguinHoarder1533>: [Personal] I'm self-sabotaging myself, are you? So, I do the things we know I shouldn't do- I try a lot of new products, wanting them to be the miracle product that will rid me of my acne, and I do not patch test. A couple of weeks ago I decided to change up my routine (another thing I should not do), by using the products I already had in a new way. I stopped using my benzoyl peroxide treatment and started using my DE night serum instead (previously I only used it once or twice a week). Things were okay, but then my acne started to really flare up so I decided to stop using DE every night. Did I go back to my old, not perfect, but okay routine. Noooo. Instead I bought a new salicylic acid treatment from Murad. That thing really destroyed my skin. Not only did it worsen my acne, it dried my skin out so bad. I almost called out for work because I did not want people to see me. Now, I am backing off anything harsh and I am focusing on reviving my poor, poor face (Thank you Aquaphor!). Does anyone else self-sabotage their skin routine in this way, by doing things they know they shouldn't to their poor, poor faces? <kricketrocket>: Lol. All the time. It’s called being a skincare addict. I’ve managed to identify a routine (thank the lord) that calms my skin right down over the course of a few days if I go a little too ham with the experimenting and my skin breaks the eff out. You may ask, why don’t you just use that routine forever then? Because I’m addicted to skincare. End of story.<PenguinHoarder1533>: I am tempted to ask what your \"calming routine is..but, knowing myself, that will tempt me to try new products.<kricketrocket>: That’s likely 100% correct. But if you wish me to divulge, I am happy to. <PenguinHoarder1533>: Eh, what the heck. Tell me please, because YOLO or whatever the youths say nowadays. <kricketrocket>: I knew you’d cave. Morning : cotton pad - bioderma micellar water. Wipe off residue from night before and rinse with water. Soon Jung 5.5 toner (I use my hands slap slap slap) Cosrx snail mucin essence. Avene skin recovery cream. Sunscreen (currently Althea petal velvet sun away) <Evening>: 1st cleanse Tula kefir cleansing oil Second cleanse innisfree green barley foaming cleanser or if I’m extra dried out then something like glossier milky jelly or any hydrating cleanser I have. Soon Jung 5.5 toner Cosrx snail mucin essence 5 drops rosehip oil mixed with Nivea GERMAN VERSION creme (blue tin) slather slather. No actives until my skin can handle it (if I’ve gone overboard) and then I add in maelove glowstarter vit c in the daytime when my skin is calmed down and every few days some sort of acid at night. I have a million so I just pick whatever looks fun that day. But one thing I’ve reallllly noticed is that when I was younger, my skin loved gentle acids daily. Now, at most every 3 days is all it can tolerate. Seriously my skin gets way more bumps if I exfoliate too often vs just moisturizing the crap out of it. Very odd and very different from what I’d been used to. You asked for a novel right? Lol. I honestly have so many products it’s ridiculous but I’m finding that mostly anything will work as long as I’ve narrowed down ingredients my skin hates. At present, I think niacinamide breaks me out so I’m probably going to have to sell a couple of my brand new essences I just got 😭. <PenguinHoarder1533>: Thanks! I enjoy reading people's routines to see what insight I can gain. And, though I have been tempted to buy a new micellar water I will try to resist the impulse.<kricketrocket>: I love it too! So many products out there :)", "num_messages": 8, "avg_score": 5.5}
{"start_date": "1544741519", "end_date": "1544760283", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 10, "text": "[deleted]: [Product Question] Double Strength Retinol for a $1, is it okay? [deleted]<haha_thatsucks>: I hope you try it and let us know. The ingredients look legit even tho the price makes it look like a scam<victwat>: I actually found another post by searching \"dollar tree\" and lots of people said the ingredients are great!<haha_thatsucks>: Yup! I love tried the face masks from there but I haven’t found these serums in any of my dollar trees", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1544750386", "end_date": "1544756902", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 14, "text": "<uglyasiankid3>: [acne] what kind of acne is this and what should i use? Used mario badescu acne cleanser and tea tree oil before which didnt work <amk933>: I do not think oils and cleansers will fix that problem. Go to the pharmacy and buy Differin. Start using Differin every other day or every two days and gradually increase frequency as your skin adjusts. Use moisturizer 20-30 minutes after applying Differin. Your skin will become worse for the first weeks but should improve tremendously around the 2-3 month mark. Be sure to add SPF in the morning.<neurosciencebiddie>: Is it possible to buy Differin without a health insurance these days? Insurance stopped covering mine a while ago and I remember it to be $125 without coverage. Regardless, OP you will need a prescription. <leslspurmar>: Differin is OTC in the states.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1543576375", "end_date": "1543623009", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 34, "text": "<LazerTRex>: [Haul] Christmas Presents <LazerTRex>: Just received my latest order from Soko Glam. 30 year old female. My skin is acne prone, slightly dehydrated and starting to age. I’m using hormonal birth control to control my acne. I have pigmentation and scars from a bad breakout last year which I’m undergoing fractional mesotherapy (micro needling) to treat. After the treatment I can only use gentle products for a week and no actives. I’ve been focusing on hydrating my skin. Products I bought are; **Banila Clean it Zero Balm Revitalising** I bought this to replace my current oil cleanser (was using the MooGoo oil cleanser but it doesn’t emulsify well and the packaging makes it difficult to travel with). So far I like the feel of the product, how well it emulsifies in water, and the packaging, which is good for travelling as well as just looking cute in general. The smell is ok, and not too overwhelming but I don’t have the best sense of smell anyway. **CosRX Triple C lightening liquid** As I have some pigmentation I’ve been testing out vitamin C serums to improve the pigmentation. I’ve tried the andalou natural Tumeric + C enlightening serum which felt nice but smelt a bit funny and I didn’t see much results. I’ve been using the skinstitut even blend serum but I’m not a fan of the gel texture, it feels too heavy. This feels really light on my skin and doesn’t really have a smell. It’s too early to see any results. **CosRX Low PH Good Morning Gel Cleanser** so far I haven’t tried this. I bought it to replace my nuetrogena hydro boost gel cleanser which I love the feel off, and leaves my skin feeling clean but not tight, however I do not like the fragrance. I will finish the bottle before I open this. **CosRX Advanced Snail 96 Mucin Power Essense** I bought this to add some extra moisture into my routine and because I heard it can be good for acne and breakouts. However I then heard it can cause a reaction in people with shellfish allergies so it’s going to undergoing some serious patch testing before I incorporate it in my routine. I might not include it until the new year just in case I have a reaction (too many social events before Christmas). If I end up not being able to use it I’ll give it to my sister. **Various sheet masks** bought these as stocking stuffers for Christmas for my sister and best friends. Hopefully they have some fun with them. All the products came from Soko glam, shipping to Australia took about a week and it came well packed with lots of air packet thingies to protect the products. I also got a couple of samples of Ascen TOC toner, but as I’m avoiding actives atm I probably won’t use these. <crrunchygranola>: I have a shellfish allergy and have always wondered about the snail products for that reason! Curious to see how it works out for you. <LazerTRex>: I’ve tested a pretty big patch on my forearm and I’ve had no reaction. Usually testing on my forearm doesn’t really tell me if a product will irritate my face but I figured with an allergy it would show up pretty quick. Nothing, no reaction. My allergy is pretty mild but I’m still a bit scared that doing a larger area or continuous exposure might trigger something so going to patch test for a little while before moving to my face but so far so good!", "num_messages": 4, "avg_score": 8.5}
{"start_date": "1543237198", "end_date": "1543238887", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 13, "text": "<rinsue_8>: [Product Question] Oil cleanse substitute for someone who can't use oil on face? Oily combination skin. I have really bad blacheads and clogged pores. Everywhere I've read, people have suggested BHAs, clay masks, and oil cleansing. I did this for a few weeks and all it did was spread milia across my face, all the way down to my cheeks. On top of the fact my blackheads and clogged pores have not cleared up, I now have white dots on my face I don't know how to get rid of :[ Currently my routine is just two products, I'm too scared to use anything else. CeraVe Foaming Cleanser and Simple Protecting Light Moisturizer with SPF 15. The product that caused my milia was the Johnson's baby oil I used for oil cleansing. I've tried to do research on how to prevent milia and the only thing I've really gotten out of my research is \"don't use oils or heavy creams\" (no product suggestions), so I'm kind of stuck, because that rules out SO many products, and I'm scared of accidentally using a product that will spread it more. Please help!!<Armamama>: It's possible that the oil was not cleansed off properly after you were done with oil cleansing. While it's quuuiite unusual to be sensitive to mineral oil you may be. Does your moisturizer have mineral oil? And anyway, while oil cleansing really helps, the real magic is in acids. Tretinoin helps too (speaking from experience). So I suggest just using a bha or aha toner two to three times a week. That should help without the need for oil cleansing. Slower and less satisfying to be sure tho haha<rinsue_8>: Is there a particular way I should have cleansed it off? I was just using water to rinse it off. I'm a noob when it comes to skincare. No, I switched moisturizers after the milia outbreak. Thank you for the suggestions!<Armamama>: Well some people do that, but for some people residual oil can trap bacteria and oil in pores resulting in all kinds of breakouts. Would not recommend it with mineral oil though. Some organic oil like rosehip or jojoba is probably better for that method. The better method for you is probably to use your foaming cleanser and make sure to wash every bit of oil off your face. There are emulsifying oil cleansers which wash off with water but those can be expensive. Meanwhile milia can be quite stubborn and I really think an acid toner will help you in the long run~ <rinsue_8>: Thank you so much for the information!", "num_messages": 5, "avg_score": 2.6}
{"start_date": "1543617555", "end_date": "1543641908", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 443, "text": "<sunlit_cairn>: [Humor] When you make your own face masks but it looks like you just raided a bunch of diapers. <sunlit_cairn>: for anyone curious, it’s a mixture of water, honey, turmeric, and activated charcoal (and a few drops of tea tree oil). It’s helped with my inflammation a lot, but comes at this price <purplebawl>: The turmeric didn’t stain?<HowardAdderly>: It stained my face pretty good. It wasn't gone until the next day<sunlit_cairn>: I know everyone’s skin reacts differently and I’d seen mostly women of color using turmeric on youtube, so I was a little nervous since my skin is pretty pale. My foundation is high coverage so I figured I could at least deal with it if it went sour. Today I had a bit of a thicker layer of orange left over because I lost track of time folding laundry, but I was able to scrub it off with african black soap (the shea moisture brand *exfoliates*).", "num_messages": 5, "avg_score": 88.6}
{"start_date": "1541644966", "end_date": "1541710505", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 25, "text": "<catinthecupboard>: [Skin Concerns] Chronic nose blowers, chap preventative and treatment? I am a nose blower. Not allergies just other health issues keep me glued to a kleenix box. This is a problem year round but with the cold air in winter it gets worse. My cheeks, upper lip and nose all risk getting easily chapped. Anyone else find some great methods and products to combat this? I would like to prep for the long winter ahead. <poliebear>: La Roche Posay Cicaplast Baume is my go to!<Plaidpoop>: Seconding this. Use cicaplast, then top with a layer of aquaphor.", "num_messages": 3, "avg_score": 8.3333333333}
{"start_date": "1543594575", "end_date": "1543629692", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 100, "text": "<brainyspecs>: [Misc] My GP had samples! <bonez2017>: What's gp?<DanteThonSimmons>: What do they call a GP where you live? Like the Doctor you go to regularly.<bonez2017>: i have never heard people called a doctor a GP in the usa .. we just call them doctors . LOL ---------------- <edit>: why downvotes ? LOL .. have you guys ever heard anybody in the USA say \"im sick today- i will call my general practitioner\" doubt it most people will just say \"i will call my doctor\" .. JFC<DanteThonSimmons>: Haha. Didn't realise Americans don't use GP. Sorry about that! To be fair though, Americans say a lot of things the rest of the world doesn't. A few off the top of my head - Soda, pop, Aluminum, Fall, college, referring to university/college as \"school\", I could care less, vacation, a long ways to go, aggressiveness, check (vs cheque), aLmonds, and a few ERRbs like orEGGano and BAYsil. Haha. We love you for it though! :)", "num_messages": 5, "avg_score": 20.0}
{"start_date": "1544726033", "end_date": "1544762133", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 462, "text": "<fntastk>: [Misc] Hydrocolloid bandage this morning after covering a three headed monster pimple for ~ 14 hours. Staying home today so slapped another one on after my shower <Cjohnson_14>: What brand do you use?<fntastk>: It's the bandaid brand. You get three big squares for like $3, sell them anywhere. Target, Walmart, grocery stores, Walgreens, CVS I cut them to the size I need! <nemicolopterus>: Are they light enough to wear during the day? I just got the Nexcare ones and they're great at night but they're soooo thick I'd feel weird wearing it during the day.<fntastk>: Hmm, these are thick too. I've worn one to get coffee before but that's about it. You can't really feel them though so they're definitely light. <nemicolopterus>: Thanks for the info! I'm starting to wonder if what I want doesn't exist since they all seem to be pretty thick. No worries!<fntastk>: I used patches from alba botanica I believe at target and they *might* have been light if I'm not getting them mixed up with something else. <nemicolopterus>: I'll give them a try thanks!!<Kikikiarara>: I've found that Spot Medic is light enough to wear out and be unnoticeable. My sister has worn them under makeup but I tend to just use them as is :)<nemicolopterus>: Ooh excellent thanks! I'll look at these.", "num_messages": 10, "avg_score": 46.2}
{"start_date": "1544755812", "end_date": "1544766624", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "[deleted]: [Misc][Product Question] To anyone else who lacks impulse control as I clearly do, would you say this even makes a difference? Fridge and quartz roller opinions welcome. [deleted]<blackesthearted>: Love the setup! I have the same fridge (I haven't seen anyone else who got the black one!), and I too keep my roller in it (though mine's \"jade\"). If you're referring to whether refrigerating things makes a difference: absolutely, in my experience. The Fresh face mask, for example! I'm not really a mask person (requires me to be without my glasses for too long), but I bought the 1oz after falling for the sample because it feels *lovely*, especially when it's cold! I keep oils (except my marula which does *not* like being cold), actives, acids, and serums in the bottom of mine, and my \"jade\" roller, aforementioned Fresh mask, and decants of my PM moisturizers on the top. I wish I'd bought two, honestly, because I'd love to throw my decanted face sprays and more essences in there.<Ellieissokay>: They had a bigger 12 can sized one. I was going to get it until I realized it was plastic and $45, so I opted for the smaller one. Now I'm wishing I had gotten the larger one because I am very limited as to what I can put in it. Not like I needed the bigger one, haha. My bathroom is full and this is on a dressing chest right outside of it.. I have all of my cabinets full, under the sink, the large windowsill, the rack above the toilet, plus [this cart](http://imgur.com/a/qnOgOHl) that I bought from Tj Maxx for my main products and samples. I have way more skincare than anyone would ever need, but that doesn't stop me from buying anything and everything that interests me. It's definitely a problem, lol. I *wanted* the larger one.. but most definitely did not *need* the larger one. I might just take all of my deluxe sample jars and bottles that I have used up, take a magic eraser to the branding and use them to store smaller portions of stuff I use everyday. Good idea, thanks for the inspo.<heatherssss>: I thought I had begun to develop a make up problem but I have to say this takes the cake. I would love to see all of what fills up the drawers.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543372030", "end_date": "1543623247", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 22, "text": "<wsmiles0>: [Acne] Could I lance this and put a hydrocolloid bandage on it? It has no head and its just solid. <saucylackey>: I’d strongly recommend seeing a derm. They might be able to give you an injection that can take the bump down within hours. No lancing required.<xleucax>: Why is this downvoted? A small injection of a steroid can help prevent scarring and improve healing prospects massively.<Casua11yCrue1>: I think maybe because seeing a derm anytime remotely quickly isn't possible in all areas of the world or even the US.<pandazyzy>: Even the us? The worst waits I've ever experienced were in the US, despite being in a big metropolitan area with insurance <Casua11yCrue1>: I live in the US so that's all I know, but figured there are probably other parts of the world where dermatology is relatively inaccessible. <pandazyzy>: Not in developed countries", "num_messages": 7, "avg_score": 3.1428571429}
{"start_date": "1544758821", "end_date": "1544880350", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 6, "text": "<kendallp94>: [Skin Concerns] Blister like bumps on fingers. Help! [removed]<onelove888>: I have similar things on my hands but mostly in the cracks or bendy parts of my fingers. And in the winters. Little reddish ( although yours look whiteish ) little reddish and move around my hands for the winter. Sore but don’t hurt. I really wonder what mine are too. <kendallp94>: do they go away on their own for you?<onelove888>: Just looked this up and YES that is mine exact. Thank you so much !!!! That’s crazy that you figured this out !", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1543529509", "end_date": "1554847213", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 108, "text": "<Peter_789>: [Review] Comparison of sunscreens with Tinosorb, Uvinul T150, Uvinal A Plus and Mexoryl A year ago I made a post on all the Tinosorb sunscreens I could find at the time, so I thought it was time for an update ([see sunscreens here](https://imgur.com/a/7Gknw0F)). The most important thing to me is that a sunscreen is non-irritating, free of fragrance, contains stable sunscreen actives, doesn't leave any whitecast/tint and feels pleasant on skin. I have sensitive-dehydrated skin that feels dry quickly, I don't like a greasy/shiny sunscreen either. I've rated every sunscreen and I added a rating for it's oiliness and whitecast. Of course the overall rating is quite personal, all sunscreens in the list have some good/interesting aspects. So something with a 5 is not perse worse than something with a 7. To give an example; I've given the Paula's Choice Resist SPF30 a 5.5, it was the wrong color, expensive, very drying and the uva protection could be low. However if you have a darker skin tone that's very oily, and you live in the US, I can imagine you like it very much. The ingredients are good, although the uva protection remains low of course. Good luck finding your holy grail sunscreen! I've found some good ones, but not really my holy grail, so if you have tips for a good sunscreen please let me know. &amp;#x200B; [Go to the spreadsheet with all sunscreens](https://drive.google.com/file/d/184GCIxZ9YH4tAn2kF1UmyO2JS6yZLjEE/view?usp=sharing) (easiest to read on a laptop/desktop) &amp;#x200B; **Whitecast and shine:** |Whitecast|Shine| |:-|:-| |0: no whitecast|0: completely matte| |1: slight whitecast, barely noticeable|1: not very shiny| |2: noticeable whitecast, easy to offset with foundation|2: a bit shiny| |3: very visible whitecast|3: shiny| |4: strong white/purple whitecast.|4: very shiny| &amp;#x200B; **How much to use for the face:** |Facial Area (cm2)|Sunscreen amount (gram)|source| |:-|:-|:-| |600 (456 + 144 for neck)|0.91 + 0.29|[Labmuffin](https://www.youtube.com/watch?v=NKS5kMbZBlk&amp;t=8m49s)| |785 (550 + 230 for neck)|1.11 + 0.46|[ECHA, 2017](https://echa.europa.eu/documents/10162/21664016/recom_14+_default+human_factor_values_biocidal+products_en.pdf/88354d31-8a3a-475a-9c7d-d8ef8088d004#page=6)| |565 (face only, 1140 incl scalp)|1.15|[Nordic Council, 2011](https://books.google.nl/books?id=vNVrYKh4_BQC&amp;pg=PA88&amp;lpg=PA88&amp;dq=cm2+facial+area&amp;source=bl&amp;ots=7mLgRQWKqd&amp;sig=YaR40h-oFLuSjAVOeTi2aQ_861I&amp;hl=nl&amp;sa=X&amp;ved=2ahUKEwjdsKv7sZDfAhUJ2aQKHRftDiIQ6AEwBnoECAMQAQ#v=onepage&amp;q=cm2%20facial%20area&amp;f=false)| |594 (18000\\*3.3%)|1.18|[Bender et al., 1995](https://www.elsevier.com/books/benders-dictionary-of-nutrition-and-food-technology/bender/978-1-84569-051-9) and [Nordic Council annex B](http://norden.diva-portal.org/smash/get/diva2:702615/FULLTEXT01.pdf#page=148)| |619|1.25|[futurederm](https://www.futurederm.com/how-much-exactly-is-2-0-mgcm2-the-amount-of-sunscreen-necessary-to-achieve-the-labeled-spf-rating/)| |650 (1300\\*50%)|1.3|[RIVM,2014](https://www.rivm.nl/bibliotheek/rapporten/090013003.pdf#page=49)| |685|1.37 (face +neck)|[Dr. Dray](https://www.youtube.com/watch?v=Y24twlGzsJA&amp;t=10m48s)| |Average|1.15 (face) + 0.37 (neck)|| &amp;#x200B; **Sunscreen actives:** |Good ss actives|Okay ss actives| |:-|:-| |Tinosorb S|Avobenzone (good uva protectant, but unstable and high chance on skin reactions )| |Tinosorb M|Octocrylene (very stable, but forms free radicals, penetrates skin easily)| |Tinosorb A2B|Titanium Dioxide (stable, but stability of coatings is still unknown, increases free radical production)| |Uvinal A Plus|Ensulizole (stable, but does have some risk of skin reactions and increase in free radicals)| |Mexoryl XL|Homosalate (stable, but penetrates skin easily and risk of skin reactions)| |Mexoryl SX|| |Uvinul T150|| |Uvasorb HEB|| |Zinc Oxide|| |Polysilicone-15|| |Octisalate (on it's own not very stable, but can easily be stabilized, no further concerns)|| &amp;#x200B; **Ingredients that can better be avoided:** |Ingredient|| |:-|:-| |Fragrance, linalool, limonene, etc|Common skin allergen and also irritant, no role in skincare| |Bergamot oil, citrus extracts, Eucalyptus oil, menthol|Can increase skin irritation and photosensitivity| |Methlyl(chloro)isothiazolione|Problematic preservative| |Oxybenzone|Increases free radicals, penetrates skin very easily, high change on skin irritation, unstable and not environment friendly| |Octinoxate (Ethylhexyl Methoxycinnamate)|increases free radicals, penetrates skin very easily, unstable and not environment friendly| |Enzacamene|penetrates skin easily and increases free radical production, not approved by FDA and Japan| |Padimate O|| |Isoamyl p-Methoxycinnamate (Amiloxate)|| |Olive oil|due to high oleic acid content can disrupt skin barrier| |Alcohol|When present in very high concentrations, can disrupt the skin barrier, concentrations &lt;5% shouldn't cause any problems| &amp;#x200B;<Odd_Manner>: What do you think of this sunscreen? Has octocrylene, Octyl salicylate, Avobenzone, Tinosorb M and S, and is fragrance free. White cast isn't notable. RoC Protect Recomforting High Tolerance Fluid :<http>://www.frenchcosmeticsforless.com/proddetail.php?prod=553579 <Ingredients>: Composition Formula INCI: Aqua, octocrylene, C12-15 alkyl benzoate, dimethicone, ethylhexyl salicycate, butyl methoxydibenzoylmethane, silica, butylene glycol, methyl methacrylate crosspolymer, bis-triazine Ethylhexyloxyphenol methoxhyphenyl, glycerin, styrene / acrylate copolymer, methylene bis-benzotriazolyl, tetramethylbutylphenol ( nano), Chrysanthemum parthenium flower extract, tocopheryl acetate, lecithin, propylene glycol, glycol caprylyl, linseed acid, PEG-100 stearate, PEG-8 laurate, decyl glucoside, potassium cetyl phosphate, sodium dodecylbenzenesulfonate, xanthan gum, acrylates copolymer, glyceryl stearate, sodium acrylates copolymer, cetearyl alcohol, dimethicone crosspolymer, disodium EDTA, caprylhydroxamic acid, phenoxyethanol. Formulated to minimize the risk of allergies. Developed specifically for sensitive skin. Hypoallergenic. Fragrance free. <Peter_789>: Yes it's good. I've been considering it as well, but was afraid that it still leaves a whitecast due to the Tinosorb M. <ggabrielpp>: It does leave horrible white cast. It is just unusable. And reading the ingredients, before i bought it, I had such high hopes for this sunscreen. It also streaks while I apply it and pills later. The only positive thing about it is that RoC Protect Recomforting High Tolerance Fluid is quite matte on my oily skin. <Odd_Manner>: I notice that if I put a light moisturizer on before it, it doesn't pill. What do you use for sunscreen?<ggabrielpp>: Maybe I used way too much then. Right now I am transitioning from Oriflame Sun Zone Face and Body Protector SPF 30 to Eucerin Oil Control SPF 50+, as I want higher spf than 30. <Odd_Manner>: How did you like the Oriflame sunscreen? Did it produce a white cast?<ggabrielpp>: I like it quite much actually. No white cast at all. It contains old and new (chemical) UV filters, including Tinosorb S. It should offer some descent UVA protection and is fragrance free. It also has *Aluminum Starch Octenylsuccinate* that helps with matte finish to some extent. However, it is still greasy for my oily skin, so I have to blot my face some 30 mins after the application. All in all, it is one of the best sunscreens I have used.<Odd_Manner>: Thank you", "num_messages": 9, "avg_score": 12.0}
{"start_date": "1543612077", "end_date": "1543629859", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": -6, "text": "<tteltraba>: [Acne] I was curious what SCA's opinion is on pimple popping estheticians / how their patients benefit from the treatment ~~Publicly ashamed to admit I've been watching these types of YT videos alot lately,~~ IMO avoiding picking/popping your skin is deemed as a word for the wiser but what's the explanation for patients undergoing procedures with needles and extractors coming back with great results? Most of the time; by the end of the session the areas worked on are incredibly irritated and bloody. To me it wouldn't seem much worse to walk around with the acne and allow it to subside instead. Anyhow, what are your thoughts? and has you been a subject to this and how did it turn out? ~~^(p.s. who is your favorite pimple popping youtuber??)~~ &amp;#x200B;<LeRemy>: I have no experience with this, just personal opinions. If it's that bad, that you are going to an esthetician to pop the pimples. Then you're better off beginning on accutane/spirolactone, because yea. You get rid of the pimples then and there, but doesn't do anything about why you get acne. Which accutane/spirolactone do, the acne is just going to come back otherwise.<amk933>: You get Accutane, you get Accutane, he gets Accutane, everyone gets Accutane! How lovely! Are you serious? Dermatologists do not treat every case of acne with Accutane for a good reason. First, your acne can return after Accutane. Second, Accutane has a plethora of side effects (from photosensitivity through endocrine problems to psychiatric issues) and contraindications (e.g. pregnancy). Third, you have so many topical alternatives like azelaic acid, clindamycin, BP, Rx retinoids, salicylic acid and more with a better safety profile that jumping straight to the A-bomb for acne makes no sense. Fourth, not all acne is the same - if hormones cause your skin problems, then balancing these will help you more with the root cause (and maybe turn your attention to other important underlying issues) than chugging Accutane. I am not saying do not ever use Accutane. However, recommending that everyone who has acne should undergo Accutane treatment is preposterous. Sure, use isotretinoin for the worst cases, but many others can benefit from alternative treatment options.<LeRemy>: I can't say I have bad acne, I still got it. Because I wanted. Doing research is good, but who are you to say that one shouldn't use accutane in mild cases? Like, \"Your acne isn't that bad, so you don't get accutane\" It sounds pretentious to me. Mental problems because of accutane, is because one already are predisposed of it. So if a person is getting depression of their acne, accutane often makes skin worse before it gets better. This will break an already depressed mind.<amk933>: Mental problems caused by Accutane because you are predisposed? LOL. You probably also get endocrine and cardiovascular problems while on Accutane and at 20 something years of age because you are predisposed as per that comical hypothesis. You can make whatever decisions you want for yourself, I do not care. As long as you harm no one, do as you wish. However, just as you have the right to say whatever you want (no matter how reckless as in this case), so do I have the right to call you out and share my own opinion (hoping that someone who does not really need Accutane will not decide to go down that route).<LeRemy>: Of course you can call me out, but this may be my personal opinion. You haven't done so in a nice way, but that's okay. It's not my problem, I'm just pointing it out. I can't say anything without proof. Btw, you don't get Accutane without doing anything first. If BP works for you as an example, great. I don't shame you for that.", "num_messages": 6, "avg_score": -1.0}
{"start_date": "1543552505", "end_date": "1543623539", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "[deleted]: [Routine Help] Similar product to La Prairie Skin Cavier Essence-in-Lotion? God, this product is... a godsend, essentially. And I have no idea what's in it that my skin loves so much, because I've never used anything like it before. All I know is... my skin right now looks the best it has in years. I don't use it as a \"pre-serum\" treatment the way it's advertised, I just use it before moisturizer. I've been getting compliments on my skin like crazy, which never happens. But, alas, it's... a million dollars. I mean, $255. But, same difference when you're living at the poverty line LOL! I've only been able to use it because my sister gave me a sample bottle of it. I'm just wondering if anyone knows of either a dupe, or something with any similar ingredients at all? It's kind of a semi-transparent liquid jelly, for lack of a better description, and it seems make my moisturizer seep in a lot better. &amp;#x200B; &gt; Caviar Water, Water (Aqua), Pro-Panediol, Dimethicone, Glycoproteins\\*, Panaz Ginseng Root Extract\\*, Equisetum Arvense Extract\\*, Caviar Extract, Lens Esculenta (Lentil) Seed Extract, Avena Sativa (Oat) Kernel Extract, Yeast Extract, Ergothioneine, Saccharide Isomerate, Saccharonmyces Cerevisiae Extract, Amodimethicone, Sodium Citrate, Disodium Edta, Acrylates / C10-30 Alkyl Acrylate Crosspolymer, Sodium Hydroxide, Citric Acis, Glycerin, Propylene Glycol, Sodium Salicylate, Lactobacillus Ferment, Pentylene Glycol, Polysorbate 80, Xanthan Gum, Dimethicone / Vinyl Dimethicone Crosspolymer, Carbomer, Fragrance (Parfum), Linalool, Benzyl Benzoate, Benzyl Salicylate, Phenoxythanol, Ethylhexylglycerin, Sodium Benzoate &amp;#x200B;<LikesGreenTea>: That product is a hydrating toner. The caviar water isn't really doing anything for your skin, it's just marketing hype. The powerhouse ingredients in that product are ferments (yeast, saccharomyces, lactobacillus). I think you would like Nature Republic Saccharomyces Ferment The First Essence. I also recommend looking these threads for product recs: [https://www.reddit.com/r/AsianBeauty/comments/9g81ln/discussion\\_your\\_favorite\\_product\\_with\\_fermented/](https://www.reddit.com/r/AsianBeauty/comments/9g81ln/discussion_your_favorite_product_with_fermented/) [https://www.reddit.com/r/AsianBeauty/comments/7v208x/discussion\\_your\\_favorite\\_high\\_percentage/](https://www.reddit.com/r/AsianBeauty/comments/7v208x/discussion_your_favorite_high_percentage/) [deleted]: Thank you so much! Yes, I had a feeling this was the case - \"caviar water\" just screams of marketing hype and buzzwords LOL. I didn't even identify those other ingredients as fermented other than the yeast, so thanks! I don't know much about individual skincare ingredients other than the ones I'm allergic to. That Nature Republic is sold out so I THINK I'm probably going to buy the Kiku Moist everyone seems to love :) Thanks again for the links!", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543616151", "end_date": "1543616875", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 3, "text": "[deleted]: [misc] CALLING ALL PEOPLE WITH BEARDED PARTNERS [deleted]<anime_niac>: Has he tried beard balm?<reabehs>: He has, various ones, doesn’t seem to make any difference but possibly as the hair is 90% grey so it’s mega coarse! <anime_niac>: How often does she shampoo his beard?", "num_messages": 4, "avg_score": 0.75}
{"start_date": "1544726804", "end_date": "1544728729", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 110, "text": "<ifthordiesthensodoi>: [Shelfie] Two years in the making! <ifthordiesthensodoi>: First off, sorry for the quality of the picture, you can almost see how much I did not want to be in it. I have dry skin that is prone to redness so my routine is all about hydrating and dewy skin! Morning routine Lancome Tonique Confort Re-Hydrating Comforting Toner with Acacai Honey Peter Thomas Roth Max Sheer All Day Moisture Defense Lotion SPF 30 Sunscreen Lotion Clinique Chubby Stick Moisturizing Lip Colour Balm Night routine CeraVe Hydrating Facial Cleanser Drunk Elephant T.L.C. Sukari Babyfacial (once a week) Lancome Tonique Confort Re-Hydrating Comforting Toner with Acacai Honey Estee Lauder Advanced Night Repair Synchronized Recovery Complex II Estee Lauder Advanced Night Repair Intensive Recovery Ampoules (once a week usually whenever I use Babyfacial) Estee Lauder Advanced Night Repair Eye Cream Synchronized Complex II/Clinique All About Eyes Rich Clinique Moisture Surge 72-Hour Auto-Replenishing Hydrator Clinique Moisture Surge Overnight Mask (once a week) Shelfie Peter Thomas Roth Anti-Aging Cleansing Gel I use this whenever I want a deeper cleanse or a lighter exfoliation, my skin always feels sooo smooth after I use this. Drunk Elephant T.L.C. Sukari Babyfacial Haven’t heard about this in a minute but I still love it. The twenty minutes you have to leave this on aren’t the best (there definitely is a tingling) but this has helped so much with my texture and dullness. Estee Lauder Advanced Night Repair Synchronized Recovery Complex II I could go on forever about this product but suffice to say that if I could only pick one skincare product, it would be this. It’s just so instantly hydrating. If I neglect my skin for too long (hello finals), it gets dry to the point where it’s painful putting on products so I’ll ease back into my routine by using this. And it gives you just the nicest glow. Estee Lauder Advanced Night Repair Intensive Recovery Ampoules Bought this solely based on how much I love the serum. I like it, and it’s certainly hydrating, but not nearly as much as the serum. At $115, I would definitely say that it’s not worth it. Estee Lauder Advanced Night Repair Eye Cream Synchronized Complex II Another product I bought because of how much I love the serum. It’s not bad but I don’t think it’s worth it, and it does make me eyes tingle a bit. Still in search of a good eye cream. Clinique Moisture Surge 72-Hour Auto-Replenishing Hydrator Another favorite of mine! I love, love this cream. It leaves my skin feeling so plump, dewy, and of course, moisturized. Even though I have dry skin, I use so many products that I don’t want a heavy moisturizer, so this gel cream is great. If you’re interested, the 0.5 oz is actually a better deal than the 1 oz. Peter Thomas Roth Max Sheer All Day Moisture Defense Lotion SPF 30 Sunscreen Lotion I don’t think I’ll ever run out of this sunscreen because it is in absolutely every Sephora Sun Safety Kit ever. Not sure what to say about a sunscreen except that I never burn and this is usually moisturizing enough without another moisturizer underneath. philosophy Ultimate Miracle Worker Multi-Rejuvenating Cream SPF 30 Another find from the Sun Safety Kit. I hate how small this is because I love, love how it feels, so velvety. I’m debating on buying a full size of this whenever philosophy has a gift with purchase even though I have a lot of sunscreen to go through, that’s how much I love this. AMOREPACIFIC Resort Collection Sun Protection Mist Let me start off by saying that I know that a mist is no replacement for a sunscreen but I do like using this to reapply sun protection if I can’t use my hands Clinique Chubby Stick Moisturizing Lip Colour Balm Not especially moisturizing but nice if you want a tint of color. Clarins Double Serum Complete Age Control Concentrate All the Clarins products are new so I can’t really say but will definitely give updates if anyone would like me to. Clarins Multi Active Day Cream Clarins Multi-Active Night Cream Clarins SOS Comfort Nourishing Balm Mask First Aid Beauty Facial Radiance Pads I only use Babyfacial once a week so I wanted something that I could use the rest of the week. I think this is great daily exfoliator that helps with texture and brightening. You definitely have to use this regularly to notice the results but when you do, your skin will look sooo much better. Caudalie Hand and Nail Cream Moisturizing but no better than the Aveeno lotion I use for my hands. Clinique Moisture Surge Overnight Mask From the same line as the moisturizer I love, this is another product I like, but isn’t absolutely necessary. Like the moisturizer, it leaves skin feeling plump and dewy, but I prefer the moisturizer’s gel texture. Clinique Moisture Surge Face Spray Can’t be 100% sure that it’s this product because I’ve only used it a few times but whenever I do, my face tends to tingle. First Aid Beauty Ultra Repair Hydrating Serum This is a great serum for hydrating and plumping but I love the Estee Lauder one so much that I rarely ever reach for this. Clinique All About Eyes Rich Moisturizing, but I don’t think it really does much for brightening like it claims it does. Kiehl’s Since 1851 Glow Formula Skin Hydrator Leaves skin looking super dewy, but I wouldn’t say it’s really all that moisturizing. First Aid Beauty Ultra Repair Cream Intense Hydration I know this is a favorite of so many people but since I love gel creams, I hardly ever use this. Because they say that this can relieve dry patches due to eczema, I expected it to do more for my dry hands. Maybe I set the bar too high but it does help with my hands, I just need to use it more regularly! CeraVe Hydrating Facial Cleanser (not pictured) A classic. This is a gentle cleanser which doesn’t leave my skin feeling tight and uncomfortable after I use it. I don’t really wear makeup so I can’t say for myself but I have heard that you need to double cleanse if you use this. Lancome Tonique Confort Re-Hydrating Comforting Toner with Acacai Honey (not pictured) I keep seeing that you don’t really need to use a toner but this is a step I almost never skip. This has such a nice, soothing effect whenever I put this on. And my face tends to heat up a lot (not sure if it’s a skin or anxiety thing) but this helps cool it down.<Hello_are_you_ufo>: I love, love, love this! I have naturally red, dry skin and theres some good ideas for products in there! I hope in two years I have my act together like you! <221bekind>: That is so sweet of you to say! I think what has most helped my redness is regularly using moisturizer so definitely try to do that!<Hello_are_you_ufo>: Oh yeah definitely! I have an under makeup morning moisturizer and a heavier night moisturizer, but I'm still trying to use them daily.", "num_messages": 5, "avg_score": 22.0}
{"start_date": "1543615532", "end_date": "1543629414", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 5, "text": "<vinyamar07>: Will my Vitamin C go off when travelling? [product question] Hi all! I use C-Firma and have a trip coming up on the 20th of December. I'm flying from NZ to Canada, so a long haul flight. I considered buying the travel sized vit-c and b-hydra to take with me, but then my full size vit c will sit in my fridge in NZ for about 3-4 weeks and will just continue oxidising while I'm away. So it seems a waste to leave it. However, since it's normally in the fridge, will the 30 hour journey also ruin it? I know it seems silly to ask - but it's quite expensive, so I want to do whatever I can to ensure it keeps it longevity. Thanks!<schneiderct>: I'm sorry i cant get passed the fact that you're leaving NZ for CANADA?!?!? What the heck would you ever do that for, leaving in NZ is like my dream<vinyamar07>: Haha it was my dream too :p I’m from Canada, but I’ve been living here for 6 years. I’m just going home to Canada for Christmas!!!", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544715874", "end_date": "1545124465", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 1979, "text": "<clocktopustheoctopus>: [Haul] Helped out at my local Salvation Army yesterday, and received 10 SNP Animal Tiger Wrinkle Masks as a thank you! <Lovinglifting123>: Hi! You seem like a lovely person, and I don’t think you’d purposely volunteer for a shitty organization. Unfortunately, Salvation Army has a testy at best relationship with the LGBTQ community. Here’s a link on it: https://www.google.com/amp/s/m.huffpost.com/us/entry/4422938/amp<shewasallthat>: Where on the application or in dealing with them does one have to disclose their sexuality? <Edit>: Yes, please keep downvoting a reasonable question because your sensitivities control you. 🙄<TastyMagic>: They probably want to know why you're homeless esp if you're under 18.<shewasallthat>: Yeah, I'm familiar with them and I'm sure they will. That doesn't mean you have to disclose those exact details, js. <neutralpunches>: Sometimes it can be pretty obvious (e.g. someone who is gender non-conforming).<Tutiloo>: Gender non conformity has ziltch to do with LGBT. <betteroffinbed>: ??? For a start, the T in LGBT stands for transgender...<Tutiloo>: Being gender non conforming doesn't equal being trans. Patti Smith, GNC long before it was trendy yet all woman. Feminine and masculine are just sex role stereotypes pushed onto us, its entirely fine to be a masculine woman or a feminine man and not be trans. Actually it's pretty important not to appropriate the experience of those who struggle with gender dysphoria by suggesting that GNC is the same thing. GNC is just not buying into girls like Barbie's and boys can't cry shit that gets shoved down our throats. Sex role stereotypes for women and girls includes being passive and unassertive and accepting men's superiority and entitlement to our bodies, I've yet to meet a woman who identify's with that, so I've yet to meet a woman who isn't GNC, and most women I know aren't trans.<plo83>: Long before it was trendy? People's gender dysphoria is a trend to you? What a sicko! Violence against trans people and gender non-conforming folks is at an all-time high. Let's call it a trend so people feel like these individuals are making a choice and reinforce negative stereotypes!<Tutiloo>: Being gnc has nothing to do with being trans, stop appropriating the experience of people struggling with gender dysphoria. Being gnc is a completely different thing that is absolutely a choice, it's Nicky Wire choosing to wear a skirt on stage even though he is 100% ok with being a man, Patti Smith choosing a more masculine look even though she's every bit a woman, or every person out there who makes the choice to step away from sex role stereotypes, and plenty of those people are not LGBT+ . Suffering with gender dysphoria is completely different from choosing to be GNC and the violent and ugly thing would be to appropriate the experience of those suffering with it. <plo83>: So you think that trans people are gender conforming? lol Also, we do not say ''suffering with gender dysphoria''. You're talking like it's a plague. A person can suffer due to the feelings they are experiencing because of the gender dysphoria. They can suffer due to the confusion it may cause. They suffer before their feelings are acknowledged. They suffer because people are ignorant. Educate yourself instead of bullying people online.", "num_messages": 12, "avg_score": 164.9166666667}
{"start_date": "1544740684", "end_date": "1544760081", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 12, "text": "<catherinekatern>: [Acne] PLEASE help me. At my wits end. Hi everyone. I recently have been getting all of these little bumps everywhere. They are very visible in the correct lighting, but face on they don’t look as bad. I have been dealing with these for months and I’m getting very depressed. (PHOTOS BELOW) I was a long time PC 2% BHA user and stopped about two months ago because I felt I was over exfoliating. So I gave my skin about a week break of just cleansing and moisturizing. Fast forward, it didn’t help. Should I start using the BHA again? Differin? Please any help is appreciated! Current routine: AM&amp;PM: cleanse with A.N.D. Balancing bar, moisturize with A.N.D. Hydrotant gel (recently trying CeraVe PM because I feel I need more moisture. Only used this one night so far. <Photos>: https://imgur.com/a/FRV2io5 May be worth mentioning: I try to limit diary and sugar intake. I consume no gluten/wheat due to an allergy and I take a probiotic daily. <cammmm->: i had these bumps on my forehead awhile ago and they drive me nuts so i feel your pain. i think mine were a combination of fungal and bacterial acne. i used nizoral shampoo as a mask for 5-10 mins and they improved a lot. i also started using my friends clindamycin phosphate pledgets which you have to get from a dermatologist and now my forehead is completely smooth. i would start with a fungal acne safe routine first and try the nizoral and see if it helps to rule out fungal acne. look up simpleskincarescience on google. his product suggestions for fungal acne and acne in general are very helpful. hope this helps!<catherinekatern>: Thank you so much! I’ll definitely look into that. I have been suspecting fungal for a while but I take a daily probiotic so I feel like that should protect against that but who knows! Skin is crazy. Thanks for the website, it looks super informative !<CousyCousy>: Came here just to say it looks fungal! I was dealing with bumps all over my forehead for monthssss and could not figure it out ( I also take probiotics and eat pretty clean, but I guess stripping by moisture barrier really messed with my forehead). I alternated Ketoconazole wipes (sold for pets but hey, it works) &amp; Lotrimin for a week and they COMPLETELY went away. Have been doing a fungal safe routine as well, and things are staying clear fingers freakin' crossed.<catherinekatern>: Thank you for this! I’m pretty sure my moisture barrier was damaged as well and it went haywire like you talked about. Did you have them on your forehead only?? <CousyCousy>: Yup, only on my forehead! It was the strangest, but also makes sense because that was the area I hit hardest with chemical exfoliants and thus the most stripped part of my face. I also went through a very very stressful few months, which I think can trigger fungal infections as well. In terms of products, I think the the Lotrimin Ultra has been crucial because it not only has the antifungal ingredient (butenafine) cream so more moisturizing than the wipes. I only used the Ketoconazole wipes for the first little bit to help really attack it, but the Lotrimin has been what I use every few nights since then to maintain a clear forehead. Hoping I'll be able to phase it out completely soon as I introduce a Curology script with Zinc in it (which also helps fungal acne). Phew. That was a lot. But I've learned SO MUCH dealing with this, happy to share anything I know!<catherinekatern>: Thank you so much, seriously I appreciate it. I have bumps on my cheeks as well but they are nothing like the ones on my forehead. I actually got a chemical peel a couple weeks ago and it didn’t show as much improvement as it should have, which I’m guessing is a sign of fungal acne (maybe, right?) Would you mind sharing your current routine with me?<CousyCousy>: PM -bioderma micellar water to remove makeup -vanicream cleanser -amara organics aloe vera gel -cerave baby moisturizing cream -sometimes I mix a few drops of tea tree oil or biossance squalane oil or both (changes based on how my skin is doing) -lotrimin ultra just on forehead (will go light on moisturizer there if using) <AM>: -in the AM I skip micellar water and sometimes even the vanicream -amara organics aloe vera gel -cerave baby cream -Alastin HydraTint SPF (not fully fungal safe but I love it too much to let it go) -If needed, Bare minerals powder Additional Thangs! -spot treat with de la cruz sulfur ointment for 10 ish min -currently trying to incorporate curology zinc/azelaic acid/tret but unsure how I feel about it yet comparison of my forehead, a few weeks apart: [fungal acne comparison ](https://imgur.com/gallery/K7dsZ0s) <catherinekatern>: Wow it looks amazing! Thank you so much for sharing this with me. (:", "num_messages": 9, "avg_score": 1.3333333333}
{"start_date": "1543595115", "end_date": "1543711949", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 2125, "text": "<ozzyboiii>: [B&amp;A] what 6 months of healthy eating and regular exfoliating did for me <ozzyboiii>: I’m really not doing anything fancy. I exfoliate with a towel every other day and just use some aveeno active naturals 24hr moisturizer after, after I shower in the morning and before bed. I avoid dairy like the plague. I took accutane like 5 years ago but that still left me with all those scars, I doubt it had any effect recently though. VERY rarely I’d use a [charcoal mask](https://www.amazon.com/dp/B06Y2BMSZZ?ref=yo_pop_ma_swf), but I’m talking like once every few months. I think it was just the healthy eating that helped me out. <Edit>: spelling<Frankobanko>: Do you feel like avoiding dairy helped? I'm ready to give it up finally but struggle with my love of cheese. What about butter?<NiceOnesie>: Not OP, but my skin hates milk and ice cream but I have no issues with cheese. I wonder if it’s related to the reduction in lactose through culturing. YMMV but thought I’d point it out for a fellow cheese enthusiast :) <FPS_Russia>: Just thought I'd chime in here to touch on what you said about lower lactose content in cheese (you're absolutely right about the decrease in lactose). So lactose is a type of sugar, which is digested by the lactase enzyme. Everyone reduces their production of lactase as they age (it's medically referred to as a primary lactose intolerance), which is why kids can drink heaps of milk, but adults cannot. Now lets talk about cheese :). So cheese has a rather low sugar content (and butter has virtually no sugar). Given that lactose is a sugar, that means that cheese has a much lower lactose content than milk and ice cream. Further, lactose intolerance is not an allergy, and thus typically a low quantity of lactose can be digested with ease, however we become intolerant to larger quantities. Ultimately, the low volume of lactose in cheese doesn't overwhelm your enzyme production, so no problems occur but milk will deplete your enzymes quite quickly. <Note>: this is regarding lactose intolerance, I'm not entirely sure if this is responsible for the effect of cheese on skin, but it's probable. Hope this helps!!<NiceOnesie>: That makes a lot of sense, thank you so much for the explanation :)<FPS_Russia>: No worries!! :) :)", "num_messages": 7, "avg_score": 303.5714285714}
{"start_date": "1543614441", "end_date": "1543623687", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 9, "text": "<SoberLucilleBluth>: [Routine help] Best fragrance-free cleansing oil for sensitive, acne-prone skin? Hi all, I've just started Differin for hormonal acne (mostly on the chin) and fine lines, so I want to simplify my routine. I want to get rid of the first cleanse with micellar water on a cotton pad and use an oil cleanser to break down makeup and sunscreen before going in with my regular non-foaming cleanser. I've heard great things about Clinique's TTDOB and Hada Labo's cleansing oil. Which do you prefer? It'd be followed with hyaluronic serum on damp skin and Cerave moisturizer (the one in the tub). <Pantone877>: I have the Clinique balm and have been using it for many years now. It’s so very gentle. I use a quarter sized amount to masaage my face with and then rinse off. I don’t feel the need for a double cleanse, but YMMV.<schneiderct>: Agree, I switched from the balm to some neutrogena wipes for like 2 weeks because I was feeling too lazy to use the balm and my skin hated me for it. I've been using the balm for about 2 years now and it's a holy grail!", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1543609081", "end_date": "1543683598", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 635, "text": "<yodelinggirl>: [HUMOR] WHY IS THIS ME!? <Casua11yCrue1>: I turned into a skincare and makeup hoarder by the age of 20 and it's been such a struggle trying to catch myself before it gets out of hand.<UnfairBookkeeper>: How do you know if the stashed products haven't gone bad? Some of them don't have an expiry date, and I found that sometimes they sell products that will expire in a few months, so what do you do about that?<Casua11yCrue1>: I try to use them quickly but I sometimes will notice somethings too old and should be thrown out <UnfairBookkeeper>: And what would you consider too old? just asking bc I have a stash too and the other day I realized some had no expiry date and it hit me it's probably a mistake to stash up products like that. Most if not all of the stuff will be ok for years, the problem is how to tell.<Casua11yCrue1>: It can be hard! Sometimes I will google how long a certain products shelf life is, otherwise if I know it’s been open and exposed to air for like 2 years it’s probably time to toss it.<UnfairBookkeeper>: Haha damn but sometimes they send products that are within a few months of expiring, so if there's no expiry date on one, how do I know it's not one of those? I don't want to waste time using a product and expecting results and not get them because it was expired, or even get bad effects. Anyway, I made a post about this on the daily help thread that you may be interested in too :) feel free to check it out: [https://www.reddit.com/r/SkincareAddiction/comments/a206x8/new\\_or\\_need\\_help\\_ask\\_here\\_sca\\_daily\\_help\\_thread/eav0uk8](https://www.reddit.com/r/SkincareAddiction/comments/a206x8/new_or_need_help_ask_here_sca_daily_help_thread/eav0uk8)", "num_messages": 7, "avg_score": 90.7142857143}
{"start_date": "1544753247", "end_date": "1544812155", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 38, "text": "[deleted]: I feel fucking disgusted when I look at myself. [personal] [deleted]<thequietsandwich>: i see you’ve been on everything except accutane, go back to your derm and tell them to put you on it, i’ve been 100% acne free for the last 6 months because of it, including my back. the shit is magical. shit sucks sometimes, message me if you want someone to talk to.<SplyceyBoi>: The only problem is that OP seems to have big self esteem problems, and accutane sometimes has detrimental​ effects on mental health. I would recommend OP see a therapist in conjunction with accutane, if they decide to go down that route.", "num_messages": 3, "avg_score": 12.6666666667}
{"start_date": "1544757271", "end_date": "1544760808", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 14, "text": "<gkrhdvc>: [Skin Concerns] [Pore Help] Tried new cream, tiny bumps all over face <saucylackey>: I would go back to your old routine and see if the bumps go away on their own. Often they do. I wouldn’t recommend adding anything new into your routine for a while. And if things start to get worse (unlikely in my opinion, but always good to be prepared) see a derm. And patch test next time!!<gkrhdvc>: Thank you!! How to patch test/is there a link for how to patch test?<saucylackey>: Sure thing! There are a couple of different ways to patch test. Here’s what I recommend: Day 1: Apply a bit of the product behind your ear, and leave it on throughout the day. This will test for an allergic reaction. If you don’t have any response to it, you’re good to move on to testing it on your face. Days 2–7: Decide on a small patch of skin (no bigger than a coin) on your face where you want to test the product, and apply a bit of the product to that area every day for a week. I recommend an area like your forehead or cheek, where you’re likely to have a reaction. In your case, if you had patch tested that cream, you would have noticed a bunch of little bumps developing on that patch of skin and known to stop using the product. That’s really the whole point of patch testing. It just prevents you from having a reaction all over your face. It’s a lot easier to clear things up when they only happen on a small patch of skin.<gkrhdvc>: 😍😍😍 thank you so much!! :D :D<saucylackey>: You’re so welcome! I think your skin will clear up quickly once you go back to your old routine. But if it doesn’t, don’t stress about it. A derm will be able to get you sorted out. And don’t hesitate to reach out in the future if you have any more q’s.", "num_messages": 6, "avg_score": 2.3333333333}
{"start_date": "1543623339", "end_date": "1543624333", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 45, "text": "<Jada241>: [B&amp;A] My skin after about 1 month of using my new and improved skin care routine consistently! [deleted]: You look great, well done!<Jada241>: Thank you so much! I really appreciate that. :)", "num_messages": 3, "avg_score": 15.0}
{"start_date": "1543543659", "end_date": "1543623862", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 12, "text": "<--lily-->: [Routine Help] Lactic and glycolic acids or just one? So i've got two problem areas I'm working on. I've got minor keratosis pilaris on my arms and chest, and my face is always kinda red and bumpy. I've been using lac-hydrin on my arms and that's working well, but my order from the ordinary just showed up today, with their 10% lactic and the glycolic toner. So should I be using one or both, on my arms and my face? And would I be better off with TO's lactic acid stuff or lac-hydrin on my arms? Thanks!<Oh_My_Sagan>: i tried TO’s lactic acid on my right leg for over two weeks and compared to the left leg, there was initial improvement of KP right after application but no long term benefits that i could see. i switched to Amlactin lotion and oh boy, i can see a difference! i also added dry brushing into my routine before i apply the lotion and it’s working wonders!!!! assuming your lotion is similar to the Amlactin i’m using, adding TO lactic acid serum on your body would probably be overkill and you should keep that just on your face.<--lily-->: So hey how exactly did you apply to's lactic? Drop some on your skin and spread around? I've been using a cotton pad but I'm not sure that's the best way But yea the lotion is definitely the best for me. Difference from one application for my kp<Oh_My_Sagan>: yep! just with my fingers. and to be exact it was The Ordinary’s Lactic Acid 5% + HA. i would apply on the same patch of my thigh every day and i just wasn’t noticing a difference. but i’m gonna keep using the lotion instead; it’s cheaper in the long run, there’s more of it to cover more surface area, and i can notice a difference in texture and softness. maybe i’ll try the lactic acid serum on my face, we’ll see.", "num_messages": 4, "avg_score": 3.0}
{"start_date": "1543623511", "end_date": "1543624706", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "<--lily-->: [Routine Help] Should I use vit c silicone cream before or after moisturizer? It's TO's vitamin c 30% silicone suspension cream and cetaphil moisturizer. Am I correct in assuming the silicone should go on second since the moisturizer won't penetrate it? [deleted]: I apply Sun cream first which I also use a moisturiser (la Roche Posay Anthelios) and TO Vitamin C 30% after that. That's the advice I've seen on here due to the silicon.<--lily-->: so silicone last, thanks! [deleted]: Yeah. I find it great actually because with the silicone, it also doubles as a primer and helps foundation last longer so it's multi- beneficial!<--lily-->: oh cool awesome, I've been using it at night but maybe I'll try it out for the morning instead", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1544759277", "end_date": "1544771167", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7, "text": "<-Saraphina->: [Routine Help] Stubborn blackheads on nose that won't go So I have little blackheads pretty much all over my nose that just won't budge. My nose genuinely looks like a freaking strawberry and they just never go away. I've been using Differin for 2 years and while it keeps my acne pretty in check, I feel like it's done absolutely nothing for my blackheads. This is confusing to me because I keep reading that Differin is good for blackheads. I've also tried physical exfoliation, plain old squeezing, a blackhead extraction kit and even the dreaded pore strips. The latter 3 somewhat worked temporarily but led to me causing more harm than good and now I have some permanent little thread veins as a reminder. :( **Current routine:** **AM:** *Wash face with Cerave hydrating cleanser using a silicone face cleansing pad *Apply 99% aloe vera gel *Moisturise with Cerave PM *Apply Biore watery essence sunscreen **PM:** *Use micellar water to remove make-up *Wash face with Cerave hydrating cleanser using a silicone face cleansing pad *Apply 99% aloe vera gel *Apply Differin 0.1% cream *Moisturise with Cerave PM And ocasionally I'll use the Angels on Bare Skin cleanser and Mask of Magnaminty from Lush. I can't really tell if the Lush products are even doing anything though. I've been looking into adding a BHA or AHA but I honestly have no idea what I'm doing and if they're even okay to use with Differin or not, because I've been looking and there's some pretty conflicting info online. So any advice would be greatly appreciated!<LikesGreenTea>: I think you'll find this thread to be helpful: [https://www.reddit.com/r/SkincareAddiction/comments/9oh0vd/skin\\_concerns\\_please\\_help\\_with\\_these\\_pores\\_im/](https://www.reddit.com/r/SkincareAddiction/comments/9oh0vd/skin_concerns_please_help_with_these_pores_im/)<-Saraphina->: That's pretty helpful, thanks! :) I've just been avoiding oils since I was scared they'd just be greasy and break me out, but I definitely want to give that method a try. I'm still not sure whether a BHA is okay to use with Differin though.<LikesGreenTea>: The blackheads are just on your nose, right? So don't use Differin on your nose, just use BHA.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543509799", "end_date": "1543623918", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 9, "text": "<calm-down-okay>: [routine help] what are your silicone-free hg products? I'm currently in the process of trying to get rid of silicones in all of my skin and hair products. I've already seen great results in my hair but am having trouble finding skin care products. Mostly I'm trying to move away from CeraVe because most of their products have dimethicone (not to mention all the parabens!) Skin type: combination/dehydrated Skin concerns: the Stridex and benzoyl treatment have really saved my life as far as acne goes, thanks you guys! What I'm looking for now is how to prevent dry patches and make my pores not so massive. Also need a good product to reduce shine. Current routine <AM>: ✔️ CeraVe hydrating micellar water (silicone-free) ✔️ Milk makeup watermelon brightening serum (for eye area, silicone-free) ❌ CeraVe AM lotion (contains dimethicone) ❌ Neutrogena Shine Control Powder (only when I go out and want to look nice, always end up with dry patches at the end of the day. dimethicone, dimethicone/vinyl crosspolymer) <PM>: ✔️ Stridex Maximum, Salicylic Acid 2% (leave on for 10 minutes, too long and I get irritated) ✔️ Aveeno Ultra Calming Hydrating Gel Cleanser (silicone-free) ✔️ Milk makeup watermelon brightening serum (for eye area, silicone-free) ❌ CeraVe PM Lotion (dimethicone) ✔️ Neutrogena On-the-Spot acne treatment, Benzoyl Peroxide 2.5% (applied to trouble areas, silicone-free)<calm-down-okay>: Btw I use [this](http://isitcg.herokuapp.com) to paste ingredient lists in to find silicones and other baddies. It's for hair but I wish someone would make one for skin care.<datglotho>: There are multiple websites like that for skincare: [cosdna](http://cosdna.com/), [incidecoder](https://incidecoder.com/) and [skincarisma](https://www.skincarisma.com/) - the last one is my personal favourite because it's very user-friendly and you can save ingredients that are problematic (or beneficial) for you, so it flags them when you look at a product. <calm-down-okay>: Thank you!", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1543972431", "end_date": "1544759960", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 33, "text": "<madmita>: [product question] what are some safe products for acne and acne prone skin when pregnant? Or an entire skin care routine? For instance, salicylic acid and benzoyl peroxide are a strict no no, but what can be safe and effective substitutes? Which sunscreen? fash wash? Serums? Masks? Not for me right now (not pregnant), but for a friend. <Edit>: agreed that asking a doctor is best. I was hoping to gift some skin care goodies to my friend, this the post! :) <liverpoolish>: Azelaic Acid is safe!<humblebumble99>: Second this. It's also probably best if your friend goes to a doctor to confirm and make sure she checks any labels since some will specifically say that they are not meant for pregnant or lactating women. My guess is most moisturizers, serums, masks, etc. are probably fine but again, ask a doctor to confirm.<whippetshuffle>: Third this. Am pregnant. Lactic Acid is fine according to my midwife, as is niacinamide, so I am waiting for those to come in the mail. Azelaic Acid is fine and melazepam is cheap but not enough for my already acne-prone skin. Retinol is a huge no no but your friend likely knows this already. <madmita>: Congratulations! And thank you for the reply. I forgot to add, I'm thinking of buying my friend some nice skincare products for the holidays, that's why I posted the question! Would you say TO niacinamide + zinc is fine? I'll read up on the ingredients and check too. <whippetshuffle>: Yes- I personally use that exact product.", "num_messages": 6, "avg_score": 5.5}
{"start_date": "1543560034", "end_date": "1543631380", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "<baguspr>: [Routine Help] Differin or tret? So, I’m 17 and I have a ton of CCs everywhere, like it’s covering my face. I’ve tried BHA and AHA but nothing seems to be working. I’m thinking about trying differin or tret. Which one is better for CCs? Have you tried it?<rbartilet>: Transitioned from differin to tret since I found that while differin helped with active acne, it was slightly ineffective with dealing with stubborn ccs on my chin and jaw. Currently on week two of tret use (0.025%), my ccs are clearing away, although I’m suffering from the symptoms associated with introducing a new retinol into my routine (but overall, I’m glad I transitioned). <baguspr>: okay, do you use it every night or how often do you apply it? do you use the cream type or gel?<rbartilet>: I use biacna? (clindamycin and tret), which I believe is the canadian version of Ziana. It's a watery gel consistency, and my skin absorbs it fast so I have no problems layering my routine over it. I've been using it every other night, although I might only use it twice a week since my skin has been feeling inflamed with dry patches everywhere.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1544720552", "end_date": "1544766244", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 315, "text": "<phoenixchimera>: [PSA] Deceim to Relaunch at Sephora <sapphocating>: This gives me great hope &amp; great sadness, because this leads me to believe they will up their prices in the future &amp; the only thing I purchase TO for is cheapness &amp; short ingredients lists<PootMcGroot>: They just released their cheapest ever product two weeks ago - I wouldn't panic about that just yet.<sapphocating>: Except they can opt to raise their prices at any time once they're on shelves :( they could easily double their prices on high demand products, even if that's only true @ Sephora, it takes away any pro for them being there <PootMcGroot>: I don't think Sephora sells above the recommended price on other products, do they?<sapphocating>: But what IS the recommended price? I imagine TO is seeking Sephora to broaden their customer base &amp; make more $ in general, which is almost always synonymous with price hiking. CosRX &amp; CeraVe are several $ more at Ulta than Walmart for same products, for example. TO's ridiculous price is almost 100% the appeal for me, so if it's say $5 more for the same product, that might be enough of a difference that I buy off Amazon or another similar product that's more cosmetically elegant <Edit>: added more info to make more sense", "num_messages": 6, "avg_score": 52.5}
{"start_date": "1543573938", "end_date": "1543621638", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7897, "text": "<LazerTRex>: [Humour] Sleeping in your makeup isn’t healthy <Ailidh0309>: I remember a beauty therapist I went to years ago going on and on about how much she drank and about all the drugs she took at the weekend (we were quite friendly outside of her work as well so she could drop the professionalism with me), and then she said 'But...even if I'm on a serious comedown at 6 am after being up for almost 24 hours I still remove my make up before I go to bed. Not taking it off is the worst thing you can do.' <EDIT>: (side note) she also didn't eat on the days she was going out drinking so she could 'be a lightweight' and save money and calories, and she stayed up all night watching crime documentaries on TV and used to complain about how grey her skin was and the dark circles under her eyes. She blamed her genes. <viriiu>: And you kept going to her?<Ailidh0309>: She was surprisingly good at her job, and very punctual and friendly and a real perfectionist. Plus she used to give me a lot of good advice (which she had long lost interest in putting in to practice herself) about nutrition, skin care, keeping my hair looking good etc. She actually really cared about her clients and loved her job, she just didn't care about herself. I was about 18 or 19 when I went to her, and then I moved and started going to a very sterile, upmarket place where they kept missing patches of hair during waxing, my manicure only lasted a few days before chipping, and they were rude to me. <viriiu>: Aaaa she was like \"the bad haired Hair dresser\"! Well, not quite. But the morals the same, she may not take care of herself, but she does take good care of others. (\" in a town where there's only two hairdressers, one who looks terrible, and one who looks amazing, who should you let take care of your hair? Answer: the one with the horrible hair cut, as they have to cut each other's hair.\") <HydrationSeeker>: I love this.... my sorely missed hairdresser with her shaved her head! No2 all over. When she moved back to her home town, I grew locs. 🤣 <Edit>: words<jacquelynjoy>: I had the MOST amazing hairdresser in college and she shaved her head too!", "num_messages": 7, "avg_score": 1128.1428571429}
{"start_date": "1544710549", "end_date": "1544736881", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 18, "text": "<bakijmj>: [Routine Help] Small bumps along my jawline <bakijmj>: In the past month these small bumps have crept up along my jawline solely. They are NOT itchy at all. Also in the past month I’ve spent in Japan and New York whereas I live in a hot and humid climate in the Caribbean. I also changed up my routine a bit while away. I generally have very oily skin, not dehydrated. Acne prone and sensitive. <AM>: Fresh Soy Face Cleanser Hada Labo Gokujyun Lotion EltaMD UV Clear Sunscreen <PM>: DHC Oil Cleanser Fresh Soy Face Cleanser Hada Labo Gokujyun Lotion Everything was new in my routine besides the sunscreen. I’m not sure if this may be fungal acne, but what would have caused this all of a sudden? I’m not sure if it’s the Face Cleanser? I don’t think it’s the hada Labo though. Please help! <LikesGreenTea>: Lower cheek acne is usually hormonal acne, which can be caused by a variety of factors such as environment, stress, etc. My first suggestion is to go to a doctor. If that's not an option, do you have access to OTC retinoids (such as Differin) in the Caribbean?<bakijmj>: I have something called deriva-c which is just like differin but it also has an antibiotic in it<LikesGreenTea>: Have you tried using it on your new breakouts?<bakijmj>: I haven’t cus I want to see if I can soothe my skin without having to rely on prescription products", "num_messages": 6, "avg_score": 3.0}
{"start_date": "1543607551", "end_date": "1543615495", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 105, "text": "<girlbones25>: [Personal] You are doing me a sad, Sephora! Let me count the ways in which Sephora has disappointed me this year: 1. You get $15 off of a $75 spend this year instead of $50 last year. 2. You only get two free samples now instead of the three like it's been since inception. 3. Your status and points expire faster now than in the past. 4. They don't give any free shipping codes at the check out counter when they used to do this. 5. Changed their return policy to be more strict (I get it, some people were abusing it.) 6. Spending thresholds for GWP keep getting higher, e.g. $45 in the past and now $90. In conclusion, I think they're getting too greedy. I understand that companies have to keep profits at a certain level but don't try to make that solely off the back of your customers when innovation and offering something that is uniquely valuable was the reason you did so well in the beginning. \\[End rant.\\] By the way, I welcome alternate points of view. If you love Sephora, change my mind! :) &amp;#x200B;<lukibunny>: whats their return policy now? i totally have something to return. i got this tatcha bento box and the cardboard is ripped inside =/ I can't gift that out sephora -.-! &amp;#x200B;<girlbones25>: &gt;It changed as of June 2, 2018. For returns in-store and by mail, you have up to 60 days to get a full refund in the form you paid, within 61-90 days, you get store credit. After 90 days it's permanently yours! Here's the policy [link](https://www.sephora.com/returns-exchanges) if you want to read it.<lukibunny>: Ahh well i usuaully know by the first week if i wanna return something so 60 days is more than reasonable... i mean some stores are like 30 days.. <girlbones25>: I agree that 60 days is twice as long as most stores but it is still a decrease in a benefit. One of the reasons I liked the longer return policy was if I bought an item, forgot about it, never used it, and decided I liked something else more that I purchased more recently. I did that once with an overpriced eye cream.<lukibunny>: can always bring it back and say you got it as a gift and there is no receipt. If it's brand new, they will probably give you a store credit and take it back. No loss to them and no loss to you. <girlbones25>: Nope, you can't do that anymore under the new return policy! \"If you are returning a Sephora gift that you received by mail and do not want the refund to go to the purchaser, before mailing the return please call 1-877-SEPHORA (1-877-737-4672) to set-up the gift return under your account.\" All other returns require a receipt or a gift-receipt!<lukibunny>: oh that sucks!<girlbones25>: Indeed! I should add that from reading the return policy it seems like \"all other returns require a receipt or a gift-receipt!\" but that part was my quote, not to confuse the quote from Sephora's actual policy. I wonder though if in-store reps would be more likely to process a return without receipt, especially during the holidays.", "num_messages": 9, "avg_score": 11.6666666667}
{"start_date": "1539330522", "end_date": "1539368507", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 2522, "text": "<qwerty0521>: [Selfie] [B&amp;A] [Acne] I can’t believe the improvement of my acne scars after just one laser treatment <Hitlers_Big_Cock>: I know this is an acne thread, but your eyes seem whiter and healthier aswell<qwerty0521>: that’s because i’m looking in different directions. as a long term contact lens wearer my eyes are always like this<Covered_1n_Bees>: Another contact lens wearer - if your eyes are always like that, they’re probably dry and starved for oxygen. My eye doc got on me about the same thing, because I was wearing the one month contacts you can sleep in. Using artificial tears every day and cleaning the contacts overnight once a week has really helped. <alexsaurrr>: Also be very careful if you sleep in your contacts, even if they are meant to be slept in. I ended up with an eye ulcer from my contact cutting the surface of my eye, then the proteins built up in the cut. My eye felt completely normal until one morning I couldn’t even open it without insane pain and light sensitivity. Always keep your contacts hydrated and clean! <qwerty0521>: i actually wear a special type of contact lens that is only to be worn when sleeping <alexsaurrr>: Which is fine! Just know that contacts are still a piece of plastic that sits on your eyeball. When you are sleeping your face can rub against your pillow weird, which moves your contact (think about when you rub your eyes and how the contacts can feel “out of place” for a second). Usually we can “blink” them back into place, but when you are sleeping you can’t. Sometimes, the contact edges can cause very small cuts which you can’t feel. Those cuts can then get bacteria in them, causing infections (or in my case, an ulcer). Taking them out to soak in saline solution every once in a while helps keep the contact hydrated and flexible, reducing the chance of cuts, and cleans off excess proteins or bacteria. That way *if* they do cut your eye, the chance of infection is much lower :) Please know I’m saying all of this not to lecture you by any means! Excessively dry contacts mixed with sleeping in them seriously contributed to my eye ulcer. <qwerty0521>: i think we are talking about different types of contacts :) i wear ortho k lenses which are hard and do not move at all in my eyes and we’re not supposed to use saline solution with them. <alexsaurrr>: We are definitely talking about a different type, but they are still pieces of plastic that sit on your eyes and can cause cuts. As long as you keep them clean and hydrated you should be fine :D I just try to spread the awareness of eye ulcers because they are not fun. I ruined my ability to wear “long wear” contacts when I was 15 and I wish I could still wear them.", "num_messages": 9, "avg_score": 280.2222222222}
{"start_date": "1543624279", "end_date": "1543946075", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 9, "text": "<lovergold>: [Selfie][Routine Help] My near one-year struggle with acne [skin struggles](https://imgur.com/a/sIQRU4L) (this is my first time making a true SCA post w/pics so bear with me if it's not the greatest.) **Tl;dr:** my skin took a downward spiral and i still don't really know what's wrong Before we start all this, **Here is my current routine:** **AM:** -Vanicream cleanser -Fruit of the Earth aloe -Hada Labo premium lotion (I put it on my lips too) -Heritage Store rosewater (hippy bs but love the smell, don’t always use it) -Timeless Squalane (I just added this and love it!) -Biore UV Perfect face milk -Aquaphor on da liiips **PM** -Vanicream cleanser -Stridex in the red box (only at least 2 days in between using finacea) -Fruit of the Earth aloe -Hada Labo premium lotion -Heritage Store rosewater -Finacea gel 15% (once a week or so) -Timeless Squalane -Aquaphor on the lips &amp;nbsp; *Notes:* I use the Vanicream Z bar in the shower I also pretty much cut out gluten and dairy because I tested as intolerant. I will eat it maybe once a week without side effects. I used to pretty much eat only mac and cheese when my skin was at its best, so I have no idea if this is a factor. &amp;nbsp; **Where it all began:** Hey, long time lurker here. I came here for some advice once pretty much at the start of this treacherous journey. I've been documenting my skin since the beginning, but I've been hesitant to post about it. Here I am! I'm back pretty much to 1. get a little advice and 2. show y'all my skin. I don't think I'm knowledgeable and cleared up enough to really make this teachable as much as I wish I could, lol. &amp;nbsp; Here's a run-down of the story of my skin. As the age-old tale goes; I spent my whole life with clear skin (besides a pimple or two on my chin) I used to get so many compliments! In February, started breaking out in tiny CCs all over my forehead for a reason I still haven't figured out for sure *(I suspect either switching from a BCP to an IUD, or transitioning out of vegetarianism to being an omnivore)*. I started w/typical googling of symptoms and found SCA. I first suspected CCs, and tried using TO's 10% LA, Niacinamide, and 2% SA. Didn’t do jack, and I think the SA was breaking me out (FA?). The CCs started to spread down my temples, and I got clogged pores along with a pimple here or there on my inner cheeks. The pimples I would get on my chin also multiplied. Upon more SCA perusing, and finding Simple Skincare Science, I suspected fungal acne. I tried Nizoral &amp; Stridex which only dried out my skin and things continued to worsen. I used Vanicream cleanser, Hada Labo premium lotion, Cerave in the tub, Vanicream Z bar, and Stridex on &amp; off during this time. &amp;nbsp; In July, I went on a trip to Thailand. This is when I would say my skin was at its worst. I saw a derm (family connection) there who I tried to get a KOH scrape from, but she denied me (language barriers probably didn't help) saying fungal acne wasn't likely, and the treatment was the same for fungal and bacterial acne. She went on to prescribe me the typical acne treatment: a SA face wash, moisturizer, BP, an antibiotic, and differin. I didn't do this for fear I'd fuck up my moisture barrier for good, and that the antibiotic would only allow for more malassezia growth if it did happen to be the case. I continued on with pretty much the same routine as before, (similar to what I do now)and my skin somehow started to clear up. &amp;nbsp; **Actives &amp; products I've tried worth mentioning:** *Note: I’ve used them all at varying degrees and lengths in between. It can be hard to tell what did what, so this is a general consensus. * -*Nizoral 2%:* dried me out, especially in conjunction with Stridex. Bad idea, ik, but didn’t seem to help w/ my bumps -*Stridex Max 2%:* I never know if this works but it hasn't seemed to hurt unless I use it days in a row -*Vanicream Z bar ZnP 2%* (not FA safe!): I think this has actually really helped me despite not being FA safe. -*Finacea gel 15%*: probably what has cleared me up as of recent. I don’t always use it, but when I do, I usually notice a difference in texture the next day. Sometimes I’ll get a random pimple after using it, though. I’m pretty sure you’re supposed to use it daily, but I’m too chicken to commit to an active like that. -*De La Cruz Sulfur ointment 10%:* Meh. Hard to really tell if this helps. I’ve only used it a few times recently, and usually while using Finacea and/or Stridex so idk. Nothing that I’ve noticed though, sadly. -*Hada Labo Premium lotion:* love this stuff!! Glad I incorporated it. Hard to say if it made my skin better, but it always makes it feel nice and makeup applies more smoothly. -*Hada Labo perfect gel:* Eh. I started using this in place of CeraVe after getting it in Thailand, and my skin started to clear up a bit. After stopping both, my skin seems even more clear. When I try using this again, it seems to break me out. It was probably the CeraVe -*CeraVe in the tub:* love/hate. I’m so bad at telling when things break me out (partially bc of my sporadic habits). I think it clogs my pores, hence above, but I love the way it makes my skin feel right when I put it on. -*Aquaphor*: I've tried the slug life a few times and I’m not sure how I feel about it. However, not important to this post but worth mentioning: this over the Hada Labo Premium lotion makes my lips feel amazing! I have a lip biting problem and my lips look so much better than they used to doing this. -*Biore UV Perfect face milk:* Does the job without breaking me out, I think that's good for a sunscreen? -*Aloe Vera:* I've used so many different types of aloe in the past, even before this whole SCA journey, it's hard to list them all. So far, they've only done me well. I can't say exactly what it does for me because I've always used aloe. I love the refreshing feeling and I believe it has repairing properties. -*Rosewater:* Something I also used to use as a refresher. I now like it just to have as some sort of good-smelling spray that plumps up the HA in my Hada Labo premium lotion. -*Timeless Squalane:* Lives up to all the good claims I've seen on this sub and over at SSS. Not much more to say! There are plenty of reviews for this guy. &amp;nbsp; **As of now**, I’ve been concerned w/ some of the pimples as you can see in the pic, some remaining ccs/clogs, and scarring. I'm considering trying the differin I still have from Thailand, but I think overuse of products could be got me into this mess in the first place, so I'm hesitant. I also plan on seeing a derm where I live in the states to hopefully get some better communication and get that KOH scrape. Please let me know if you have any thoughts/suggestions. I know I’m pretty unorganized and lengthy w/all of this so I appreciate anyone who stuck around! Much love. <Edit>: Spelling/formatting<lovergold>: PS, with all the product mentions, would this count as a review? Sorry I massively crowded this post... just so many skin woes<scumteam14>: Those definitely count!! Also I think your formatting is awesome :) As for actual routine feedback, I think I'd either stick with what you have now till you get to see the derm you're planning on, or just slowly and methodically work your way through the rest of the acne treatment lineup. Fungal acne is relatively rare and I wouldn't put all your eggs in that basket till you know for sure, but there's nothing wrong with getting a KOH scrape. It might help to list all the acne treatments you've tried along with the ones you haven't. Also, keep in mind that products might break you out for reasons other than FA! I'm not trying to dissuade you from FA entirely, I just think it's good to keep your options open and not hone in too strictly on one thing (especially if that one thing requires a derm diagnosis) * BHA - Stridex, TO Salicylic Acid * AHA - TO Lactic Acid * Benzoyl peroxide - * Azelaic acid - Finacea (you noted has helped the most - maybe decrease the frequency of Stridex, increase the frequency of AzA?) * Sulfur - De La Cruz * Retinoids - * Antibiotics - Personally, I'd just work your way through the acne treatments one at a time. If Stridex isn't helping and you've been using it for a month+, drop it and focus on Finacea. If that doesn't start helping after a month+, drop it and move on to benzoyl peroxide. And so on and so forth, eventually hitting derm prescriptions. As long as you go through your options slowly and methodically, there's no reason to be scared of trying new actives, especially since you've only mentioned dryness in response to specific actives and not overall dehydrated or damaged skin. You seem to have a healthy respect for actives in general, and you seem to know your skin quite well, so you'd know if things were becoming too irritating. Trust your own judgement :)<lovergold>: Sweet, thank you! :) &amp;#x200B; About the FA, my main justification for this is that I've taken a lot of rounds of antibiotics in my life for reasons besides skin, and I've had fungal issues arise after doing so. I took several rounds in 2017, the year prior to the CCs starting. So, I wouldn't be surprised if it was fungal. I do see your point in saying I shouldn't put all my eggs in one basket because I totally agree. In the beginning I was so fixated on Fungal acne, but I'm opening up to more options which is part of the reason for this post! So I guess I shouldn't be surprised if it's not fungal! However, I like the idea of keeping an FA safe routine since it keeps it simple, and a lot of actives which can help treat both regular and fungal acne are safe which is awesome. I'm just waiting on that scrape, hopefully I'll have updates soon! &amp;#x200B; As for listing the treatments, do you mean on the post, or just to brainstorm options? &amp;#x200B; I think you're totally right about doing treatments one at a time. In the past I've gotten so impatient about waiting to incorporate new products. Even now in knowing better, my initial thought is \"I don't wanna keep waiting! Why don't I just drop this and try something else?\" Marathon, marathon, marathon. I will take that advice. Like with what you said about Finacea, I've actually stopped using Stridex for a couple of weeks now, so with what you said I might just stick with Finacea through the rest of the month and see how that goes. Think I should update my routine? I'll definitely get differin out of my head until I go to the derm. &amp;#x200B; I also really appreciate what you said about when I get dryness because despite what you said about knowing my skin well (thank you btw, such an affirming thing to hear) I actually haven't realized that! I've switched between actives and no actives without noticing much of a difference besides more clogged skin when I don't use them, yet I've still had an internal dilemma about using them with seeing so many posts about moisture barriers and dehydration! &amp;#x200B; I really appreciate your insights! I will definitely be taking your advice &lt;33 &amp;#x200B; &amp;#x200B; &amp;#x200B;<scumteam14>: Hey, sorry for the late response! &gt; About the FA, my main justification for this is that I've taken a lot of rounds of antibiotics in my life for reasons besides skin, and I've had fungal issues arise after doing so. Oh that makes sense!! Yeah your justification for that seems very sound, and keeping it simple seems like the best way to go about it regardless! &gt;As for listing the treatments, do you mean on the post, or just to brainstorm options? Just to brainstorm! I wanted to make sure I hit all the things you had already tried before suggesting something, plus it's always good to keep track &gt;yet I've still had an internal dilemma about using them with seeing so many posts about moisture barriers and dehydration! Haha very much the same thing here - I love that the sub generally has an excess of caution because it balances out some of that \"I'll *make* my skin obey me - the burn means it's working!\" mentality, but it's easy to get a bit *too* scared of actives. You should never be scared of skincare - as long as you know what signs to watch out for and listen to your skin, you'll be good! Especially for topical daily routines, damage doesn't slam you like a freight train, it tends to slowly accumulate. So as long as you can recognize \"Hmm, that moisturizer isn't supposed to sting....it's not so bad, but maybe I should skip a day or two for my actives\", you're golden!", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1543817100", "end_date": "1544771173", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 10, "text": "<ExternalPush>: [Personal] People from the Philippines, Any Product Recommendation Need Help! Hello Guyz, I am a Male 20 years old and I just wanna ask what skin routine should I do that is suitable for me, I am from the Philippines, and if possible recommend products to buy that are in the supermarket for easier access and cheap. Also list down all the products and how to use them as routine. I currently have large pores, acne, hyper-pigmentation. When I wake up my face is very oily and when I wash my face with soap it becomes dry. I currently use Cetaphil Bar Soap, Eskinol and Laneige Water Bank Gel Cream Thanks for the help<clarysandy>: Nice! A fellow Pinoy redditor :) we have a good community going on over at r/beautytalkph but I can help you out here. If your face feels dry after cleansing, your cleanser might be too harsh. Cetaphil is a bar soap with a pH and eskinol has a lot of drying alcohol, so that's probably why. You can try switching to the gentler **Celeteque Acne Cleansing Gel** and see how your face feels after each wash :) The Laneige is very hydrating na, but if your face seems tight pa rin after using it, you can look at alternatives at Watsons :) based on your skin type, I'd recommend **Cosrx Oil-Free moisturizing lotion, Cetaphil lotion, or the Celeteque Acne Clearing Gel Moisturizer.** Don't be afraid of moisturizer just cause your skin is oily! If your skin is dehydrated, putting moisture back in your skin may tell your oil glands to stop producing sebum. Anyway, cleanser and moisturizer should be enough to get you started. Hyperpigmentation will fade on its own, but you can speed it up with Vitamin C products like **The Ordinary 30% Vitamin C or Melano CC in Shopee, and Mad Hippie Vitamin C in Healthy Options**. Drop by the sub if you have any other questions :)<ExternalPush>: So what do you suggest is the right products in order should I use? Celeteque Acne Cleansing Gel, and then what cleanser should I use? and I will try to continue using the Laniege &amp;#x200B; Thanks<clarysandy>: The Celeteque can replace your cleanser na, so bale: - Cleanser - Toner - Vitamin C - Moisturizer - Sleeping Mask You can use the laneige underneath your moisturizer din, if the moisturizer is heavier in texture.", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1539726355", "end_date": "1539735201", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 35, "text": "<AGDadabhoy>: [Routine Help] Have really really oily skin, and can't seem to get rid of these enlarged pores with hairs/blackheads on nose and cheeks, what do I do! Currently using Cerave foaming cleanser, and cetaphil moisturizer. <Lilin_unite42>: Those are sebaceous filaments, not blackheads, and they are a natural part of skin. Removing them is bad for your skin, and you shouldn't try to. That can result in infections, and the pores getting even larger. If the texture of them bothers you, you might find exfoliation to be helpful. They seem a bit less visible on me when I am exfoliating regularly. But ultimately, there isn't really anything that will produce a lasting impact on the size of pores. That is genetic, and most people do have larger pores on their nose and cheeks than elsewhere on their face -- especially men, and people with oilier skin types.<AGDadabhoy>: I see, but is there no way to hide them, or atleast reduce their appearance for the day or etc, they kinda are noticeable and make me a bit insecure<Lilin_unite42>: I am certain the only one who finds them so distracting is you. 😉 Everyone has these. You just don't look at them as closely as you look at yourself. Like I said, I find that exfoliation reduces their appearance slightly, because it keeps them flush to the skin. In terms of short term solutions that cover them more completely, all I know of is make-up.<AGDadabhoy>: Lol I wish, I got called out on them by someone like last week, it's made me even more annoyed about them, I'll try to get some exfoliation going, know any good exfoliator though? <Lilin_unite42>: That seems bizarre to me, given that your nose looks like just about every man I've ever seen in my life. Don't let idiots get to you like that. The list of unremarkable features of mine some idiot has commented about over the course of my life could easily reach into the dozens. I use AHA's.", "num_messages": 6, "avg_score": 5.8333333333}
{"start_date": "1543607465", "end_date": "1543616896", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 11, "text": "<ticklystarlight>: [Anti-Aging] What is the difference between basic retinol and \"encapsulated\" retinol? I'm not asking for product advice, since I already chose a retinol (Paula's Choice 1% Clinical Retinol). However, in the process of searching for a retinol there were lots of recommendations to try Peter Thomas Roth's Retinol Fusion, which is a **1.5%** ***microencapsulated*** **retinol** product. So my question is... what is the difference between the retinol and microencapsulated retinol? I thought that 1% retinol was the highest retinol percentage available in the United States without a prescription. So this encapsulated retinol must be different, and I guess it must be less effective? Both kinds are listed as the same thing in the ingredient list (simply \"Retinol\"). There seemed to be confusion about this in the threads I was reading, too. Maybe this is a mystery that can't be solved, or someone more knowledgeable can help me understand the difference. Thank you!<scumteam14>: I'm not the most knowledgeable on this, but microencapsulated retinol is literally encapsulated retinol - so it has a little sphere / comfy little coat around it. This helps for a slow, controlled release of retinol over time as the capsule breaks down. Microencapsulated retinol has the pros of being more stable than regular retinol (has a longer shelf life) and being gentler since absorption is spread out over time rather than all at once. I'm not sure if any retinol gets lost in this process or if microencapsulated retinol products have higher concentrations simply because they can / it's less irritating. Also, I'm generally confused about the highest concentration of retinol you can have in the U.S. - there are a few 2.5% retinol products on amazon that seem to use retinol (rather than the usual method of using retinyl palmitate.) Does anyone have a source for max concentration?<ticklystarlight>: I tried to look up the max concentration of retinol for the US and I couldn't find anything. Instead I just got lost in an click-hole trying to find out more about encapsulated retinol. It's actually my thought that encapsulated retinol contains less retinol than just the pure stuff. For example \"1.5% encapsulated retinol\" (which is how PTR is marketed) probably means that the encapsulation material is being included in the percentage, if that makes sense. But I have no way to tell what it's being encapsulated with (although some people here: https://chemistscorner.com/cosmeticsciencetalk/discussion/comment/16501#Comment_16501, seem to say that it's technically a dispersion not an encapsulation) and how much actual retinol molecules are contained in the product. So maybe that's why they can get away with a higher percentage... it's not pure retinol. Anyway it's all very confusing and I'm left feeling really exhausted by just trying to figure out how to navigate retinol/retinoid products....", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1544677728", "end_date": "1544756395", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 28, "text": "<AutoModerator>: NEW OR NEED HELP? Ask here! - ScA Daily Help Thread Dec 13, 2018 If you're new to SkincareAddiction: welcome! This thread is the best place to start if you have questions about skincare products, your routine, and your skin. Our community is knowledgeable, and we want to help you have the best skin of your life! - #Do you have a question? ###Step 1: Read our resources First take a look at our [FAQ](https://www.reddit.com/r/SkincareAddiction/wiki/faq) and [Wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)! They include product recommendations and advice for skin concerns like [acne](https://www.reddit.com/r/SkincareAddiction/wiki/acne), [pigmentation](https://www.reddit.com/r/SkincareAddiction/wiki/pih), and [dehydrated skin](https://www.reddit.com/r/SkincareAddiction/comments/1akqed/dehydrated_skin_what_is_it_what_it_looks_like_and/). Or search the sub using [this awesome website](https://www.narfar.com/r/skincareaddiction). You might find a solution to your problem there! If you can't find an answer, or you have additional questions after reading, please move on to step 2! ###Step 2: Ask for help To give you the best advice possible, our users need relevant information about your skin and skincare. With your request for help please include: * **The issue(s)** you need help with. * **Skin type**. It's OK to be subjective, how do you feel your skin is? Oily, dry? If you need help clarifying, check out [this guide on skin types](https://theacidqueenblog.com/2016/06/23/skin-types-proclivities-and-conditions/) * **Current routine** with the full names of your products (try to separate it in to Morning, Evening, and Occasionally used) * **How long** you have been using your current routine, or product in question * **Anything new** you’ve introduced or started doing that might change the condition of your skin * **Your location** so we can recommend products/services available to you Thanks for taking the time to include your information! #Would you like to give advice? Firstly, thank you so much for helping out our community, without your knowledge and time ScA would not be the same! Some things we'd ask for you to keep in mind: please don't just downvote someone's opinion or response because you disagree. If you can, please take the time to tell them why you think their advice may be incorrect or harmful. It's better for people to understand why something is a poor choice, instead of just being told that it is one. #[Previous Threads](https://www.reddit.com/r/SkincareAddiction/search?q=title%3AAsk+ScA&amp;restrict_sr=on&amp;sort=new&amp;t=all) ---- *This thread is posted every day at 12:00am ET.* <bellebrita>: I feel like this is such a newbie question... What are the desired results of an AHA? I have sensitive skin, so I've only used DERMA E's Overnight Peel and Farmacy's Honeymoon Glow inconsistently at best in the last four months. I'm finally up to using Honeymoon Glow twice per week, but I've only been at this level for two weeks. I still can't apply it on the skin between my nose and mouth because it stings too much. It no longer stings at all on the rest of my face. I apply it at night after washing and drying my face. I then use DERMA E's Hydrating Night Cream over it. I don't know what difference I'm supposed to see in my skin. Do I need to use an AHA longer? Use the DERMA E one more often? It's a lower percentage, so I assume that means it can be used for frequently. Try a different AHA product all together?<nemicolopterus>: Haha why are you using it if you don't know what its doing? What are your skin goals? <bellebrita>: My skin goal is just to have healthy skin. Preventing noticeable aging would be nice, but I consider physical appearance as secondary to skin health. My dermatologist told me a year ago to stop using physical exfoliators because my skin is too sensitive. (It didn't used to be this sensitive). So last winter I mostly stopped using them, with the occasional gentle use as a spot treatment if I had a dry, flaky patch. Having very sensitive skin was new to me, so I started reading this sub. I didn't really understand chemical exfoliators, but that recommendation was in line with what my derm said. Around maybe July or August, I received first the DERMA E product and then the Farmacy product to try out (I get a lot of PR samples), so I slowly added them to my routine. I just don't know if there's supposed to be some obvious physical result, or if it's just one of those things that contributes to overall skin health. <nemicolopterus>: I don't think exfoliating is necessary for overall skin health at all actually. Exfoliants are usually used to treat problems like acne. Hydration and moisturizing are the proper ways to treat flaking. the sub doesnt recommend chemical exfoliation in all cases: just says it's better than physical exfoliation. I'd look at the rest of your routine for your hydrating and moisturizing products and focus on that especially if you're getting dry patches. Niacinamide is great for protecting your moisture barrier as are ceramides. These are commonly found in moisturizers. <bellebrita>: Isn't exfoliating a big part of getting rid of dead skin? That's why I figured it was part of overall skin health. I'll reevaluate my moisturizers once winter really hits. I live in a humid climate with mild winters, so I haven't had dry patches since February. Thank you for your help!<nemicolopterus>: My understanding is that if your skin is healthy the turnover happens naturally without excess flaking or dryness. I'd look at LabMuffin who writes science-based skincare info that's accessible and backed up by research: https://labmuffin.com/its-the-lab-muffin-guide-basic-skincare/ If your skin is dry, you likely need to add oil, and if it's dehydrated you need to add moisture. AHA is drying so doesn't help with either!<maewen27>: I'm not 100% sure (I'm having trouble finding a proper reference), but I thought that AHAs can actually help with moisturizing? This has been my experience, at least! \"If you have dry skin, you’ll also find glycolic particularly useful, because it draws moisture to the skin and helps prevent transepidermal water loss. It also increases the hyaluronic acid levels in the skin.\" <https>://www.dermstore.com/blog/hydroxy-acids-what-they-do-and-which-ones-are-right-for-you/<nemicolopterus>: Whoa weird! I've never heard of that. I use lactic acid as my AHA so maybe there is also a difference depending on which specific one you're using? Here's what I've found so far: &gt; Twelve percent glycolic acid in water and 0.1% retinoic acid in ethanol, respectively, were applied for 60 min once daily, over a period of 2 weeks (5 consecutive days weekly) on dansyl chloride-labelled skin and on untreated skin. During a 10-day application period, both glycolic acid and retinoic acid similarly induced a significant increase in Trans-Epidermal Water Loss. [src](https://www.ncbi.nlm.nih.gov/pubmed/8651024) i.e., both retin-a and glycolic acid dried the skin out. This might be a function of me being imprecise with my language though: all AHAs I've tried have really irritated my skin (they make it red, flaky, sensitive, etc). When I have dry skin it feels the same way but maybe I'm really conflating two different experiences. On the other hand, [this study](https://www.reddit.com/r/SkincareAddiction/comments/9kgypf/research_sidebar_research_threads_week_4_ahas/e71lhk7/) found no difference in skin surface hydration between 40% glycolic acid and a placebo peel. And [this study](https://www.reddit.com/r/SkincareAddiction/comments/9kgypf/research_sidebar_research_threads_week_4_ahas/e6zyjof/) did show an increase in hyaluronic acid in the skin (though it's not 100% clear to me that that's the same thing as \"less dryness\"). [Here's a few more studies](https://www.reddit.com/r/SkincareAddiction/comments/9kgypf/research_sidebar_research_threads_week_4_ahas/e72hdvx/) showing increase in hyaluronic acid in the skin as well. <Anyway>: this may be another thing of \"YMMV\": for me, AHA is soooo irritating and the redness, flaking, and irritation seems like my skin gets dry but of course that may not be true for everyone!<maewen27>: So interesting, thank you for looking up all these studies! I agree, this is almost definitely a YMMV situation. Glycolic acid is certainly not for everyone!", "num_messages": 10, "avg_score": 2.8}
{"start_date": "1543540567", "end_date": "1543552111", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 18, "text": "<happychipmunkcheeks>: [skin concerns] Is sunscreen supposed to feel uncomfortable ? I really dislike it.. lol It's bad enough it makes me look kind of ghostly, but then the feeling of it on my skin is also annoying. Today I used the Aveeno sensitive &amp; it feels decent but I still hate the feeling of having it on my skin. It also kind of pilled around my nose. I also tried Asian sunscreen (Isehan mommy) and really dislike it. It doesn't feel as soothing as zinc spf. But zinc spf can also make my skin feel a little tight &amp; pill in places. The white cast also sucks. Tinted sunscreens are too dark and orange. Help<blorqx>: I share your frustration. When I put on moisturizer, my skin is nice and glowy. When I put on my cereve AM sunscreen, I look like I have the flu and spent the day steaming my face over a deep fryer. <happychipmunkcheeks>: Lol Cerave AM pills up so bad and felt irritating on my skin !<blorqx>: Ugh why can’t skincare companies figure this stuff out. <furiana>: Seriously. At least mineral sunscreens with a white cast have an excuse. But chemical sunscreens?! There were clear chemical sunscreens back in the 90's! And NONE of them should be greasy anymore. If Skinceuticals and Deciem can make non greasy mineral sunscreens, then so can the rest of you.<blorqx>: “If Skinceuticals and Deciem can make non greasy mineral sunscreens, then so can the rest of you.” Preach🙌🙌", "num_messages": 6, "avg_score": 3.0}
{"start_date": "1544760608", "end_date": "1544812536", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "<nebulousmilk>: [Routine Help] Lotion suggestion for skin that hates lotion? Just looking for recs from people with similar issues. Normal creamy lotion makes me feel sticky and hot on my face. CCs and red splotches with any lotion I put on my face at night. Literally, have never put a lotion onto my face that has not caused this. I tried the Garnier gel moisture lotion and my skin feels tight after. Oils make me feel greasy if I leave them on. Natural Moisturizing Factors + HA gave me CCs. Hada labo gave me a borderline allergic reaction? Idk Things my skin seems to tolerate: moisture bomb mask, synactif “lotion” Any recommendations are appreciated <EDIT>: Last night I tried The Ordinary Granactive Retinoid under my Cerave PM lotion. Legit every spot on my face is reduced, almost every CC gone. WTF. My skin looks super hydrated too.<LikesGreenTea>: Hemi-Squalane! [https://theordinary.com/product/rdn-100pct-plant-derived-hemi-squalane-30ml?redir=1](https://theordinary.com/product/rdn-100pct-plant-derived-hemi-squalane-30ml?redir=1) Or regular Squalane! [https://theordinary.com/product/rdn-100pct-plant-derived-squalane-30ml?redir=1](https://theordinary.com/product/rdn-100pct-plant-derived-squalane-30ml?redir=1)<nebulousmilk>: I read somewhere that Argan Oil has squalene in it, any idea what the difference is?<LikesGreenTea>: Are you sure you weren't looking at a blend of oils? Argan oil is made from the kernels of argan trees. Squalane oil is made from sugar.<nebulousmilk>: Oh I wasn’t looking at anything I just saw someone commented on a post here saying that", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1544680896", "end_date": "1544909664", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 29, "text": "<rlsleepingbeauty>: [Product Question] Skincare products that are actually worth investing in at Sephora? <snicole1173>: Dr. Jart+ products are usually my only Sephora purchases. The cicapair line is incredible! But you can sometimes find them on other websites cheaper. And Fresh’s Kumbacha Essence was expensive, but has kept my skin so hydrated and seemingly poreless since I started using it that I’ll never go without it now. <rlsleepingbeauty>: I recently got dr jarts ceramidin cream and it was a total miss for me 😭 I was so sad but I am all for trying the cicapair line! Is there a certain product from the line you recommend?<snicole1173>: I use the whole line, but I love the serum - it heals my skin in just a day or two if I have pimples or have done extractions. The overnight mask is my favorite occlusive product too, I rarely use a moisturizer now bc it keeps my skin super hydrated even using just twice a week. I use the correction treatment on really bad face days but it’s a little thick/greasy bc of the sunscreen so it’s not my favorite.<rlsleepingbeauty>: Ohh!! So it does heal pimples? For some reason I assumed this would bring everything to the surface. To be clear, you’re referring to cicapair serum right? Not ceramidin liquid.. ? Wow your lucky, I need a moisturizer, my skin is a thirsty beast. Maybe incorporating a sleeping mask will do me wonders, thanks for your suggestions, seriously!! <snicole1173>: Yeah, the cicapair serum. The main ingredient (centella asiatica) is healing/soothing. It’s really good for redness too but I’ve seen the biggest difference in the healing of my acne/skin! You’re welcome!! Once I found products that kept my skin hydrated (I live in the desert so that was a process, but like 80oz of water a day helps as does using my HA while in the shower so it can pull that moisture in instead of pulling it from my skin) I haven’t found a huge need for moisturizer more than once or twice a week under the sleeping mask. Good luck!! <rlsleepingbeauty>: Omg yesssss thank you so much for recommending this. My skin loves Centella and I haven’t found a good product that contains it!! I also drink so much water so that’s no problem for me! Crazy hydrated on the inside, chronically dehydrated on the outside lol. Ohhhh you’re in a dry climate! I’m in a humid climate 😬 do you still think cicapair serum would work despite this? Also, could you explain how you use the HA in the shower in a little more detail? I’m really intrigued by this cause the steam I’m sure really opens your ores and allows your skin to absorb it better/deeper. Great idea!<snicole1173>: I don’t see why it wouldn’t work! Just let it soak in for a bit if you know you’re going to sweat a lot. So, bc HA uses the water around it (it can and does pull moisture/water out of your deeper skin layers if you don’t give it any to use) using a mist before and after helps a lot, as does putting it on before the shower bc the steam and the water gives it more to pull in and use. I read about it on here months ago and swear by it now!<rlsleepingbeauty>: Wow this is crazy cool. So you put the mist on before the shower or the HA?<snicole1173>: If I’m not taking a shower I spray the mist before and after the HA. If I take a shower I don’t spray any. :)<rlsleepingbeauty>: Wow thank you. So just to be clear, when you use it in the shower, how are you applying it? Putting it into your hands and patting into the skin or letting it sit and absorb the moisture/water? Also, do you layer this in the shower?<snicole1173>: You’re so welcome!! I pat it on and give it enough time to soak in before getting in the shower, and just try to keep my face from getting super wet so it doesn’t rinse off. If my skin is extra dry I’ll add another layer when I get out and let my face air dry. <rlsleepingbeauty>: This is genius, I’m going to try this, thanks so much!!", "num_messages": 13, "avg_score": 2.2307692308}
{"start_date": "1543581823", "end_date": "1543625635", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 137, "text": "<happyGruber>: [Humor] Basically how I deal with life <micultra8>: \\*Not talking to parents following a joke of a depressing Thanksgiving, grandmother is dying, could really use a hug\\* <Me>: Gonna add face mask to my Friday night list and see if it perks me up at all. &amp;#x200B; (I did seriously add this to my Friday night list, because even if it won't fix my sadness, I might as well have beautiful skin while crying uncontrollably, right?)<zoom_dog_160>: Sending you internet hugs! My grandma passed away about a month ago and it was rough and is still rough. Self care is so important during this time!", "num_messages": 3, "avg_score": 45.6666666667}
{"start_date": "1544754308", "end_date": "1544806296", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 17, "text": "<ShemomedjamoShorty>: [Routine Help] Incorporating The Ordinary Products into my skincare routine?<https>://www.reddit.com/r/SkincareAddiction/comments/a4qul4/routine_help_incorporating_the_ordinary_products/?st=JPNEPENO&amp;sh=87ac8f5e Hi everyone, I posted this a couple days ago but didn’t get much response. Let me know if any of you have any suggestions as to how I can incorporate any of the products in the above link into my routine (also in the link above). <saucylackey>: Could you give us a little bit more info about your skin, and the problems you’re trying to address?<ShemomedjamoShorty>: My skin is normal, with a very oily nose. I’m drying to address redness, dullness, and pigmentation. <saucylackey>: Gotcha. I can't in good faith recommend the TO niacinamide because it's causing problems like redness, irritation, and breakouts for so many people. The amount of niacinamide in that product is just obscenely high. As for the rest of the actives, you can just use them on a rotating basis. Keep in mind that they may cause you to purge. So here's your current evening routine: 1. Philosophy - Facial Cleansing Gel 2. Thayer’s Witch Hazel 3. ACTIVE 4. Dr. Dennis Gross - Hyaluronic Marine Eye Gel 5. First Aid Beauty - Ultra Repair Cream And here's a way you can rotate your actives: * Monday: Herbivore * Tuesday: Lactic * Wednesday: ALA * Thursday: Herbivore * Friday: Lactic * Saturday: Herbivore * Sunday: AHA + BHA Peel You're going to need to have very robust skin to pull this many actives off. Personally I would just commit to one (either the lactic, ALA, or AHA + BHA peel) but you do you. Good luck, and let me know if you have any q's.<ShemomedjamoShorty>: Thank you so much! I appreciate your in depth response. Which one would you recommend committing to?<saucylackey>: You're so welcome! For your concerns, probably the lactic because you can work up to using it daily (the ALA and AHA + BHA shouldn't be used more than once or twice a week). Alternatively, you can use the lactic six days a week, and rotate the ALA and AHA + BHA on the seventh day. <Example>: Week 1 * Monday: Lactic * Tuesday: Lactic * Wednesday: Lactic * Thursday: Lactic * Friday: Lactic * Saturday: Lactic * Sunday: ALA Week 2 * Monday: Lactic * Tuesday: Lactic * Wednesday: Lactic * Thursday: Lactic * Friday: Lactic * Saturday: Lactic * Sunday: AHA + BHA Peel<ShemomedjamoShorty>: Do you have any products that you would recommend incorporating into my morning routine?<saucylackey>: Nope, it's a really solid morning routine. Although I wonder if some of the essential oils and fragrances could be contributing to your redness.<ShemomedjamoShorty>: I wondered the same thing, however I’ve had the same redness and discoloration since before I started using those products. One more question - would you recommend using any retinoids? I don’t have any experience using them, but I’ve heard wonderful things <saucylackey>: A retinoid could absolutely be helpful. If you were to go that route, I would recommend seeing a derm (OTC retinoids aren't nearly as effective as prescription ones IMO) and dropping all the other actives. You won't need them with something like a low does of Tret. Keep the questions coming if you have more, I don't mind :)<ShemomedjamoShorty>: Thank you so much! Do you have any eye creams you would recommend? The one I use is nice, but it’s about $50 for .5 oz. <saucylackey>: You're welcome! I actually don't use an eye cream, but here are two much-loved and slightly less expensive dupes to the one you're currently using: [https://www.origins.com/product/15348/11641/skincare/treat/eye-care/ginzing/refreshing-eye-cream-to-brighten-and-depuff](https://www.origins.com/product/15348/11641/skincare/treat/eye-care/ginzing/refreshing-eye-cream-to-brighten-and-depuff) [https://www.clinique.com/product/1683/4769/skin-care/eye-lip-care/all-about-eyes](https://www.clinique.com/product/1683/4769/skin-care/eye-lip-care/all-about-eyes) &amp;#x200B; You could also try applying [this](http://www.hadalabotokyo.com/product/skin-plumping-gel-cream/) to damp skin right after cleansing, and taking it up around your eye area. Then just let your skin air dry and go in with your FAB moisturizer.<ShemomedjamoShorty>: Thank you so much for your help! For curiosities sake, if I were to use the ordinary 10% Niacinamide serum, where would I incorporate it? And can I use with vitamin C?<saucylackey>: There's controversy about mixing those two together, although I don't think the science backs it up (you can read more about it [here](https://www.paulaschoice.com/expert-advice/skincare-advice/myths/can-niacinamide-and-vitamin-c-be-used-together.html)). However, TO specifically states not to mix their niacinamide serum with vitamin C. So my inclination would be to use vitamin C in the AM and niacinamide in the PM. Something like this: <Morning>: 1. Philosophy - Facial Cleansing Gel 2. Thayer’s Witch Hazel 3. Youth to the People - Kale + Tripeptide 5 Vitamin C Hyaluronic Acid 4. Dr. Dennis Gross - Hyaluronic Marine Eye Gel 5. First Aid Beauty - Ultra Repair Cream 6. Dermalogica - SPF 50 <Evening>: 1. Philosophy - Facial Cleansing Gel 2. Thayer’s Witch Hazel 3. Lactic Acid 4. Niacinamide 5. Dr. Dennis Gross - Hyaluronic Marine Eye Gel 6. First Aid Beauty - Ultra Repair Cream<ShemomedjamoShorty>: Do you think I could use it after the Prism Herbivore Acid or the AHA + BHA as well? <saucylackey>: I wouldn't use anything after the peel. 30% AHA is no joke. You'll definitely want to baby your skin after that. Same with the ALA. Using it after the Herbivore acid should be okay because it doesn't contain topical vitamin C (l-ascorbic acid). But I'm not a derm, so always proceed with caution and listen to your skin.", "num_messages": 16, "avg_score": 1.0625}
{"start_date": "1544757159", "end_date": "1544768752", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 502, "text": "<laoniang>: [Misc] Okay-skincay for those struggling with low energy or mental health conditions. (Oh dear, I was a lost redditor and submitted this to MakeupRehab earlier on. Heh.) So I’ve got mental health challenges, and this was a much more difficult year than ever. I peak at an energy level of 4/10 on excellent days. Skincare is not a priority when you struggle to rinse your body under the water for 30 seconds. But then I decided that I wanted to look glamourously depressed, so I tried out different skincare routines (whenever my energy allows). To make any routine sustainable for those suffering from low energy, I decided that there were a few factors that are essential: * Feelings of small wins and big wins * Low time commitment * Immediate gratification * Low cost * Routine and products that are accessible for all I’m going to share my own routine for varying modes of energy levels I experience, which consists of 3 modes of difficulties. For ease of reading, I’m just gonna call them Levels 1, 2 &amp; 3. The lower the level, the simpler the routine, and funnily, the most difficult to begin. * Level 1: Clusterfuck * Level 2: Yeah, fuck. * Level 3: Barely but surely, I can make it through today. [Context]<Lifestyle>: 27 year old, female, heavy smoker, office job and mostly sedentary, on antidepressants for around 10 years now. Lives in Southeast Asia, bear the equator. Climate is typically hot and humid. Skin type and issues: Combination-type, medium-tanned skin. Sebaceous filaments around nose and under lower lips, low to no acne. Please adjust the routine according to your lifestyle and skin type/state. — [Level 1 - So I’m a clusterfuck and can’t get out of bed] <Routine>: Drink 2 litres of water and wash your face with tap water. Stuff required: Drinkable water and tap water. How to do: Store bottles with an overall capacity of 2L of water or more beside your bed. Sip throughout the day. Wash your face when you go to pee/poop. <Rationale>: Almost no cost. Water is essential to hydrating from within and can help improve in overall health - mentally, physically and er...facially. Getting out of bed to pee is a good investment of 2 minutes, compared to trying to pee on a bottle while in bed and having to change and launder your sheets. For the average person this might sound ridiculous. But we know this takes quite a tremendous amount of mental and emotional effort. Don’t trivalise the essential function of watering yourself. — [Level 2 - Yeah fuck, but I had worse days.] <Routine>: Drink 2L of water. Wash face with cleanser/tap water and use a moisturiser. Stuff required: Drinkable water, tap water and moisturiser. How to do: Same steps as level 1, but smear moisturiser on your face. I recommend: A hydrating facial mist. I use one from Eucerin, so it takes me 3 seconds to spritz and my hands won’t be greasy. Then I go back to sleep. <Rationale>: It’s just adding one more step to the previous routine. Except you’re hydrating on the outside in addition to the inside. Good job! — [Level 3 - Yup, I can make it through today at least.] <Routine>: Spot treatment and/or sunscreen, in addition to whatever’s in level 2. Stuff required: Products for any skin specific issues you have, and a good sunscreen. Drinkable water, tap water and moisturiser. I recommend: Tinted sunscreen. I use one from The Face Shop, which is also a BB cream and facial primer. I also use an oil cleanser to remove my sunscreen. Sometimes I use a non-tinted thin sunscreen from a local brand, so I can avoid the oil cleansing, which is one more step and product to my routine and Budget. Never used a miscellar cleanser myself but I think it’ll do double duty of removing both makeup and basic cleaning? <Rationale>: At this stage I feel that I should introduce sunscreen because it’s an investment in your future. The future is usually not important when you’re not sure if you can survive the day. But today you can. — [Bonus Level - I’m alright for the time being.] I recommend: Whatever you want, whenever you want to do it, in your own terms. I usually just try to unlegbeard myself. <Rationale>: Cherish this burst of energy and clarity and do whatever the fuck you want. You know this is transient, so all the more you should account to yourself. — Well, I hope this is helpful to those that read it. I understand to some this is a no-brainer. But it’s very hard for those struggling to differentiate between normality (yeah I’m lazy today so I’m going to chill) and inadequacy (I cant even do this simple thing!). I share this really from lived experience. I tend to incline towards level 1, something like 20 days a month. Sometimes even without meeting the 2Ls of water I set for myself/recommended water consumption. However, I feel that if I must compel myself do something for self care, I prefer to incorporate a step that’s more holistic like drinking water. When I feel slightly better, I try to prioritise. But I find the first step is just not to trivialise myself and others. With my disposition which dislikes anything that can be termed motivational, I just want to end this post by saying that you are all sufficient. Thank you for sharing your problems and advice on this sub. I learned a lot.<meowgrrr>: I love neutrogena cleansing towelettes in general, they really just work for my skin, but I love them even more because I just keep the pack next to my bed so when Im depressed and/or drunk I can grab a wipe from in bed and wipe my face and not have to worry about getting up and going to the sink. It cleans and it also makes my face feel dewy and moisturized. If not the neutrogena cleansing cloths, there are so many brands out there with wipes I bet there is a good option for everyone! <ooh_cake>: Wipes, pads like Stridex, and sprays really come in handy on those days when my physical and/or mental health is acting up.<afro__ditee>: This. I have a jar of toner pads (the neogen cica ones) that I keep specifically for low spoon days and traveling. They're the best tbh.", "num_messages": 4, "avg_score": 125.5}
{"start_date": "1544754694", "end_date": "1544809620", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7, "text": "<uniqueinalltheworld>: Started accutane today! Help me build my moisturizer arsenal [Routine Help] I finally got my hands on some accutane (40mg/day) and I definitely know I'll need extreme moisture to get through the course. I already slap layers of cerave and sometimes aquaphor on before bed and I'm still slightly dry even without the use of tretinoin. Right now I'm using the basic cerave lotion, which I love but may be too light, and have tried the cream, but I feel a slight tingle when I use it and I think it might have something my skin dislikes (alcohol of some kind?) even though I haven't noticed any actual negative consequences from using it. Now I just need cleanser, a heavy night cream, body lotion, and lip product recommendations from seasoned accutane survivors. I like the idea of oil cleansing and following up with a very mild moisturizing cleanser (like the nonfoaming cetaphil stuff). If you have advice on body wash and stuff in case it gets that serious, I'm all ears. All tips and anecdotes help!<QuinnReed>: Hyaluronic acid serum is a must. La Roche Posay Cicaplast lip balm is awesome. <uniqueinalltheworld>: You know, I always assumed La Roche Posay was out of budget for me because apparently my dumb Alabamian ass heard something French and was like \"that sounds *fancy,* I can't afford it!\" Turns out I can get my hands on some of their stuff at target for pretty reasonable prices. I can probably spring for the lip balm. Haha<QuinnReed>: Hehe. Yeah some of the bigger lotions are a tad pricey but the lip balm is awesome even if it’s a few dollars more than just regular lip balm. It has good skincare ingredients that actually help fix your moisture barrier! <uniqueinalltheworld>: Awesome, I use a balm by bite beauty which works really well, but is thick and difficult to apply without using my fingers. And it's annoying to have sticky lip balm hands. Looks like the la roche posay one will be way more convenient to use <QuinnReed>: Yeah just FYI the little tip is quite small. Depending on how big your lips are you miiiight have to rub it in a little. I haven’t got massive lip but certainly not thin so.", "num_messages": 6, "avg_score": 1.1666666667}
{"start_date": "1543600376", "end_date": "1543625945", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 2, "text": "<herbertbailbonds>: [Acne] Accutane safe for 20 yr old Male in College? [removed]<_ihavemanynames_>: Hi there, This subreddit is not a substitute for a doctor's appointment, and it seems like you're treating it that way. You've already received an [official warning](https://old.reddit.com/r/SkincareAddiction/comments/9o5bbd/acne_supplement_stack_for_acne_safe/) for Rule 2. This is your final notice; continuing to try to get medical advice here instead of from a medical professional will result in a ban. If you'd like to talk through your treatment options, please make an appointment with your doctor. If you don’t have easy access to health care, try one of these resources: * Free or low-cost clinics (http://nafcclinics.org/clinics/search in the US) * Student medical services * Nurse practitioners (http://npfinder.aanp.org in the US) (Most insurance companies have a phone number you can call to speak with an NP to help if you can’t get an appointment or aren’t sure whether you need one) * Online dermatology services * /r/AskDocs - a sub which uses verified flair to mark medical professionals <herbertbailbonds>: How is this related to using it as doctor when I ask about a common acne treatment. So hypocritical", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1544735375", "end_date": "1544762636", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 69, "text": "<loscilprimitiva>: [Research]Retinoic acid more effective than glycolic acid, mainly in the cell renewal and the exfoliation process because it decreased the horny layer thickness. <chemgirlie>: I've found that glycolic acid is better at rapidly smoothing the skin. If you have recent acne, it's good at flattening the acne -- turns mountains into molehills. It's not that good at actually fading discoloration. Retinoids are definitely better at pigmentation issues. I tried glycolic acid exclusively for a couple months and my hyperpigmentation didn't really fade well, but I felt it resurfaced my skin better. I feel people looking to fade PIH using acids are going to be prone to go overboard because they are looking for results that aren't going to happen. The scientist in me support these findings and it is personally true. Combination of both is probably the best. <wildyogini>: have you used both together? are they both best used at night? in any particular order?<chemgirlie>: Both are best used at night, but NOT on the same nights. If you've never used them, I would do something like 1x tret and 1x AHA a week. I would do the tret and the AHA three days apart (with the AHA 'first'). If my skin did well, I would bump it up to something like tret 2x week, AHA 1x a week. I would also be very diligent with sunscreen everyday, and really work on moisturizing my skin on the days I wasn't using an active.<wildyogini>: thanks! I have only used glycolic acid, but I am interested in retinol because i have pigmentation.", "num_messages": 5, "avg_score": 13.8}
{"start_date": "1543625148", "end_date": "1543630128", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 97, "text": "<hippybones21>: [Acne] 3 years ago my skin was “healed”- 1 month ago it started all over again.. now on the right is me tonight. 26 yrs old &amp; staying in on a Friday night because I can’t find a way to cover this with makeup no matter how hard I try.. <lrp253>: Any hormone related differences? Like: Having a sexual relationship after not having one for a long time? Birth control changes? <hippybones21>: Nope, no birth control ( never agreed with my system well ) &amp; been with the same partner for over 3 1/2 years. <lrp253>: Hmm. Look into the Vitex supplement (read the reviews on Amazon). It’s used for regulating your cycle (most people do it to know when they are ovulating) but it can balance and help with acne. <hippybones21>: Well me and my boyfriend are actually trying to start a family. Does it hinder / cause any issue in that department? I’ll do my research and check into it obviously too <lrp253>: No it helps! <hippybones21>: Sign me up! Lol Thanks, I’ll definitely be checking into that.", "num_messages": 7, "avg_score": 13.8571428571}
{"start_date": "1543606970", "end_date": "1543612646", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 151, "text": "<garbagedog666>: [b&amp;a] feeling happy with my skin's progress. stubborn PIE is finally fading! <Frankobanko>: What do you think helped your PIE go away? I'm struggling with that myself<diralopes>: Following this. <Frankobanko>: Thanks for that input but appreciate OP addressing my question. I was wondering if she felt a specific step in her routine targeted PIE. <diralopes>: I just meant I was interested in that as well and was about to ask the same question eheh ;)", "num_messages": 5, "avg_score": 30.2}
{"start_date": "1543453200", "end_date": "1543473313", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 69, "text": "<klaudippidy>: [skin concerns] It IS pityrosporum! And something else as well. If you’re at your wirs end, I highly recommend getting a skin biopsy done! Now curious about your opinions. Update since [this](https://www.reddit.com/r/SkincareAddiction/comments/9yqrce/skin_concerns_update_after_the_appointment_my/?st=JP1QY15V&amp;sh=0b1f395ehttps://www.reddit.com/r/SkincareAddiction/comments/9yqrce/skin_concerns_update_after_the_appointment_my/?st=JP1QY15V&amp;sh=0b1f395e) post. I posted countless questions on this sub, just check my post history. My derm was confused and so was I. After 2 years NOTHING has worked and my skin looks like all sorts of things - seb derm, acne vulgaris, eczema, rosacea, subtype 2 rosacea, PIE etcetcetcetc During my last derm visit I dropped the topic of pityrosporum possibility. She was reluctant and dismissive. I was fed up with everything she ever perscribed me with no improvement, so much money wasted on pills (I’m off of them after 18 months!) and appointments and perscriptions. I was doubtful since the beginning as she would diagnose me with just her eyesight. But I was done. She said she’d let me come in a week to have skin biopsy done to see the fungal possibilities. I WAS RIGHT!!! There has been pityrosporum found upon examining the sample of my skin under the microscope as well as demodex! These two fuckers are finally out in the light! It’s just step one but after 2-3 years of blind guessing and not being sure of the fuck was my skin so resistant to everything we finally know the cause!! Just PSA: the sampling was uncomfortable. I felt like the lab guy literally scraped my skin to the meat with his little knife. He scraped the inside of my cheek and the side of my nose to get the sample. I was told not to moisturize or use anything but cleanser three full days prior so the results would be accurate. I felt like my skin was bleeding and out in the open after the process - when I looked in the mirror it was slightly red and the small papule was minorly damaged so it was a relief! Now that I’m finallyyyyyyy sure of the root cause, I’m curious of your opinions on my perscriptions to treat pityrosporum and demodex my derm has given me. I’m supposed to use 20% miconazole cream and a topical antibiotic that I dont remember the name of for theee weeks on affected areas (inner cheeks and t-zone and wherever I possibly get a blemish), every night in turns. So mornings would be cleanse &amp; moisturize (and spf if I’m out) and nights would cleanse &amp; be those two things, one night miconazole, other night topical antibiotic for three weeks. Then I’ll have a checkup. Does that sound good? Tbh I’m scared as I’ve had no successes all this time from things perscribed by my derm, lots of which had fragrance and esters and other nonesense. I wasn’t told what to use after those three weeks, guess we’ll disciss that at the checkup. But I’m afraid to even start those two perscriptions. Do any of you have experiences with pityrosporum and/or demodex and miconazole/antibiotic to treat them? I thought about just getting sulfur self-initiatively. Either from the get-go (aka not even trying the perscriptions) or using it after thise 3 weeks for maintenence. Opinions??<PollyM16>: I haven't gone through your previous posts but I have a question - have you been around puppies at all?<booster-and-snifits>: I would be interested in knowing why you ask. This may answer a few of my skin issues as well. <PollyM16>: Demodex is pretty much universal and all baby puppies have an overgrowth of it until their immune system starts to mature and, of course, demodex has long been suspected in rosacea. I didn't have rosacea until my first litter. Sometime after they were born I noticed my skin looked different and when the redness didn't go away and started looking worse, I went to my PCP. She's not a derm but she is really good on skin issues. She diagnosed rosacea. I got the metrogel but I didn't think it helped, I stopped using it. But eventually the rosacea went away. I don't know why it went away and I can't even say when. My first litter was in 2005, I've had two more since without the redness coming back. Maybe I'm taking better care of my skin, maybe my immune system learned not to react, I don't know. My theory is that since canine demodex isn't the same as human, it was going to go away eventually. And I've always suspected that I'm part dog, so I was susceptible to the puppy demodex. ;-) Right now I'm pretty sure I have an overgrowth in my eyelashes. It's normal for most of us to have demodex, it's the overgrowth that causes problems (my eyelashes are itchy). I'm curious if the OP was around puppies and maybe got demodex from them (we all put puppies up to our faces, don't we?), which started her problems. Since it's normal to have demodex, I wonder if the scrapings showed an overgrowth or a normal amount? And, of course, demodex are mites. Tiny creeping bugs. The pityrosporum is a fungus. I was prescribed metrogel (metronidazole, for rosacea) and the OP has miconozole. Metronidazole is an antibiotic and antiprotozoan; it's used to treat rosacea, yeast infections, giardia, and many other things. Miconozole is an antifungal used to treat pityrosporum and other things (athlete's foot, yeast, ringworm) according to WebMD (I just looked it up, I'd never heard of it before tonight). klaudippidy, I think your derm is concentrating on the pityrosporum, which is probably the right thing to do. The demodex were probably on your skin anyway. Maybe you have an overgrowth of demodex but maybe that's because of the pityrosporum. I do not think sulfur is a good idea! It is very harsh and your skin needs to heal. Your immune system has to help get rid of this stuff and sulfur is NOT going to help. Just my musings. I wish you good luck. I think you should follow your derm's advice and not go off on your own on this. In three weeks, I hope you get good news! By the way, do your eyelashes itch? This just started yesterday and it's bugging me! ;-)", "num_messages": 4, "avg_score": 17.25}
{"start_date": "1544760797", "end_date": "1544785346", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 17, "text": "[deleted]: [Skin Concern] is this Keratosis Pillars? (On legs, chest, &amp; arms) [deleted]<sofiawithanf>: no idea! ive been getting bumps like the 1st and last photo on my legs and its often worse for me in the winter. <primatesandme>: Could be a sign of dehydration--started using lotion with Urea and it helps a lot.", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1544759644", "end_date": "1544797936", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 6, "text": "<KissofValkyries>: [Product Question] drunk elephant Anyone used the DE skincare line before? What do you like and not like? How was the experience and did it make a difference on your skin at all? I’m considering it. Thanks. <pk2050>: I used the lala retro moisturizer and it was nice...but not good enough to justify the price. I get more out of a $10 tub of CeraVe moisturizer! <KissofValkyries>: So I’ve tried CeraVe but like it’s too thick for me, I’ve tried the entire line. The regular lotion, and am and pm one. And I find it to be really thick, my skin would be oily at the end of the day. I have combination skin, and cerave only work if I wear it at night, but for work, it’s a little too oily for me.<pk2050>: Gotcha! Then you should probably give DE moisturizer a try. For me, it was very light and not at all moisturizing. I have dry skin and DE didn't do enough. But since you have it combo, you may like it. If not, you can always return it :)", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1542088928", "end_date": "1544806963", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 16, "text": "<saga___>: [Product Question] Attention all Curology users! Is the new base formula pilling for you? Because it is for me and I don't know how much longer I can take it. It's ruining the product for me, honestly, regardless of how much Curology has helped to clear up my acne. The only unusual thing I'm doing is applying it over a hydrating toner (Hada Labo Gokujyun Premium). I need to try next time to apply it directly on bare skin, but they should have formulated the new base to work with other products anyway! Help. Am I the only one experiencing this?<huffliest_puff>: What else are you using it with? I apply mine over hada labo premium too and I don't get any pilling<saga___>: That’s literally it. I don’t get it. What’s in your formula? Mine is niacinamide, zinc pyrithione, and clindamycin. I’ve wondered if only certain variations cause pilling<siderealcowboy>: Do you mind if I ask you what your skin was like pre-curology? I just ordered my first bottle and have been prescribed the same ingredients — I’m so nervous and really hoping it’ll help!<saga___>: My skin was super angry, dehydrated, and red. Had a huge breakout of whiteheads at the time. Would get cystic acne and pustules every couple days. I’ve been dealing with acne for about five years and for whatever reason I had never done enough research to find out how to help it. Luckily I came across this subreddit which I think pointed me toward Curology and I seriously can’t say enough how much it’s changed my skin for the better. I’m not 100% clear yet I’d say but I’m really close and it’s been less than 6 months. I don’t wanna speak TOO highly of it because there’s a good chance it won’t be that same level of life-changing for everyone, but it really has changed my life. Main thing is that my skin doesn’t hurt anymore. That’s the best part<siderealcowboy>: This does make me feel better — the “angry, red, dehydrated” is real, and the painful, under-the-skin bumps that never go away (I don’t think they quite qualify as cysts for me, but they certainly hurt and never want to leave). I’ll take your reservations for sure (I appreciate them, after a long while of “this is an amazing miracle product!” for a whole slew of things that end up not working), but this is making me less nervous and more looking forward to it. Thanks for answering, and I hope you figure out the issue with the pilling!!<saga___>: Thank you! Best of luck to you and lots of love for your skin :)", "num_messages": 7, "avg_score": 2.2857142857}
{"start_date": "1543554528", "end_date": "1543649500", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 14, "text": "<AutoModerator>: [Personal] It's Casual Friday! General Chat thread - Nov 30, 2018 Today is Casual Friday! We allow Humor and Cringe posts today, and post the General Chat thread to have a nice chat with each other :) In this thread, you can share anything you like with the sub; from skin victories to personal drama to cat anecdotes (though pictures will be mandatory for the latter!). **If you need skincare advice, please post in the Daily Help Thread stickied on the front page.** Happy Friday! ---- *This thread is posted every Friday at 12:00am ET.* <onigiri815>: I've managed to make it to season 3 of *Hinterland* and have no fucking clue what has happened so far... or even in this episode. What.<jacquelynjoy>: Okay so I loved the first season of Hinterland and barely remember the second. In season three I went \"what in the FUCK is going on?\" so many times that I just gave up, which is sad because it's exactly the kind of moody creepy dark British weirdness that I love, plus Welsh accents which make me happy. If you liked it, I fully recommend Broadchurch, Shetland, and Vera...and ten others which I will remember as soon as I hit \"reply.\"<onigiri815>: I fucking love Broadchurch but didn't even bother with Season 3 I'm watching Shetland now and really enjoying it but still probably need to rewatch some things I honestly think Hinterland needs to be **watched** I can't be fkn around on reddit and stuff or I miss it all<jacquelynjoy>: Any show that needs to be watched super closely is not going to work for me. I fuck around on the computer way too much.", "num_messages": 5, "avg_score": 2.8}
{"start_date": "1542949656", "end_date": "1543074461", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 22, "text": "<AutoModerator>: NEW OR NEED HELP? Ask here! - ScA Daily Help Thread Nov 23, 2018 If you're new to SkincareAddiction: welcome! This thread is the best place to start if you have questions about skincare products, your routine, and your skin. Our community is knowledgeable, and we want to help you have the best skin of your life! - #Do you have a question? ###Step 1: Read our resources First take a look at our [FAQ](https://www.reddit.com/r/SkincareAddiction/wiki/faq) and [Wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)! They include product recommendations and advice for skin concerns like [acne](https://www.reddit.com/r/SkincareAddiction/wiki/acne), [pigmentation](https://www.reddit.com/r/SkincareAddiction/wiki/pih), and [dehydrated skin](https://www.reddit.com/r/SkincareAddiction/comments/1akqed/dehydrated_skin_what_is_it_what_it_looks_like_and/). Or search the sub using [this awesome website](https://www.narfar.com/r/skincareaddiction). You might find a solution to your problem there! If you can't find an answer, or you have additional questions after reading, please move on to step 2! ###Step 2: Ask for help To give you the best advice possible, our users need relevant information about your skin and skincare. With your request for help please include: * **The issue(s)** you need help with. * **Skin type**. It's OK to be subjective, how do you feel your skin is? Oily, dry? If you need help clarifying, check out [this guide on skin types](https://theacidqueenblog.com/2016/06/23/skin-types-proclivities-and-conditions/) * **Current routine** with the full names of your products (try to separate it in to Morning, Evening, and Occasionally used) * **How long** you have been using your current routine, or product in question * **Anything new** you’ve introduced or started doing that might change the condition of your skin * **Your location** so we can recommend products/services available to you Thanks for taking the time to include your information! #Would you like to give advice? Firstly, thank you so much for helping out our community, without your knowledge and time ScA would not be the same! Some things we'd ask for you to keep in mind: please don't just downvote someone's opinion or response because you disagree. If you can, please take the time to tell them why you think their advice may be incorrect or harmful. It's better for people to understand why something is a poor choice, instead of just being told that it is one. #[Previous Threads](https://www.reddit.com/r/SkincareAddiction/search?q=title%3AAsk+ScA&amp;restrict_sr=on&amp;sort=new&amp;t=all) ---- *This thread is posted every day at 12:00am ET.* <binsz>: Using body sunscreen, should I reapply every 2-4hrs? And on face sunscreen, if I use a waterproof sunscreen and I sweat a lot and I'm not usually under the sun, should I keep reapplying? <Eel-InSnakesClothing>: General rule is reapply for every 2 hours of sun exposure, no matter what. Same rule applies for body and face - skin is skin ;) Reapplication is something I personally don’t bother with unless it has washed or sweat off my body - but I’m lazy. A derm would disapprove of that habit, haha. <binsz>: I sweat a lot that's why I'm looking for a waterproof one. So if I don't get exposed in the sun for 2 hours, I should not bother reapplying?<Eel-InSnakesClothing>: Right, I wouldn’t bother. <binsz>: They suggests for me that I should use Vitamin C, does that mean I look for a cleanser/moisturizer that has vitamin c?<Eel-InSnakesClothing>: Who is “they?” <binsz>: On this sub also, cause I was asking some suggestions to revert back my tanned skin to my natural skin tone<Eel-InSnakesClothing>: I see. The most effective Vit-C is typically in a serum form. The side bar and sub info has some good research and product recs. <binsz>: I am lurking for 1 week and I'm still confused. I also can't order from Amazon which makes my choices not much of a variety since I live in the Philippines.<Eel-InSnakesClothing>: [start here](https://www.reddit.com/r/SkincareAddiction/comments/9uzpth/misc_holy_grail_products_ingredients_week_7/?st=JOVMMU08&amp;sh=b82a4474) Hope that helps. One week of lurking is still really new, so don’t be discouraged! It takes time.", "num_messages": 11, "avg_score": 2.0}
{"start_date": "1542993383", "end_date": "1543626904", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 46, "text": "<Roxiesdancingnutria>: [Shelfie] After nearly 3 years I’ve finally got a nice routine down <Roxiesdancingnutria>: After many years of buying the wrong products because of cute packaging and hype, I’ve finally curated my routine to one with effective (for my skin) ingredients. Skin type: Dry, flaky. I really want to reduce scarring and improve texture. <AM>: I am far too tired to do anything but use a moisturizer and primer <PM>: Klairs supple preparation toner, (newcomer) Pyungkang yul toner, Rosewater toner (Garnier or Mario Badescu), Hado labo gokujyun, The Ordinary ascorbic acid, Benton snail bee high content essence, Innisfree green tea eye cream, Cerave moisturizer, Treclin 1% gel, all topped off with Aquaphor. I also use the ordinary 30% aha 3 times a week and the tony moly floria peeing gel if I’m very scaly. There’s a lot of toners in my routine because I haven’t been able to find a hydrating essence or serum that I’m interested in. I’ve recently started incorporating the Innisfree green tea seed eye cream and I’ve found it to be just okay. It’s helping to keep that area looking bright but I still have a lot of dry skin under my eyes at the end of the day. The Hado Labo gokujyun is my holy grail for hydration. I alternate the rose toner and the Hado Labo three times each in my toner step. I use the rose toner just to give the hado labo something to cling to. The Aquaphor has been the best godamn purchase to keep my dry skin in check. I slather this on as a final step. It used to somewhat difficult to find in Ireland but it’s more accessible now and I find it superior to vaseline which is cumbersome to apply. I’m still prone to impulse purchases (the Mario Badescu spray) but I’ve been keeping it consistent for about a year now and I’ve been trying at this skincare thing for about 3 years. Small skin comparison <https>://imgur.com/a/tDsSQLR<LintPlastic>: I love your comment about the am. Because I totally feel the same. 5 days out of the week I have to wake up at 4:30/4:40am. I'm way too exhausted to do anything but wash my face and moisturize it half the time. I try to use toner or something else but most times I'm just barely awake. I've been wanting to try the Innisfree green tea cream. You think it's okay but do you think it's worth the buy?<Roxiesdancingnutria>: The innisfree is fine, it’s definitely made my eye area smoother but I wouldn’t say it’s particularly moisturizing. Doesn’t seem to give me the bright under eye look. It was relatively cheap though and there’s a lot of product in the tub so I’m going to use it up. Oh and it isn’t causing any under eye milia so that’s very much appreciated!<LintPlastic>: Thanks for replying!", "num_messages": 5, "avg_score": 9.2}
{"start_date": "1544760340", "end_date": "1545102187", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 21, "text": "<Paradoxes12>: [Misc] Just got the aztec secret indian healing clay I got the product any recommendations on how to use it like how often etc Thanks <dmorrison666>: Would pomegranate vinegar work the same as ACV? That’s all I have right now lol <37472610>: youre supposed to use acv with the mother plus i don’t know if pomegranate vinegar would make it any more irritating <Paradoxes12>: &gt;ACV With the mother?<37472610>: yeah im pretty sure it’s from the process of making vinegar itself, it’s just the strands in the bottom of the bottle bragg’s is a good brand to use", "num_messages": 5, "avg_score": 4.2}
{"start_date": "1544724448", "end_date": "1544786324", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 9, "text": "<MindMyOpinion>: [Routine Help] Oil cleansing method. Adjustment or breakout? So, before I begin, I want to thank everyone on this subreddit because I have learned so much through all of your posts. So much to the point that I think I know more than my dermatologist (only kidding, but sometimes). Anyway I'm a 25 year old male who had amazing clear skin up until last yr. I initially started to break out on my cheek with single large painful cystic bumps taking weeks to heal. Earlier this yr I decided to start using stridex pads and made the mistake of not easing into it and instead just starting to use them 2x a day from the start. I powered through the purge but my skin started to burn anytime I put water on it and I soon realized I was over-exfoliating. I took a break from all facial treatments for 2 months and last week started the oil cleansing method using grapeseed oil and just bought argon oil to start using as a moisturizer. I have done months of research and I know there is an adjustment period when it comes to OCM. However, I'm starting to get concerned because I seem to be getting these very small bumps since starting OCM, but my bigger cystic acne is actually resolving. I just wanted to know did anyone with success have a \"purge\" (I know that idea is only used for actives) or period where closed comedones came to head? I have a small number of closed comedones come to head and some grits as well so I'm torn as it seems to be working but it also seems to be making things worse. I would love to hear from people who found success with OCM and went through an adjustment period. Thank you very much to anyone who replies. I appreciate it all.<lyndsbae>: My face “purged” for about four weeks with the oil cleansing method. I have dry skin though, and my biggest concern was my painful dry patches. When my skin was “purging,” it seemed like I had blackheads everywhere. It eventually went away, and now my skin feels great after every cleanse. If you can wait through it, you may really like oil cleansing.<MindMyOpinion>: I think I will stick with it for at least 30 days and see how it goes. Every morning I wake up and my skin looks amazing but when I get super close to the mirror I see really small bumps. I know in the real world people won't be that close to me, but I also know that's not normal. Anyway, thank you so much for the input.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1544762580", "end_date": "1544799998", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 18, "text": "<whats_a_weekend>: [Routine Help] Dry Skin and Vaseline Buildup I have really dry skin with hormonal acne. I'm currently using Differin, so it's also a bit sensitive. This winter, I started using a heavy duty moisturizer and Vaseline. Lately I've been noticing this gross buildup on my cheeks of skin flakes and maybe moisturizer/ Vaseline. The only way to get rid of it is to use my Clarisonic, which isn't great on my sensitive cheeks. Do I need a better cleanser? Morning Routine: Wash face: CVS brand gentle cleanser (Cetaphil dupe) Hada Labo Skin Plumping Gel Cream Trader Joes Nourish Moisturizer Elta MD tinted mineral sunscreen SPF 41 Evening Routine: Wash face: CVS brand gentle cleanser (Cetaphil dupe) Hada Labo Skin Plumping Gel Cream Trader Joes Nourish Moisturizer Differin (3x week) Ponds Dry Skin moisturizer Vaseline<SilverStilettoStreet>: Have you tried oil cleansers and toner?<LikesGreenTea>: Seconding this! In the AM, use an oil cleanser to remove Vaseline, then follow up with a regular cleanser to wash away the residue. In the PM, use an oil cleanser to remove sunscreen/makeup, then follow up with a regular cleanser to wash away the residue. Popular oil cleansers: [https://www.reddit.com/r/AsianBeauty/comments/6eyr8h/discussion\\_or\\_discovery\\_summary\\_of\\_popular\\_1st/](https://www.reddit.com/r/AsianBeauty/comments/6eyr8h/discussion_or_discovery_summary_of_popular_1st/)<whats_a_weekend>: Thanks for the link. I have used the Hada Labo before, so I think I'm going to give it a try again.", "num_messages": 4, "avg_score": 4.5}
{"start_date": "1541099789", "end_date": "1544990433", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 63, "text": "<ihave15fansinmyroom>: [acne] My skin has gone from left to right in just 5 months. I went to a dermatologist and what she prescribed made it soo worse and sooo inflamed. It’s itchy and literally aches all day long. I feel like everything makes it’s worse and nothing helps I don’t know what to do. routine in the comments <nodiggity__>: My skin looks exactly like yours! Went from crystal clear to itchy, painful, inflamed acne in less than 2 years and nothing has helped me, only made my acne worse. I suspect mine is FA related from browsing reddit and coming across the Simple Science Skincare blog. Just curious, have you tried the FA routine yet and if so, any improvements at all?<ihave15fansinmyroom>: I used the vanicream facewash and saw a HUGE difference in my forehead acne, literally over night the little bumps went away. I used cerave moisture cream. And it helped my really really dry spots. The ones on my chin, not so much though. For those I basically stopped everything I was doing. I stopped taking vitamins, stopped birth control, stopped my probiotics, switched detergents and stopped wearing makeup. And those got soooooooo much better. My face doesn’t itch like it used to and the acne is not swollen and it doesn’t hurt like it did. I’m still planning on going to the derm for it. I have probably 75% less acne but it’s still more than most people. <nodiggity__>: Wow 75% reduction in 1 month is amazing! Congrats on that, I am hoping - better yet, praying mine is actually FA because I went and bought all the stuff today including detergent so I hope I can see a change like you too. I did a Head &amp; Shoulders mask last night, and I found that all of the red bumps came to head in the morning and I was probably 90% less itchy so fingers crossed its a good sign. I'm also thinking of stopping all my supplements too (currently on Probiotics, Zinc, Magnesium, &amp; Vit D). And I want to go to a Derm just to get a culture and confirm if it is really FA or not. <ihave15fansinmyroom>: The ones on my chin were big and INCREDIBLY painful and they’re practically nonexistent now, just small little Whiteheads and I still have small ones on my forehead but again whiteheads and nothing they were! I hope everything goes well! I think the thing that helped the most was the detergent. I got dye free and scent free and the next morning my skin was less painful and red! <nodiggity__>: Wow amazing how 1 change can make such a difference! My case of acne is literally identical to yours. I've been doing the Nizoral/Head &amp; Shoulders mask for 2 days and my itching is gone and my forehead is getting smoother. And I washed everything with a clean detergent last night. However, I woke up with huge painful bumps under my chin again this morning so it really set me back. Have you been doing masks every night? What skin product do you think has made the most difference to you? <ihave15fansinmyroom>: I got an exfoliating mask, the ole henriksen 2-1 polishing sugar mask (I got it on sale at tj maxx lol) but exfoliating has helped a lot too! I like the dermae exfoliate as well. I try not to do mask just bc I found a routine that works and I don’t want to anger my skin lol. The vanicream face wash really helped! I’m now using the la roche-posey effeclar purifying foaming gel cleanser for oily skin and it’s helped!! The best advice I have for you is to give it time, I was so focused on my acne that I think the stress made it worse! I hope you find something that works for you!<nodiggity__>: Ya stress is a huge factor for me. I stress about my acne and then I get more, so it's a neverending cycle. :( I'm two days in with masking with the H &amp; S and Nizoral and I feel like my skin is kind of better but also kind of worse. Like the existing acne I have is smaller (except for my chin which is huge and painful), but I feel like more bumps have surfaced. Did you go though some kind of purge in the beginning? I am not sure if I should continue with this or stop. Sorry for all the questions, its just your acne is so so similar to mine so it's nice to hear some feedback <ihave15fansinmyroom>: It’s okay! Maybe don’t put the H&amp;S and nizoral on your chin? That may be making it worse. Also I used pure aloe Vera gel as a mask to soothe my big cystic pimples and take the pain away. I don’t remember that bad of a purge, my acne got smaller and less painful immediately. I think less is more in the beginning just to get your face used to it!", "num_messages": 9, "avg_score": 7.0}
{"start_date": "1543601055", "end_date": "1544765209", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 11, "text": "<BisonBeastie>: [Routine Help] Halp! Dehydrated, red, acne prone. See my info and routine in comments. <Ioanna_Malfoy>: What products are you using? What does your current routine look like?<BisonBeastie>: See my comment after the picture. I didn't have it ready after I made my initial post.<Ioanna_Malfoy>: I would recommend trying a low pH cleanser ([here](https://www.reddit.com/r/AsianBeauty/comments/2mjjtv/the_rasianbeauty_cleanser_ph_list_and_ph_faq/) is a good resource about them). In short, the natural pH of our skin should be 4-5.5, the slight acidity of our skin is one of the mechanisms that help prevent the growth of harmful bacteria on your skin. Cleansers with a pH level of 5-5.5 are generally what I have seen recommended. There is a spreadsheet list available in the resource that I linked which compares the pH of a bunch of different cleansers. The one that I personally use is the Missha Near Skin pH balancing cleanser, it's not very widely talked about but in my experience, it has been gentle and helped clear up my breakouts. &amp;#x200B; I have also head a lot good things about [Avene](https://www.aveneusa.com/) products for sensitive skin. Their brand has a couple product guides and a \"diagnosis\" tool that you might find helpful to look at and figure out what looks best from there: [Anti-Acne Routine Guide](https://www.eau-thermale-avene.ca/en_CA/news/201609081118/a-guide-to-help-you-discover-your-skin-type-and-choose-the-anti-acne-routine-thats), [Diagnosis Tool](https://www.eau-thermale-avene.ca/en_CA/diagnosis), [Care Programs](https://www.eau-thermale-avene.ca/en_CA/care-programs), [Information about how they define skin types](https://www.eau-thermale-avene.ca/en_CA/experts-skin/sensitive-skin) &amp;#x200B; Here are a few other threads you might find useful: [product reviews for acne and dehydration prone skin](https://www.reddit.com/r/AsianBeauty/comments/8ucjih/what_i_learned_from_ab_so_far_and_a_long_list_of/), [toner pH list (if you don't want to change your cleanser yet)](https://www.reddit.com/r/AsianBeauty/comments/3e39ly/do_we_have_a_toner_ph_list_and_faq_and_if_not_can/), [thread about Avene products](https://www.reddit.com/r/SkincareAddiction/comments/9wrqyz/product_question_avene_best_products/) &amp;#x200B; Hope this helps, let me know if you have any more questions. Sorry, it was so non-specific : )<BisonBeastie>: This is really helpful, thanks! And great direction with the links. <Ioanna_Malfoy>: Hope to hear an update at some point about how your skin journey is going (you know, for secondhand hope through somebody else finding success even when I’m still looking for it)<BisonBeastie>: So I changed my cleanser to the Vanicream Gentle Cleanser but I'm finding that it doesn't take makeup off very well. I tried some different oils but I'm having to rub the oil (cold cream, Vaseline, or coconut oil) off my skin to really get the makeup of to cleanse :( leaves my skin red and raw feeling. I guess I could do no makeup but I feel ashamed of my skin rn. Vicious cycle. I also changed to the CeraVe Moisturizer in a tub and really like the feel of that. Still using Vaseline on top of that at night and loving the results. I'm still breastfeeding which still affects my hormones a lot so I'm sure my recent breakouts are a result of that. I'm sorry you are having issues too. I get so sick of having to figure out what I'm doing wrong.<Ioanna_Malfoy>: I hope it works out for you and congrats on the baby! Also for taking off makeup you might enjoy an emulsifying oil cleanser. You put it on your face dry, rub in to dissolve makeup, add a little water, keep rubbing as the oil emulsifies, and rinse. It should remove you makeup and wash off clean without any scrubbing! The main thing I’ve had to watch out for is getting one that doesn’t sting my eyes. A really popular one is the Banila Co. Clean It Zero. I’ve tried the Nourishing version and enjoyed it. The only thing I don’t like is that it’s a solid balm and is stored in a jar. But that’s mostly only an issue for me because it’s a bit hard to store the jar within armsreach from my bathtub. But because of that I’ve been using the Klavuu Pure Pearlsation Divine Pearl Cleansing Oil which is a liquid that comes in a handy pump bottle. I’ve really enjoyed it (it also has a subtle vanilla scent that I find relaxing) although it’s a bit more expensive than the Banila one. There are tons of other good emulsifying oils too, those are just the two that I’ve tried and liked. I’m also a frustrated with trying to figure out my skin. Six months ago, I had a few occasional zits but my main problem was some scarring from adolescent acne. But now I have constant red, angry break outs on my cheeks and jaw. The precipitating factor was a terrible cleanser that I used for about 3 months (I have no idea why it took me that long to realize what was the problem) but even since I quit using that cleanser about a month ago, my skin still hasn’t calmed down. :/<BisonBeastie>: Is it like dry and angry? That sucks. I used to try different products before I found this subreddit and most of the time I would try a shit load of new things at once and never be able to figure out what was causing the issue. I'm learning to be patient and try one thing at a time. The latest has been applying moisturizer in tiny circles with two fingers (read that somewhere on SA) so that your skin absorbs the moisturizer instead of just sitting on top of my skin. It's actually working and my overall face texture is improving.<Ioanna_Malfoy>: My skin naturally tends more toward the oily side but I’m pretty sensitive to products. So most products designed for acne are too harsh for my skin and it goes dry and flaky. Since I’ve been working on my acne recently I’ve been working to keep my face moisturized, I’ll have to try that technique! Luckily, my break outs seem to have finally started becoming less severe (but I don’t know which product to attribute it to because I’ve been desperately trying so many things)! This subreddit and my bad experience with the cleanser seem to have fueled an unhealthy obsession with skincare products. What do I spend my money on? Skincare products. What did I ask for as my Christmas gifts? Skincare products. What did I buy people for their Christmas gifts? Also skincare products.", "num_messages": 10, "avg_score": 1.1}
{"start_date": "1543238558", "end_date": "1543408426", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 2205, "text": "<miasews>: [Shelfie] Thrilled to say that with this I’ve managed to kick my acne and scarring for good. <R41n80wR04d>: What do you think of the Revolution peeling solution and the hyaluronic acid? Do they sell them in Superdrug? I'm thinking of trying them as it's easier to buy in store rather than ordering online from The Ordinary. <miasews>: They’re really good! And they’re in Superdrug. I’ve just edited in mini reviews for them on the routine comment. The peeling solution is STRONG and also don’t get it near your eyes (burns) or lips (tastes absolutely horrific) but I love using it because the afterglow is REAL. SFs around the corners of my mouth? Gone. Blackheads on nose? Gone. Textured bumpy bit under bottom lip? Gone. Stubborn closed comdedones on chin? Gone. I always follow up the peel with lashings of hyaluronic acid and rosehip oil and frankly I look excellent the next day.<tinbeancanofdeath>: Whats the price lile compared to TO? Really hope my local superdrugs stocks them!<miasews>: Pretty much the same - I think they’re all £5-8.<tinbeancanofdeath>: Ohhh damnnn, sorry bank account. Thank uuu<sgehig>: I don't think the ingredients are all that similar though.<DaLastMeheecan>: would that be a problem ? I would love to try this but not sure which to use<sgehig>: They've basically made products that look the same but have nothing in common.<DaLastMeheecan>: Hmmm If I have sensitive/oily, which one should I use? They are both the same price where I live. <sgehig>: I would basically say don't use the Makeup Revolution ones at all. They have a lot of unnecessary not great ingredients.<DaLastMeheecan>: So TO is a better choice?", "num_messages": 12, "avg_score": 183.75}
{"start_date": "1544762961", "end_date": "1544991944", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 8, "text": "<sapphocating>: [Routine Help] Is this a normal reaction to Differin or should i take it easy? Hi guys! I have blackheads, SFs, huge pores &amp; naturally oily. I've been super spoiled with a naturally resilient skin with zero adverse reactions to anything I throw at it minus overexfoliation. I revamped/simplified my routine getting ready for Differin. Everything was tested before starting. Even with my tough skin I started slow (every other night at most). I'm on day number 5 of actually applying the retinoid. As of day 3 applying (1 week in), my cheeks started getting really inflamed when I put on my CeraVe Baby Moisturizing Cream. I use the Baby version bc it's mattifying &amp; light enough for daily use so I can get my barrier protectant in the AM without the oiliness of Stratia LG, but lately it BURNS like a MF on my cheeks only &amp; they turn bright red. I thought this was normal but it's hurtsss a lot, but then goes away after a couple minutes. I also started contact washing with Differins BPO wash per this subs suggestion for the purge. I'm seeing some peeling &amp; flakiness as expected, but do you think it's the CeraVe itself?? I use CeraVe foaming wash &amp; Equates hydrating wash dupe but they don't burn? Please help! Last two days I skipped exfoliating or Differin &amp; just moisturized in hopes of cooling down but it still happened. Routine in comments!<LikesGreenTea>: You only apply Differin to your T-zone, but your cheeks are burning? It sounds like you're having a reaction to the Cerave cream. I'd stop using it.<sapphocating>: I'm sorry, I should mention I also apply it to my cheek area near my nose. It definitely seems to correspond with where I put the Differin in the middle of my face <LikesGreenTea>: Ah ok. In that case, cut back on the frequency of Differin use. Instead of every 2nd day, try every 3rd day.<sapphocating>: Thank you for your suggestion! I did a raw honey mask &amp; slathered my face in aloe directly from my aloe plant for two days and it seems to have corrected itself. I think I was sensitive from overexfoliating with the BPO &amp; Differin at the same time right away, especially bc I got a cystic pimple on my chin for the first time in almost a year. Nothing hurts anymore thankfully. I will slowly re-introduce Differin every 3 days for now and see how it goes", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1543597121", "end_date": "1543615382", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 224, "text": "<Sweet_Tangerine50>: [Humor] When you’re showering at a friend’s place and all they have is Apricot Scrub. <HuggyMonster69>: I love that stuff, keeps my butt nice and smooth, and actually helps quite well with kp <Edit>: not going on my face unless you pay me though <Minimal_minimal>: Why not your face? I use it with pretty bad results. Should I avoid it?<girlbones25>: I avoid it because it has ground up walnut shells and depending on the sensitivity of your skin they can create micro-tears which doesn't sound good. Then again I have read that dermatologists who were asked about the micro-tears said that skin is resilient and able to heal itself. I just don't know why you'd need something so harsh though when there are plenty of better chemical and gentler physical exfoliants. I trust the Atlantic and here's [an article on St. Ives specifically.](https://www.theatlantic.com/health/archive/2017/01/i-dont-want-no-scrubs/512237/)<Minimal_minimal>: Hmm, interesting. Maybe I should get a chemical exfoliant instead... Any advice? <girlbones25>: Only if you think your skin needs it...texture concerns, closed white heads? Regular old red box stridex (depending on where you live, if in the US, should be easy to find) has helped my CC's and KP a lot! I'd start at that lower level than say getting a peel at 30% strength right off the bat. I feel like there are a lot of people on this sub who have been so helpful and knowledgeable about what to use but they probably get advice fatigue at this point, hehe, so I try to share the minimal info. that I've picked up. The sidebar has great recommendations for exfoliants as well.<Minimal_minimal>: Thank you so much for sharing that. I no very little about how to take care of my skin. I'll add a picture to the forum to get accurate help. I'm surprised and happy how helpful people are in this sub!<girlbones25>: My pleasure to help! It's a journey but you're ahead of the game! Seeking help in a forum like this and doing research is the way to go. I initially made the mistake of just buying anything that looked flashy when I should have been reading the ingredient list and learning what every ingredient is and does - for me specifically - and to keep track so I didn't buy the same duds over again. You'll find people are willing to help because they in turn will need help as well - it's a good system! :) Good luck with your skin!<Minimal_minimal>: Thank you very much!", "num_messages": 9, "avg_score": 24.8888888889}
{"start_date": "1533368252", "end_date": "1533420558", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 24, "text": "<AthenaSardina>: [Anti-Aging] are there any other ways to get rid of nasolabial folds and marionette lines without fillers? I’m 16 and I had them for few years. Is there anything I can do about them?<devonbeas>: If you’ve had them for a few years at 16 then I’d say it’s the shape of your face rather than aging. I have the same issue and saw a picture of me when I was 5 recently (I’m 36 so it’s a very old picture!) and I had exactly the same lines then. In fact they looked even more prominent then as I had chubby cheeks. Unlike the lines, pigmentation etc I fight to keep away daily I’ve come to accept that those are just part of my face shape.<AthenaSardina>: I guess so. But I’ll never look cute with them.<devonbeas>: Of course you will! Now you know they’re your face shape and not aging look at photos of naturally attractive celebrities (not filler full celebs that look like clones of each other 😉) you’ll see lots of attractive people that also have the same face shape as you. <labellavita1985>: Agree. Sometimes it makes me feel better to look at those pictures. For example Cameron Diaz has had acne but she's so gorgeous. Also Angelina Jolie has a very thin face and it makes me feel better about my very thin face ☺️<devonbeas>: Definitely! I’m sure just being comfortable with who they are and confidence makes them so much more attractive", "num_messages": 6, "avg_score": 4.0}
{"start_date": "1544720107", "end_date": "1544813631", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 4, "text": "<leatherart5>: [Skin Concerns] Is it normal to have fine lines in your early 20s? Feeling kind of distraught. I am a 22 year old girl, whose 23rd bday is next week. Earlier this week, I woke up to notice crow's feet at the corner of my right eye only, and they have not gone away even though it's been a few days. I am diligent about sunscreen, I use an AHA, and I use Vitamin C (the THD form). Never smoked or touched a drop of alcohol in my life. I probably only drink 16 oz of water a day tho (hate water). They are barely noticeable when I use vaseline (if at all), but after washing my face they come back. I have medium skin (NC40 in MAC). I guess it's kind of upsetting because I thought that with the way my family members have aged (people all peg them as 10 years younger than they are, and none have lines at the corner of their eyes), and my skincare routine, I didn't think I would see such lines so fast. It is interesting too because the crows feet on my right eye are literally the only lines I have on my face (no smile lines, \"11\" lines, etc.). Is this from aging? If so, is it possible to reverse at my age? Why do I only have it on one side?<epipin>: This is probably due to dehydration. If it was aging they would come on gradually and be similar on both sides. If they appear after cleansing, that would be my first suspect - it may be drying you out. Try using something gentler. Then hyaluronic acid containing products are great for boosting water levels. And follow with a more occlusive moisturizer. <leatherart5>: So can it go away? Idk it just bothers me because they came on so suddenly (like...overnight) and haven't gone away since.<epipin>: Yes, it can go away. <leatherart5>: How long would it take, especially at my age?", "num_messages": 5, "avg_score": 0.8}
{"start_date": "1544579738", "end_date": "1544703001", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 9, "text": "<rlsleepingbeauty>: [Product question] HG toner recommendations that do not contain witch hazel/alcohol? All recommendations welcome!<violets_will>: Etude House SoonJung Relief Toner! No fragrance, alcohol, or hyaluronic acid (see /u/LikesGreenTea's comment).<rlsleepingbeauty>: Hi thanks for you reply! I’ve seen this one mentioned quite a lot m! Is this considered a hydrating toner or a ph balancing toner?<violets_will>: It's both. It has a pH of 5.5 (same as your skin), but also includes panthenol and madecassoside as soothing and hydrating ingredients. <rlsleepingbeauty>: Wow awesome! Do you use this?<violets_will>: Sure do, I love it!", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1544763410", "end_date": "1544764317", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 4, "text": "[deleted]: [Anti Aging] How can you tell if fine lines are from dehydration or aging? [deleted] [deleted]: you said its on your right eye only. do you sleep on your side? they could be from sleeping on your side or face down.<leatherart5>: I am a huge side sleeper lol, but I have been trying to do that less since I noticed these lines spring up. [deleted]: i have the same problem! its just so comfortable.", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1543587851", "end_date": "1543699488", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 27, "text": "<furiana>: [Selfie] 3 month progress I'm quite satisfied at the progress in making re: redness. I credit the PC AzA + BHA for doing most of the heavy lifting, and also for getting rid of the cystic acne on my chin. (One or two were \"underground\" in the first pic but believe me they hurt!) I've tried lots of products over the past three months, but here's the routine I settled on: **AM** - NIOD CAIS2 - NIOD Survival 0 - Pyunkang Yul Essence Toner - Homemade sheet mask - NIOD Hydration Vaccine - Paula's Choice Azelaic Acid + BHAs - TO Magnesium Ascorbyl Phosphate - Skinceuticals Physical Fusion UV Defense SPF 50 **PM** - Hada Labo oil cleanser - CeraVe Hydrating Cleanser - NIOD Survival 0 - Pyunkang Yul Essence Toner - NIOD Hydration Vaccine - Neostrata retinols for face and eyes - Wait - Cosrx Overnight Mask: rice or honey [IMG]http://imgur.com/gallery/Wk7p12V[/IMG]<HydrationSeeker>: You do that every morning? <furiana>: Yep. For health reasons, I need to do light therapy every morning. It ranges from 30 minutes to 2 hours depending on the time of year. So, I have lots of time to fill! If I had to pare down my morning routine, I'd do this: - Hydration Vaccine if needed during winter - Paula's Choice Azelaic Acid + BHA - Skinceuticals sunscreen<HydrationSeeker>: Wow, light therapy I have a neighbour who gets up and blasts herself every AM. <furiana>: Like... with light or sound?!", "num_messages": 5, "avg_score": 5.4}
{"start_date": "1531320537", "end_date": "1531324130", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7, "text": "<scamandercommander>: [Sun Care] it I start wearing sunscreen now will it reverse some damage already done? I’m feeling really dumb right now. I’m very fair and 18 years old and rarely ever wore sunscreen. I have a lot of freckles and some moles on my face that I’m just now starting to realize could become problems in the future :( I never got bad burns or anything but just looking back at all the summers my skin went unprotected just because I always listened to people who told me “you need to get some sun” is really bothering me. I know it’s pointless to worry because the past is the past. But if I start wearing sunscreen every day now, could my skin improve? Will I end up with a lot of wrinkles and skin cancer due to lack of sunscreen at a young age? <flabberghastedghost>: Better late than never. I didn't start wearing sunscreen daily until I was 20.<scamandercommander>: How’s your skin now? <flabberghastedghost>: I'm only 21. Strangers often think I'm in high school, though that may be due to genetics or because I never wear makeup. I used to go to the pool all the time when I was a kid and get tan (I'd be outside for most of the day and would only apply sunscreen once before leaving the house). However, in middle school I stopped going outside often.<scamandercommander>: What about in your teens? Did you go outside a lot w/o sunscreen? <flabberghastedghost>: I walked to and from school so I'd be outside for a total of about an hour every weekday during non-peak hours. Have you picked out a sunscreen to wear daily? If you are worried about aging you can also look into using other products as well. Tretinoin is the gold standard for anti-aging though it can be costly if it's not covered by insurance (assuming you live in the US). Here is [a video on retin-a for anti-aging](https://www.youtube.com/watch?v=o8l5aAgQxHE&amp;t=) by a dermatologist. Another resource is [this playlist](https://www.youtube.com/watch?v=d4VE_OVhmY8&amp;list=PLyL1L38FXPpu4aSFIGBqSfyOlCB7siTq3).", "num_messages": 6, "avg_score": 1.1666666667}
{"start_date": "1544754150", "end_date": "1544785724", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 14, "text": "<diamondvalkyrie_>: [Routine Help] seems like i have tried everything, nothing works So about a year ago, I had cleared up my skin using Neutrogena retinol products, like the serum and daytime and nighttime moisturizers. Then, I started travelling for six weeks in England/Europe. I’m originally from Ontario, Canada, so the climate and food was quite a bit different. While I was there, my skin broke out majorly. It’s now been over six months since I have gotten home and NOTHING has cleared my skin since then. I stayed with my regular products for a while, then started switching things up to see if it helped. The Body Shop’s tea tree oil products helped bring down my redness, but that was it. I’ve now been on my current routine for about three or so months. My main concerns are acne and scarring. My skin is dry if I don’t moisturize it, especially during winter. I’m still living in cold/dry climate. Here’s my current routine, which is still not giving me the results I want: <Morning>: - FAB Facial Radiance Polish - FAB facial radiance pads - Lush tea tree water toner - Clinique acne solutions clearing gel - Sunday Riley good genes lactic acid treatment - Sunday Riley Tidal moisturizer <Night>: - Spectro cleanser for blemish prone skin - FAB facial radiance pads - Lush tea tree water toner - Sunday Riley Luna night oil Here is what my skin currently looks like on this routine: https://imgur.com/a/NLnCWhL Any advice, product recommendations etc. would be appreciated!<saucylackey>: This looks like you need the help of a derm. Is that possible for you?<diamondvalkyrie_>: It is possible. I’ll just have to get a referral from my doctor to get an appointment with a dermatologist. The process may take a few weeks, as I won’t be able to see my doctor until mid-Jan and then whatever the wait time is for a derm appointment! Will definitely work on getting in to see one. Just not sure what to do in the meantime <saucylackey>: I would definitely encourage you to get the ball rolling on that. Is your forehead clear?<diamondvalkyrie_>: It is! I very rarely/if ever get acne on my forehead and if I do it’s usually just one small zit and not the nightmare that my chin area is. There is some very mild scarring left, but most of that cleared up when I was using a lot of Neutrogena products and it’s hardly noticeable now<saucylackey>: I thought that might be the case. That’s a really strong indication that this is hormonal acne, not product-related acne, in which case there’s not much you’re going to be able to do OTC-wise. It’s probably going to require a prescription or two from a derm. Common treatments include an antibiotic + retinoid, spironolactone, and/or birth control. If I were in your position, I’d be pushing to see a derm as soon as possible, and using a very simple routine with some benzoyl peroxide in the meantime. I like the Vanicream Gentle Facial Cleanser, CeraVe Moisturizing Cream, and La Roche-Posay Effaclar Duo (the U.S. version). I’d also be looking into getting a hormone panel done, just to make sure there’s nothing wonky going on internally. Let me know if you have any q’s.<diamondvalkyrie_>: That definitely makes sense. Does hormonal acne tend to just start happening out of nowhere? I’ve been on the same birth control for a few years now and it didn’t seem to effect my acne at all good or bad. The only thing that changed in this timeline was my travelling, and I got into a new relationship... would that affect my hormones enough to cause acne? <saucylackey>: It can absolutely happen out of nowhere, and it’s important to note that it doesn’t necessarily mean anything is “wrong.” Natural fluctuations in our cycle that are perfectly healthy can cause things to go awry. That being said, I think it would be a good idea to check in with your gynecologist or GP to make sure that everything is balanced internally. All that requires is a quick blood draw, and you can get results very quickly. If you want to try some lifestyle adjustments, 10 minutes of yoga a day is a great place to start. You don’t have to keep it up forever if it’s not your thing—just think of it like a treatment, to be used when you have an acne flare. If you have access to the brand Yogi Tea, their “Green Tea Kombucha Decaf” and “Women’s Moon Cycle” blends are also worth looking into IMO. And of course sleep lots and stay hydrated. Other than that, I think it’s best to stick to a very gentle routine with one active. Benzoyl peroxide is the gold standard for OTC acne treatments, so that’s what I usually recommend. Congrats on the new relationship, that’s wonderful :)<diamondvalkyrie_>: Thank you so much for all of your help! Will definitely be implementing some of your advice :)<saucylackey>: You’re so welcome! If anything else comes up, you know where to find me :) Good luck!", "num_messages": 10, "avg_score": 1.4}
{"start_date": "1537593813", "end_date": "1537835405", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 19, "text": "<Valkyrian>: [Research] Let's talk about Vitamin C as Tetrahexyldecyl Ascorbate. (ex. Sunday Riley CEO, PTR Potent-C, TO Ascorbyl Tetraisopalmitate Solution 20% in Vitamin F...) I want to know all about everyone's experience with this newer type of Vitamin C, which I will refer to as THD. So far, there really hasn't been much research as to how effective this derivative of Vitamin C is in comparison to traditional L-ascorbic acid. From what I have read online, it seems to have brightening effects, is a gentler derivative of Vit C for people who would otherwise be sensitive to it, and there is the claim that it penetrates deeper into the skin as an oil-soluble form. Basically, there's a lot of hype surrounding THD and it's a little too early to be sure about its overall benefits. If you have used a THD Vit C, what was your experience like? If you used other types of Vit C (particularly L-ascorbic acid), how did the THD compare? Other questions: Is THD considered an acid at all? Is pH-dependent? Are there any ingredients you should never layer THD with (like how some would not pair their L-ascorbic acid with niacinamide)?<pazzaglia1>: I've used AA formulations and also tried The Ordinary Vitamin F - I was really under-whelmed. At least for me, it did not lighten or brighten like the AA so I started putting it on my arms to use it up and my arms actually broke out. So don't really know if it was the THD or Vitamin F but def not going to purchase that again. Right now I'm using the GOW Vitamin C and I really like it (except for the fact that it smells like hot dog water). It's about equivalent to the Timeless Vit C for me in terms of results, but even better because it absorbs faster and comes in an airless pump.<cyn-n-tonic>: &gt; except for the fact that it smells like hot dog water zomg. This is important info to share with the world, indeed.<MxUnicorn>: It's the ferulic acid.", "num_messages": 4, "avg_score": 4.75}
{"start_date": "1543381608", "end_date": "1543434944", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 21, "text": "<AutoModerator>: NEW OR NEED HELP? Ask here! - ScA Daily Help Thread Nov 28, 2018. Text-post only today! If you're new to SkincareAddiction: welcome! This thread is the best place to start if you have questions about skincare products, your routine, and your skin. Our community is knowledgeable, and we want to help you have the best skin of your life! - #Do you have a question? ###Step 1: Read our resources First take a look at our [FAQ](https://www.reddit.com/r/SkincareAddiction/wiki/faq) and [Wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)! They include product recommendations and advice for skin concerns like [acne](https://www.reddit.com/r/SkincareAddiction/wiki/acne), [pigmentation](https://www.reddit.com/r/SkincareAddiction/wiki/pih), and [dehydrated skin](https://www.reddit.com/r/SkincareAddiction/comments/1akqed/dehydrated_skin_what_is_it_what_it_looks_like_and/). You might find a solution to your problem there! If you can't find an answer, or you have additional questions after reading, please move on to step 2! ###Step 2: Ask for help To give you the best advice possible, our users need relevant information about your skin and skincare. With your request for help please include: * **The issue(s)** you need help with. * **Skin type**. It's OK to be subjective, how do you feel your skin is? Oily, dry? If you need help clarifying, check out [this guide on skin types](http://www.gardenofwisdom.com/profiles.html) * **Current routine** with the full names of your products (try to separate it in to Morning, Evening, and Occasionally used) * **How long** you have been using your current routine, or product in question * **Anything new** you’ve introduced or started doing that might change the condition of your skin * **Your location** so we can recommend products/services available to you Thanks for taking the time to include your information! #Would you like to give advice? Firstly, thank you so much for helping out our community, without your knowledge and time ScA would not be the same! Some things we'd ask for you to keep in mind: please don't just downvote someone's opinion or response because you disagree. If you can, please take the time to tell them why you think their advice may be incorrect or harmful. It's better for people to understand why something is a poor choice, instead of just being told that it is one. #[Previous Threads](https://www.reddit.com/r/SkincareAddiction/search?q=title%3AAsk+ScA&amp;restrict_sr=on&amp;sort=new&amp;t=all) ---- *This thread is posted every day at 12:00am ET.* <KittenOfWar>: Does anyone have experience with derm offices not listening to you? I went in for a mole check and figured I'd ask about an rx acne product that would help me. I got passed from a PA to an aesthetician and found neither of them helpful. The aesthetician tried to tell me I was \"using too many products and messing up my barrier\" but I know my acid mantle is fine. <Am>: Skinfood foaming cleanser Toner (korean, dont know the brand, picked it up in seoul) Missha essence Cerave moisturizer Spf <Pm>: Oil cleanser (coconut or avocado and tea tree depending on mood) Skinfood foaming cleanser Toner Differin Cerave I've got the occasional sheet/mud mask but I tend to stray from physical exfoliants as I've found they really over exfoliate me. I've got a ton of products I use if the whim strikes me -- snail gel creams, nip and fab extreme night fix, just a bunch of random things that go on sale at CVS, but they arent daily things. <TopStrawberry4>: When it comes down to it, doctors are just people with (highly educated) opinions. If you truly disagree with what the derm office said then I wouldn’t hesitate to see someone else. However, if everyone you see gives the same reasoning, then I would accept hat you don’t need the rx and move on to something else. After all, they go to medical school for this stuff. Sometimes less is more and you have to trust that your derm knows what they’re talking about. <KittenOfWar>: I never even got to speak with the doctor, they just shifted me from the assistant to an aesthetician. <Edit>: I'm laughing at the irony that my complaint is people dont listen to me and the only response I've gotten thus far didnt address my concern. Maybe I'm too soft-spoken and need to assert myself more.<stepapparent>: Go to an office that doesn’t have PAs. Those types of offices typically only allow worst cases to see a doctor (shrinks, on/gyns, and more use this model and they suck).<KittenOfWar>: Ah, thank you! That makes a lot more sense. I felt like I was getting the old \"bait and switch\" because every appointment I was made to feel like I was seeing a derm when I wasnt.<stepapparent>: Yep - I stopped going to any practice. It started with my OB/GYN. I could only see the doctor if I was pregnant or trying to get pregnant. Sigh.<KittenOfWar>: Yeah, I understand. I'll definitely look into other offices if I dont have my concerns fully addressed next time I go in.<stepapparent>: Good luck :)", "num_messages": 9, "avg_score": 2.3333333333}
{"start_date": "1543624265", "end_date": "1543705867", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 7670, "text": "<i-wanted-that-iced>: [Humor] oops <galacticmeowmeow>: Ok but like how often should we wash??? Somebody teach me 😭😭😭<mado55>: So the theory is that your brushes should be cleaned lightly (think brush cleaning spray) after each use and deeply (shampoo and warm water) once every week or every other week. I personally am lazy and don't breakout that much so I deep clean my brushes about once a month. Which is kind of nasty, but hey, priorities. <Ubernaught>: I read this and thought maybe I should go clean my GF's brushes for her. And then remembered she has almost no acne problems and I may end up just causing some issue.<Leda654>: Cleaning them with baby shampoo won't cause any issues. But as long as they aren't filthy or causing break outs there's no need to follow a strict cleaning regiment.<crispmeatburt>: Can you clean beauty blenders the same way with baby shampoo?<WickedPrincess_xo>: beauty blender says no, it breaks down the sponge. i say i cant tell.<-leeson>: Shit I washed mine with hand soap a bunch out of desperation and it lasted way longer than I should have used it for haha <TimeYam>: LOL beauty blender just wants us to spend more money on their sponge cleanser 🤷‍♀️<Ohaipizza>: An awesome dupe for their sponge cleanser is Dr Bronners baby bar soap. Works great for brushes too. It’s a big bar of soap for a fraction of the price. <MeepsNcheese>: I'd also recommend using Daiso's sponge and brush cleaner! Granted you have a store nearby, it's only $1.50 and it basically melts the makeup off of my brushes and beauty blender whenever I use it", "num_messages": 11, "avg_score": 697.2727272727}
{"start_date": "1543614469", "end_date": "1543643601", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 15, "text": "[deleted]: [Routine Help] Help with calming down pimples! [deleted]<cyberhunty>: Current routine: AM Cleansing with Curology Cleanser Sunscreen Drunk Elephant Umbra Sheer Mixed with Drunk Elephant Marula Oil. <PM>: Cleansing with Curology Cleanser and Low Ph cleanser by CoSrx<Creams>: Curology custom (4% niancinamide, 4% clindamycin &amp; 1.4% Zinc Pyrithione) Marula Oil This was caused by taking Halo Beauty’s kiwi seed boster supplements along witn Cerave Lotion which totally ruined my skin! They’re mostly hormonal but I curology has been helping a lot. Drunk elephant isn’t working giving my CC’s but I don’t have any other products besides Klaris Supple Preparation Toner , Rich moist serum (contains fungal ingredients) and Soon Jung Intesive Barrier Cream which i believe gave me CC’s and acne as well. If anyone can recommend any good sunscreens , cleansers and moisturizers i should add in my routine that won’t damage my easily clogged oily acne prone skin (: thank you sm!! <redcoat12>: My skin hated Curology. Have you been to a dermatologist or even your GP? If it’s hormonal you could go on birth control or spiro. You could also try oral antibiotics like Minocycline. <cyberhunty>: no I definitely have to try starting there ! I’ve never tried antibitoics bc i don’t wanna ruin my skin but I’m trying to change my routine a bit (: thanks!<redcoat12>: Clindamycin is an antibiotic. Have you tried using Benzoyl Peroxide? That stuff does wonders for my skin but I have to remember to buffer it with moisturizer. <cyberhunty>: I haven’t given it a try. I’ve been debating in adding an an Azealic Acid product into my routine , maybe a cream I can buffer as well with a moisturizer, or maybe the benton snail bee line that contains azealic acid ! <redcoat12>: Benzoyl peroxide is available everywhere, the one I use is the neutrogena clear pore cleanser in the morning and at night I use clean and clear 10% cream (a thin layer after a thick moisturizer) and it completely eradicated my acne even the hormonal ones. <cyberhunty>: I just purchased the La Roche Posay Toleraine Cleanser for Normal to Oily skin ! Reading some posts here I found maybe that one can calm my skin and repair my barrier. ! So should I use my moisturizer before benzoyl peroxide cream? I would def give it a try but i’m a bit scared , hopefully it wont be my last resort but do you think adding another benzoyl peroxide product into my routine could help? maybe an spot treatment?<redcoat12>: Yes use BP as a last step in your routine. I find that it doesn’t really work well as a spot treatment, but it works as a thin layer everywhere. It also helps prevent pimples. <cyberhunty>: what % do you use to buffer with moisturizers if you don’t mind sharing (:<redcoat12>: I use 10% because that’s what they sell at target. I haven’t had any trouble with the high concentration especially because I buffer. Some people here only like 2.5% but you have to get it online. My cleanser is 3.5%!", "num_messages": 11, "avg_score": 1.3636363636}
{"start_date": "1544591199", "end_date": "1544709806", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 24, "text": "<AutoModerator>: NEW OR NEED HELP? Ask here! - ScA Daily Help Thread Dec 12, 2018. Text-post only today! If you're new to SkincareAddiction: welcome! This thread is the best place to start if you have questions about skincare products, your routine, and your skin. Our community is knowledgeable, and we want to help you have the best skin of your life! - #Do you have a question? ###Step 1: Read our resources First take a look at our [FAQ](https://www.reddit.com/r/SkincareAddiction/wiki/faq) and [Wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)! They include product recommendations and advice for skin concerns like [acne](https://www.reddit.com/r/SkincareAddiction/wiki/acne), [pigmentation](https://www.reddit.com/r/SkincareAddiction/wiki/pih), and [dehydrated skin](https://www.reddit.com/r/SkincareAddiction/comments/1akqed/dehydrated_skin_what_is_it_what_it_looks_like_and/). You might find a solution to your problem there! If you can't find an answer, or you have additional questions after reading, please move on to step 2! ###Step 2: Ask for help To give you the best advice possible, our users need relevant information about your skin and skincare. With your request for help please include: * **The issue(s)** you need help with. * **Skin type**. It's OK to be subjective, how do you feel your skin is? Oily, dry? If you need help clarifying, check out [this guide on skin types](http://www.gardenofwisdom.com/profiles.html) * **Current routine** with the full names of your products (try to separate it in to Morning, Evening, and Occasionally used) * **How long** you have been using your current routine, or product in question * **Anything new** you’ve introduced or started doing that might change the condition of your skin * **Your location** so we can recommend products/services available to you Thanks for taking the time to include your information! #Would you like to give advice? Firstly, thank you so much for helping out our community, without your knowledge and time ScA would not be the same! Some things we'd ask for you to keep in mind: please don't just downvote someone's opinion or response because you disagree. If you can, please take the time to tell them why you think their advice may be incorrect or harmful. It's better for people to understand why something is a poor choice, instead of just being told that it is one. #[Previous Threads](https://www.reddit.com/r/SkincareAddiction/search?q=title%3AAsk+ScA&amp;restrict_sr=on&amp;sort=new&amp;t=all) ---- *This thread is posted every day at 12:00am ET.* <FrostyHero_>: 25M, looking to add TO products to routine to help with sun damage, texture, redness, and moisture. Current routine is simple, Cerave Moisturizer AM and PM after washing, and Cerave hydrating cleanser every 3 days. I'm looking to add: * Hyaluronic Acid 2% + B5 * Niacinamide 10% + Zinc 1% * Glycolic Acid 7% Toning Solution * Ascorbic Acid 8% + Alpha Arbutin 2% I've understood that you usually go from lightest to heaviest as far as some product goes, but could really use some additional help here. If any of these contradict I'd love to know. Thanks!<nemicolopterus>: 1. First, pick ONE problem (sun damage, texture, redness, and moisture) and start with something to treat that. Add that one product, patch-testing first, and keep it in your routine for at least a month. Then, pick your next important problem and go with that. Definitely do not add all of these at once! 2. Since you're concerned about sun damage I'm surprised to see you're not wearing sunscreen. It's the number one product to protect your skin! You especially need this if you end up using any exfoliating acid like glycolic. 3. Am I reading this correctly that you only cleanse every 3 days? Why is that? <FrostyHero_>: Yeah I kind of figured putting all of them in was a sin. Let's say I want to start with moisture, would I start with the moisturizing toner? I am not using sun screen right now because I'm not in the sun that much, I was stupid as a teen though and received a few bad sunburns because of it. If I add the glycolic I'll definitely hunt down a sunscreen. I only cleanse that often because I don't wear any makeup and it does make my skin feel tight after. My skin isn't cracking or peeling or anything so would you assume it's safer to use more than that?<nemicolopterus>: Yeah hyaluronic acid is an excellent hydrator! Apply it to damp skin to maximize benefits since hyaluronic acid works by transporting water to deeper layers of your skin. Sunscreen is good anyway, so I always recommend adding it :) Lots of great sunscreens these days! Especially if you're anywhere with direct sunlight it's the best thing you can do for your skin. Ah if your cleanser is making your skin feel tight it's way too harsh for you! Cerave hydrating is generally pretty gentle, so maybe it'll get easier to use once you step up the hydrating. Try that first. If it still feels tight when you wash try something more gentle like oil cleansing (I like hada labo emulsifying oil cleanser because it's easy to wash off), micellar water, or vanicream hydrating cleanser. <FrostyHero_>: I will start with the toner and hopefully it allows me to increase my cleanser usage and move from there! Do you have a nice light sunscreen that you would recommend considering my routine and future goals? I've actually read that just adding a sunscreen can be good for your skins moisture as well. Thanks for taking the time and effort in your replies, I really appreciate it and have already learned from your skin and product knowledge.<nemicolopterus>: Happy to help! Here are all my recs: https://molecule.github.io/post/skincare-and-haircare/ Good luck with the toner!<FrostyHero_>: Very interesting read, I enjoyed that. What do you mean by damp skin? Do I pat my face dry and immediately apply product or is damp skin still wet with water slightly? You're routine seems so advance, time to step up my game it seems. There's a lot in there about Ph levels I don't quite understand yet but a little research will help. Good blog! <Edit>: also would you agree that starting with repairing my moisture barrier is the right move?<nemicolopterus>: I usually pat my face w a towel to remove most of the water but it's still wet: like if I touched my face w a dry finger my finger would get wet. My routine is super advanced. It took me about 4 years to get to this point. Glad it was useful! I'll add more links about pH stuff there, thanks for the feedback! And yes: absolutely repair your moisture barrier first! Good instincts.<FrostyHero_>: Alright, gotcha now. Yeah, I'm hoping restoring my moisture first will help alleviate some of the others and then see what happens. I saw you really liked the Hada Labo toners, would you recommend that over TO or wouldn't matter? I've heard good things about both.<nemicolopterus>: Well I've never tried the TO hydrating products but in general their stuff feels less well-formulated than Hada labo's. Like grittier and doesn't sink in well and clumpy and goopy. I mean it's hard to complain for the price but just not my ideal. And some of their stuff is actually formulated in such a way that it likely won't have any effect at all. If I recall correctly their vitamin c is designed such that it just probably won't deliver much of anything to your skin. Whereas Hada Labo Is a Joy to use and I can immediately feel the difference in my skin. For me part of skincare I guess is the qualitative experience, so enjoying the process is important. Plus their bottles last for a full year of twice daily use which I really appreciate. But TO is cheap and their bottles are glass which is great. Honestly they've kind of revolutionized skincare by making stuff so affordable and by being so accessible with answering questions. I own a lot of TO stuff too! I would only repurchase the rosehip seed oil and the salicylic acid but it was definitely a worthwhile experiment!", "num_messages": 11, "avg_score": 2.1818181818}
{"start_date": "1544764060", "end_date": "1544764299", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 31, "text": "<toasteggsbacon>: [B&amp;A] Before and After Isotretinoin &amp;#x200B; <https>://i.redd.it/f00k7zf4f6421.jpg<brusselsprout85>: How long?<toasteggsbacon>: Around five months!", "num_messages": 3, "avg_score": 10.3333333333}
{"start_date": "1544735818", "end_date": "1544840851", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 17, "text": "<rlsleepingbeauty>: [Skin Concern] Face feels so tight and dry after cleansing...help! gentle cleanser recommendations for combo skin?!<learningtarot>: I just saw this, and I had the exact same problem as you. Very dry/uncomfortable/tight feeling skin. I would try to put moisturiser on as quickly as possible because it felt awful otherwise, and even with moisturiser it didn't always feel great. What fixed it almost completely for me was using hyaluronic acid (specifically hada loba premium). I didn't really understand the difference between dry skin and dehydrated skin back then (I had dehydrated skin), and hyaluronic acid is amazing for it.<rlsleepingbeauty>: I have this product! How do you personally apply it to your skin? <learningtarot>: I put it on right after I shower, while my face is still wet. I just put some onto my fingers and apply it like that, spreading it so its evenly distributed. I then wait like five minutes or so, before moving on to the rest of my routine, but this isn't always necessary. <rlsleepingbeauty>: Awesome. Thank you so much for your reply :) do you use multiple layers?<learningtarot>: You're welcome! My routine is changing a little bit right now, but this is what it usually is: Wash Face Every other day: BHA stridex, wait 15-30 minutes Hyaluronic acid, wait five minutes (I use this after the stridex on days I use stridex, but it works best right after washing my face) Moisturizer Azelaic acid I don't use any other toners or serums or anything. I tried using argan oil before, but found it didn't do anything for me.<rlsleepingbeauty>: Are you combo skin? This resembles my routine a good amount. Argan oil broke me out! Also thanks for visual of your routine! Makes things a lot easier lol<learningtarot>: I'm more oily/dehydrated than combo. That sucks! I think it might have broke me out a little too, but I stopped using it pretty quickly since I had primarily bought it for my hair anyways.<rlsleepingbeauty>: Haha!! We are similar there, argan oil for my hair is a dream, I love it!! Can I ask what azelaic acid you use?<learningtarot>: I've used both melazepam and the ordinary's azelaic acid. I honestly don't know which I like better. They both have their pros and cons, so its kind of frustrating for me! I actually keep swapping back and forth. Are you using azelaic acid now? If so, what are you using?<rlsleepingbeauty>: I actually am! I have a curology prescription of 0.009 tret, 9% azelaic acid, and clindamycin 1%. I really only use this formulation when I want to use tret, and I started at a lose dose to ease into it. I’ve very sensitive though so I alternate with finacea gel 15% azelaic acid and finacea is hands down he best azelaic acid IMO. The ordinary texture was sooo weird on my skin I couldn’t stand it. Haven’t tried Melazespam only because it is a cream texture and I’m clog prone so I was worried for that reason. You can get the azelaic acid finacea Gel 15% at chemist direct Australia. I live in the US but could never find a derm that would prescribe it for me so I took a risk based on reading thousands of reviews and took the plunge. I really like it, and would recommend.<learningtarot>: Down the road I will definitely look into it, but I'm still trying to find a routine that works for me, and want to fine tune that before I try to get a prescription for it. I live in Canada, and unfortunately azelaic acid can't be sold over the counter here, so I have to order it online from places that don't care about that! I've recently started using Differin (also something that is prescription only here), and working in azelaic acid into my routine has been challenging, but so far the combination has been very effective for me.<rlsleepingbeauty>: Chemist direct Australia, you don’t don’t need a script! You just buy it! Differin is pretty good, I used it before tret but tret really is a work horse!", "num_messages": 13, "avg_score": 1.3076923077}
{"start_date": "1543591327", "end_date": "1543611392", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 86, "text": "<YodaYodaCDN>: [MISC] Financial Post: The inside story of how Deciem, the Abnormal Beauty Company, lived up to its name <jennifer538>: I saw the video of him in the mental health hospital when he was under influence. He thought playing a prank putting a diy noose around his neck would be funny.... In a mental health hospital 😐... Ofcourse staff would be on high alert and take it seriously <PootMcGroot>: I find it profoundly worrying that he's been released, as his personal Instagram is exactly as it ever was. It's interesting that his lawyer openly admits to his use of crystal meth in court: that's something many of us here suspected, given his changing appearance.<tinfoilforests>: Whoa whoa whoa I missed the admission of meth. Where’s the sauce for my dry pasta???<PootMcGroot>: The curious thing is it seems his use of meth is what got him *released* from psychiatric hold. \"*The hospital was unable to rebut Truaxe’s lawyer’s suggestion that his psychosis was induced by his use of psychedelic mushrooms and crystal meth. In the interview, Truaxe was alert, cogent and sober after a week in hospital.*\"<corpuscle634>: I'm not sure about the UK, but in some states in the US, you can be sectioned for acute mental health reasons but not chronic drug misuse. So \"I was just super high, you can't hold me against my will now that I've come down\" is a valid defense, since \"he's likely to get super high and have to be hospitalized again\" isn't enough to keep him there.<PootMcGroot>: I think it's similar in the UK.", "num_messages": 7, "avg_score": 12.2857142857}
{"start_date": "1543604455", "end_date": "1543710151", "thread_id": null, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "total_score": 17, "text": "<Enitocin1>: [Skin Concerns] Need Advice <saucylackey>: They look like a typical breakout to me (though I'm not a derm). Did you have them before starting your routine?<Enitocin1>: Yeah I did have this before my routine. So far I haven’t really seen any improvement to my skin since starting my routine<saucylackey>: Just wanted to make sure it isn't your routine that's giving you problems. Are the spots only on your right cheek?<Enitocin1>: Yeah they are but I also have the same issues with my left cheek/temple as well<saucylackey>: Gotcha. Personally I would switch from the CeraVe hydrating cleanser to the foaming one (the brand is very good, but the hydrating cleanser can be problematic for some people), and from the PM moisturizer to the moisturizing cream (the cream is more soothing IMO and dries with a soft matte finish). I would also remove all the “extras” right now and just use a spot treatment in the evening... the La Roche-Posay Effaclar Duo is extremely effective (note that it will bleach fabrics like towels and sheets). You can tap a pea-sized amount onto your breakouts every night or every other night, before or after moisturizing (depending on how resilient your skin is). I hope that gives you some ideas. Let me know if you have any q’s!<Enitocin1>: Thank you for the recommendations! I’ll definitely check it out!<saucylackey>: Any time! Good luck!<Enitocin1>: Do you recommend any alternatives to la roche? They’re a little too high end for me lol<saucylackey>: Ah, that's the ONE product I have trouble finding alternatives for. It's that good. But this one is comparable, and a little bit milder: [https://www.paulaschoice.com/clear-regular-strength-daily-skin-clearing-treatment-with-2.5pct-benzoyl-peroxide/610.html](https://www.paulaschoice.com/clear-regular-strength-daily-skin-clearing-treatment-with-2.5pct-benzoyl-peroxide/610.html) Add the La Roche-Posay to your holiday wish list ;)<Enitocin1>: Thank you so much for the help! :)<saucylackey>: My pleasure :)", "num_messages": 12, "avg_score": 1.4166666667}
