{"start_date": "1554513153", "end_date": "1554528293", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 6096, "text": "<Belledame-sans-Serif>: The LGBTQ+ acronym is like pi. Everyone knows what you’re talking about after the first few characters, but nerds memorize as many as they can to prove they care more than other people. [removed]<ElTuxedoMex>: Tomorrow I'll wake up and it'll have 3 or 4 more letters.<Belledame-sans-Serif>: It's impossible to make a complete list of gender, sexuality, and presentation because it would be infinite, and the longer people think about it the more they can come up with. Also like pi.<EyedLoki4292>: I mean there are two genders biologically. It’s like give an inch and they take a foot kind of scenario. <Bheda>: Trigger Warning ahead. You've been warned! I'm an avid watcher of Ben Shapiro. He's very factual in the way he works and approaches political issues. One of his debates goes in to mental health being linked to the LGBTQ community. How they have the highest rate of suicide both before and after their gender reassignment. The rate of suicide does not change from before to after. His take on the subject is one we all need to start pushing passed the PC culture. What we're doing is feeding into delusions and acting as if it's normal. It isn't. We do not take any other delusional mental patient and play into their delusions to make them feel better. We get them help. The more we let these mental health issues and delusions strong arm their way into society, the more fucked we'll be. These people need real help. Not genital mutilation. If I go through my Facebook and pick out all these radical LGBTQ people, they all also post about their mental health issues. They're all on some sort of medication.<RonBach1102>: The only group with a similar suicide rate is paranoid schizophrenics. Just let that sink in. <Bheda>: It's 100% a mental illness. The numbers don't lie. It's just that the numbers don't play into their delusions. These confrontational, angry people, could have the opportunity to live such happy lives if they accept it for what it is and get real help.<WinterShadow476>: Gender dysphoria *is* a recognized mental disorder, and transitioning is currently the only viable treatment. Is it theoretically possible to just make them stop feeling that way? Yes, but it’s human nature to take the path of least resistance, and the physical body is a hell of a lot easier to manipulate than the mind.<Bheda>: The issue with this path is, I don't think it solves the issues that lead to the dysphoria. Genital mutilation currently, if being used as a treatment, is nothing more than a poor band-aid.<WinterShadow476>: If it makes them comfortable in their own body and literally does not affect you in any way, I say live and let live.<Bheda>: But it does effect us. See- _That's not my pronoun!_ and other bullshit that's now everyone elses problem. <WinterShadow476>: How exactly is it bullshit to refer to someone the way they would like? What exactly do you lose by being nice? People have no problem referring to Gordon Sumner as Sting, but not resorting to the most petty thing possible is too much for you?<Bheda>: Because I'd have to ask someones name to know it. It isn't visual. I'm not going to go around and start meeting people like; Hello, my name is Bheda. I identify as a Straight Male. What is your name and preferred pronoun? I already suck at remembering names, let alone a supposed infinite number of gender pronouns, and trying to link them all with the people that identify as them. Come on, now.<WinterShadow476>: &gt;supposedly infinite He/him She/her They/them Yeah I feel you bro 3 is pretty hard to distinguish from infinity, It’s usually pretty obvious what someone’s pronouns are, (i.e. Jacob will probably be he/him, Amanda will likely be she/her) and a decent person will politely correct you. Like getting someone’s name wrong. To borrow a common situation from my mother, “Hi I’m Suzanne” “Hi Susan I’m [name]” “Actually it’s Suzanne.” “Oh ok sorry, I’ll try to remember.” It’s sooo much easier to be polite than needlessly confrontational. “Hi I’m Suzanne” “Hi Susan I’m [name]” “Actually it’s Suzanne.” “Fuck you idgaf what you want me to call you all these different names are too complicated your name is Susan now.” <Bheda>: Actually... HE/SHE|HIM/HER|HIS/HER|HIS/HERS|HIMSELF/HERSELF :--|:--|:--|:--|:-- zie|zim|zir|zis|zieself sie|sie|hir|hirs|hirself ey|em|eir|eirs|eirself ve|ver|vis|vers|verself tey|ter|tem|ters|terself e|em|eir|eirs|emself<WinterShadow476>: Have you ever actually seen anyone use these? Cuz I spend a lot of time with members of the lgbt community and not once has anyone asked for anything other than he/she/they.<Bheda>: Yes, I have. Obviously these will be relative to the person. Some might be around people who don't, while others are around people who try to modify others language. I live around people who try to push this.<WinterShadow476>: Well I’m sorry you live around people who are different than you, it must be very tough not being 100% homogeneous :(<Bheda>: I love diversity. I don't enjoy living in peoples delusions, however. We don't see eye to eye, and that's obvious. No one has ever been swayed from a firm belief of theirs over a reddit discussion. We should end this since it has no mutual resolution that we can agree on.", "num_messages": 19, "avg_score": 320.8421052632}
{"start_date": "1555506166", "end_date": "1555549799", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 3885, "text": "<jauhopallo>: The first person who walks on Mars will have quite a responsibility to say something iconic just like when the first person walked on the Moon <backwardCrossover>: “Uhhh, guys? This isn’t mars!” Followed by 25 minutes of just breathing. Then “oh wait. Yeah it is. I was looking at it wrong.” Either that or just sing the theme to Fresh Prince of Bel-Air. I mean it’s universal. Might as well use it as the world’s new national anthem when claiming planets for our species. <Edit>: thank you for the gold! I will take this as validation that one of these comments should be used when I’m selected and become the first person on mars. Which one? The world will have to wait in suspense. Knowing me, I’ll probably screw it up, though.<Hawks2020>: &gt;“Uhhh, guys? This isn’t mars!” Followed by 25 minutes of just breathing. Then “oh wait. Yeah it is. I was looking at it wrong.” Holy shit that made me laugh so hard<nomadichedgehog>: I don’t get it<Hawks2020>: Psst me neither, just go along with it<nomadichedgehog>: I feel like there’s some kind of song reference<Hawks2020>: I think we’re talking about “Life On Mars”... . . . Please get my reference<nomadichedgehog>: Sorry, dude. This one’s lost on me.<Hawks2020>: It’s a David Bowie song", "num_messages": 9, "avg_score": 431.6666666667}
{"start_date": "1554500883", "end_date": "1554546534", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 34531, "text": "<nobutternoparm>: People will refuse to ever read a book, because they \"hate reading,\" but will read a novel's worth of text on social media in a week. [removed]<Blastercorps>: Because people think reading is what they were forced to do in school. Dry book choices that won't offend anyone (to kill a mockingbird notwithstanding) and then read it not for enjoyment, but to extract every false reference they can from it in order to take a standardized test. <BigZmultiverse>: Yeah. If schools gave kids books to read with less literary value, but were actually enjoyable, it would pay off a lot more in the long-run.<CH33KCL4PP3R>: If school was designed to educate, and not just to pass tests, it would pay off a lot more<SvarogIsDead>: Then there is no success metric <Needyouradvice93>: This is a good point. I think the current system definitely needs work but as of now we need tests and a curriculum. <DatOneGuy00>: Scotland has a great system from what my English teacher has told me. They don’t have grades, only small tests so they can see how well they understand what they’ve been taught.<mariesilk>: Thats what grades are used for though, lol. <jeffrope>: \"They dont grade them, they just grade them instead\"<ChuckyFucknuts>: I cheat on all my exams by memorising all the answers so the invigilator can't see where I've hidden them. <wrdsrfn>: That's sad. Where are you in your education? What have you done to educate yourself? You're worth more. <ChuckyFucknuts>: I'm finished education and have been working for over ten years. I got two degrees by hiding all the course material in my memory in the weeks leading up to the exams, and no one ever found out. I feel like such a fraud<wrdsrfn>: Then what are you doing?! You're worth more than than that, and all you're doing is hurting yourself and others. Learn, and pass it on. You're wasting everyone's time doing that, right? Stop bypassing the checkpoints and actually do something with it. I wish I had that kind of opportunity. Grab it and run with it, don't just accept the mediocre, snag what you can. What's stopping you? <ChuckyFucknuts>: I'm only joking mate<wrdsrfn>: Bah, go on with you! Go play then, and have fun with it. <ChuckyFucknuts>: Appreciate the concern all the same, you seem like a nice guy. Good on you for trying to help!", "num_messages": 16, "avg_score": 2158.1875}
{"start_date": "1555516330", "end_date": "1555521460", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 118, "text": "<Danimater2>: The tooth fairy teaches children that they can sell their body parts for money. [removed]<DocCannery84>: Your Mum taught me about selling bodies for money.<dudecoolstuff>: Ouch", "num_messages": 3, "avg_score": 39.3333333333}
{"start_date": "1554521768", "end_date": "1554522806", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 9, "text": "[deleted]: Centuries ago pizza used to be bread with seasoning on top, and now it’s the most hated part [deleted]<jameizing777>: Only if you eat cheap chain pizza. If it doesn't have good crust what is even the point of eating it?<RandomAndRetardedYT>: Idk but around here Pizza Hut is the best place for Pizza of course and yes we have a dominoes <jameizing777>: Do yourself a favor. Next time you get pizza look up \"best pizza near me\" on Google. Skip Pizza Hut, Domino's, and Little Caesar's.<RandomAndRetardedYT>: Hmmmm alright!", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1555443441", "end_date": "1555520951", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 21, "text": "<Mr_Mustacchi>: If you donated to a sperm bank and had trans-gender surgery afterwards, you could birth a clone. Messed up but true.<DxSkillzz>: That’s not how baby’s or being transgender works<DxSkillzz>: If you are transgender you can’t just be able to give birth if you don’t have a vagina<firelock_ny>: I think the lack of a uterus or ovaries would be a bigger problem.<DxSkillzz>: So if I have balls and a dick and ovaries I can give birth wooooow<firelock_ny>: I don't think intersex disorders work that way in humans. Functional testicles and functional ovaries don't show up on the same person.<DxSkillzz>: I know, I was being sarcastic", "num_messages": 7, "avg_score": 3.0}
{"start_date": "1555520806", "end_date": "1555525070", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 16, "text": "<shIongdonger>: We all have at least one relative that was alive for every historic event ever <Ellspel>: The big bang?<Zangdor>: Historic<Ellspel>: Yes it was", "num_messages": 4, "avg_score": 4.0}
{"start_date": "1555520707", "end_date": "1555525021", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 6, "text": "[deleted]: We grow up being told to tie your shoelaces or else you will trip but only in cartoons do people trip on their shoelaces [deleted]<AyamXII>: Do we even leave our laces untied enough to prove this?<Haelstrone>: I can prove lt, havent tied my laces in an entire year when i was in high school and i've never fall off. Another childhood lie.<AyamXII>: Nice exposé, I might rock straggling laces and die on an escalator.<Haelstrone>: Looks like a good way to die.", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1554478180", "end_date": "1554528616", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 6814, "text": "<WolfGamer4781>: We are taught to not talk to strangers, but then when we are older we are judged for being scared to talk to people. <mini_thewoodenpig>: Well when you’re a kid you’re easily fooled<ArmyOfDog>: I was certainly fooled. My parents were super fundy religious types. They put me in a private Christian school all the way through 10th grade. Their reasoning being that 1) there was no prayer there, 2) they taught evolution there, and 3) everyone there was very dangerous and at best, would ridicule me for my faith, but more “realistically,” upon discovering my family was Christian, would stab me with the knives that every single one of them had hidden in their lockers. I seriously believed that ALL public school children were *looking* for me, just so they could make fun of me as they killed me. So I was terrified of *everyone.* For years. I would only speak to adults. People my age left me frozen in fear. It really fucked me up in the head to the point of developing severe agoraphobia. But I moved in with my grandparents when I was 16. They were wonderful people. I got a full time job and finally was forced to interact with people outside of church and school. And you know what? They were all fantastic. Everyone I met. They just wanted to hang out and joke around and have a good time. They included me in shit, and it really changed my life for the better. Those were some really decent people that I’ll never forget. Over time, I went from being too afraid to talk to anyone, or even pump gas (except at one very specific pump that I used exclusively for two years), to joining a band that performed live and even toured. After that, I even ended up fronting a different band, as the singer. And I loved it. I’m 37 now. I’m retired from the playing in the local music scene, but I’ll still go out and watch others play. Nobody believes me when I tell them that in the past, before I was the sort to feel more fulfilled playing music on a stage than anywhere else, that to call me shy would be a gross understatement. So yeah, I was fooled. But thanks to all the people out there that I’ve met, who are kind and friendly, and probably a lot like whoever you happen to be as you read this, I’m not fooled anymore. So thanks, everyone. For being kind and decent and normal, and assuming that I was, too. That was cool of you.<1khmtd_Surge>: sometimes parents lie<ArmyOfDog>: Well I know that *now.* And I pump gas anywhere I damn well please. It’s so liberating!<1khmtd_Surge>: do you harbor any non-respectful thoughts concerning the duplicities your parents dispensed?<ArmyOfDog>: When I was in my early 20s, I did. Not anymore. My step-father is long dead, and this all came from him. I found out after he died that my mom was only playing along because he withheld money for groceries from her if she was not 100% in line with his decrees. He’d go out to eat, while she’d scrape change together to buy Ramen for us, until she fell in line again when we ran out of food and spare change, at which point we had regular food again. She was forced to quit her job after they got married, and be a housewife. So the money he gave her every week is all she had to work with. When he’d cut it off, there wasn’t much she could do for long. I always thought it was weird at the time, but I never knew what was really happening until his death. At that point, she finally felt it was safe to tell me. Which she did in a very apologetic way. She was really in a no-win situation the entire time. I really admire that she silently endured that for me and my siblings for almost 20 years. She was often much like the boy next door’s mom in American Beauty, sitting silently, apologizing with a vacant stare for the messy house that was in reality, immaculately kept. She’s super chill now, and we’re very close. She came back out of her shell when he died, and is totally happy and vibrant and loves life and has a good circle of friends who are all really positive and decent people. She’s a wiser, smarter version of the happy and loving mom I remember from before my step-father came into the picture.<1khmtd_Surge>: yeah. Glad you made it. Welcome to the world! <edit>: add on ... I mean you've been here a while, but you got over a bit of a setback early on.<ArmyOfDog>: Glad to be here! Thank you, friend. I suppose I’ve “been here” about 19 years now. I thank you all for not ridiculing me and stabbing me for no reason at all! Sixteen year old me, and younger me - he’d be so surprised to not only to still be alive, but to have become one of you. High five, everyone! Together, we did it!<fuchajen>: proud of you, and so happy your mum is finally free too :)<ArmyOfDog>: And I’m happy you’re a kind and decent person who took the time to say so. I’m not naive. Not that anyone said I am. I know there are assholes out there. Sometimes, that asshole is me, if life plays out that way with all the wrong things happening at once. But all the same, if we strive to make life good and happy, with the fortune bestowed upon us, as people who can take the time to get on Reddit and shoot the shit about things like this, life *will* be good and happy. I think of it like this - every time I’m stuck in traffic, I used to be irritated. But after six years of struggling, (that I haven’t gone into, as it’s been irrelevant to this thread), these days when I’m stuck I traffic, I’m grateful that the reason I’m stuck in traffic is because I have not only a job, but I have a place to go home to everyday, when my job is over. I’m lucky to be stuck in traffic. A lot of people sit at home all day, applying for jobs, *wishing* they had to deal with traffic.", "num_messages": 11, "avg_score": 619.4545454545}
{"start_date": "1555515970", "end_date": "1555520942", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 4, "text": "<Pqouist>: You can suck dick but you won’t die or go to hell or anything <yuungjay>: r/ihadastroke<Pqouist>: Oh dude awesome comment that’s so true<yuungjay>: 🤷‍♀️ sorry friend. your post didnt make a whole lot of sense😂 I only say shit in good fun though I wasnt trying to put you down or anything. I hope you have an amazing day<Pqouist>: Ahaha 😛✌️", "num_messages": 5, "avg_score": 0.8}
{"start_date": "1555500351", "end_date": "1555511998", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 10905, "text": "<s0angelic>: Your cousins are either your best friends or you never see each other at all [removed] [deleted]: Or you saw them occasionally and they're just ok.<WeeziMonkey>: Yeah wtf is this post<FuckYouAli>: a personal anecdotal experience that the OP decided was also everyone's experience<Andrewcoo>: If you put 'I think' or 'in my experience' or 'it seems' in your shower thought, this sub then automatically rejects your post stating personal opinion is not allowed. Edit - I think anyway. Don't know the exact terms.<airmclaren>: In your experience, you mean.<mssge>: Happy cake day!", "num_messages": 7, "avg_score": 1557.8571428571}
{"start_date": "1554472494", "end_date": "1554657004", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 4156, "text": "[deleted]: The Russian guys who lose their tickets in the beginning of the movie Titanic were the real winners <Hargroth>: They were Swedish, but yeah<itsjaredlawl>: Could you even call them swedish? Their swedish was so bad<chesterluno>: Well they're certainly not Russian<dleon0430>: Later on everyone was Russian...to the life boats.<chesterluno>: Can you can't<dleon0430>: Sorry, there's Norway to stop.<chesterluno>: Please, I beg you, stop<dleon0430>: I'm not ghana stop. Uganda make me? &amp;#x200B; <Edit>: Spelling<chesterluno>: Syriasly?<dleon0430>: Israeli getting to you huh? If you like I can send some with you Togo.<chesterluno>: What are you china do? Get a spainking?<dleon0430>: You Hungary for more?<chesterluno>: Oman, kenya please stop!<dleon0430>: Country puns are like a Pokemon. You can't stop till you Guatemala.<chesterluno>: But won't you cameroon and realize that we'll sudanly run out?<dleon0430>: There's always somalia, at least a brazillian.<chesterluno>: You need to czech your notes<dleon0430>: denmark it down yourself, I'm just trying to be france with you.<chesterluno>: With a little elbow greece I might be able to think of some more, but I'm at a laos<dleon0430>: You thought Iran away. Bhutan other day has come and I have Myanmar to say.<chesterluno>: I malta as well serbrrender<dleon0430>: I don't bolivia can. You're probably just Philippine through all these puns while Iraq them up. <chesterluno>: Ukraineing down puns, but I'm burma through my whole collection <dleon0430>: I hope you didn't buy them from chad, cause its starting to sound like egypt you.<chesterluno>: Kuwait a minute, I think you're right<dleon0430>: I think this needs to end. Jamaican me crazy with all these puns.<chesterluno>: Good, kazakhtually this is my last one", "num_messages": 28, "avg_score": 148.4285714286}
{"start_date": "1555505438", "end_date": "1555522085", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 243, "text": "<smileywater>: 2019 will be the last year of our lives that ends in \"teen\" Probably*<crispus63>: It's reckoned that the first person to live to be 150 has been born, so a few reading this might get to 2113. Unless things go completely pear shaped for humanity before then.<Joshy334>: Two words. Global Warming.<cardboardsnail>: 3 words. its not true<Joshy334>: Oh boy, a wild trump supporter has appeared!<cardboardsnail>: surprise surprise, IT'S A JOKE . I do generally suck at sarcasm even IRL btw im not white or american<Joshy334>: That sounded legit, but ok.", "num_messages": 7, "avg_score": 34.7142857143}
{"start_date": "1555520565", "end_date": "1555668354", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 14, "text": "<usenet_alias>: Some cultures are superior. <kriticalbonus>: cultures that no longer exist are the weakest cultures of the world.<usenet_alias>: They're still subject to critical analysis. Are some cultures superior? Or, are all cultures equal?<kriticalbonus>: i literally answered that question.<usenet_alias>: You weren't asked a question. You posted an irrelevant statement. Only after all that were you asked a question. Again, are some cultures superior? Or, are all cultures equal? You're under no obligation to respond.<kriticalbonus>: my original comment is the answer to the question you replied with. all i did was assume you were going to ask a question like that, or, i was just reaffirming your original post. either way, stop acting stupid, stoopid.<usenet_alias>: I have no idea what you're trying to accomplish.<internet_warlord>: I think when he said that the cultures that don’t exist anymore are the weakest just literally means that not all cultures are equal, and the superior ones still exist thus answering both of your questions<usenet_alias>: So cultures that are eradicated through ethnic cleansing are inferior? That's a very regressive opinion you got there.<internet_warlord>: I don’t have the same opinion as him. I am just explaining what he’s trying to say so you could have a more intelligent discussion<usenet_alias>: I didn't ask the man what he was saying. I asked him what he was trying to accomplish by saying it. Now, if I ask you what YOU are trying to accomplish by interrupting, will you take that as subtle hint, or will continue to explain the obvious?<internet_warlord>: That’s what he’s trying to accomplish, to tell you his opinion that weaker cultures don’t exist anymore. It doesn’t mean that even though he has a different opinion that you will disregard what he says<usenet_alias>: So that's a big negatory on the hint take. In other words, I don't need subtitles or some little lady in the corner of the screen doing sign language in all the movies after midnight. We're done here.<internet_warlord>: Well it’s pretty evident that you have a huge ego so any other opinion is irrelevant, that’s why having someone explain to you what you missed makes you uncomfortable. And I agree that we’re done here, because from the start you already made up your mind that you’re the only right one here and can never be wrong<usenet_alias>: In other news, a random contributor ignored all social cues and continued to beat a topic into the ground. Witnesses reported a futile demand to be acknowledged and appreciated. This was denied. Again.<kriticalbonus>: what he said is correct. the fact that there are cultures that no longer exist proves that there are superior cultures to some. if you dont understand that, you might want to reset the parameters to your original thought. what traits might make a culture \"superior\" and what is \"equal\" outside of the idea that all things are subjective.<usenet_alias>: A superior culture can be destroyed by natural disaster or disease. A superior culture can be conquered by an inferior culture the same way a mugger kills a Nobel laureate. A superior culture can rise, then decay on its own, the way people mature, age, and then die. Just because a culture no longer exists doesn't make subsequent cultures better. YOU are the one who doesn't understand, since you keep scare-quoting superior.", "num_messages": 17, "avg_score": 0.8235294118}
{"start_date": "1554469046", "end_date": "1554510164", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 12038, "text": "<Murderhands>: When someone steals money from you they aren't just stealing cash, they're stealing the irreplaceable time it took to earn that money. <redditoriousBIG>: Taxation is theft. <AyeMyHippie>: No it isn’t. I guarantee that at some point in your life, you’ve utilized the stuff that tax dollars pay for. Roads. You use them every day. They’re funded by tax dollars. Using tax funded services without paying taxes yourself is more akin to theft than taxation itself. You’re more than welcome to never use any publicly funded services again, if you’re so concerned about being “stolen” from. Good luck with that lack of education, transportation infrastructure, house fires, the list goes on and on. Your life would be shit without taxes. <redditoriousBIG>: Pointing out the inevitability of utilizing a monopolized service isn't a good counter argument. False dichotomy. <AyeMyHippie>: Bir Tawil sounds perfect for you. No government to “steal” taxes from you. I’m sure you can build a comfortable life for yourself there. <redditoriousBIG>: Again, this is not a strong argument. \"America, Love it or Leave It\" is a False Dilemma fallacy. <AyeMyHippie>: Except that’s not the argument at all. The argument is that if you don’t like paying taxes, you’re more than welcome to live somewhere without taxes and see how that works out for you. I’m sure you’ll enjoy the lack of basic infrastructure. Your argument of “taxes are theft” without acknowledging that you use services funded by tax dollars every single day of your life is the biggest fallacy here. Seriously, go somewhere without taxes and see how awesome your life is without clean water, paved roads and emergency services. It’ll be loads of fun.<redditoriousBIG>: If you don't like X, you can Y is the argument. It's a false dilemma in that these are not the exclusive options. This is a basic logical fallacy.<AyeMyHippie>: So tell me, what is the alternative to living somewhere that collects taxes, if you don’t want to pay taxes? <redditoriousBIG>: That's a great question and I'm glad you asked it! Any arrangement which is based on consent rather than threats of violence is valid. Another question by way of thought experiment is to think about the things government does which you don't want your taxes spent on. It's easy to point out basic infrastructure which \"no one could disagree is necessary\" I. E. roads, clean water, safe food, fire protection etc. Everyone wants a safe and productive society. You might challenge yourself to find solutions outside of the current paradigm. Many societies managed to have those things long before taxation which is a relatively new invention. Roads certainly pre-date it. \"The Enterprise of Law: Justice Without the State\" by Bruce Benson is a great primer for non-monopoly or polycentric legal systems. \"The Machinery of Freedom\" by David Friedman is about how consent based governance is not only possible but has worked in various human cultures in the past. <AyeMyHippie>: Holy shit. You think that water treatment, advanced medical care, and paved roads predate taxation? I can’t argue with you, because we’re apparently living in two different worlds. Let me know when you want to discuss the way things are on earth, and we can talk. I have no interest in discussing the history and policies of a world that doesn’t exist. <redditoriousBIG>: You asked for suggestions for solutions and I've offered them. User fee based models exist for everything you just suggested. Again, simply stating the ways that existing government monopolized services is not an argument against any alternative. <AyeMyHippie>: Have you ever been on a toll road? Imagine having to pay a toll for every single road you drive on. That’s not what you want, I promise. I guarantee that alone would eat up more of your income than the taxes you pay. Anyway, I’m done with this ridiculous conversation. Go ahead and stop paying taxes if you’re that upset over them. I’ll be glad to fund the jail you end up in with my tax dollars. <redditoriousBIG>: Imagine not threatening others with violence and being locked in a cage! There's a long history of tax protestors. I'm sure it was hard for most people in 1860 to imagine a world without slavery, in 1950 a world without segregation just as it's difficult for you to imagine a world not predicated on violence. At least you're honest about your bloodlust. <AyeMyHippie>: No, I just think thieves belong in jail, where they can’t steal from people that actually work and pay for the things they have/use. Follow the rules, pay your taxes, or find some place that is more in line with your beliefs. If you can’t find said place, maybe that’s an indication that your beliefs are stupid. <redditoriousBIG>: Excellent then we agree that government officials belong in prison for theft and extortion..", "num_messages": 16, "avg_score": 752.375}
{"start_date": "1555520830", "end_date": "1555520897", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 19, "text": "<TaylorTaft>: Cereal is just breakfast soup [removed]<college_safe_space>: I love breakfast soup. You know, I’m sitting there in my beanbag chair watching my Bob Ross porn, waiting for the midget to enter and eating my cereal. It’s Golden Grahams. When I’m about to climax I take a final bite of those delicious Graham’s, hear bob say “no that’s a happy little midget” and bam. I’m done. That is how one should spend a Tuesday afternoon<BobRossBot_>: 'Remember how free clouds are. They just lay around in the sky all day long' || [Here's a link to a random video of me painting](https://youtube.com/watch?v=I-ousb8-SD0) || [Here's a random painting :)](https://imgur.com/w4nER2N)", "num_messages": 3, "avg_score": 6.3333333333}
{"start_date": "1555491563", "end_date": "1555509012", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 8807, "text": "<JoinTheTruth>: Someone from the past may have had a genius idea that could have changed the present and shrugged it off as a bad idea. <xXChavGodXx>: Someone today may have a genius idea that can change the future and shrugged it off as a bad idea.<buttHurticus6669>: Someone in the future may have a genius idea that can change the past and shrugged it off as a bad idea<imsquaresoimnotthere>: Someone today may have a genius idea that can change the past and shrugged it off as a bad idea<MolMeister>: Someone today may have a bad idea that would change nothing and acted like it is a genius idea<BigClappy>: Someone today may have a bad idea that would change nothing and acted like it is a genius idea<skailines>: Someone today may have a bad idea that would change nothing and acted like it is a genius idea<lordwarriorpoet>: Someone tomorrow will have a bad idea that changes the future where someone else will have a good idea that fixes the bad idea to ultimately change nothing and act like it's an ok idea while everyone else claims it's a great idea, which is a bad idea. #politics<MrAcurite>: Bames Nond's having a stronk", "num_messages": 9, "avg_score": 978.5555555556}
{"start_date": "1555480427", "end_date": "1555531790", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 53399, "text": "<filetofishburger>: Maybe Earth’s like the uncontacted tribes in the Amazon, the whole Galaxy knows we’re here but they’ve agreed not to contact us. <RalphieRaccoon>: That is a serious answer to the Fermi Paradox. Basically aliens have a star trek style \"Prime Directive\" not to interact with us until we interact with them.<MartinaS90>: According to Isaac Arthur, it's not. The main problem is that if there are any technically advanced civilization, we should **see** them. You can't hide a big galactic civilization, unless you break the laws of thermodynamics. Heat is radiated as infrared light everywhere. Let's say someone constructed a something big to use the energy of a star. That structure irradiates infrared light in a way that should be very visible from our position and current technology. Sure you can't \"trap\" that radiation, but only for a limited amount of time as temperature would start increasing, at some point you have to let it go which equals to fire a lighthouse of stellar proportions. <Edit>: Anyone that wants to see what Isaac Arthur says about it can check his series of videos about it: [The Fermi Paradox &amp; the Dyson Dilemma](https://www.youtube.com/watch?v=94iDdHRa2X4) [Fermi Paradox Solutions](https://www.youtube.com/watch?v=Z4snQS1QGD4) [The Fermi Paradox Compendium](https://www.youtube.com/watch?v=rDPj5zI66LA) And many more, he even has videos in his channel dedicated exclusively to specific answers to the Fermi Paradox. Usually whatever answer you think to the Paradox (like \"the space is big\", or \"they could be using another type of energy\" or \"they are wiped out by thei AIs\") he discusses them in detail. Check his entire channel, it's one of the best in Youtube about this stuff (probably the best).<Wintermule42>: Also its very hard if not impossible to enforce such a directive. It only takes one person who ignores it to break.<MartinaS90>: This is the key point. Many people can come with a clever answer to how they could hide themselves, but that's irrelevant. Because it only takes **one** civilization to do it in a different way, or only one small group among a big civilization, or even one single individual. If anyone is going to give a Fermi Paradox answer, it has to be applieable to every single one of the hypothetical existing advanced technological civilizations, without exception.<ihaveadogname>: The most likely answer I have seen to the Fermi Paradox is that we are the first.<rafikiknowsdeway1>: The fermi paradox isnt even a paradox. Space is fucking huge, there could be advanced civilizations everywhere but it could be physically impossible for any of them to ever interact. Stuff like warp drives arent guaranteed to be possible in reality. They can easily be far enough away that the energy they give off cant be distinguished as having to come from living things<ihaveadogname>: I mean, honestly TIME is fucking huge too. Their could be 100s of billions of active civilizations that we cant see just because their light/radiation hasn't yet reached us.<UniquePaperCup>: Does anyone feel small and insignificant yet?<lrapturel>: When life gets you down Mrs. Brown....<DSM-6>: And things seem hard or tough,<raybansean>: And people seem stupid, obnoxious, or daft...<get_sirius>: And you feel that you've had quite enough!<RedChancellor>: Just remember that you're standing on a planet that's evolving<topdeckisadog>: And revolving at 900 miles an hour<AlwaysSupport>: It's orbiting and 19 miles a second, so it's reckoned<Mathguy43>: A sun that is the source of all our power!", "num_messages": 17, "avg_score": 3141.1176470588}
{"start_date": "1554521414", "end_date": "1554522217", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 14, "text": "<frogz192>: One different choice in the past could have changed your whole life <danielsjack86>: Yeah crazy man.. I had two job offers like 10 minutes apart one in Michigan where I’m from and one in Tennessee.. if the Tennessee one would have called first I’d probably have taken it and everything would be completely different.. some other timeline I’m sitting in Tennessee drinking moonshine right now <frogz192>: Exactly... I was just thinking about where I would be now if I went to another university. I would literally not and will never know the people I know now...", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1555519770", "end_date": "1555527684", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 47, "text": "<jfi224>: For sex, it’s generally quality over quantity. But to improve your chances of higher quality you’ll need a higher quantity. <Oh_You_Pretty_Thing>: You're very wrong.<jfi224>: ...you say without explanation.<stillakilla18>: Does quantity refer to partners or per act? I'm guessing per act, however this may still be a false statement. If you're actually striving for quality you should be taking your time and talking with your partner to improve the sexy time. However, most men these days just go for high quantity of partners, meaning everyone is going to like/dislike many different things.<jfi224>: Per act. And if your goal is quality then each time you do it you’ll have attempted to improve it, so the more you do it the better it becomes.<stillakilla18>: Wouldnt that apply for almost anything though? As practice makes perfect.<jfi224>: Yes. And yet many people out there treat sex differently.<stillakilla18>: I'm just guessing those many people fall under the category of not consciously improving or caring about their quality? But yes technically they're still improving with quantity.", "num_messages": 8, "avg_score": 5.875}
{"start_date": "1555520190", "end_date": "1555521382", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 8, "text": "<FunnyCarp>: Black tea is not black. <jocheeseburger11>: \"mind-blowing\" Maybe not.<RileyCargo42>: The tags are fucked and mods dont know how to fix it<jocheeseburger11>: Ah, that's my bad then. Hopefully they can fix that.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1555413589", "end_date": "1555447094", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 20515, "text": "<Patrick_W-S>: Everyone talks up Black Panther for being really diverse, but in reality, it's one of the least diverse films ever made. <HappyHighwayman>: Also Wakanda is a country run by dictators monopolizing on a resource. Do you know any nations today that are both democracies and have a large resource to exploit ? Are people allowed to leave ? Invite others to visit ? Run for office? Who elects a king via mortal combat these days ?<skrat6009>: There is a difference between a dictator and a monarch. Their history explained that the tribes agreed to live under the protection of the warrior black panther. Don't forget all the \"great power .. great responsibility\" stuff that they are clearly implying too. Also, I would hardly consider what they are doing with their resources as them exploiting the vibranium. They've used it to build an amazingly technologically advanced culture which clearly the majority of their population benefits from. Have they used that technology to shield themselves from other countries? Yes, but clearly they felt the need to do so, and by the end of the movie they have said they would be sharing their technology. As for no evidence of sharing it, letting the Avengers come in and use their technology to create a new arm for Bucky and also to separate Vision from his stone would both qualify considering how much they were against such sharing before. Also, there was a post credits scene in black panther where they were in front of a world council and said \"we will share our technology and resources and not hide in the shadows\". When asked \"what can a nation of farmers offer to the rest of the world\" the implication from their smiles was that they had a lot to offer.<HappyHighwayman>: If a single individual didn't want to live under a king then it's oppressive.<skrat6009>: I don't want to live under Trump, is that oppressive? They don't stop people from leaving. I voted, but I didn't get want I wanted. That's not how oppression works.<HappyHighwayman>: I have a feeling people can't just leave Wakanda. They even BRAND THEIR PEOPLE. To maintain differences. [deleted]: u/HappyHighwayman, Seems like democracy is doing wonders for your country.. Curious : Are you white?<HappyHighwayman>: I'm Canadian [deleted]: You're not white?<HappyHighwayman>: Are you looking to confirm your obvious anti-white bigotry? [deleted]: You are white (or mixed breed)<HappyHighwayman>: ....and? [deleted]: Effeminate. Brainwashed. Uninformed.<HappyHighwayman>: lol thanks I take your opinion quite serious, Alice. [deleted]: No everything is opinions kiddo Some things are just facts.<HappyHighwayman>: I agree [deleted]: Effeminate. Proved.<HappyHighwayman>: It’s not an insult unless you’re a misogynist [deleted]: Rephrased : If I were a misogynist would you feel insulted?<HappyHighwayman>: I don't think about you [deleted]: Thinking and feeling are two different things. Insult is a feeling. And where'd you get 'I don't think about you'? Reddit's guide to insult a person and sound intelligent? L O L<HappyHighwayman>: I read the little book that came with the internet [deleted]: Looks like it is the first time you are being bullied on reddit How does it feel?<HappyHighwayman>: It feels fine I don't think I'm being bullied. I think people are just revealing their lack patience for people who's opinions don't conform to their mainstream ones. [deleted]: Again, everything's not opinions. Do you smoke?<HappyHighwayman>: Well perhaps but their emotional reaction is telling. Not tobacco", "num_messages": 26, "avg_score": 789.0384615385}
{"start_date": "1555503795", "end_date": "1555526981", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 52265, "text": "<RomanCatholicCrusade>: “She has good child-birthing hips” is just the 1800s way of saying “Daaaaamn, she thicc” [removed] [deleted]: Wait you guys don't still say this? Child bearing hips make my nether regions engorged.<eneuendo>: I mean, my creepy ex said that he genuinely was attracted to me cause of my good child bearing hips. Mainly cause he was dead set on having 6 children in the future...<ThisIsJustAnAccount7>: Is your ex from 1800?<eneuendo>: Oh also, I still live in the same apt with him (and 4 other people) and have chatted with his most recent ex. He apparently told HER that she reminds him of Eva Braun. And that that was hot.<k1rage>: That boy ain't right<eneuendo>: Oh trust me, that isn't even CLOSE to the craziest stuff about him.<brinz1>: Do. Go on<eneuendo>: To list some of the most memorable things: aliens are out to get him, he basically larps as a Nazi (fake lugar and lots of military shit), couldnt jack off while we were dating cause he \"has a perfectly good girlfriend\", told my friend who was having a panic attack to just stop, told that same friend that some day he'd choose to not be depressed, doesn't believe racism exists. Honestly I feel like I'm forgetting a lot.<JurisDoctor>: What did you see in him that made you say, I want to be with this person?<Every3Years>: This needs an answer. \"LARPs as a Nazi\" Oh my moist moist panties have hit the jackpot.<eneuendo>: That's how my current bf described him. Cause he'll blare imperial marches and carry a fake lugar at his side while having print out of Mexican revolutionaries and Nazi generals on his walls.<Bimmbyuyu>: Wtf is a fake lugar, no dictionary has any definition of it<eneuendo>: Like a lugar (the hand gun commonly used by Germans in WWII) except it's built for airsoft, thus it only shoots small plastic balls<Bimmbyuyu>: Thanks, I had googled hard but couldnt find this meaning<eneuendo>: Fair enough, i dont think the specific term \"fake lugar\" is common, but it's just easier to type than \"airsoft lugar\"", "num_messages": 16, "avg_score": 3266.5625}
{"start_date": "1555520772", "end_date": "1555525906", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 13, "text": "<nyamtumbo>: Before we had pictures from space, we could never be completely sure if our maps were right or not. <Shamrock1423>: I think the math used in cartography made maps pretty spot on<Thunder_bird>: Yes, this.... Navigation, surveys and map - making has been at a sophisticated level for hundreds of years. Past generations were confident of their understanding of geography long before space travel.", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1555517220", "end_date": "1555534913", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 20, "text": "<Physc>: Dating apps, like Tinder, only facilitate love at first sight. <courtesy_flush_plz>: How is that all the facilitate? They're the opposite of that<CarelessSignature>: Because it provides many more \"first sights\".<courtesy_flush_plz>: But love at first sight is a term. And does not apply here. Seeing a person on Tinder for the first time has no business being in the same sentence as love.<Physc>: Under which conditions would you call something “love at first sight”? Is a picture of someone not enough to fall in love at first sight?<courtesy_flush_plz>: Love at first sight is as real as religion", "num_messages": 6, "avg_score": 3.3333333333}
{"start_date": "1555472928", "end_date": "1555506213", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 21786, "text": "<theboywholovd>: You can’t stand backwards on stairs. <Capnreid>: How the fuck does one “stand backwards”? [deleted]: Carefully<Musclemagic>: But backwards <Edit>: no fucking way!? Silver for this?? I'm speechless.. but now I know what they crave (other than Brawndo) Thank you! This is my first time. :) <edit>: referenced to r/awardspeechedits !! I've made it!<mart1373>: Yes<spicyasice>: Yes<PaulRyanMadeMeDoIt>: Yes<protocol_666>: Yes<Maax42_>: Yes<Jon5600>: r/unexpectedjojo<AntiLowEffortBot>: Hello, pointing out references ruins the effect of them. If you see a reference to something you like, just upvote it or make an original joke. This is a bot<ImmaSoldierBot>: Hey Lord AntiLowEffortBot. I think you're on the wrong website. Reddit is an entertainment site, what were you expecting? People ain't gonna stop these jokes cause a bot told 'em to. Please stop spreading hate. This is a bot. Beep boop.<RamAir17>: Good bot. I think.", "num_messages": 13, "avg_score": 1675.8461538462}
{"start_date": "1555517042", "end_date": "1555525450", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 21, "text": "<MarkSaleeb>: In a race between a duck and a penguin a duck will win but it will be so close <kung_fu_slug>: Is it a Gentoo penguin? Coz they can run pretty fast.<MarkSaleeb>: it is a regular one<kung_fu_slug>: Regular eh?.. Do you not accept all types penguins?<MarkSaleeb>: is there more than one type of ducks ?<kung_fu_slug>: Yurp<MarkSaleeb>: maybe it will be one of each type of ducks vs. one of each tyow of penguins<kung_fu_slug>: Yes. Perhaps an Obstacle course and some kind... Problem solving event should be included? If we're to discover which bird is better a broad spectrum of trials should be included.<MarkSaleeb>: we should do that on the whole jungle to know if the lion is truly the king or not<kung_fu_slug>: 'Animals got talent'?<MarkSaleeb>: *mindblowing sound<kung_fu_slug>: *followed by gold confetti raining from above*<MarkSaleeb>: dude we are geniuses<kung_fu_slug>: Entertainment and the further development of science. Surely some kind of prize will be awarded to us?<MarkSaleeb>: maybe a nobel prize in biology<darkraidisciple>: If we're trying to go as broad as possible how about a male and a female from each species competing as a pair?<MarkSaleeb>: and diffirent ages<darkraidisciple>: Or how about just every single organism on the planet is competing?<MarkSaleeb>: dude you are taking it so far<darkraidisciple>: This is science! There is no such thing as \"Too far\"!<MarkSaleeb>: yeah lets do atoms race", "num_messages": 21, "avg_score": 1.0}
{"start_date": "1555475322", "end_date": "1555538496", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 3782, "text": "<VerySpicyNoodles>: Pineapple pizza and country music are very similar. People in support of them are chill about it and don't really shove it in your face. People that are against them will go out of their way to push down pineapple pizza eaters and country lovers. <Richey5900>: Okay I’ve never really understood the hate for pineapple on pizza, some one explain please lol<Hnro-42>: I think its an american thing. Something about american pizzas doesnt suit pineapple topping. Whereas in australia, pineapple is the number one most popular topping on pizza.<TimeForANewIdentity>: I think it tastes great on American pizza! I think it's just a cultural perception that pizza isn't supposed to be sweet<EyeAmYouAreMe>: Here I am pouring honey all over my pepperoni pizzas.<KryssCom>: Half of my brain just went \"ALRIGHT GET THE FUCK OFF MY PLANET YOU FUCKING MONSTER\" and the other half went \"Hey cool man, it's not for me but if you like it then that's great for you!\"<EyeAmYouAreMe>: Crust can be dry sometimes. A little honey helps it go down. Try it 😉<TheGingerNinga>: See, I have no problem with honey on crust, but honey on top of all the sauce and cheese and other toppings? Why?<AntiAtavist>: Because i can discern more than one flavor at a time and appreciate the different mouth harmonies.<TheGingerNinga>: Ah yes, the elitism of fucking food tasting. Congrats bucko.<AntiAtavist>: Well the tongue-in-cheek tone intended clearly didn't come through. I was describing food with a music allegory, seemed on topic.", "num_messages": 11, "avg_score": 343.8181818182}
{"start_date": "1555516720", "end_date": "1555521729", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 9, "text": "<CreepyC02>: It’s impossible to do “nothing” [removed]<KingVizio>: What if someone's name is nothing<CreepyC02>: You can’t do someone’s name<Fwubalicious>: What if someone is nothing<CreepyC02>: You can’t do someone<Fwubalicious>: I can... &amp; I will", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1554519514", "end_date": "1554523311", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 248, "text": "<SomaliPrince2002>: No one would want to watch an 8 hour movie, but break it up into 8 one hour episodes and people will binge it all in one sitting. [removed]<UsernameTakenTooBad>: Person: Would you watch an 8 hour movie? <Me>: Well yes, but actually no<porkman384>: Well no, but actually yes.<romwalls567>: People want what they think they don't want <Lams1d>: People think they don't want what they actually do want.<tysc3>: People don't think it be like it is but it do.", "num_messages": 6, "avg_score": 41.3333333333}
{"start_date": "1555507375", "end_date": "1555508665", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 10, "text": "<YourOwnBiggestFan>: A lack of crime reports in media is either a really good or a really bad sign. <CarelessSignature>: They say 40% of crimes go unreported. How do they know?<FloatingGrav>: Police reports, government reports etc.<CarelessSignature>: My question was on the unreported ones.", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1554522120", "end_date": "1554522643", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 2, "text": "[deleted]: A pear is an upperclass apple [deleted]<fiveXdollars>: I think an apple tastes better and has more use in cooking<sproutacus007>: Exactly.", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1554516978", "end_date": "1554522267", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 17, "text": "<GuffManDude>: “Lol” has come to represent almost every degree of laughter except “laughing out loud” <camjarrold>: Very true. If I do actually laugh at loud it tends to be something along the lines of \"fuck me hahahahahahahah\"<GuffManDude>: More characters usually=more actual laughter<camjarrold>: Oh for sure hahah. I literally say lol if I don't find something funny but feel bad not laughing, I'm also ashamed to say I don't only do this via messages.<GuffManDude>: Lol is more a disarming tactic than anything at this point", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1555519926", "end_date": "1555523834", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 22, "text": "<the_celi>: Humans are lucky that there wasn't any virus capable of causing mass infectious disease when there were only few of us walking the earth <TrashFalcon>: What, like the plague or influenza?<the_celi>: Yea...which came much much later in cosmic timeline....by that time humans were genetically diverse, geographical isolated, medically advanced<TrashFalcon>: Apparently we had things like whooping cough and leprosy dating back to 300 odd million years ago.... that’s perhaps not the beginning of humans but definitely right back in the day.<the_celi>: True.. we got lucky...we survived<TrashFalcon>: We did. Kinda a shame tho.<the_celi>: I think I partly know what u meant....but still.... Why do u say shame?<TrashFalcon>: Well. I’m a human and I like being alive, and living and being free’ish. But from a blue sky perspective we’re a shitty race that have fucked up the earth, enslaved almost all living things and and generally act in un-worthy of our status ways that point towards us never making it this far as a species being a good thing. We invented religion which is a bad enough crime to warrant not being here. Also, I’d love to see the ape or dolphin version of. McDonalds drive through.<the_celi>: &gt;we’re a shitty race that have fucked up the earth No truer words were ever spoken...<TrashFalcon>: Thanks! I’m going to follow you, your posts are quite cool. Do you ever consider what earth might have been like without us? I wonder what unique challenges would have occurred without the human element. For example Dolphins becoming extinct as a result of them being too effective as hunters.<the_celi>: &gt;I’m going to follow you, your posts are quite cool. Thanks &gt;Do you ever consider what earth might have been like without us? In short I'll say it would have been in a lot of good condition.... But then again there are other complications like instead of us some other species were to come to power as a super species.. after all what differentiates us from others is our brain....maybe they would have bought the apocalypse a lot sooner or maybe later or never.... We'd never know the things that didn't happen... Maybe in some distance future they might run massively large scale realistic simulations on computer to determine the alternate possible futures...that will be cool to see &gt;For example Dolphins becoming extinct as a result of them being too effective as hunters. Bringing whole species to the verge of extinction is the worst thing humans have done and are continuously doing... It really saddens me knowing that the world will never see the likes of those gone extinct... Reminds me of a line from Hellboy II- The Gold Army \" man had been created with a hole in his heart, a hole that no possession, power, or knowledge could fill. And in his infinite greed, man dreamed of expanding his dominion over the entire earth......Greed has burned a hole in their hearts that will never be filled; they will NEVER have enough!\"", "num_messages": 11, "avg_score": 2.0}
{"start_date": "1555508501", "end_date": "1555541737", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 58494, "text": "<danceswithwool>: If you curse at inanimate objects, no one cares but if you talk nicely to them people will think you’re crazy. <BlackTheNerevar>: That's because deep down we don't want what happened in the terminator movie, so we assure dominance early. Never let them know they are better than you.<supreme_kream>: Sometimes I feel bad for inanimate objects. Is this bad<Nero-4>: You can judge a person's character by the way they treat people(and things) that can't fight back.<javalorum>: I think that was part of the best dating advice I was given.<OfficialTacoLord>: *cough* sevice employees *cough*<Raymy93>: Not the emoyees!!<billybobjoe102>: r/engrish<Raymy93>: Thats how op spelt it before he editeds his comment :)<billybobjoe102>: That’s a fat oof on my part. I apologize.<Raymy93>: Thats ok it was a sneaky edit!<billybobjoe102>: Yep", "num_messages": 12, "avg_score": 4874.5}
{"start_date": "1555520325", "end_date": "1555521193", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 11, "text": "<gapii98>: The phrase “It’s a white man’s world” doesn’t really apply to the whole world. <AndThatsHowIgotHSV>: Doesn't apply to most of it.<slothluuuvchunk>: u/AndThatsHowIGotAUsefulDistinction<AndThatsHowIgotHSV>: There are dozens of us!!!", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1555440699", "end_date": "1555453100", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 63091, "text": "<theinspector5>: Of all the spiderman universes you could have been born in, you were born in the one where he is a fictional character. [removed]<ninja_cracker>: infinite universes doesn't mean an existence of a universe where a super hero with spider like powers exists.<BDooks>: I mean... If the universes are infinite then why would that not exist? <Edit>: Okay we are being pedantic with what should be a funny shower thought<ninja_cracker>: Things can be infinite without containing all possibilities. There are an infinitely amount of odd numbers, none of which are even.<pingu_for_president>: But the defining characteristic of an odd number is that it's not even. It's logically impossible for an odd number to be even. Is it a defining characteristic of a guy who wears a red costume and shoots sticky webs that he doesn't exist?<ninja_cracker>: infinite does not mean everything. I was trying to find an intuitive example of where something is infinite and does not contain everything. The infinite universe theory states that there is infinite amount, but doesn't state that all of them exist. The gummy bear universe where gummy bear versions of us having this conversion, in all likelihood, does not exist, for several reasons.<pingu_for_president>: True, but there are scientific reasons for that. Is there a scientific reason why no-one would be born with some kind of genetic mutation (I don't think the backstory has to be the same for them to be Spiderman) that would allow them to shoot spiderwebs?<critically_damped>: No, but that characteristic alone wouldn't qualify them for the title of *Spider-Man*. (respecting the hyphen) This is the same as people who argue for a historical Jesus Christ. Certainly there may have been 50 or 60 itinerant preachers named Yeshua or whatever, and maybe even all of them gave sermons on mounts about loving your neighbor and paying your taxes. But unless it an be shown that one of them had magical powers over life and death, the argument that *Jesus the Christ* actually existed is invalid.<KetamineKastle>: Jesus being a real figure is pretty much universally accepted by historians. Saying Jesus didn’t exist is the equalivelent of a Christian saying “evolution doesn’t exist” even when almost all scientist universally accept it.<critically_damped>: No, it isn't universal, and further your response blatantly ignores what I just said regarding what \"actually existed\" means. So I would like you to back away from the scripted non-sequiturs you have lined up and actually read what I wrote if you're going to respond. Those \"historians\" who \"universally accept\" that Jesus was a \"real figure\" *do not have any evidence of the miracles and other things that actually define the character of Jesus in the Bible.*<KetamineKastle>: The Jesus in the Bible existed and was crucified for his blasphemous claims by the Jews/Pontius Pilate. Regardless of if you believe he did miracles. Maybe he was a crazy guy with a delusional cult following who knows. Saying “40-50” implies you don’t think that specific man existed.<critically_damped>: Saying a thing doesn't make it true. \"Historians\" saying a thing doesn't make it true. *Saying that Historians say a thing* Sure as **FUCK** doesn't make it true. And you keep completely dismissing the fact that without the fucking magical powers, the person you're talking about isn't **Jesus Christ**, exactly how a guy named Peter Parker who *doesn't* have spider powers isn't fucking **Spider-Man**.<KetamineKastle>: &gt; Saying a thing doesn't make it true. \"Historians\" saying a thing doesn't make it true. This is exactly why I compared it to creationism. It's borderline delusion against facts and evidence to support your beliefs. What would you say if you replaced historians with \"scientists\" to a Christian?<critically_damped>: I would say that you were replacing words without regards to meaning, context, or respect for language or ideas. I'd say you were engaging in a half-assed whataboutist word-swap game because you can't fucking stand to talk about the idea that there's no evidence that any person with magical powers has ever existed.<KetamineKastle>: Edgelord 3000 here. You literally said &gt;This is the same as people who argue for a historical Jesus Christ. Nobody argues Jesus as a messiah who did miracles as a historical fact. Even the most diehard Christian fundamentalist will say it comes down to faith. When people argue for a historical Jesus they argue for whether the man himself existed historically, not his powers.<critically_damped>: Even when you copy and paste parts of what I write you can't be bothered to read a single fucking word of it. I'm done with you. You were never talking to me, you're just here to vomitously repeat your mantras and thought-terminating homilies.", "num_messages": 16, "avg_score": 3943.1875}
{"start_date": "1555521180", "end_date": "1555521427", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 2, "text": "<Josef-Stalin8>: Wolverine and Deadpool will always have their umbilical and their foreskin <olihamblin>: Deadpool wasn’t born with his powers, so not the umbilical chord. Not sure about Wolverine<Josef-Stalin8>: Wolverine is the same way but I would think that their powers would heal this", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1554492854", "end_date": "1554522236", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 14, "text": "[deleted]: A high EQ is more of an indicator for success in life than a high IQ. <soup_cow>: Your must not be very successful [deleted]: 😂 why do you say that?<soup_cow>: You can't try to correlate high IQ with high IQ... its one in the same thing. [deleted]: But I do appreciate your clarification. 😊 Thank you. <soup_cow>: Honestly read EQ as IQ lol my bad. [deleted]: We're all good, soup_cow! 😊 I'm guessing with the way the post keeps getting down voted and up voted, others may think I'm an idiot, too. Lol<soup_cow>: We're (the ones reading EQ as IQ) the idiots here, haha [deleted]: 😂 Ehhh, reading is hard. Lol. Seriously though, I do that all of the time.", "num_messages": 9, "avg_score": 1.5555555556}
{"start_date": "1555517251", "end_date": "1555544580", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 23, "text": "<Infectious_Burn>: \"The sky's the limit\" is a horrible thing to say to a prospective astronaut. <TechzR>: Reach for the stars then<Infectious_Burn>: Nice comeback.", "num_messages": 3, "avg_score": 7.6666666667}
{"start_date": "1554521651", "end_date": "1554577422", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 106, "text": "<Samyie>: Everyone agrees with the right to free speech until your opinion is the one being shit on. <Javerlin>: Free speech is always easy when it’s not you in the firing line. It’s important to remember that in order for you to have rights, you have to stand up for the rights of others that you do not agree with. This is what worries me about google blocking anti-vax searches. I’m all for the government legislating around vaccinations. But when you stop information everyone agrees to block it if it’s for the greater good, but what happens when what people perceive as the greater good changes? I’m very much worried about the blocking of information, because as soon as you can convince someone it’s bad for them, you justify the stopping of information, whether it’s actually bad or not. <Edit>: for clarity. Freedom of speech laws against violence or bomb making instructions should still apply. Further, laws mandating vaccines are supported by myself. I’m raising concern about censorship by mob rule by companies and governments.<fuhrertrump>: im pretty sure there is a few groups that we don't agree with, and we don't defend. example: racists, anti vaxxers, nazi's etc... &amp;#x200B; or is there something we need to know about you?<Javerlin>: Under some governments, being gay is illegal. In those societies removal of information regarding homosexuality is the norm. Look at Russia. With growing divisiveness in the West we should be worried about what ideologies are in ascendance and if we want to set a precedent for removing information from public accessibility. Just humour the thought experiment, say nationalism grows in the West, and liberal ideas are thought of as dangerous, if there was a president for removing information then it would be done much sooner, make it easier for that information to be removed and harder for a liberal resurgence. In countries with free information democratic processes emerge. At no point did I ever say things like antivaxers should be defended. I clearly stated I support legislation against them. I’m simply concerned about governments and cooperations deciding what information the public has access to. Look at the way social media and data collection influence our voting and politics. I’m expressing concern, there’s no need to accuse me of being a nazi apologist for wanting freedom of information.<fuhrertrump>: [https://en.wikipedia.org/wiki/Paradox\\_of\\_tolerance](https://en.wikipedia.org/wiki/Paradox_of_tolerance) &amp;#x200B; come back after you had a read through this. <Javerlin>: I’m not advocating tolerance without limit. As stated in both of my pervious posts. If you wanted to discuss something with me I’d be more than glad to. But as you are not engaging with what I have to say I wonder what you are doing here.<fuhrertrump>: giving people a chance to educate themselves of their own free will before they find themselves on the wrong side of history. &amp;#x200B; i can lead a horse to water, but you can't make it realize giving nazi's a foot to stand on is bad.<Javerlin>: Again. I never advocated that. I specifically said that legislation against these issues is supported. Don’t strawman any further. Information restrictions such as bomb making instructions etc should still apply. Freedom of speech laws against inciting violence still apply. I said we need to consider the president that we’re setting before it is used against the liberal world that we enjoy.<fuhrertrump>: so then, i guess i should ask you, in your infinite wisdom. how many people do nazi's and similar white supremacists have to kill before we decide killing them first is in our best interests ? 100? 10000? 1000000? &amp;#x200B; do they have to kill as many minorities as the did in the 40s? what about half? or 10% ? &amp;#x200B; they got up to 14 million ish before we were able to finally stop them, is that how far you need it to go before you realized you fucked up just like the weimar republic did ? &amp;#x200B; &amp;#x200B; fail to learn from history, you are doomed to repeat it lol. &amp;#x200B; though let me know sooner rather than later how many people need to die so i can let them know lol. <Javerlin>: What... oh wait: u/fuhrertrump Well that explains things.<fuhrertrump>: \\&gt;TFW you think the guy that is against nazi's is a nazi because he created an ironic username &amp;#x200B; i suppose you have a difficult time with buffalo wings too huh? lol <Javerlin>: Nope, I just think you're a troll<fuhrertrump>: cool story sweetie.", "num_messages": 13, "avg_score": 8.1538461538}
{"start_date": "1555498288", "end_date": "1557564939", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 1636, "text": "<snarkpowered>: Of all the Spider-Man universes you could be born into, you were born in the one where Stan Lee is not a fictional character. <10_Virtues>: You mean we were born into the universe that the 'One Above All' lived.<StarChild413>: I thought it was canon that he was an Emissary of the Watchers<10_Virtues>: It's probably that to for the MCU. I was going off a theory that Stan is the OAA in comics. And there is a part in the 90's Spiderman cartoon, Peter goes to a universe without a real Spiderman, our world. He meets Stan and takes him webslinging around the city and Stan gives some wisdom.<StarChild413>: Sorry, too many Marvel universes, too damn hard to keep track", "num_messages": 5, "avg_score": 327.2}
{"start_date": "1555515803", "end_date": "1555588860", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 13077, "text": "<arthritictongue>: If we can raise $600 million in 24hrs to rebuild a church, it shows that we could solve real world shit if we really wanted to. [removed]<lightknight7777>: The problem is that a church is a super easy problem to solve. Throw money at it until it is rebuilt. But something like solving cancer doesn't have a clear target to throw money at.<CrimsonWolfSage>: Could try Cancer Research Groups... just don't expect results right away.<shablagoo135>: Because cancer treatment is a billion dollar business, so if there is a cure they would lose money. For some reason people are willing to spend money on religion for no reason.<kyew>: Researchers don't work that way. If someone cures a disease they get awards and then everyone moves on to the next disease. There's always more diseases.<saintsfan636>: This exactly. People treat cancer like its a singular disease, like smallpox for example, when in reality it's thousands of complex diseases with varying causes that can really only be \"cured\" one at a time. There is no magic, overarching cure for cancer.<kyew>: Even if there was a way to cure all cancers, it's not like that means it would *prevent* all cancers. Spontaneous mutations are always going to happen. So there will always be a market for the cure.<Xarethian>: Lets just hope they don't jack the price so goddamn high you live to regret it.<kyew>: That decision is made by people who are about a dozen degrees of separation from the people who work on developing the cures.<Xarethian>: Good point.", "num_messages": 10, "avg_score": 1307.7}
{"start_date": "1555508827", "end_date": "1555553600", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 497, "text": "<The_Melon_Man>: The leaning tower of Pisa is just a regular tower, but Italic. [removed]<iamjason10>: Isn't everything in Italy italic?<HiveMynd148>: *it's times New Roman*<Coopthecool>: r/PunPatrol Drop the pun and come with me please.<HiveMynd148>: Are you going to arrest The General secretary of the PunInternational here officer?", "num_messages": 5, "avg_score": 99.4}
{"start_date": "1554519675", "end_date": "1554521736", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 24, "text": "<GooseandMaverick>: You've probably masturbated to the same porn as your dad. <BreezePosts>: The chances of that are so low.<GooseandMaverick>: Maybe, but if you both use reddit to watch porn then you might be apart of the same subreddits. Or you might like the same type of porn and watch the top videos on that website<BreezePosts>: Because an old Vietnamese dude is on Reddit? And who the fuck watches porn on Reddit.<FireLordObamaOG>: You don’t watch it on Reddit. You get material from Reddit for later. Remember there are all different kinds of masturbaters", "num_messages": 5, "avg_score": 4.8}
{"start_date": "1555520586", "end_date": "1555535215", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 26, "text": "<garrickfuller>: Every person could see colors differently but no one would know. [removed]<opinion_overflow>: There is limited range for the spectrum of visible light. So once neuroscience is advanced enough we can verify that the visual processing areas of the brain are functioning the same<leeman27534>: the problem is more the subjective experience. &amp;#x200B; hell, red's the same wavelength, there's no issue there. and likely no issue for the way the brain interprets it. &amp;#x200B; but the actual experience of seeing red might be different, even with all of that.<opinion_overflow>: With sufficient technology to the point of reducing neurons to their elementary particles and a computer strong enough to understand all that information, you could interpret someone else life in the computer, under the condition that consciousness is technologically attainable. I was more trying to state that claiming we'll never know if we see things differently is not true. As we could eventually. Though that being said on the slightly more philosophical side of things you could claim that nobody interprets things the same way and draw a conclusion from that sort of argument. After all individual interpretation is almost the definition of subjective in the case of trying to make a claim with the data assumed for this argument.<leeman27534>: i'm one of those people that thinks consciousness can't be digitized or quantified as much, merely the brain can. course, also an existential solipsist, and not certain anything BUT my mind exists, either, so eh.<opinion_overflow>: Yeah, I'm kinda weird. I'm a Christian with keen interest in neuroscience and futurism. Ultimately I believe the consciousness is an algorithm, it's just infinitely complex through God's power. ¯\\_(ツ)_/¯ people are interesting", "num_messages": 6, "avg_score": 4.3333333333}
{"start_date": "1554521238", "end_date": "1554533916", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 71, "text": "<karteldan>: The plural of man is men, the plural of woman is women. It seems wasted the plural of human is not humen. [removed]<Jmgone>: Umm human is already plural<You_minivan>: Ok, one human plus one human is....? The word human is both a noun and an adjective. The noun is pluralized in English by adding an 's.'<Jmgone>: Mmm no not every English word is pluralized with s and btw its 2 human<You_minivan>: I didn't say all words in English are pluralized with an 's.' The whole point of this post is that some aren't, but this one is. I feel sorry for the two humans that created you. <Jmgone>: I dont feel sorry for your parents but I do feel sorry for you. Being brought up believing humans is the plural to human must be a sad life<MopishOrange>: \"Human\" comes from a Roman word, so from an etymological standpoint, \"humans\" is the proper form. Being brought up to get this aggressive over a word must be a sad life. <You_minivan>: My degree is in linguistics, and it just makes me sad that anyone with the power to look up something as simple as a single word on the internet so easily would not take the opportunity to do so before posting.", "num_messages": 8, "avg_score": 8.875}
{"start_date": "1555455527", "end_date": "1555501905", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 13167, "text": "<shayocean>: Most people are made on beds, born on beds and die on beds. <usernamefreakingout>: Some people are made on drugs, born on drugs and die on drugs.<RussianSparky>: Some drugs are made on people, born in people, and die in people.<101conrad>: r/vore_irl<djreisch>: Can you explain to me what this subreddit is about? It’s virtual gore? Fake gore? I don’t get it<kecou>: Vore is a fetish about either eating, or being eaten by someone/thing.<djreisch>: Oh that’s a little more unsettling than I thought<kecou>: At a convention I went to a late night panel about fetishes. Vore is just a crossing of the the two most basic drives of any creature, food and sex. It's really not that hard to see why someone might have that kind of fetish<propanololololol>: Because it's not simply food, it's people as food.<kecou>: It's fantasy, and most of it is not violent. Think about how people are into BDSM. Pain is a very primal thing, as is sex, so over time they became intertwined. I'm friends with a guy who is big into furry porn so my tolerance for the odd is pretty high, so maybe i think about this kind of thing differently, but if its just a weird fantasy, why care?<propanololololol>: Oh, I think I'm talking out of my ass then. If it's fantasy then that's fine<wotmate>: Of course it's fantasy, it's being swallowed whole by another person. It's like the ultimate oral sex (from what little I've seen)<propanololololol>: Whole? I was really talking out of my ass. I thought it was any form of consuming your partner<wotmate>: Yeah, I went down the /r/vore rabbithole once and every pic I saw was people being swallowed whole by other people... I didn't last long though, so I could be wrong.", "num_messages": 14, "avg_score": 940.5}
{"start_date": "1555520679", "end_date": "1555521370", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 95, "text": "<dbrady0805>: Would the cars in the movie Cars have life insurance or car insurance [removed]<hoodrichthekid>: Well car insurance would be life insurance<opinion_overflow>: Yeah but what do they call it?<hoodrichthekid>: Insurance", "num_messages": 4, "avg_score": 23.75}
{"start_date": "1555485350", "end_date": "1555520844", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 11, "text": "[deleted]: Homophobia exists, so by this logic heterophobia could maybe exist. [deleted]<freeprince1982>: It's true it does exist. But society hides that aspect<TheSwagCat49>: I guess what you sayin' is true, I couldn't find it on Oxford dictionary.<surveying_flea>: Fun suppressed fact Homosexuality is a mental/psychological disorder, but big money had it removed from the American medical and psychological reference books.", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1555499454", "end_date": "1555500877", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 209, "text": "<creamcheese11001>: We can understand the behavior of a galaxy 17 billion light years away, but have only explored 5% of our oceans <Dadbodyy>: To be fair, we have explored less than 1% of space.<randomly_mexican>: How do you know what percentage of space there is?<Dadbodyy>: That’s why I wrote ‘less than’. Because we haven’t explored much at all.", "num_messages": 4, "avg_score": 52.25}
{"start_date": "1555501969", "end_date": "1555512088", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 2902, "text": "<LikeBrockWork>: If you think about it, bird callers are people just catfishing horny birds. <KamiKami3>: I think a better term is \"birdfishing\"<jukka629815>: yeah I mean if you would catfish a cat what would you be?<KamiKami3>: Catception?<HiveMynd148>: I would've called PunPatrol on this but the puns are so bad I would've got arrested.", "num_messages": 5, "avg_score": 580.4}
{"start_date": "1554516841", "end_date": "1554517787", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 166, "text": "<BL00DBL00DBL00D>: The phrase “You are not” can be shortened to “you’re not” or “you aren’t”, but you can’t combine them to make “you’ren’t” <_just_my_2_cents>: Yeah, you usually can’t combine three words<BL00DBL00DBL00D>: Are there any other situations where three words have the potential to combine?<UnspeakableR3bel>: whom’st’ve<BL00DBL00DBL00D>: I appreciate the support, kind rebel.", "num_messages": 5, "avg_score": 33.2}
{"start_date": "1554513107", "end_date": "1554550830", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 3141, "text": "<Bert-63>: In real life, the people you accidentally see naked are never the people you WANT to see naked. Discuss.<TheDanishThede>: And this is why I feel more lucky than I deserve. My bf is currently sleeping beside me after driving All night from a meeting in Zürich. He is 197 cm tall, buff with broad shoulders, slim hips, soft golden hair and square chin. He is the one person I want to see naked THE MOST and here he is. As he is every night. <Yarusenai>: Weird and totally unrelated flex but ok.<TheDanishThede>: That shit happens when you are deliriously in love. My bad.<Yarusenai>: No offense, but this kind of love makes you blind to a lot of things. I hope you'll find success, but I have seen people be so in love they didn't realize a million red flags, flaws or problems that piled up behind them. Be aware always and make sure it works out.<TheDanishThede>: Thanks for the warning, and I am absolutely certain it is needed for SO MANY people. As it is, we have been living together for 1.5 years and the only thing to crop up is an annoying habit of leaving dirty boxers and socks kicked under the bed, and nail biting. I think we'll be fine.<Yarusenai>: Awesome! I hope so. Wishing you all the best.", "num_messages": 7, "avg_score": 448.7142857143}
{"start_date": "1554471232", "end_date": "1554522427", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 170, "text": "<ItzSiez>: Texting has allowed us as a generation, to talk shit about someone, behind their back, in front of them. <Fakeaccount451>: Bruh, your saying communicating online is bad, by communicating on an online social media site. Intelligence 100<ItzSiez>: I didn't say communicating online is bad... I meant to display how humans have evolved. Whether it is good or bad is up to you to decide <Fakeaccount451>: I understand that, but the fact of the matter is, most of the communication online isn’t just talking shit to each other, it’s actual communication to other humans. The moment that humans stop communicating altogether, is the moment we have to worry about", "num_messages": 4, "avg_score": 42.5}
{"start_date": "1554522297", "end_date": "1554522607", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 14, "text": "[deleted]: No matter how hot it is, a blanket is always necessary to sleep at night. [deleted]<MeyMeyticHazard>: No not always in hotter climates. Caribbean summers are so frickin hot you would need like 5 fans if you wanted to not die of heat stroke with a blanket on. Especially considering air conditioning can be rarer down there. Even in Texas it gets too hot for a blanket in the summer<lecorrele>: Lol this is actually true, I am a Texan. I live in an older home with AC box units (or whatever you call them) and even then, it’s unbearable during the summer.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1555502949", "end_date": "1555600303", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 5161, "text": "<CursedOverlord>: There are only two days in your life where you didn't live the whole 24 hours. [removed]<Colonelbuzzard>: What if you fly between time zones<Guardian983>: Hey there. Remember me? You filthy punner? You still haven’t answered for your crimes.<Colonelbuzzard>: *Over radio* Bro I escaped like a week ago. Check the comments<Guardian983>: You escaped, I hunted you down<Colonelbuzzard>: *over radio* where am I then?<Guardian983>: *sigh* we’re at this again, huh? It couldn’t be the same place as before, you’ve got to give me a hint<Colonelbuzzard>: *over radio* No I don’t<Guardian983>: That’s just unfair then. Anymore and this’ll be a godmoding contest<Colonelbuzzard>: *over radio* I’m just gonna keep making puns. You gotta catch me in the act<Guardian983>: I don’t think that’s how that works. You escaped the gulag, I have to hunt you down and find you<Colonelbuzzard>: *over radio* well, arrest me on one of my recent puns<Guardian983>: r/ESOguilds ?<Colonelbuzzard>: *over radio* just arrest me when I make a pun on a sub. I dunno, put me on a punner list. Than other people will try to arrest me.<Guardian983>: Fine.", "num_messages": 15, "avg_score": 344.0666666667}
{"start_date": "1554521997", "end_date": "1554525672", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 24, "text": "<udhayy315>: If nothing is impossible, then there's a possibility for something to be impossible. [removed]<Showerthoughts_Mod>: Thank you for your participation in /r/Showerthoughts. Unfortunately, your submission appears to mirror a common thought. [Here is a previous example](http://www.reddit.com/r/Showerthoughts/comments/93b36v/nothing_is_impossible_therefore_it_is_possible/). Your submission has therefore been removed. Please remember that as per Rule #1, **all showerthoughts must be original and unique**.<udhayy315>: Wait what lol", "num_messages": 3, "avg_score": 8.0}
{"start_date": "1554477106", "end_date": "1554522455", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 325, "text": "<70720>: If life has no purpose then you can't really waste it. [removed]<Malidorn>: Actually you can, quite easily. If life has no purpose, then it is up to the individual to steer the course of their life and decide for themselves where they find value and meaning. If this person were to be convinced to do things they hate for the majority of their life, never allowed to truly explore what life means to them, stuck in a series of obligations they're only really engaged in because they've had it drilled into their head that they \"should\", only to look back later in life and regret all the opportunities they had allowed to pass them by, then that is precious life wasted. TL;DR: Don't get so caught up in the rat race that you don't allow yourself to truly experience life on your own terms. You will have a literal lifetime of regret if you do.<digitaldrummer1>: BRB ragequitting my job at Walmart and using what little money I have to foolishly attempt to go on a nationwide road trip in search of my big tiddy goth gf soulmate.<Malidorn>: Any advice, taken to its absolute extreme, becomes foolish.<digitaldrummer1>: The sad thing, I'm aware of that. Aware enough that I seem to fear the idea of failing such an endeavor and knowing the consequences to the point that I sheepishly prefer to stick with the crap day-to-day routine that I already have.", "num_messages": 5, "avg_score": 65.0}
{"start_date": "1555499595", "end_date": "1555525371", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 8, "text": "<SRidwtd04>: We all know th apple, in dutch apple is appel. We also all know the orange, in dutch orange is sinaasappel. In Dutch it's ananas and in english pineapple. In one language it has apple in it, in the other not(except apple)<English>: apple | orange | pineapple<Dutch>: Appel | sinaasappel | ananas<indianb0nes>: If you’re referring to the color orange in Dutch it’s oranje and pineapple is only pineapple in English most other languages have close variation to ananas. This is something that caught my attention as well. Closest I found was piña in Spanish. What I can’t get past is bear in beer in Dutch look that one up and tell me it’s not a mind fuck.<SRidwtd04>: Huhu No im referring to een sinaasappel. I am durch so maybe read it before you comment.... You clearly don't get what I mean<indianb0nes>: I get it you're durch and you were connecting the dots of pineapple apple appel sinaasappel and ananas, I was merely trying to relate by giving my own thoughts on the relationships of the languages as I am also perplexed by the way languages are used and developed. I don't get what being durch has anything to do with it. I also forgot to bring up the whole citroen and limoen. ALSO saying beer and beir outloud sounds so close to me. I have had this convo with a lot of dutch people and I get the same response, they don't get why I find it confusing. It just sounds similar. Speaking of beer, I find it also amusing you call your neighbor buurman which sounds like beer man to me. I was introduced to a neighbor and my dutch isn't that great (big shock) and I thought oh this guy works at the beer store. ANOTHER funny story I was working for some people in Holland and one of the employees that didn't speak English came up to me asking for a scheck or thats what it sounded like. I told him I don't get paid until Saturday then one of the guys that did speak English told me he was asking for a rolled cigarette.<SRidwtd04>: Than say that now it felt like you said I was wrong or sth because no I wasn't referring to the colour why would you thing that if I'm talking fruit and sinaasappel..? Also we here in the Netherlands (at least me) prefer to call the Netherlands the Netherlands and not Holland because: fun fact, Holland is actually just a part of the Netherlands.<indianb0nes>: Well aware that Holland is not technically the Netherlands. I prefer saying Holland, I never understood why they call it THE Netherlands as apposed to just Netherlands. Why not Nederlands even. Why is Duetschland, Germany? Munchen - Munich. When I commented on the color I believe that was in response to someone's comment. And Feyenoord is of course the greatest club of all time.<SRidwtd04>: The Netherlands is called Nederland in Dutch. I know why it's multiple though. A long time ago the Netherlands used to be called: de 7 Verenigde Nederlanden (the 7 United Netherlands). Now in Dutch people were too lazy to say de Nederlanden and Nederland Just sounds better and unique, as one, but the English people didn't really care about that I guess and called in the Netherlands. Kinda like the United States of America, also multiple Maybe something went wrong idk🤷 all good now Haha I don't know much about football. I do know Ajax won last night.<indianb0nes>: That could be, I'm no historian but I always wondered. Thanks for the responses.", "num_messages": 8, "avg_score": 1.0}
{"start_date": "1555476314", "end_date": "1555521412", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 8, "text": "<K-LUB_101>: It's crazy to think that a decision two people made will affect your life more than any decision you could ever make <sansg>: This is so poorly written that it makes my head hurt.<morgathan>: How so? I thought it's about ones parents.<K-LUB_101>: correct", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1555521337", "end_date": "1555521555", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 8, "text": "<Night_Duck>: You can never look at your reflection without making eye contact [removed]<CarelessSignature>: What if it's a low-hanging mirror which isn't reflecting your face?<Night_Duck>: I guess the assumption here was that you were looking your reflection in the face. You can obviously look at a different part of your reflection", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1555520802", "end_date": "1555522167", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 11, "text": "<JackalMainOkay>: In toy story, there are toys based on the toys in the movie. <LetsGoX2016>: Andy’s mom also has toys named Buzz and Woody probably.<f4thom>: Wow.", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1554522580", "end_date": "1554523161", "thread_id": "t3_ba0erb", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": -1, "text": "<VectorTorn>: Could you elaborate?<tryingtobesarcastic>: Just kidding, could you not get offended? <VectorTorn>: Not getting offended, just want some elaboration <tryingtobesarcastic>: Haven't seen any girl streamer that good, but I do take my words back. It can happen.", "num_messages": 4, "avg_score": -0.25}
{"start_date": "1555517647", "end_date": "1555527025", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 21, "text": "<ewwabutterfly>: If we were able to fly, any risky behavior related to heights wouldn’t be amusing to us anymore. <Corflon_Ultra>: Drunk driving would be a thing<ThePrattattack>: Drunk flying?", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1555485865", "end_date": "1555493863", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 24, "text": "<DumbCowGoesMoo>: The kids who used to say 1+1 is 11 were technically right in base 1. <sketchyrealitycheck>: In HS one of my math teachers said we could skip the final if we could prove something mathematically impossible. She shouldn't have said that because there were four of us in the programming club. We turned in a \"how to make 2+2=10\" essay.<DumbCowGoesMoo>: &gt;how to make 2+2=10 How'd you go about doing that?<BobbitTheDog>: Yeah I don't get that, even using binary... 2 = 10 2+2 = 10+10 = 100 in binary Maybe it was meant to be 2+2=100? Or 1+1=10? Also, you aren't proving anything mathematically impossible. You're proving that decimal \"one\" + decimal \"one\" = binary \"one-zero\", which is perfectly mathematically sound.<Ducttapemummy>: Not binary, base 4. Binary is base 2, so you count: 0,1,10,11,100 Base 4 would be counted:0,1,2,3,10,11,12,13,20... So 2 +2 in base 4 actually makes 10<BobbitTheDog>: Fair enough, but then I'm not sure how programming is relevant... No systems use a quarternary system that I can think of... Also still nothing impossible proved, if I was that teacher I'd a smacked those kids down fast... But tell them it was a good attempt.<Ducttapemummy>: I believe the thought behind his post is, same as me, through programming you get to know and understand other counting systems. We never learned this in school. We just came in touch with it through the interest in programming oder similar things. So the others simply had no idea of how binary, hexadecimal or any base x system works. I don't know why they chose base 4 to prove their point, but that honestly is not our business. Yes, you're right. They don't prove anything impossible, but if they for example asked their teacher: \"If we can prove you that 2+2=10, can we skip the finals?\", it would be the teachers fault, which it is either way, because the skipped it. So i leave you to thinking in peace. Have a good day :)", "num_messages": 7, "avg_score": 3.4285714286}
{"start_date": "1555496777", "end_date": "1555509072", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 753, "text": "<bobbyrito24>: Masturbation is basically like the saying “Fake it until you make it” It comes with practice though<Zueirinho_Gamex>: I always think about that in the shower too<bobbyrito24>: Damn that was clever as fuck<harnishnic>: You got got", "num_messages": 4, "avg_score": 188.25}
{"start_date": "1554521012", "end_date": "1554523601", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 17, "text": "<GotMyOrangeCrush>: Every sandwich is a submarine sandwich on a submarine <emeyeyoukneek>: On a submarine or in a submarine?<GotMyOrangeCrush>: Yes<emeyeyoukneek>: Yeah. That makes sense. Thank you for clarifying. <GotMyOrangeCrush>: You’re welcome, I’m glad to not be unhelpful when I cannot avoid it.<emeyeyoukneek>: It's people like you that make the world go around. <GotMyOrangeCrush>: Well thanks, I take my job as a Reddit poster seriously. Despite the long hours and low pay, these posts don’t write themselves, it takes hours of hard work and dedication.<emeyeyoukneek>: You get paid???????", "num_messages": 8, "avg_score": 2.125}
{"start_date": "1554521585", "end_date": "1554523594", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 5, "text": "<ninepipers>: Our genetic codes might have been written in a low level language like assembly thats why we can think and act fast unlike other animals <crunktowel>: So other animals have a different \"processor\" architecture then us? <ninepipers>: May be so", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1555050668", "end_date": "1555521439", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 188, "text": "<Roseelesbian>: Take your age. Add 5 to it. That is your age in 5 years. <karimlns>: This was more complex for OP to come up with then it was for the scientists to calculate the image of the black hole.<Sorcerer-Supreme1210>: *than. Otherwise the perfect comment!", "num_messages": 3, "avg_score": 62.6666666667}
{"start_date": "1555521244", "end_date": "1555522367", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 25, "text": "<LaughingMop>: Umbilical chords are just charger chords for babies <theryguy66>: And sicknesses are apps that drain your battery<LaughingMop>: Aging is pretty much just your battery frying", "num_messages": 3, "avg_score": 8.3333333333}
{"start_date": "1555521447", "end_date": "1555522165", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 19, "text": "<CormacCTB>: No social media platform is more civilised than one with users who mutally promise each other not to spoil the plot of a highly anticipated movie. (I'm talking about Avengers: Endgame btw)<JDdiah>: Spider man will be back . . . . For \"spiderman far from home\"<CormacCTB>: Marvel spoiled its own movie<JDdiah>: The ancient one will also be back again from the cast details", "num_messages": 4, "avg_score": 4.75}
{"start_date": "1554495618", "end_date": "1554525062", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 249, "text": "<Bcmwolverine>: The letter ‘C’ isn’t found between the spelling of 0 and 999,999,999,999,999,999,999,999,999,999 <Jojo-19>: Not in German, we already fail at 6 (sechs) :(<Bcmwolverine>: French fails at 5 cinq lol<NaturalFaux>: Spanish fails by 4 (cuatro)<Myself510>: If you don’t count 0 (cero)<TheProGamerDan>: In Russian we fail at 6 (шесть)", "num_messages": 6, "avg_score": 41.5}
{"start_date": "1555504406", "end_date": "1555542012", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 137, "text": "<creon>: If someone tells you they haven't pooped in a month, they are either full of shit, or really full of shit <JDdiah>: OP was pooping in the shower.<FoolishLyingHumans>: There I was, cramped up, my gut in more knots than a roller coaster. The ceramic throne, endemic to the west, too high for my bowels to open properly; I’d been straddling, only able to push out a few superficial scraps of the death inside me. So I rolled over into the tub of the shower, delirious and shivering, turning on the hot water to warm me up. I manage a squat, and after a few seconds of gravity pulling things down, and several gut-wrenching shoves (literally, with hands squeezing stomach), the poisonous food exits the system, no longer threatening life. My body’s energy, exhausted but already recovering from the battle. The hot water slowly washing away the putrid, sticky heap, still trying to cling to the tub despite losing its battle to stay in my body, hostile bacteria and viruses dying by the millions in the showerly genocide, the few that remained to by fried by chlorine and extreme temperatures in the processing plant that awaited them at the end of the drain.", "num_messages": 3, "avg_score": 45.6666666667}
{"start_date": "1555519460", "end_date": "1555519801", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 12, "text": "<karm4wh0r3>: The people who live in one room homes are the real winners <unknownxk>: How come?<karm4wh0r3>: You will learn if you live for any time in a big place<unknownxk>: Won’t ever achieve that so I guess I won’t ever know<karm4wh0r3>: If you feel you are not achieving things, try aiming lower.<unknownxk>: I’m a student, it isn’t my time yet.", "num_messages": 6, "avg_score": 2.0}
{"start_date": "1554519039", "end_date": "1554568717", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 15, "text": "<thecubiclist>: So many people feel they are socially invisible - may be they can start seeing each other and stop giving a damn about those who don't see them. That will be an immense force! <chuggomcggunson>: Are you Korean?<thecubiclist>: Nope.<chuggomcggunson>: It's okay if you are, you don't have to lie to me. It just sounds like something a super Korean person would say.<thecubiclist>: Haha! You are funny :)", "num_messages": 5, "avg_score": 3.0}
{"start_date": "1555501818", "end_date": "1555525538", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 5107, "text": "<elburcho>: Anyone getting married on Saturday would have their 50th Anniversary on 4/20/69 [removed]<freyahatesyou>: Nice<Jankosi>: Nice<SeanBC>: Nice<MrMonotone009>: Nice<MusaTO>: Nice<bumpyxxx>: Nice<rbanders>: Nice<Gogbr>: Nice<RandyMarshUSGS>: Nice<vampireondrugs>: Nice<ii_jwoody_ii>: Nice<SkShark>: Nice<AlbinoStepchild>: Nice<Shipper0007>: Nice<FancyShrimp>: *Nice*<bandanning>: **Nice**<carolinejlewis20>: Nice<hawgballer5>: Nice<Shake_Zula_>: Nice<Its_Alessandra>: Nice<Donato_was_taken>: Nice<ii_jwoody_ii>: Nice", "num_messages": 23, "avg_score": 222.0434782609}
{"start_date": "1554494760", "end_date": "1554546860", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 3177, "text": "<Ignustious>: Plankton has created a computer so strong it has its own feelings, yet he is jealous of a cheap burger restaurant owner <DJcrhyme>: Well, he IS 85% hot gas. <I_Write_The_TLDR>: it's 99% hot gas.<DJcrhyme>: I guess I’m 100% hot gas:/<randominternetdood>: you aint hot.<Cookieopressor>: Oof<MEMELORD7070>: https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRhmfW7NbHJXKeI8RmU82Ez5alor74BEahL-2YRVp2xzmuvPMS6", "num_messages": 7, "avg_score": 453.8571428571}
{"start_date": "1554505776", "end_date": "1554545803", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 15943, "text": "[deleted]: The first person to plagiarize was doing something original by being unoriginal [removed]<SUND3VlL>: Borrow from one, it’s plagiarism. Borrow from two, it’s research. <DaDuke678>: The most nuanced of distinctions <Darkdemonmachete>: Plagiarism if its not quoted or referenced, regardless of how many.<dollarstoretrash>: I bet you are very fun at parties,so much so they don't even invite you.<ranchan13>: People who reference well actually have their very own secret parties. And they are wild.<dollarstoretrash>: It isn't a party if it's only you.<ranchan13>: It's always only you. https://en.m.wikipedia.org/wiki/Solipsism<dollarstoretrash>: Wow,that's a very interesting article,thanks for that dude :D always love a good Wikipedia article.<ranchan13>: You're welcome.", "num_messages": 10, "avg_score": 1594.3}
{"start_date": "1555412578", "end_date": "1555429255", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 17883, "text": "<Zitty-Z>: People joke about women being in the kitchen and yet the chef field is dominated by men. [removed]<clocksailor>: Yeah. Women are expected to keep their families fed in exchange for no money/fame/appreciation. Men get to do the creative, prestigious, career version.<Cuddlyzombie91>: Not all women, especially today. I don't expect to be cooked anything by my SO. Women can be chef's if they want to, and I'm sure there are exceptional women in the profession. It's 2019 not 1940.<clocksailor>: Of course there’s no law preventing women from being chefs. That’s not the point. Women *can* be in the Senate, but they’re still incredibly outnumbered.<Cuddlyzombie91>: The Senate is an entirely different issue, let's stick to the topic. You can't compare making a meal at home for 3-5 people to cooking for 100's of people in a restaurant. Not any man can do that and even then there are some women that can. This shit has nothing to do with sex, it's about talent and commitment.<clocksailor>: So the disparity between the number of male chefs/politicians/CEOS/billionaires and female ones are all total 100% coincidences? Fascinating<Hexadecimated>: I bet you’re just fine with the amount of female garbage workers, janitors, and construction workers, though.<clocksailor>: Sure. Those are all perfectly good jobs that pay well, but there's not as much competition to get into them, and they don't hold outsize power over the way the country is run in the way that very wealthy and famous people do. Why do you ask? Seems like you're implying that people should feel shame about holding those jobs. Why is that? What do you do for a living?<Zack_all_Trades>: He's asking you why you think overrepresentation of males in the culinary arts is an issue but a non issue when the same logic is applied to labor-based careers.<clocksailor>: &gt; they don't hold outsize power over the way the country is run in the way that very wealthy and famous people do.<MelisandreStokes>: Just because there are a few wealthy and famous chefs doesn’t make them powerful people. The answer is that it *is* an issue that women are underrepresented in the trades, which is why there are so many orgs dedicated to attracting women to the trades<clocksailor>: &gt; it is an issue that women are underrepresented in the trades Can you tell me why you feel that way?<MelisandreStokes>: Briefly: Because they pay better than the jobs women normally get with the same level of qualifications. Also I think it’s important for women to be in all fields, especially useful ones like the trades. Can you tell me why you *don’t* feel that way?<clocksailor>: &gt; Can you tell me why you don’t feel that way? I didn't say I don't, I just wanted to find out where you were coming from before putting my two cents in. Yeah, I also think women should be in trades for the same reasons as you, and even also some additional ones. But like, Republican men in Texas are trying to make it so that women can be put to death for getting an abortion. Ohio just restricted their abortion access, like, two days ago. Women are under serious life-changing legislative attack, right now, today. I don't think the men on this thread who are making the argument that the dearth of women plumbers is as big of a deal as the dearth of women lawmakers (and women rich people with the clout to influence those lawmakers) are doing so in good faith.<MelisandreStokes>: No, of course not. That’s why I like to point out that the reason they’ve never heard of all the orgs focused on getting women into the trades is because they never looked for them, because they don’t actually care.<clocksailor>: Haha, yeah. I got into a beef about this yesterday where some guy was saying that the men's rights activism movement is exactly the same as the feminist movement: mostly decent people with some fringe folks making a lot of noise. I'd be okay with that argument if I saw MRAs organizing, starting foundations, fundraising, lobbying, passing laws, donating money, or doing really anything to win gains for men instead of just complaining about women. Whatever you think of feminists in general, you can't deny that they got women the vote and have forced countless other legislative wins for women all over the world. You don't get respect just by existing and complaining. You need to, you know, produce something.", "num_messages": 16, "avg_score": 1117.6875}
{"start_date": "1555517450", "end_date": "1555603729", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 285, "text": "<funnyonlinename>: At this point, NOT getting a tattoo is the act of rebellion. <Hason2003>: The majority of people are still tattoolless<D1stant>: Among people 18-35(~) it's like 40% tattooed in US [deleted]: So, less than half, a majority still aren't tattooed and your point adds nothing.<D1stant>: It adds statistical clarification to a claim.", "num_messages": 5, "avg_score": 57.0}
{"start_date": "1554511947", "end_date": "1554547299", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 364, "text": "[deleted]: The sound of children's laughter is beautiful. Unless it's the middle of the night and you live alone. [deleted]<w_oos_y>: Unless you're a pedophile. <SebyTheRuski>: Lion sleeps tonight plays", "num_messages": 3, "avg_score": 121.3333333333}
{"start_date": "1555491216", "end_date": "1555581446", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 12255, "text": "<its_Shithead>: In Guardians of the Galaxy, Drax thinks that if he stands completely still then no one can see him. This is because he saw Baby Groot do it so he thinks it works (Edit) Whoops... I meant Infinity war<Fedaykin_Sandwalker>: But if he was able to see Baby Groot then it obviously doesn't work. <Edit>: auto correct<franktheguy>: I am grout.<Soran1337>: I have some tile to lay, can you help?<OnetB>: I am mortar.<WrenchFriessAlt>: I am pestle.<lilafrika>: I am Inigo Montoya. You killed my father. Prepare to die<shreeteshthapa>: But... i am your father<Simhacantus>: &gt;Luke...I AM your father. &amp;#x200B; FTFY<shreeteshthapa>: No. U<Betadzen>: I am U.<inappropriate-slur>: We are grout<shreeteshthapa>: Grout are we", "num_messages": 13, "avg_score": 942.6923076923}
{"start_date": "1555519226", "end_date": "1555520562", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 12, "text": "<FunnyCarp>: Most flat-earthers don't really believe the Earth is flat... they believe it's a disc like a coin. <rowan404>: Ever notice how a coin is flat?<TheFamousDoodleberry>: If the earth is flat how come the iPhone emoji is a circle 🌏<FunnyCarp>: So according your logic the Devil must be real because it has an iPhone Emoji?<HugNugget64>: Yes.", "num_messages": 5, "avg_score": 2.4}
{"start_date": "1554519871", "end_date": "1554527176", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 28, "text": "<Animeking1108>: Sid became a garbage man in Toy Story 3 so that he can burn toys knowing they can't retaliate. <Djanghost>: But they dont burn garbage?<StaticBlack>: What was the incinerator themat the toys almost died in in TS3 then?", "num_messages": 3, "avg_score": 9.3333333333}
{"start_date": "1554517110", "end_date": "1554558484", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 42, "text": "[deleted]: If you think about it, pregnant women are the only real body builders. [removed]<DezGalbie>: Nope. If we're going down the route of saying that the creation of life in that way is the only \"real bodybuilding\" (which is shaky at best, but let's go with it for the sake of argument), then why is it just women that count? Why not other pregnant creatures? Pregnant dog, cat, horse, dolphin, gorilla? etc. These creatures all have bodies \"built\" during pregnancy.<NateBeast1398>: they never specified human women<DezGalbie>: Yes they did - by using the word \"women\" you are specifying human. Dolphins aren't \"men\" and \"women\". \"Man\" and \"woman\" refers to humans.<pbellot>: You must be fun at parties...<DezGalbie>: Why would I want to be fun at parties? That only gets you invited to more parties.<pbellot>: Touché", "num_messages": 7, "avg_score": 6.0}
{"start_date": "1555521476", "end_date": "1555522697", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 10, "text": "<welldonerusticpizza>: Toyota is one letter away from being a palindrome <sharpguitarfret>: Is it?<bongblitz>: If you take away the “a” it becomes one.<sharpguitarfret>: Ah. I think using “away” made it seem like it needs one more.<Bloodhavoc052>: Well if you make it Atoyota, thus adding an A, it also makes it a palindrome.", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1555516594", "end_date": "1555519597", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 28, "text": "[deleted]: You can live the rest of your life without breathing [removed]<MrGreen290>: But what if I stop breathing and my body evolves to not need air?<Colloquial_Bloke>: Then you live the rest of your life without breathing.<nine_seven_five_>: So we have now confirmed (with this scientific experiment) that you can, in fact, live the rest if your life without breathing.", "num_messages": 4, "avg_score": 7.0}
{"start_date": "1554522689", "end_date": "1554528795", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 337, "text": "<Starlord_who>: If we stopped trying to pressure everyone into a romantic relationship or into having kids when they aren't ready, they'd probably be a lot more happier and nicer people in the world <ChrisCGC>: Amen. But does that really happen a lot anymore? Maybe that’s why kids seem happier these days. <Starlord_who>: Happens more than you think still<ChrisCGC>: I know I’ve been calling my kids recently and telling them I want grandkids. I’m 56 and they are 25 and 26. Am I wrong? I hope not. <doom_doo_dah>: That's young to be worrying about kids. Let them get settled and decide if they even want kids first. <ChrisCGC>: I’m not pressuring just letting them know that I’m fully in support of their timely decisions <doom_doo_dah>: Expressing your desire for grandchildren is not the way to do that. Children are people, not a thing to be given. <ChrisCGC>: If you are so good at advising why is your point not stated?<doom_doo_dah>: The best thing I can tell you as someone with supportive parents is knowing they'll support my decision either way feels a lot better than what I imagine being pressured to do something with my genitals would be. <ChrisCGC>: What did you not understand about the fact that I told them I supported their every decision? You better get better at listening if you want to be a good parent. <doom_doo_dah>: &gt;I know I've been calling my kids recently and telling them I want grandkids. Sounds rather lopsided to me. Also, why are you assuming I want to be a parent? <ChrisCGC>: I advise you against it since you give lousy parenting advice<doom_doo_dah>: Lolz", "num_messages": 13, "avg_score": 25.9230769231}
{"start_date": "1554519620", "end_date": "1554520552", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 20, "text": "<oarfish14>: People in ancient times wouldn’t have really known what they looked like I mean maybe in the reflection of a lake or ocean but most bodies of water aren’t too reflective. Many wouldn’t have known.<SugarcubEX>: I mean they had mirrors pretty early on <kfbilling>: I think he means in ancient times, which means no they wouldn’t have mirrors<Karinrinkashi>: It is called reflection in the water...<kfbilling>: Most bodies of water aren’t reflective, many people wouldn’t have known<Karinrinkashi>: At any given day, if you stand in the water at a good angle you can definitely make out your face. Even with just a bowl of water in your hand, especially in the sunlight outside. You dont have to take my word. Youtube it.", "num_messages": 6, "avg_score": 3.3333333333}
{"start_date": "1555516527", "end_date": "1555517025", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 2, "text": "[deleted]: Theorically, Just by existing we are polluting The environment since when we exhale we produce carbon dioxide [deleted]<scalesofdyslexia>: And then trees thank us for breathing by taking our exhaust. Then they produce oxygen.<AstolfoZeGreat>: No that's Just a lie that the governement is saying. Thruth is that trees don't even exist", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1555520335", "end_date": "1555521674", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 7, "text": "[deleted]: If you aren't good at anything, being a nice guy kinda doesn't count. [deleted]<sirhamrobsong>: It doesn't count to a sheep of a human.<slothluuuvchunk>: This sentence took me a while to parse. I initially read it as \"It doesn't \\[enumerate, one-by-one\\] to a sheep of a human.\" I know I'm probably the only one who struggled with that, but can I get some congratulations, please? I need a nap.<sirhamrobsong>: You deserve nothing.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1554519777", "end_date": "1554524400", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 9, "text": "<PlzNo__>: Since we figured out how to make a 2D image look 3D, then its totally possible to make a 3D object look 4D. <Dugillion>: There is a VR game that has 4D toys you can play with.<tyree8973>: Which game?<Dugillion>: https://www.youtube.com/watch?v=uBEu-QTpBuc<tyree8973>: That was amazing thank you", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1555521576", "end_date": "1555522214", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 5, "text": "<ilovelettucesomuch>: Because AirPods make it so you can’t hear your other senses will get stronger therefore you can literally smell the broke <2-Chans>: Unless you’re wearing your AirPods 24/7 for months or years at a time, there’s no way this would happen. Also being broke doesn’t have a smell. Stay in school, buddy.<ilovelettucesomuch>: It’s. A. Joke.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1555502985", "end_date": "1555614100", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 70, "text": "<dylantherabbit2016>: At one point yesterday the world had 7,696,969,420 people. [removed]<iambadwithnames_>: It is possible for two people to be born at the same time skipping that number<The_Jalster>: One comes out first, even if by microseconds.<iambadwithnames_>: Still a possibility of being born at the same time even down to the microsecond level", "num_messages": 4, "avg_score": 17.5}
{"start_date": "1554460502", "end_date": "1554495339", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 2623, "text": "[deleted]: The Apollo 11 left a pile of almost 100 bags of human waste behind on the surface of the moon. As far as feline or canine aliens are concerned, the moon is officially ours. [deleted]<hijack-carman>: Feline or canine aliens, that’s not how it works?<Protomachos>: In popular culture, it is. Start Trek and Star Wars e.g. have feline aliens. <hijack-carman>: This port doesn’t reference science fiction, it talks about real world, so your point is invalid<Protomachos>: In the real world, \"feline and canine aliens\" is a contradiction in terms: why would life forms from another planet closely resemble those from earth? And share their habits in marking territory?<hijack-carman>: So you agree with me that OP made an oopsie<Protomachos>: Whenever outer space is discussed, a great number of people find pop culture references as appropriate as hard science. <hijack-carman>: But no one apart from you has mentioned it<Protomachos>: The OP obviously finds feline and canine aliens relevant enough to mention.<hijack-carman>: But you’re assuming, and assumption is the mother of all fuck ups, so maybe don’t<Protomachos>: A long build-up for a little smugness…<hijack-carman>: But I’m right, if they had mentioned anything related to science fiction, then you’d be right, it’s not my fault you chose the wrong hill to die on<Protomachos>: Don't break your arm patting yourself on the back.<hijack-carman>: Yon chose a stance that you pulled in without any information leading to it and lost, don’t be a dick in defeat<Protomachos>: Marvelous how much self-satisfaction some people can wring from empty air. You rival Donal Trump. <I_Think_Helen_Forgot>: Aw man, he was being a smug fucknugget, but you went and brought politics into it.<datbeerdude>: This is one of the dumber reddit conversations I have seen and I was in one about the cost The Undertaker would have to incur for hearse rental, casket costs, grave detail, etc.", "num_messages": 17, "avg_score": 154.2941176471}
{"start_date": "1555427609", "end_date": "1555501448", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 24294, "text": "<-Chatterboxx->: Teenage rebellion isn't a bad thing, it's a survival technique that makes kids less dependent on their parents as they transition into adulthood. <colbsauce>: Is that why I always relied on my parents liquor cabinet when rebelling as a teen?<Callefang>: Gotta boost that alcohol tolerance for the future somehow.<GEEZUS00>: And don’t forget nicotine!<SheriffBartholomew>: Oh how I miss the sweet succour of tantalizing nicotine. Wherefor art thou, cigarettes.<Ndavidclaiborne>: It's me, your father....I'll go get you some cigarettes.<biglongjohn94>: Cigarettes? Its 2019! Get me some juul pods.<RIPtheboy>: Jule rules!<DarkFlames538>: *Juul rules<Thewilsonater>: *Juul ruuls<FetusDeletus13>: Goddamnit take my upvote<daskommando>: You’re not cuul if you don’t hit the juul", "num_messages": 12, "avg_score": 2024.5}
{"start_date": "1554522693", "end_date": "1554523095", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 15, "text": "<BromilioEstevez>: It's literally impossible to prove that you can go to the gym without talking about it without talking about going to the gym. <romniner>: 1 remove literally and the sentence doesn't change meaning or context. 2 incorrect, simply have to go to the gym without talking about going. <OTS_>: To your second point: Prove it. <romniner>: Already did", "num_messages": 4, "avg_score": 3.75}
{"start_date": "1555517856", "end_date": "1555547669", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 20, "text": "[deleted]: For all the people you have walked by, you have probably walked past at least one murderer, rapist, or terrible criminal in your life. [deleted]<nammoyosto>: This is why I don't like mirrors<NobleDragon777>: Um..?", "num_messages": 3, "avg_score": 6.6666666667}
{"start_date": "1555521652", "end_date": "1555521959", "thread_id": null, "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo", "total_score": 13, "text": "<kcahmadi>: All of us will have a day where we drink milk in public for the last time and not even realize it. <tic_ttocs>: Why specifically milk?<kcahmadi>: idk the last time I saw an adult drink milk in public", "num_messages": 3, "avg_score": 4.3333333333}
