{"start_date": "1543580696", "end_date": "1543631885", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4624, "text": "<AshittyPCscientist>: I am the most comfortable talking to people i dislike, I have realized that i if i like someone, i would hide my personality because i think showing no personality is better than showing a personality that the person i like might hate. I always thought that I do not have anything to say, that i am silent because i dont know what to say or how to say it, but i have figured it out, The reason why i dont say anything because i am too busy thinking if should say something, i am too busy thinking of what i should say, Too busy thinking if someone would dislike my personality because i said such thing, if someone would not like my joke, or if someone would find me stupid. I got it all wrong, Small talk should not be thought of that much, i shouldn't think of what im gonna say(not saying you shouldnt give a fuck at all) but just saying what comes on your mind without caring what the person in front of you would react. I found this because i talked to a lot of people i hated, and when i talk to someone i hate, i don't give a fuck what he thinks of me, so i realized i'm my realest personality when i'm talking to someone i don't like. I still have the problem of caring what others say, but i have been using a really awful but working method of pulling up things i hate about a person, making me hate him and not care a bit about him, this is an awful method but it has helped me a lot, and its making me a lot better at talking to people. <Quoxium>: I've noticed it's people who I am not afraid to loose are the ones who I'm most comfortable around. It's weird.<officialshebu>: Count me in as well<shadow_clone69>: Hashtag metoo <daveinpublic>: #Metwo<wyfancy>: methree!", "num_messages": 6, "avg_score": 770.6666666667}
{"start_date": "1544497798", "end_date": "1544596332", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 48, "text": "<AutoModerator>: Weekly /r/socialskills challenge thread! This is our brand spanking new challenge thread inspired by [this thread] (https://www.reddit.com/r/socialskills/comments/96i5ps/would_anyone_be_interested_in_daily_or_weekly/). Let's get this second thread rolled out! Each monday at this time this thread will be posted and stickied. Also, if anyone has any ideas or tips to make this easier at a moderation level let us know via modmail! **Challenge 1 Learn 5 people’s names.** **Challenge 2 Make eye contact with someone across the room without awkwardly darting your eyes away.** Report back here with how it goes! You can post about completing both challenges if you wish. Also, these posts will be in contest mode by default. Again, if you have any tips or tricks on how to improve this please do not hesitate to modmail us! Happy challenge doing :) <Kaori-Miyazono>: lollll challenge 2 is hard for sure<hal_cyon73>: It's a little ambiguous. Like you obviously have to stop looking at the person at some point, so how do stop making eye contact without awkwardly darting your eyes away? Does that mean you wait till they look away? Staring contest?<Kaori-Miyazono>: if its someone you know then thats ez but if its a complete stranger in the same room as u thats a lil spooky , my choice would just be to wait for them to look away<hal_cyon73>: I think just smiling and then looking away myself is what I'd go for. But hey that's my opinion.", "num_messages": 5, "avg_score": 9.6}
{"start_date": "1543596456", "end_date": "1543624632", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 17, "text": "[deleted]: I have very bad dating anxiety [deleted]<rayz_24>: Im the same way. Just be yourself. I would think since you're a female it would be a little easier for you oppose to a guy. I wish you the best of luck though. <Gis2845>: I would think so too lol but it’s still very hard. I am not often pursued or asked out. But I guess I have to just put myself out there. <rayz_24>: Exactly. Sometimes guys are intimidated to approach. Do you smile? Lol.<Gis2845>: I try to when I meet people, but I don’t all the time. Not that I’m angry, I just don’t necessarily feel the need to smile all the time", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1544747659", "end_date": "1544800421", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 15, "text": "<aloneonceagain>: Got called boring and no fun by peers \"aloneonceagain, no offense, but you're just boring bro. you just sit there on your phone and we tried messing with you but you're no fun. you can't even take a joke..\" Now at the moment I was pretty pissed, then he backed up thinking I was gonna do something to prove that I was fun but nope, I shrugged and said I didn't care. But oddly, someone telling me that straight up to my face was so refreshing. After that I felt better, like I wasn't even mad anymore but instead I knew what to work on and I was happy he told me. But would it be weird to start talking now after telling me? Then when I was walking to my last period I was opening up more. Talking more to strangers and people that I know, realizing that I was being so aloof all the time. It was a weird feeling that melted into something else, hopefully I can feel that way all the time.<ItWasMeIsNotMe>: I think it would be good to start talking, since from my perspective he wouldn't have mentioned it if he didn't care. He probably wishes he could get to know you better.<aloneonceagain>: Hmm true, I'm not very open and I want to try talking today and staying off my phone. It's good to see it from that way though so thank you. :)", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1544751492", "end_date": "1544795747", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6389, "text": "<rewritethestar>: I’m a girl and I told a guy he’s cute I basically texted him saying I think he’s cute. Honestly, it gave me a bit of an adrenaline rush, but I’m glad I did it. He basically responded a few days later (he’s very studious and we’re not close) and said he finds me pretty cool, but I’m not looking for a relationship. I responded with I’m cool with that and I just wanted you to know that you’re cute. I’m glad I told him because I’m stepping out of my comfort zone and loving myself more. I hope everyone does the same too even if they are rejected. <Edit>: thank you for silver!! I never expected anyone to look at this post <4mbitionn>: You absolutely made his day better. That's a great mindset by you!<spammusubiyummy>: Day? A girl told me I was cute once and it made my whole week better<ShiftyVickars>: Must be nice. The nicest thing my wife ever said to me was \"yeah the toilet looks clean enough, you can go to the bar tonight with your friend. \" Jokes on her though because I messed that toilet up as soon as I got home. <meowstash321>: This comment is under appreciated 😂 <Darkpoulay>: I think it's just sad. That's just casual domestic mental abuse if this is the nicest thing she ever said.<marcuzt>: Also it is very common in marriages and nobody gives a fuck as long as it is a man hearing that stuff. For me this is normal, I have hard time believing it is possible to be married and not hear comments like that on an almost daily basis.<Darkpoulay>: \"Got a lecture again, you know how my wife is !\" : fun for the whole family \"Got a lecture again, you know how my husband is !\" : police called immediately<marcuzt>: You also forget kids get to stay with mommy and daddy leaves in both instances. :(", "num_messages": 9, "avg_score": 709.8888888889}
{"start_date": "1543598253", "end_date": "1543641825", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<someonetogiveadv>: Being jealous When my friends hang out with each other without me i get so jealous, i feel bad and cant stop thinking about it, i feel like they are having really great time together. And because im a cool person that doesnt give a shit about anything and always in a chill mood(!) i dont show them this side of me. They probably think i like to be alone,im happy this way or something I want attention from everyone. I want to be everyone's favourite person BUT on the other hand when someone shows his/her love to me i dont like it, i try to stay away from that person and i want him/her to stop loving me. Do i have issues, i think i do. <muffinsandtomatoes>: Instead of being too cool (but also without looking like a jealous friend), I'd just be honest. Tell them that you miss hanging out with them. A little honesty and vulnerability goes a long way in my opinion. <someonetogiveadv>: Ah i feel like when i show my love to someone if effects our relationship bad, i dont know how to say but kinda superstition <muffinsandtomatoes>: Sorry, I’m not exactly sure what you mean. You think that if you show love to someone, it’ll negatively affect your relationship?<someonetogiveadv>: Yes, sorry english is not my first language :P", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1543609498", "end_date": "1543609990", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 25, "text": "<bananacreampie123>: Any other girls bad at showing enthusiasm? I can't be genuinely enthusiastic about little things like a lot of my female friends can. If something really does excite me, then yes, I'll show enthusiasm. But for smaller things, it's difficult. For example, a lot of my friends will squeal and get hyped when one of our friends gets a new dress or something, and I'll just be like \"cool!\" Or my coworkers will freak out that my boss got a new manicure, and I'll just be like \"looks nice!\" I also won't be super enthusiastic about something way in advance, such as a trip. I feel like I come off as rude or indifferent and I don't want people to think that, but I've never been a naturally enthusiastic person. Is anybody else like this? Any tips on how to act more enthusiastic about small things? <Alannahboo>: YES OMG this is totally me!!!! I am absolutely awful at showing any sort of enthusiasm EVER!!!!!11 When my friends freak out over something i'm pretty much just like \"yeah whatever\" and then they hate me because they think I don't care :( :( :( which is far from the truth!!!! SO unfair!!!<icarebot>: I care<Alannahboo>: You don't get it mr bot sir, I do care but people think I don't care like did you even read it???????????<icarebot>: I care", "num_messages": 5, "avg_score": 5.0}
{"start_date": "1544727956", "end_date": "1544741270", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4, "text": "<WildHuntsman>: Constantly disrepected I am wondering how I could become respected. It seems as though whenever I try to enter social groups I find that the people in them have an innate disataste for me. People will often, at best, look down on me in a pitying way. Other times, they just flat out don't respect me. In many friend groups I'm made out to be the scapegoat in every situation. People will make malicious jabs at me constantly and whenever I try to make jabs back in order to create banter, they'll often act all offended and say that I crossed a line, even if I temper what I say to match their own words. People will demand my attention yet never give it back in return. My opinions are often disregarded as well. I've tried being nice, and people just use me as a doormat. Whenever I'm more assertive and confident, people like me even less and treat me worse as a result. I'm not sure what to do. I've been wondering if this is just a constant in my life, and that toxic relationships with others are endemic to my existence.<urbanprimitive>: Start your own social group; worked for me, and that in turn helped me get respect in others’ groups.<WildHuntsman>: How do I start my own social group?<urbanprimitive>: Check out Meetup.com", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1544759756", "end_date": "1544759985", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7, "text": "<capacitor15>: Is it worth keeping these friends? As a college commuter I have no friends other than high school friends who are away at college. I go months at a time without any contact with them because I get ignored when I reach out and try to start a convo. I hang out with them occasionally over breaks. Next semester I’m transferring and going away to college. Should I just cut off these friends all together? A lot of them are pretty negative and are only really there when they need something from me. I feel like hanging with them I just bad for my mental health but I don’t have anyone else right now.<KMK7110>: If you have to ask you already know the answer.<capacitor15>: Yeah, but I have no one else at the moment and am pretty depressed. I’ve known these people for years and it’ll be hard for me. However, when I dorm next semester hopefully I can find some people that actually care. Is it worth trying to say anything to these friends or should I just cut contact?", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1543616329", "end_date": "1543626632", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4, "text": "<xomoreconfidence>: In a group conversation, why does one person only look at me when talking? In a group project at work, there is a guy who only talks to me when speaking to the group, sometimes his eye contact will flicker between the others but it will then rest on me. It has happened in every conversation where it then feels liek the conversation is just between me and him rather than a group conversation. However, when I speak in return I look around the group at everyone. Today also they were sat next to me and they leaned really, really close to my face whilst speaking, it wasn't uncomfortable but I did look away after a few seconds as it felt too close for the setting we were in. I am female and they are male, however they are in a relationship so it's not that. &amp;#x200B; Also I have noticed in presentations people will often make eye contact with me, whether that is colleagues or superiors. &amp;#x200B; None of this bothers me but I am just curious if I am somehow giving off a particular \"vibe\"? I'm quite reserved so maybe it's because I am not intimidating?<shinybrewster>: I have no real idea what I’m talking about (after all I’m also on r/socialskills, so take this with a grain of salt) but if someone is prioritizing making eye contact with you they might find you attractive... looking at someone’s face while talking lets them monitor your reactions so they can adjust their behavior. If someone is attracted to you they’ll want to make a good impression on you more so than anyone else, so your reactions to what they are saying becomes more important. Their whole talk becomes a sort of performance for you, it’s a kinda cynical perspective because people end up hiding their real thoughts just to present a good image. Again this might not be the case so don’t assume this guy is secretly macking on you.<xomoreconfidence>: They look at me and smile as they speak, which makes me involuntarily smile back and then I catch myself because what is a group conversation with 4 other individuals listening and watching ends up feeling too intimate and one-on-one, however they just carry on looking at me. They do smile when talking to others, but like I said when in group conversations with 4-5 people they will only be talking towards me. However I then end up feeling awkward and uncomfortable as he is in a relationship and it seems overly friendly, verging on flirtatious.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543626768", "end_date": "1543627885", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7, "text": "<plavipatlidzan>: Opinions about psychedelics for self improvement? <emein>: Micro dosing is a great idea. The trick is finding the right amount for you. <plavipatlidzan>: Could you elaborate so I can get a fuller picture?<emein>: Certainly. A small amount of psychedelics, not enough to trip, is like a cup of coffee and anti anxiety medication. That's the simplest way to put it. A large dose is like having a friend that burnt afraid to break down your front door. Just to slap you and tell you you're doing something stupid. That's as much as I can say now. Just got off of work and phone us almost dead.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1544740480", "end_date": "1544742809", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 185, "text": "<ga1ningconfidence>: A group of guys made fun of me for thinking I’m autistic, when I’m just awkward? This is very embarrassing, but a friend of mine told me recently about a group of guys that we hung out with joking behind my back about how they all think I’m autistic. This really hurt, because I don’t think I’m on the spectrum at all, I can just be really awkward at times. I don’t really talk much, because when I do I end up making a fool out of myself (i.e. I tried asking one of the guys to use their bathroom, but I accidentally blurted out “Can I borrow your bathroom?” and everyone started laughing). I’m self-aware of how my mannerisms and actions can seem a little off to some, but after 3 years of trying to fix it I’ve realized that there’s really nothing I can do to help it. This situation really hit me hard and I feel like never talking to anyone again after what happened. <JayKayVay>: Firstly, there's nothing wrong with being Autistic - I'd ask you to consider why you'd be hurt by someone thinking you're Autistic, then recognize these guys are ableist jerks so their opinion is worthless. It sounds like you have social anxiety so I understand why you'd be hurt they were joking about you behind your back, when already anxious about how you my be perceived having those fears come to fruition isn't just a hit to your feelings but is going to back-up your anxiety. Have you sought therapy? Your mannerisms and actions may be down to anxiety and that is something that can be treated. <ga1ningconfidence>: I think I should clarify by saying that I don’t think that there’s anything wrong with being autistic, I was just frustrated that my social skills are so bad that people assume that I have a disorder. <DARKRonnoc>: Fuck em man. What they said doesn't matter unless you give it weight. It doesn't sound like your skills are that awful but rather it sounds like they may be assholes. Criticism can suck, but it can also be your best friend if you use it correctly. So what if some people think you're autistic and made fun of you? What fucknuts. But see, you got the negative judgement and you survived. That is literally the worst thing that could happen and you're still alive and thriving. No big deal. Just get out there and keep trying. Learn to do exactly what your anxiety is telling you not to do. Tackle it head on. I know it's tough and hard and uncomfortable, but the only way to get better is to keep trying.", "num_messages": 4, "avg_score": 46.25}
{"start_date": "1540188402", "end_date": "1551674241", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9681, "text": "<Playstatiaholic>: Ya boy finally did it, thank you R/socialskills Ya boy finally did it, I got myself one of them girlfriends, she's beyond gorgeous. definitely what i'd consider out of my league. It was a girl from my class that I literally walked up to and asked for her snap. She gave me it, we've been talking and yesterday we had our first date. We were supposed to hike but couldn't find the trail entrance and headed back to my car. We ended up vaping off a thc cartridge and spent 5 hours in the back of my car, doing a lot of first things for me. I've never kissed a girl, let alone do what we did yesterday. I really want to thank this subreddit, I've been a longtime lurker but the amount of motivation I've gotten from here has helped me tremendously. It hasn't been at all easy for me, I spent the last 3 years losing weight and achieving a body that I knew I could be confident in, but honestly it's been an even bigger battle in my head confidence-wise. I had a lot of struggle simply forgetting that I wasn't who I was before, I ended up forcing myself into social situations, I don't know why but I started really liking the little adrenaline rushes I got from them. I'm by no means saying I have perfected anything, I just really took a lot of the tips being discussed here to heart, and physically wrote notes. Once again thank you guys very much, I really couldn't have done it without you guys. If I could say one thing to take away from this, is work and mold yourself into what makes you happy, and lastly \"Nut up or Shut up\", because I live off of past regrets and I really don't want to add more to that list. <MrAsinine>: Round of applause for this man right here! <Playstatiaholic>: Thank you, it has been one hell of a journey!<PeacefulDiscussion>: DONT GET ONEITIS OP!!!! Google it. Act like you’ve been here before... seriously don’t fall in love with this chick until she falls in love with you.<Phlatulesence>: That's more of an experience lesson. First time things mean you don't know the pain yet.<PeacefulDiscussion>: Ugh I hate that pain <BoRamShote>: Changes everything<Philawlsopher>: Pain is our greatest motivator. I fell in love, she didn't feel the same way. She said some mad-nasty things about me and to me. I was never hurt so bad in my life. As a result I ended up on a journey of a lifetime. I created myself, taking on the aspects I saw within her. They were always within me, I just had to realize them. It's such an awesome fucking story ... pain is our opportunity for us to find belief within ourselves.<Op67>: Holy hell does that sound familiar, but I’m still in the midst. Thanks for the good example. <dailymanup>: This is an epic post. It's great that OP finally got this done. The key is taking action. If you want to meet girls and have success, these videos will help you take immediate action. The relationship you want is just around the corner. [Here's How To Make Her Chase You](http://dailymanup.com/how-to-attract-women-turn-girls-on/) [How Not To Give A Fuck &amp; Just Approach Girls](http://dailymanup.com/how-to-approach-women-attract-girls-get-laid-make-her-want-you/) [How To Eliminate Approach Anxiety](https://youtu.be/V2M3g-HQGHU) [How To Make Girls Obsessed With You](http://dailymanup.com/make-women-obsessed-with-you-complete-system/)", "num_messages": 10, "avg_score": 968.1}
{"start_date": "1543447038", "end_date": "1543627184", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 26, "text": "<TheRedditRef>: Communication is an art, if you’re an introvert or struggle socially this post is specifically for you! Hey everyone! As a long time introvert and sciences “geek” I’d like to reach out to those who struggle socially as I use too. Before I begin the most important thing is to squash the idea that you’re hopeless or incapable of impacting, speaking and connecting on an emotional level with others. This is quite false, despite whatever failures you’ve had in the past. Truth is, I don’t really care about meeting and connecting with others when it’s not on a professional basis. I’m someone that’s content having 5-10 close friends. I don’t use social media outside of linked-In. But I have large goals career wise, and anyone who has worked their way up the competitive business latter would tell you that people liking you (especially superiors) is absolutely critical. As a manager you have to be able to communicate, and there is no significant upper level roles in any company that don’t require you to oversee, and communicate with others. “Communication is an art” These words cannot be taken lightly. Like any competitive atmosphere, you must master it. It takes practice and time. Just like any sport, challenging class, or job, practice is everything. But what I’m looking to do is elaborate on developing an arsenal of questions that will allow you to excel in any atmosphere. Questions are all you need. People love talking about themselves and their accomplishments. They love expressing THEIR viewpoints. You don’t need to elaborate on yourself at all to entice others. Let me provide a few powerful questions as an example for normal life (not job focused): (If it’s your first interaction, ask basic questions first. DO NOT come out of the blue with the following questions) - May I ask you a personal question? (They’ll always say yes, always. If you’re going to ask a power question approval is a must lead with this) - What impact have your parents had on your life? (Connects emotionally despite answer being good or bad) - What was one of the happiest days in your life? (connects in a positive emotional level) - What’s your largest aspiration or goal for your future? (connects in a positive emotional level) - Who has impacted you the most in your life? (Connects positively, if comfortable with you, possibly a negative answer which is a good sign) These are only a few questions that I have in my “arsenal” that will help you develop a relationship not just only in a professional level but emotionally. Now here’s a few for the professional atmosphere, these will allow you to dominate interviews and create great conversation with superiors: First off, if someone ever asks you “Tell me about yourself?” in an interview, always follow with “what specifically would you like to know?” Always make others be specific, this is crucial in conversation control. - What about your organization do you like the most? - What about your job do you like the most? - Who in your company have you learned the most from? - How do you feel about my performance (or interview), and how can I make a better impact on you? - How did you get into the role you currently have? - What would you like to see more of in your company? What would you like to see less of? I’m going to conclude this here, but I want to reiterate the fact that I don’t enjoy communicating all that much. However, with questions like these you can absolutely dominate conversations and interviews in an incredibly positive manner. Most importantly of all, when asking these questions SMILE or look CONCERNED depending on the context. Develop your own arsenal and watch as communication become easy, and fun. Message me your stories of you utilizing these questions, and if you need a specific one for a situation feel free to reach out as well. I’m a nerd and an engineer at heart. I now make large quantities of money in marketing and management. I even believe that being an introvert helps in jobs like these, you stay focused on your plans and questions, cause it’s all you’ve got. Works even better at the bars. I hope this helps some of you out there! Thanks! <FlightOfTheSeraphim>: Thank you so much! I will definitely be using this in the future!<TheRedditRef>: No problem! :)", "num_messages": 3, "avg_score": 8.6666666667}
{"start_date": "1543627074", "end_date": "1543676898", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "[deleted]: The other managers at my work all add each other on Snapchat, and it weirds me out. I hate sharing my personal life outside of work. Why would they do this, and how can I join in and use that social media platform to increase my likability at work? [deleted]<Cowmandonthavea>: If you don't wanna, don't do it.<fashionquestion111>: But they all do it, and I feel like I’m missing out on political points. Am I not?<ditsobeh>: Then do it? <fashionquestion111>: But I don’t know how to use it in a way that actually increases my likability.<ditsobeh>: Just add them I guess. Post cute pictures of pets on your story. Post a pretty sunset if you see one. Post a selfie if you're the kind of person who does. Look at their stories. If they post a dog for example, exclaim how cute it is and send them a picture of yours. If they start a streak, make a casual effort to keep it going, nbd if you lose it. Start conversations if the opportunity arises.", "num_messages": 6, "avg_score": 1.0}
{"start_date": "1543628391", "end_date": "1543682365", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 515, "text": "[deleted]: A girl approached me (22/M) at bar and called me hot, and I got flustered and said, “It was nice meeting you. Take care.” [deleted]<j94mp>: Bro!!!! If you think that’s bad, then hear this! Last time at a music festival I was wearing short shorts, this girl comes up and says “damn! Nice ass, what can I do to get it?” And I told her “compound movements” lol I had no idea she was flirting 😂😂😂<LonelyButConfident>: Dude, she wasnt flirting. She just asked for advice. Why would a girl want to \"get a guy's ass\" in a sexual manner anyway?<j94mp>: The reason I answered the way I did is because I’m not interested in women. You don’t go up to someone at a festival of all places, grab their ass, and then walk away insulted when they reply back with the answer to their question. She was flirting. <LonelyButConfident>: So if you are not interested in women, what makes your experience a \"wasted opportunity due to bad social skills\"? Like how do u relate to the OP?<j94mp>: When did I say that ? Lol chill 😂<LonelyButConfident>: \"If you think that's bad, then hear this.\" What's exactly bad in your situation? You arent even attracted to women.<VAYNExMECHANICS>: I can see why you're \"lonely\"<LonelyButConfident>: Why? Enlighten me.", "num_messages": 9, "avg_score": 57.2222222222}
{"start_date": "1543485784", "end_date": "1543504322", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 5405, "text": "<Goldenpanda18>: Last night I said fuck it and approached a girl that was gorgeous, bought her a drink and too only find out I’m her type! Little did I realise that this girl would be interested in me but when you don’t let your anxiety take the better of you and try it the results are crazy Morale of the story is honestly just keep telling yourself the opposite of what your mind is telling you and just do it!<unused_user>: Woot woot<U2-Yeezy>: Woot<1staccountgotbanned>: Wo<RealLifeSituation>: W<ResseXx>: I<Drewtopia_1>: S<FindingTerraNova>: C<LucasGold>: O<Confetti_Man>: N<FindingTerraNova>: S<PrajNK>: I<reptarthechameleon>: N<afdsadf>: Goodbye", "num_messages": 14, "avg_score": 386.0714285714}
{"start_date": "1543630274", "end_date": "1543630895", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 3, "text": "[deleted]: I am having trouble talking to people at my new school [deleted]<TheRealFakeKorean>: Just observe and chime in when the conversation is relevant to you. Don't feel pressured to be a part of every conversation. A nod or a laugh is enough to show people you're listening. You'll get it eventually. Give it some time. Good luck!<Jang2101>: Thanks! I’ll give it a go", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1543549336", "end_date": "1544106524", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 111, "text": "<lift_fit>: We Should Make Some Sort Of Video Chat Group A place where all of us wanting to improve our social skills can do so in a low pressure environment, where we all understand the purpose of our interactions. Toughest part about improving is actually going outside to do it. An easier first step might be video chatting with others from this sub. Might even lead to friendships. Just a thought. <l1p4p4s>: https://discord.gg/86gVDc JOINNNNN!!!<MuffledLaughing>: this link expired, would you mind posting a fresh link? :) Im sorry! I was busy and forgot to join when I first saw this! <l1p4p4s>: Yeah, no problem man! There you go: https://discord.gg/m5jqj9M , let me know if you need any help!<MuffledLaughing>: Thank you!", "num_messages": 5, "avg_score": 22.2}
{"start_date": "1544762901", "end_date": "1544811875", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4, "text": "<imnotpositivedotpng>: About to go to College Hi people of this subreddit! Next semester, I'm going to an in person class for the first time in years. I'm a little nervous that I won't make friends or get along with my professors. I'm excited to try but super scared at the same time. Does anyone have advice for making friends and getting along with professors?<MazeTLC>: Make sure you pretend to be a social justice warrior communist and you’ll be fine. <cameronhthrowaway>: This guy isn't in college don't listen to him<MazeTLC>: You’re pretty dumb. What you are saying is that OP who has social problems should go spew his capitalistic and anti big government ideas in a school that is dominated by communists and SJWs? <cameronhthrowaway>: Okay you're definitely 16. You sound like a fucking retard and this coming from a registered Republican. You have no business giving out social skills advice if you think every conversation on campus is fueled by politics. <MazeTLC>: “Registered Republican” nice job you filled out a few bubbles on a piece of paper Every conversation is NOT fueled by politics but capitalistic views can easily outcast you. Especially with your professors. <cameronhthrowaway>: You're not going to make friends no matter what views you have if all you do is spew out your ideologies. Also, being a liberal doesn't make you a bad person. You can be friends with someone who doesn't agree with you. Not every liberal is going to denounce you for being a conservative, just avoid the ones with colored hair. I honestly understand where you're coming from if you start every conversation spouting out some shit you heard from Stephen Crowder. Nobody gives a fuck about politics 99% of the time you're in college. Now go back to studying for your geometry final.", "num_messages": 7, "avg_score": 0.5714285714}
{"start_date": "1543416292", "end_date": "1543449566", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 1183, "text": "<CTB312>: Men, do you find it hard to pee in urinals? First of all I'm not shy of my penis size, it's average and I'm comfortable. But i find it hard to pee when other guys are around me in the urinals. Does anyone else have this problem too? If so how to overcome it?<Alchemis7>: I’m not shy at all, but even if I have to piss urgently and a guy comes to the urinal next to me, I can’t piss till he’s gone or it takes ages to start pissing... <Leinad97_45>: Happened to me once. As soon as he left it started flowing<papuasarollinstone>: For some reason it helps if I spit into the urinal. Don’t know why.<dickinpics>: Lock eyes then spit<3_firelevels>: Username checks out", "num_messages": 6, "avg_score": 197.1666666667}
{"start_date": "1544742915", "end_date": "1544751568", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 76, "text": "<AsthenDiscovery>: For the young people here For all the young people in this subreddit who are still in school of some sorts, I just wanted to share some advice that I have for you as someone who has passed that age. I’m deeply regretful for how I spent my years growing up. I was very shy since middle school. I had opportunities to grow out of my shyness. I could have tried inviting people over to my house to hang out, trying to talk to girls, trying to make friends and be more outgoing, develop interests, etc. But I never did. I kept telling myself that I would learn how to do it later. Instead I focused on getting good grades and trying to do well in school. I didn’t spend all my time studying or anything, but I always used academics as an excuse for not focusing on developing my social skills or developing passions. So as high school passed, I felt really lonely and it pained me when I realized that I didn’t have a social group to belong to and never had kissed / had a relationship. I left high school realizing I had no passion for one thing. The only thing I could consider a big interest of mine was basketball, but it was more like a hobby than anything. Still, I told myself that college would be a new experience. People told me it would be okay and I felt college would be a new experience. Because I was a good student, I ended up going to a pretty top school. I thought I was going to be happy there, even though it wasn’t my dream school by any means. I was going to party, hook up with girls, make tons of friends, etc. But as college went by, I found that I wasn’t doing any of these things. By my sophomore year, I realized that I didn’t have any solid friend group once again. I went to parties, but felt like an outsider all the time and always left early to go back home. I joined a fraternity, but thought I didn’t mesh well with them initially and didn’t make great relationships with the brothers. By the time I graduated, I once again found myself in that situation I was in after high school. I didn’t accomplish the things I wanted to, and I’m deeply ashamed and frustrated with myself for never stepping up to become better. The opportunities were definitely there, I just didn’t take action. I’m telling you this because I think your youth is the time when you grow the most, so make the most of it now and don’t put off your social growth for later, because I assure you it will get exponentially harder. I fucked up my high school and college years and I find myself in a position where I’m so ashamed by my lack of a social life and experiences that I can’t seem to reach out to anyone and socialize with them. I can’t even call my closest friends from back home or my family to tell them what I’m going through because I’m so embarrassed of the person that I am. I think I may be depressed, but more than anything I just feel so lost and hopeless and I tell you this has to be the worst feeling I’ve ever experienced. To know that you have gotten to this point without any traumatic experiences or other major hardships in your life really damages your psyche. I’m so convinced that I’m just a weak person, and I constantly try to find something or someone to blame, but it was always just me. I honestly don’t know what to do with myself anymore. I don’t think any advice could help me. It feels like I would literally need someone else to possess my mind and take over my body to get me out of this situation. I’m so stuck. Sorry that was a lot of rambling. Don’t feel bad for me. It’s hard to put into words what’s going on in my head, but I just want to warn you younger people what life could end up like if you put shit off for later. If you have the ability to build your social skills, I implore you to do it now. <SrWoperPants>: It might be to late for me too. I am a junior in high school but we need to get this out there<AlexRowell77>: Its not to late. You are making excuses, just put yourself out there and you'll meet great people", "num_messages": 3, "avg_score": 25.3333333333}
{"start_date": "1544699412", "end_date": "1544730207", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 1335, "text": "<Hospice_Cookies>: As a boring person, how do I respond to \"Tell me about yourself\"? I have very little that is noteworthy about me. This is a question that I seem to encounter but always struggle with answering. I am afraid of boring the other person and making them leave a conversation. I try to be curious about the other person but that only lasts for so long until they start asking me questions. Can anyone offer advice for this situation? <Edit>: I've got to go to class so I won't be able to respond until late tonight. It's been great talking with all of you. I would have never guessed I would get this much support and this many answers. It put things into perspective for me and shows me I need to worry less when talking. Thank you all for taking the time to respond to my post. You guys are awesome.<thetebe>: First off: You see yourself as a boring person. So that is what you are. Change your self narrative. In my experience most people don't have all that much noteworthy about themselves, it is more about the way we talk and less about what we say. That time you took out the trash and it was winter and you slipped, that could be a good story if presented in a fun way. You are doing great with being curious about them, but you are stealing their thunder a bit when you don't let them be curious too. You are not being curious because you seem to use it as a shield. If you are curious you should be curious about what they ask and how that leads you into new conversations. What is really the problem with them asking you questions? It sounds like you get practice with being on the asking end, perhaps you should start practising being the one asked too. What is the worst that can happen? <Hospice_Cookies>: I guess I'm just afraid of people leaving me. It's only in the past year I've tried to hold conversations with others and it makes me feel like I'm a failure if someone leaves because of me. I have never heard of using curiosity as a shield before. I guess it would make sense though. I do try to take the conversations in new ways with the answers I've been given and have had success in this. When you put it this way, I can definitely see how my curiosity can deflect the conversation. <Cyborg_Commando>: So what do you do? Like for fun. You just talk about that. See if that person is entertaining to you. Or if you like to please people see if they make you feel good about yourself while doing it. You have to value your time. You're also trying to see if they're worth your while. You have to find your own thing. That's going to make it easier to drop people. Which, unfortunately is something we have to do sometimes.<Hospice_Cookies>: I really just lurk reddit and watch youtube, I play video games here and there but I sometimes find it exhausing these days. My time really isn't worth valuing. It seems like I have too much of it and I can't get out of the house to do much. If it's not one problem, it's another. Dropping people has never been an issue for me, after all, there's usually someone else people would rather be with. I don't blame them.<Cyborg_Commando>: What is your home life like? Do you have your own space?<Hospice_Cookies>: There isn't a whole lot for me to say. As for recently, my family and I moved up to New Hampshire about a year and a half ago. Since then I've going to a community college and taking college courses in accounting. Tomorrow is going to be the end of my third semester. I do not have a job, my parents prefer me to be at home to watch after the dogs and my mother should my father need to go somewhere. I just do homework take do what's expected of me. If by own space you mean house/apartment, no. I am a dependent continuing to live with my parents. I'm looking to move out in a few years after things get sorted and I get a college education, a job, and a place to live.<Cyborg_Commando>: I mean like, do you have your own room/private space?<Hospice_Cookies>: I do, a couple actually. I have my own room and the basement. I tend to just go in the basement whenever I want to get away from others. It can be a bit noisy at times, but for the most part it's quiet and peaceful.<Cyborg_Commando>: Those spaces are full of only your things?<Hospice_Cookies>: Nope, just my room. The basement is filled with things that couldn't find a place anywhere in the house. We have a little area down there that has a TV and a futon. The rest is mostly clutter and things we don't want to throw away.<Cyborg_Commando>: Is there clutter in any other rooms of the house?<Hospice_Cookies>: Not really, the dining room is a bit of a mess but that is only because of me having a bunch of papers lying around for finals. The rest of the house is clean.<Cyborg_Commando>: Would you feel comfortable inviting a friend into your house?<Hospice_Cookies>: Yes, it would only take minutes to clean up. Maybe about an hour depending on how short notice it is. I mentioned that the basement is kinda cluttered but that's mostly furniture that never found a home when we moved. Everything else in the house is orderly.<Cyborg_Commando>: That's great! It's important that your spaces make you happy. If they aren't you should decorate them somehow. That will help keep your energy up. You say you watch a lot of YouTube? What do you watch usually? <Hospice_Cookies>: I usually watch gaming related channels. Hearthstone videos are nice to relax to here and there. Some of my favorites channels include BedBananas, Summoning Salt, and Mr. Sark (whenever they upload, they don't have regular uploading schedules). My favorite hearthstone players are Brain Kibler and Thijs.<Cyborg_Commando>: I remember kibler from magic the gathering. I don't know anything about hearthstone or who those other guys are.<Hospice_Cookies>: Brief summary of them all: Mr. Sark and Bedbanans are content creators which usually feature funny/amusing moments in some of the games they play. They usually play a variety of different games and don't really stick with the same ones. Summoning Salt is a youtuber who showcases speedrun progressions. Only uploads a couple months but I always enjoy watching anything he uploads. Definitely worth a watch if you are interested in speedrun history for a few games. Thijs is a European hearthstone player and he play competitively. Definitely not for everyone but I enjoy watching him play. He's a bit eccentric but enjoys playing hearthstone.<Cyborg_Commando>: I'm sorry I don't know what most of that stuff means. Myself, I like fountain pens, bullet journaling, and children's literature. Have you ever read \"the day the crayons quit\"? It is hilarious. Basically this kid goes to open is crayon box but instead of finding his crayons he finds that each one has written him a letter. The letters are basically a list of grievances. The beige crayon goes \"I am not light brown. I am beige and I am proud.\" Lol<Hospice_Cookies>: I've never read that book, the small description you give is hilarious. I've never done anything with fountain pens. I've looked in the past to see what they were/see how much they cost. Do you know of any budget pens that would be fun to start with? I'm entirely unaware of what bullet journaling is. What is that?<Cyborg_Commando>: Lamy safari is my favorite one right now. It's made out of the same kind of plastic as Legos. I think I paid$15 for it. Bullet journaling is a system of journaling very complicated if you don't know what you're looking at but there's short YouTube videos which explain the system. I use it because it mostly gives me a reason to buy nice fountain pens. Lol <Hospice_Cookies>: The pen's on sale right now for $22, I might pick that up later. Fountain pens have interested me for a bit, just never really had a reason to pick one up. I'll look up bullet journaling later. Looks kinda complex.<Cyborg_Commando>: Yeah! A new convert. But remember, you gotta do you! It's just that some interests are a lot more simple than others to talk about. I also like board games but just explaining that they didn't stop making new ones after they invented Trouble takes too long. So not worth it right away and new friends might get bored. Important thing is to just find things that you like. If you had told me that my hobbies were boring after I told you what they were then I would just think that you weren't somebody that I wanted to talk to anyway bc no shared interests. You just want to be your own fulfilled person, first.<Hospice_Cookies>: &gt; You just want to be your own fulfilled person, first I'm still working on this. Some days I think I want one thing and the next I want another. Kinda makes it hard to focus on one thing when it's not clear what I actually want to do. Some interests are definitely easier to explain than others. I may not understand all interests but I do try to make an effort to understand and talk about them. It seems like when I'm on the explaining end I don't really know what to say. I've gotta go to class, so I can't respond until late tonight. It's been great talking with you, thank you for the advice and the conversation! I'll look into the fountain pen and remember you. :P<Cyborg_Commando>: I've got to go too. My last exam. Remember this conversation. It's not a bad model. And nice talking to you too!", "num_messages": 26, "avg_score": 51.3461538462}
{"start_date": "1544701787", "end_date": "1544767924", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 17, "text": "<_AKingHolyCow_>: im 12, 13 in 15 days, and im bad at convesetions. text, voice all round and i never know what to say. i get told, be yourself, but it never works, any tipw?<Reddit_Mods-Are_SJWs>: Hahaha youre 12. Youll have plenty of time to learn. Dont mess up like the rest of us and actually go outside and hangout with people. Youll develop experience.<_AKingHolyCow_>: how to hangout with people? when nobody ever invites you except birthday parties?<Reddit_Mods-Are_SJWs>: If theres a group of people walking home or something then walk with them if they r near ur house and just talk to them. Idk dude. Like i said, i messed up and idk.<_AKingHolyCow_>: wdym by messed up?<Reddit_Mods-Are_SJWs>: I didnt leave my house after coming home from school . I regret it every day <_AKingHolyCow_>: i dont either, what does it matter?<Reddit_Mods-Are_SJWs>: Youre 13.. u can change that. I cant, it’s too late for me <_AKingHolyCow_>: im not sure what you mean? what's the big problem here<Reddit_Mods-Are_SJWs>: LEAVE UR HOUSE IS WHAT I MEAN <_AKingHolyCow_>: to do what?<Reddit_Mods-Are_SJWs>: Gain social skills <_AKingHolyCow_>: no kids live around here<Reddit_Mods-Are_SJWs>: Ask kids from school if u can go to their house<_AKingHolyCow_>: ill try that then<Reddit_Mods-Are_SJWs>: Make sure theyre ur friends lol. If u sort of know them then maybe ask what theyre doing after school and ask if u can join.<_AKingHolyCow_>: how do i make sure they are my friends? i very sure as im together with them alot in school, and i get told some secrets, but idk", "num_messages": 17, "avg_score": 1.0}
{"start_date": "1543634547", "end_date": "1543693032", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 16, "text": "<my_deep_th0ts>: So at school right now I have no friends and it’s basically because I’m stupid and made very shitty friends. Anyway, I was curious to know what people thought on this question: what’s worse? having shitty friends or no friends? <MakeLoveNotWarhol>: “It’s better to be alone; than to be around people who make you feel alone”. <speshil>: This sounds crazy but I completely agree. I can't really explain why or how but I think this is very true. I think you'd end up being more sad being around people and still feeling alone than you would just being alone.<MakeLoveNotWarhol>: I heard it from my father once, Initially I didn’t really understand it. But as I got older I found that being around bad company can be more harmful than just being in solitude. Thanks for the reply! :)", "num_messages": 4, "avg_score": 4.0}
{"start_date": "1543633930", "end_date": "1543638603", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 20, "text": "<tHanatos347>: I like a girl when i was young I like a woman in elementary school, I didn't have courage to say it, now I'm in college, I accidentally found her Instagram account through my friend's Instagram account ... I immediately followed and said, \"hi\". She immediately replied \"yes?\" , and I asked, \"were you the one who worshiped in this place\"? and she didn't reply ... what should I do?<JS4747>: What was your reply supposed to mean. From a neutral standpoint it doesn’t make any sense.<tHanatos347>: Only yes , so i can keep continue the conversation<JS4747>: What did you mean when YOU said, “were you the one who worshipped in this place”?<tHanatos347>: In this place is a church named gpdi .. i just want to start a conversation with that .. is that wrong? Sorry my english is really bad<JS4747>: So you commented on her picture? If so, this isn’t the way to pick up women.<tHanatos347>: Nooo , i sent a message to her<JS4747>: You’ve probably already lost this one, if you are going to start a conversation you need to be clear about what you are saying. Since English isn’t your first language you need to look at what you are saying and make sure a stranger can understand it. Even with the context you have given me, I still barely understand what you were trying to say. Don’t expect her to reply.<tHanatos347>: Thanks for your advice , but i will keep trying ..<JS4747>: Don’t keep messaging her, you will come off as annoying and clingy. I’m saying this because I want the best for you, don’t try for things that aren’t there. If you keep messaging her without any replies you will gain a reputation for being creepy.<tHanatos347>: Allright captain , i will do my best<JS4747>: I feel like you are completely missing the point I’m trying to make.<tHanatos347>: Actually i sent a message 2 weeks ago , yesterday she made a snapgram about hard life then i sent her 'everythings gonna be ok' she reply \"yes , amen\" but she still not follow my instagram .. Is that okay?<JS4747>: She was replying to you out of courtesy. She’s replying in a way that doesn’t start a conversation, so she probably doesn’t want to have a relationship with you. You’re also way too concerned with your social media status.", "num_messages": 14, "avg_score": 1.4285714286}
{"start_date": "1543616085", "end_date": "1543648648", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "[deleted]: How can I be more confident with girls [deleted]<effyeahjosh>: Practice my dude. Go to the grocery store, go to the oldest cashier there (male or female) smile make eye contact and crack a joke. It doesn’t even need to be funny, make yourself make a joke. Either they laugh at you or laugh with you and there isn’t actually a difference so don’t stress. Do this a bunch of times you’ll be amazed at how easy it will be talking to people you don’t want to stick your dick into. Learn to talk to everybody, the confidence will come, and then confidence with girls will come.<MakeLoveNotWarhol>: I 100% agree ^ Confidence; just like anything else in life takes time and practice to develop and master. Just have fun with it man, not every interaction you engage in is gonna be perfect; you just have to roll with it.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1543636553", "end_date": "1543643448", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9, "text": "<disturbedjuice>: so im a teenager with a very minor case of autism and 1-2 years behind (or at least by my estimations) the social curb really the problem is that i lack certain skills and i wold like to know how to improve on them. for example, sometimes ill draw a blank when trying to start a conversation and just stand there awkwardly. somehow it feels like if i talk i wont say the right thing or just be boring. it also feels like (even if the people in question are friends.) then wont like me talking. my main comedy source used a 4chan edgy style of humor. but as of recent i have been trying to move away from that for obvious reasons. but this often leaves me dry of jokes and unable to entertain. even further when i do start being able to talk i don't really think that fast (not that i have a low intellect just slow on the draw) so i often say things to late, miss the point entirely or don't say anything when about three seconds later i think of a responce that wold have hit the nail on the head.<JayKayVay>: It takes some practice - spend more time with people, maybe try to find more appropriate environments like hobby groups where there's inbuilt conversations to be had rather than you trying to think of something to say off the top of your head. Many Autistic people benefit off of improv or acting classes. Good you're moving way from that kind of comedy, maybe try to replace it with a better quality of humor - go watch comedians and see how they do it, also notice their timing...often they use a pause for effect, you can use that to cover-up your inertia. On the inertia also work with it rather than against it, be someone who's cool and takes their time to speak - rather than someone who panics when they can't think of what to say. Try self-help books too, a lot of them are useless to be honest, but one I found useful was [How to Talk to Anyone: 92 Little Tricks For Big Success In Relationships](https://www.amazon.co.uk/gp/product/0722538073/ref=oh_aui_detailpage_o00_s00?ie=UTF8&amp;psc=1) There's no such thing as a \"very minor case of autism\" - a person is either Autistic or they're not, same way a person is either pregnant or they're not - you're Autistic, there's nothing wrong with that. &amp;#x200B;<disturbedjuice>: Thanks! I appreciate the support. I will definitely try these ideas. Although to clarify by the autism thing, by very minor I meant I am high functioning. Just to give a sense of it, people can't normally tell on first contact.<JayKayVay>: Respectfully [functioning labels](https://medium.com/@autisticliving/whats-wrong-with-functioning-labels-a-masterpost-2978b84f2878) aren't much better at explaining anything and they're also ableist, if you're a teen I get you may have some issues with internalized ableism or may not be in touch with the Autistic culture but please think about the language you use. Try NT-passing, say you're good at masking, or just say you're Autistic.<disturbedjuice>: I don't fully understand but ok.", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1544749350", "end_date": "1544752856", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "<RandomAccessMemorie>: Fucked up with my crush. Is there anything I can do to at least stop her from seeing me as some weirdo? A few months ago I started getting feelings for this girl at my college, we had a class together last year but I didn't like her back then (actually found her kinda annoying). She was really friendly towards me, always asking how I did on the tests and whatnot, but I kept to myself the whole time. It wasn't until the next semester that I started to like her, and this current semester I finally tried talking to her. <Keyword>: tried. I couldn't get a coherent thought out if my life depended on it, was completely oblivious to the fact that she was busy sometimes, and just all around very awkward. Basically these past few years have been very rough for me. I won't go into detail, but I was an emotional trainwreck and struggled when talking to anyone that didn't know me beforehand. After a month of blowing any chance I had with her, I gave up and decided it was time to get my life back together. So I did, and today I figured I'd give it another shot... but as soon as I went up to her she just asked me to leave her alone. Now, I obviously didn't think much about this in the moment, but I must have come across as a total creep/asshole back then. Is there anything I can do to change her mind at this point? I've already accepted that we won't be a thing, but I'd like to at least be friends.<paradisebywhitelung>: I think the best thing you can do here is to leave her alone. It doesn’t feel good, but it shows her that you respect her and her wishes, rather than pushing for what you want. <RandomAccessMemorie>: Yeah, you're probably right. But would it be too much to at least apologize?<paradisebywhitelung>: Yes. Unless she asks for an apology, what she’s told you is that she wants to be left alone. You should respect her wishes.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544756460", "end_date": "1544798596", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 15, "text": "<neatoburrit0h>: I've been wanting to tell this guy that he's cute, but i'm worried that he may have a girlfriend. I just saw a post that someone told a guy that he's cute, and that motivated me to make this post. I don't have this guy's number but I see him at my gym all the time. I want to tell him he's cute/looks great but i'm worried that he may have a girlfriend and i'll embarrass myself. I have scenarios in my head in case he does, but would just rather avoid the embarrassment altogether. What can I do to gather up some courage?<siammang>: I got down voted on other thread for recommending a girl not to tell the guy that he's cute, but I stand by my opinion. Please don't go to tell the guy that he's cute. While you may see it that way, but it can backfire for some guys. Instead, try ice breaker by asking about the body part that he works on, e.g. bicep, tricep, abs, thigh. Ask how often he works out and such. Gauge his interest. If the guy seems cool and open, you can talk to him more and find out if he's seeing anyone. If not, then you can move forward by asking for a number for meeting up some other time. If he seems grouchy, you can just say keep up good work and move on. Alternatively, shoes, arm band, head band, fit bit stuff could be used for engaging the conversation instead of body parts if you don't feel comfortable mention those.<neatoburrit0h>: while an ice breaker is a great way to start a conversation to get to know the guy further, i don't. I'm not interested in getting his number or going out with him, I only want to shower him in the compliment. I appreciate you sticking to your guns though. Power to ya! <siammang>: In that case, please just say \"hey man.. I like your guns/abs/legs.\" and just carry on with your routine. Save the, \"aww. You're cute\" for when he plays with puppies, kitties, and or kids or when he does something nice to you or someone. Not he's cute because he's pumping his gains at the gym. Telling someone being cute is complimenting the sensitive side. Probably not the goal of those who's hitting up with the gym. I understand that you see the person looking cute, but hope you the gist here.<neatoburrit0h>: i read your downvoted comment, and while I don't agree with \"cute\" being perceived as \"weak\" or on the \"sensitive side\" in that matter, i can definitely agree with that there's a time and place for the appropriate compliment and cute may be the wrong word choice at a gym. i'll keep away from that and stick with \"your muscles look cut af\" <siammang>: It has more to do with social norms as well. Men tend to not like being perceived as being weak. It's in parallel to how women don't like being objectified. If men find you attractive, would you prefer they tell you, \"you looks great!\" Or maybe complimenting your choice of clothing rather than someone come to your face and say, \" yo girl I really like your bosom. Very sexy!!\"? How well you know the person could matter as well. It's probably fine if you are close with the person, but it certainly sends a weird signal for first time encounter for two strangers.", "num_messages": 6, "avg_score": 2.5}
{"start_date": "1543640191", "end_date": "1543680374", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 15, "text": "<Decent_Relief>: Thinking about going on an anti-anxiety medication makes me feel like I'm a broken person - am I? <flebby-nipples>: No, I’ve been on it before, you just don’t have a healthy way to let go of anxiety, like and I should know, I’m honestly working on my own anxiety too. Just always remember you’re taking the drug to help yourself get better, not to fix yourself. Only you can help yourself be better, try to feel better<Decent_Relief>: Do other people just naturally have healthy ways of letting go of their anxiety? <flebby-nipples>: Depends on your term for healthy, but yes there are ways of treating your anxiety without medication, the question is how bad is your anxiety, and does it hamper your day to day life. Just keep your head up high and find someway that helps you get rid of your anxiety because everyone’s different, and thinks differently", "num_messages": 4, "avg_score": 3.75}
{"start_date": "1544630349", "end_date": "1544641539", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 10, "text": "<w0snme>: Dealing with harassment and aggression I was on the receiving end of an aggressive woman at a concert. She was a stranger. The thing is, I was the one left feeling defeated and flat. My day was ruined by this person although I knew I shouldn’t let her. I wanted to cry. <Context>: I was minding my business at a concert when the woman behind me with her boyfriend started deliberately elbowing and shoving me from behind. They were using force. I turned around and said, “Could you please step back.” The woman went close to my face and began saying, “I’ll punch you in the head, got it?” And she kept saying this. She was much older and larger than me. I couldn’t move away because I was blocked, but now I’m just glad it’s over. If anyone can share their stories, how they dealt with aggressive strangers and how they felt better I’d really appreciate it. <TonberryTroubadour>: Back in high school, there was this kid who used to make really snide dumb remarks in one of my classes whenever I answered a question correctly or whatever. For whatever reason, this kid would always have something to say about me. One day, he made some dumb comment while the teacher was out of the room and I told him, \"Come up, stand up here, and say it to my face.\" Mind you, he was like 6'3\" and I'm 5'7\". The kid didn't say anything back and quit bothering me the rest of the semester. Sometimes I feel as if people test you and you gotta stop them before they feel like they can get away with anything or they'll keep on trying to get away with more. Sometimes it can end bad or good. Depends. I've learned over the years that people are often more bark than bite. In your case, I would've told her to do it. She's the one who would've gotten in trouble anyways if she did that, but it seems to me like she was just fronting.<42424242421313131313>: Dude I totally agree. I'm in HS now [15 freshman] and I had to been dealing with this one kid [17 senior] for months. He was constantly fucking with me, constantly trying to get a reaction out of me. Until all came to a head when he called me a pu*sy in class. I punched he punched back, We got broken up. Lasted all of 3 seconds. I got 3 days, he got 5. Never had a problem again.", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1544573461", "end_date": "1544829518", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 56, "text": "<KingAnve>: My first kiss! Hi! Im a lurker and have been trying to improve my social skills over the years, I've never been tough enough to talk to girls etc. irl and always make up excuses. Today, I went home with my crush and kind of flirt for the last 4 YEARS (on/off- im 16) and we were cuddling and kissing. She knows all of this so she kiiind of took the lead, and now I am never anxious or anything around her, and I love her! I was still a bit nervous, maybe that is because it was my first time doing something like this.<Zerqzee>: Congratulations! Next step is to not get too attached though! It's a slippery slope! Best of luck!<JoinedRedditForEsper>: Yeah as someone who just kinda lurks here and doesn't have an issue with social skills, dont follow this advice. Sorry zerq. The more determined you are to not get attached because you \"know its gonna end badly\" the greater the chance that it IS going to end badly. She'll be able to tell when you're holding back, and she'll think shes the issue. Jump straight in. If you get your heart broken, you get to learn how to get back up.<Zerqzee>: L o l . He's known this chick for a while and they've finally established feelings for each other. If he goes balls deep and tells her he loves her. She's going to freak the fuck out lol. You're clearly not as socially adept if you think pulling all stops the minute a connection is made is the way to make her become closer. Lol. <JoinedRedditForEsper>: I never said tell her you love her. I said dont intentionally not \"get too attached\"<Zerqzee>: Read his post. He just said he loved her, don't get too attached the minute a connection is made. It scares people. <JoinedRedditForEsper>: Still disagree. Refer back to my first comment.<Zerqzee>: I disagree that you don't have social issues then lol. Ask any girl youve known for a few years out, cuddle and flirt then tell her how much you care and that you're so happy and all this shit and you're on your way back to being \"that one guy she almost dated\" . Just asked a few female co workers , they said they'd prefer even though if they knew them for a few years they'd still like to take it slow in the romantic area. Either way, if OP feels lik he should tell her how he fully feels and he wants to get attached by all means he can. I just think your encouraging him to take a risk that might hurt his friendship. <JoinedRedditForEsper>: First thing: I AM a girl. I've been in a relationship for 8 years and am engaged. I know my shit. <Second>: I never said tell this chick xyz, theres a difference between telling the girl how you feel and having the feelings to begin with. Constricting the feelings inside you can hurt a relationship, its healthier to have these good feelings and not go screaming them right out the gate. Which is what I encouraged. Third, he already established that the girl took lead and kissed him back too, so as far as hurting the friendship, that's kinda out the window. The crossed the bridge, theres no going back really. I encouraged OP to feel how he feels and not try to repress anything over fear of getting hurt. At the same time, yes, take it slow and dont TELL her you love her for at least a few months.<Zerqzee>: Im literally saying that lol, not getting too attached is having the ability to control your emotions and being able to read the situation correctly. People are bound to get hurt in relationships, it happens. But why would you want to get hurt the minute you step in it? Take a minute to look at the relationship for it's face value then dictate whether or not you feel the way you feel. <JoinedRedditForEsper>: You're either not understanding me, or what \"dont get too attached\" actually means. So I'm done pointlessly going back and forth with you<wonderfulworldofweed>: Kissing someone and thinking you love them is already too attached <KingAnve>: I think you guys misterunderstood, I've talked to this girl for years but when I meet her irl just in the hallways etc. I just get frozen and don't know what to do or say, and over the years I've developed my social skills and are able to be with her, comfortably a.k.a overcome my greatest fear, being social as well as kissing which was a big step for me. I kind of love her but I need time to see if we work out if you know what I mean. Nice to see you guys discussing though :) EDIT : She has allready told me she loved me, but felt like it wouldn't work out because we were just texting so I went over to reddit and started working on my social skills, and how to not get anxious.<wonderfulworldofweed>: That’s good but declaring love for someone both of you before you meet irl or even if you talked online for years after first kiss is out there", "num_messages": 14, "avg_score": 4.0}
{"start_date": "1544771980", "end_date": "1544824951", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 18, "text": "<LilGambino>: I asked a girl for her number and she gave it to me and we're meeting up! I'm in highschool and I've always had a problem with talking to girls, just today I talked with her and got her number. Then I texted her for a bit and we still have to decide what we're doing but definitely something will happen My text game is weak and talking to her makes me nervous what do I do? I don't thimk im financially capable to have one but I'd love to just hang out with her. Also we dont have a ton in common though :(<lilsquish_69>: You’re in high school, so think of a couple of free things to do; might vary depending on the area. I’m 24 and I still go on cheap dates with women I meet. I usually take them to a really nice park or just get some coffee or tea. And since you guys don’t have much in common, just practice talking with her. You guys don’t have to become anything more than friends, remember that. <LilGambino>: Yeah i gotta stop throwing too much interest, its not too obvious but i feel like I'm trying <WhiteKoala__>: Froyo my dude<LilGambino>: yo i would have no clue what to say to her there<WhiteKoala__>: Here's would I'd do. Drive to her house, pick her up, meet her parents if shes okay with that, take her to the froyo places, get froyo and YOU pay for it, eat and talk about literally anything, finish eating take her hand and walk outside for a bit, if shes sending you any IOI's go in for a kiss and call it a night. <LilGambino>: IOI'S? Conversation us hard to keep up with ngl but we talked all of today", "num_messages": 7, "avg_score": 2.5714285714}
{"start_date": "1544414466", "end_date": "1544774080", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "[deleted]: approaching girls in gyms [deleted]<ZenitramNaes>: Don't <Relzyn>: Because of the concise nature of your post, I am legally obliged to ask: \"Why?\"<wonderfulworldofweed>: Gym is a place to work out. People are there to work on their bodies, relieve stress etc not get hit on.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1543640319", "end_date": "1543677439", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<Skitz574>: How can I get out of a toxic friend group? I’m a weird and annoying kid, I know that for sure. I make a lot of dumb jokes ironically (like fortnite dances, pretending to be gay, etc.) I hang out with other kids my age and it’d all be fine and dandy if I wasn’t forced into doing marching band by my parents. The people in my section don’t really get my type of humor which is fine, I wouldn’t really expect them to do so, but it feels as if every single one of them doesn’t like me, but I still consider them friends cause I have to be with them every day of the week for a class, and once the semester ends twice every week afterwards, maybe more. But they’re toxic to me. They think that they’re better than I am (which is true to an extent) so they are very passive aggressive at every interaction I have with them and it’s always just “Anon is so cringey for doing this” “wow anon you’re so gay” if not straight up calling me stupid or ignoring me when I’m just trying to talk with them, and that stuff genuinely hurts me, especially when I’ll say something that I feel is really important to me just to have it ignored in favor of someone complaining about their family mildly annoying them. I wish I could just ignore them but it’s not in my nature to do so. Whenever we’re at rehearsal and I’m bored (which I am a lot considering I don’t like playing instruments) I start to talk to people and it just starts this cycle over again. I don’t think trying to settle it with them is a solution, I’d love for it to be but I don’t think it’s realistic, and with no one I feel comfortable enough with to ask for help I’m here, so any thoughts on what I could do to get out of this toxic friend group?<bradwalk>: Well... in my humble opinion there are a couple of ways to go about it. <1>: They are in the wrong. \"If you are distressed by anything external, the pain is not due to the thing itself, but to your estimate of it; and this you have the power to revoke at any time.\" (Marcus Aurelius) You should first recognize that you don't have a lot of sway over what they think. That being said, it sounds like you work with them so you need to deal with it. You'll need to change your behavior as well as your outlook. The first thing might be to stop giving them shells to drop on you. You act \"gay?\" They call you \"gay.\" Dont feed the flames. In response, you could take it as a chance to show them your wit by verbally swinging back. Jokingly of course. Dont be a bully. Bullies suck eggs. You could ask to be placed in another division. I dunno if it works that way but eh. If you asked them as a group to stop, that might fuel the flames unless they're above the curve. but try to experiment with different responses. Try new things, and it'll sharpen your knife and give you a pocket full of options you can use later in life. 2. Maybe you're the problem. This could be them implicitly telling you that your behavior is no bueno. Not too good at all amigo. When I was in high school I was in almost the same situation and I just changed the problem behavior. At first I thought I was \"selling out\" or some kind of arrogant bullshit but the change was for the best. I dunno. Doing something and failing but learning is more valuable than suffering. <Skitz574>: Thank you, after consideration and the swallowing of my pride I think it might be the ladder option. But I think I’ll try to change how I am from now on around them. Once again, thank you", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544206786", "end_date": "1544554291", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 166, "text": "<Keiuu>: As a quiet person, if I'm laid back and nice, I'm a doormat, but if I stand up for myself, people say \"don't be mad\" I don't know if this happens to other quiet people like me, but seriously, I have one friend who is just hard to get along with, and it has happened several times that he insults me, in a \"joking\" way. If I try to laugh it off, my other friends tell me \"don't be a doormat, don't be submissive\". The thing that annoys me is that one day I started to actually call him out on his behavior, like \"Shut up, no one is in the mood to put up with you now\" and people go all like \"Hey, that was just a joke, friends are meant to forgive each other\" Like I have no idea what people expect of me. Have you ever experienced something similar?<rodpdc>: How old are you OP? And in what kind of environment does that happen? I might be wrong, but just looking at it superficially I would say you are better off alone/with other friends.<kairon156>: I'm not OP but something similar happened at a work place earlier this year. I was trying to speak my mind and the person I was talking to didn't get it, Than a 3rd person said something, I forget the word but it was similar to contentious or some other word meaning \"Assertive in a bad way.\" At least that's how I took it.<rodpdc>: &gt;rodpdc Yes, I totally get it. I've been through that as well but it's either that or being mistreated, what do you prefer? I know it ain't the ideal way, but it's still the best advice I can give. &amp;#x200B; If you had the skill to be ''assertive'' not in a bad way and naturally, you wouldn't even need this skill in first place<kairon156>: I would rather be told I\"m too assertive than being treated like a child or someone who's foolish.<rodpdc>: Exactly. That might not be ideal, but it is much better already than being bullied and keep silent<kairon156>: Only if I could be the current Me back in Jr High. I wasn't bulleid but I wasn't nearly as assirtive as I wish I had been.", "num_messages": 7, "avg_score": 23.7142857143}
{"start_date": "1544741195", "end_date": "1544780401", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 8, "text": "[deleted]: I don't understand why she wants to see this guy so much [deleted]<honybadgerdntgivafck>: She want to have sex with him and you arent going to stop her. Dont let her ruin your life, and leave her now.<tallguy1217>: She offered for me to come with too, forgot to mention<honybadgerdntgivafck>: She has gay fantasies.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543641757", "end_date": "1543694207", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<Dave273>: Help me understand.. I don't understand how to initiate anything really with a stranger, I feel like everyone else got an instruction manual on how to make friends but I never got it. I've been trying, I got a dog a few years ago, to help break the ice. And I made a lot of progress talking to people at dog parks. But I think I got as far as I can go with that. So recently, I've started trying to branch out more. I started by walking around my college campus between my classes every Tuesday and Thursday, telling myself I had to talk to at least one person that day. But I'm always too afraid to talk to anyone. I just left a heavy metal show, where I'd have more in common with people than anywhere else. I wanted to make friends, but once again, I'm too afraid to talk to anyone.. There was an extremely pretty girl I wanted to talk to, and I'm kicking myself so hard for not trying. I just kept waiting for the perfect opportunity, where she wasn't preoccupied with something, and that opportunity never came. Even if she had just wanted to be friends, I would have been happy with that. I'm at my wits end with myself.. What do I do? How do I approach someone? What do I say? I don't understand. I don't understand any of this.<xdiggertree>: First of all, props to you for wanting to make an effort to keep growing! It’s always much harder to learn something than to keep it going, so, just remember it IS hard. I would not focus on getting girls right now because IMO friends are more fulfilling than fleeting romances. You mention two different topics, making friends and initiating with strangers. These are two very different topics that need different skills, so, I would suggest you approach these two as two different topics - this should actually make it easier for you. Now, if your main goal is to make friends and that is why you are talking to strangers, we would have a different story. Not to scare you off, but it is harder to make friends through meeting only strangers. It is hard enough just to make friends through friends (I know through experience). There are some tricks to making friends through strangers, best thing would be to become a regular at a couple places *you* find comfortable, where you are in your zone. So, if you love metal shows, why not try working at a venue. That would keep you in your zone, provide income, but, most importantly, give you repeated exposure. Sooner or later people will remember you and they can do more of the heavy lifting. A person has to be pretty smooth to make friends with complete strangers. The goal is to see the same strangers over time and get to know them. Finally, don’t be so tough on yourself, this stuff is actually really emotionally draining. No one can just talk to stranger after stranger when they aren’t experienced and not become exhausted - it’s natural to get burnt. Just be proud for your *effort*, not what you may or may not have relative to others. I have a couple posts about exactly what you asked, so please go check them out! Good luck!!!<Kawhisintern2>: Let's say you do see this random stranger everywhere, how would or can you strike a convo up?<xdiggertree>: Hit general topics that you would have in common, that would usually cover things like: * “what did you think of the show last (insert date)” * “holy shit, that was so packed yesterday, I felt like I was going to get trampled” * “yea there’s another venue I visit that I saw (band name here) last week” * “yea, I wasn’t able to see them last week because my cat had a tummy ache, how were they?” All of these have a few things in common; those things would be: opinions, feelings, logistics, and hobby (venue, band, quality, etc.) You are pretty much trading bits of info to find/build common ground. It is the same friendship building process that we used as kids, “I like dogs”, “I also like dogs”, “I don’t like cats”, “I also don’t like cats.” There might be more technical facts added with adults, but, it’s still the same at its emotional core.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544777692", "end_date": "1544815727", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 23, "text": "<Imnotsure12345>: Do you find it irritating when... When someone is all friendly to you on social media like Facebook, liking all your pictures and posts and commenting ‘omg you’re so pretty’, yet when you message them to meet up, they either ignore you or they say ‘omggg I’m so busy I’ll get back to you’ but then never do? Someone is currently doing that to me and it makes me want to unfriend her. It feels so fake.<chrisappleseed>: Just do it already. The world has enough attention seekers! Unless this only happened once with that girl, in that case you should try again.<Imnotsure12345>: I’ve been trying to meet up with her for months, lol. She is quite busy but so am I, and so is everyone. The ignoring of messages is just rude. <chrisappleseed>: So is promising to get back to you and then don't. Besides, being busy is no excuse. It's all about *making* time for the people you care about.<lobsterfungi>: Yes it's about making time for those you care about and if you don't make time for us to meet up, tell me why would you expect me to care? I only have 100 years **if I am lucky** and wasting my time is just rude. It's my task to waste my time, not yours lol<Imnotsure12345>: Yeah I wouldn’t care if she was only ignoring my messages, fair enough. People drift apart. It’s the fact she pretends we are besties on Facebook. It’s so two-faced and fake. Really winds me up.<chrisappleseed>: Oh yes! So many people on Facebook do anything to make themselves look good. The good thing is, apparently she thinks her online presentation looks good being friends with you. The down side: it's all fake.<Imnotsure12345>: Exactly! People don’t want the actual friendship, they just want to look popular. <chrisappleseed>: Honestly I don't even know what it means to be a friend anymore. I'm just trying my hardest to be there for people and especially for my loved ones. When somebody needs me I find a way to make time for them...", "num_messages": 9, "avg_score": 2.5555555556}
{"start_date": "1543602972", "end_date": "1543655226", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 29, "text": "[deleted]: How do i start a text conversation with a female classmate who i have crush on without it being random or awkward? [deleted]<doodydagreat>: Trust me, don’t text. Your social skills develop increasingly if you talk to her in person. When you’re older, you can’t text an adult you randomly see on the street you find attractive. Best of luck.<Phrostbit3n>: OP said they don't see each other much, no reason to miss out just because they don't get any face-to-face. Something as simple as \"Hey you have any plans this weekend? Wanna grab lunch?\" is worth texting", "num_messages": 3, "avg_score": 9.6666666667}
{"start_date": "1543644211", "end_date": "1543694023", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 22, "text": "<MjHue_02_UPSB>: Going to my first date. Any tips on how not to be a total idiot? <xdiggertree>: Very vague question with no context. Here are things to NOT do since you asked how not to be an idiot. * Don’t criticize anything at any point * Don’t complain * Don‘t be late * Speak less if you aren’t sure what to say * Don’t go somewhere for a date that you don’t want to be at * Don’t be on your phone at all really * Don’t have caffeine * Don’t have processed sugar * Don’t think about “having to make a move”, just have good convos and really get to know your date. Other tips, if you are too nervous to make eye contact, go somewhere where there are things to look at and talk about together, a pier, a shitty museum, a mall. If things get stale and you start to get nervous, just change the setting. Surround yourself with a context that has a lot of potential topics, don’t go for coffee for this reason. If you already chose coffee, don’t have any caffeine and just suggest going out for a walk somewhere (places I suggested) after she finishes it. Good luck 🙌<MjHue_02_UPSB>: This is amazing advice, and exactly what I was looking for! Thank you! Also, I know you said no coffee, but I am taking her to a bubble tea cafe. Her never having bubble tea before inspired me to ask her, and theres lots of cultural things I feel can be talked about. I will take up your idea of walking afterwards (if I can handle the -15° weather for more than 15 minutes)!<xdiggertree>: Glad to help!! Seems like you know what you are doing dude, maybe try to find a place with a fireplace to get extra romantic?!", "num_messages": 4, "avg_score": 5.5}
{"start_date": "1543617655", "end_date": "1543645405", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 20, "text": "<Prada_Princess>: Say the person’s name as much as possible. As someone with autism, I struggle with connecting with people in conversations. Maybe some of you have heard the saying, “There’s nothing people love more than the sound of their own name.” This is so incredibly true! Looking back at conversations I’ve had with people, I always felt so connected with someone would say my name before speaking, at the end of their sentence, or when they’d frequently say my name through out the conversation. It’s how I make up for my lack of eye contact. <tykemison1>: I think this is best applied at the beginning and end of a conversation. A person's name is a fundamental part of his/her identity, and saying it as you leave gives them a sense of importance.<Prada_Princess>: Yes, definitely! Thanks for clarifying! It was harder to explain than I thought it would be. For example, when people say “How are you, Jane Doe?”I feel heard so much better than when they just say “How are you?” with out saying my name at the end. (Obviously my name is not “Jane Doe” lol. Just putting it in context).", "num_messages": 3, "avg_score": 6.6666666667}
{"start_date": "1544627999", "end_date": "1544780581", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9, "text": "[deleted]: One group, regardless of its popularity, is not the end all be all for social judgment criterion This is just a reminder that when a group of people judge you and you are left saying \"what did I do wrong\", it is typically just a sign of differences in norms. For instance, people (men) get called creepy for a whole slew of things... If you know you are not being creepy, then you are not being creepy regardless of what that group thinks. Keep doing what you are doing. The real creep knows he/she is a creep and has malicious intent in their mind. To react negatively when someone implies you are creepy, you are broadcasting that you don't know whether you are or are not a creep. You are telling people that their is a possibility you are being malicious and their assumption of you as a creep automatically becomes realer (perception wise). This is not to be taken advantage of. Only you know where your true intentions lie. If you are covering up your malicious intent with excuses then you deserve what you get. <Dagobert_Juke>: There's more to social life than norms, my friend. Also, 'a difference in norms' how you put it sounds like these norms are always preexisting and perhaps even static while they are often created and changed over the course of a social relationship. For example, a single camping trip can become a tradition during the first trip itself. [deleted]: you come into every social situation with a preexisting set of norms. the first trip is only a catalyst for tradition... tradition is passed onto another generation (including older versions of yourself). I would argue that the tradition is not established until you have proven that a group has maintained it. as far as your comment goes on \"more to social life than norms\", you are a set of habits. you appreciate people based on their positive habits (in your eyes). these habits are the norms of your personhood; you have either established proofs as blueprints for how to act in certain situations and settings or have automatic responses... regardless they are normal for you... and play 100% into whether you choose to continue spending time around someone. if you are inconsistent, that is something you will have to work on. as much as your ego may reject it, you have an identity that is evaluated by others based on the identity you are fulfilling relative to your thoughts and aspirations.<Dagobert_Juke>: I would not say habits are norms of your personhood. Norms are socially created rules of behaviour closely linked to expectations and values (both of which also matter yet are not norms as such). For example, consider the camping trip. This can create the expectation of a 'tradition' for one group but not for the other. These expectations are explored and negotiated in further interaction based on values - ie why is the camping trip worth it. Habits are neurological pathways which have been reinforced by acquiring certain rewards from acting on cues in a certain manner. Habits are indeed very important for your sense of self, and also influence how people see you. However, not all habits - especially the ones that matter - are hard to spot for many people who you will engane with (since they are only observable over time). Therefore, in social situations people can present themselves in ways contrary to their true habits. Thus, in additions to norms, expectations, values and habits, manipulation of impressions also matter in social interaction. I feel it is too reductionist thinking to through everything on the 'norms' pile. <Edit>: added one word [deleted]: true, I think it is good that you brought up tradition though because a habit is a sort of tradition of yourself. I guess it can be a slight underestimation of human potential to reduce all interaction down to norms and habits and the case that new traditions and habits are formed on any time basis is evidence that social interaction is more nuanced and people do not always conform to their habits and norms. yet, for the post's argument's sake you make a judgment call of your personal habits to say that you want to break your mold when doing so based on your perception that your life isn't quality enough as it is. at a bare minimum, norms and habits play into every decision that isn't an automated process to sustain our bodies<Dagobert_Juke>: Agreed. I do like the idea that you should not defend attacks that miss their targets (ie being thought a creep)", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1544634961", "end_date": "1544654620", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 2591, "text": "<Androwski101>: I am 14 years old and here is my way to start a conversation, does not work on everyone when i sit or stand next to someone or whatever, i often ask about their shoes or clothes because many people try to look good with nice shoes and clothing, so it is really nice for them if you compliment it. or ask them about it. <Example>: In a gym class, we stand against the wall and there is a girl on my right, i didn't know her. I saw her lebrons and asked : -What shoes are those? Lebrons? -then later i Said i was wondering because they looked so nice. It is not wierd/creepy It is an wasy way to compliment someone or start a conversation about something both care bout <OldAnxiety>: im 27 and i would use this tip. <jujuberriii>: I’m 27 too and also will use this !!<MysticSpaceCroissant>: I’m 17 and I’ll probably use this<halfinifinities>: I’m 45 and I’ll use this <daveinpublic>: I'm 76 and I'll use it.<Jabbypappy>: I’m dead and I’ll use it<goldzatfig>: I haven't been born yet. I'll use it. <almighty_ruler>: Have you been conceived yet? If not I'll try to make that happen for you<_roquentin_>: i'm a sperm and i'll use this on the egg", "num_messages": 10, "avg_score": 259.1}
{"start_date": "1543643664", "end_date": "1543693645", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 2641, "text": "<tiffythebomb>: As someone who has conquered her fear of social anxiety, these are my 3 best tips! 1. When you’re meeting someone new, don’t OVERSHARE. It’s okay to say something like “I was a little nervous to meet you” but try to avoid the details about how you thought about it for hours until you finally fell asleep from exhaustion the night before, and now you’ve only had 1 hour of sleep. This also applies to aspects in your life. If you have a medical diagnosis that is very prevalent, or a story that you feel like has defined you, it hasn’t. You define you. Those things should be kept to yourself until someone has earned the right to know them. 2. If you’re starting to feel anxiety creep up, find something to touch. A couch, your pants, your steering wheel, describe the sensation of touching the item to yourself. (Cool, smooth, leathery, moist, ect.) find 5 or more descriptive terms for your item. This will break your concentration and calm the voice inside your head. 3. If you don’t know what to talk about when first meeting someone, a go to is to get them to talk about themselves. People love to talk about themselves. Don’t pry into their lives, but maybe make a comment or ask a question about something they are wearing (avoid sexual comments, or the comments relating to their body in anyway.) Good luck fellow social skill searchers! <Edit>: This got WAY more attention than I thought it would. I’m so happy many of you can take at least something from my post, but I feel as if I need to add a disclaimer. I’m not a therapist. To get to the point where I am today, it took several times in therapy, I end up in a mental hospital at one point several years ago. I’ve worked HARD to get where I am today mentally. My advice is good but it’s not professional advice. Nothing can replace the advice of a professional. If you find yourself in a place where your social anxiety or depression has made you think about self harm, please seek professional help. <NotTheIRA>: I read once about a trick called the FORD method for initiating conversation F-FAMILY ask about their family, brothers, sisters, what do they do etc O-OCCUPATION what job are they working in, how are they finding it R-RECREATION what do they do in their spare time, sports, TV shows etc D-DREAMS what are they looking forward to in the future, any trips planned, or long term goals Almost always you'll find that one of these will spin on into a real convo without you realising, and it sure beats sitting in an awkward silence. And if it doesn't work, maybe that person just doesn't wanna chat! Anyway it's been super useful to me over time I hope it can help someone else! <Notoast4you>: Also is RAPE for what to not talk about. R-RELIGION just don’t, unless of course you’re aiming to find a metaphorical skeleton in the closet. A-ABORTION extremely hot topic between genders if you are on polar ends of agreement, essentially a how to have a bad time starter pack. P-POLITICS just watch them take it personally when you say one thing out of line. E-EXES an unrelatable beast guaranteed to silence the dinner table! (especially if you throw in the curve ball of a positive comment about an ex). <respectableusername>: Also rape. Don't ask them on how they feel about rape.<Obdurodonis>: What is your opinion on rape ..... seed oil?<tumaru>: Canadian rape seed oil or canola oil is clearly better in every way including the name.<Obdurodonis>: Canola oil is better than rape seed oil or better than rape? I agree either way.", "num_messages": 7, "avg_score": 377.2857142857}
{"start_date": "1541006587", "end_date": "1551674194", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7333, "text": "<AsthenDiscovery>: Does anyone else oscillate between wanting to be invisible and wishing they weren’t so lonely There are periods where I really want to make friends and am encouraged to hang out with people and make small talk, but then there are days when I’m really tired and don’t have the energy or interest to have quality conversations and I would really just rather keep to myself. After those days when I don’t feel like talking or hanging out, having conversations with people feels really awkward and I have a sense of guilt for not having been able to fight through my fatigue in order to talk to them. <Edit>: vacillate not oscillate lol. Close enough<RainbowYaz>: All the damn time. Like I will get hype for social events because I have so few in person events, but then as it gets closer I start to dread it. It sucks having such bad anxiety but wanting to make friends. Best advice I can give, through my own personal experiences, is to start small. Don’t jump head first into crazy stuff and if you can try to go with people you know. Let them help introduce you to people. I’m still working at this stuff myself but it’s possible. Sometimes I just have to swallow that fear I get. Like a few weeks ago I got to meet some online friends of mine and we had a super awesome time and I almost didn’t go due to that fear. <AggravatingReturn>: That hour before an event where I have anxiety and I try to turn \"on\" is tough. But like before that I'll be looking forward to it lol<TheReal9bob9>: I'm in this exact situation right now, have to go to a social event in an hour and a half and this is by far the worst part. The build up in my head is killing me.<Awsimical>: Ey how’d it go?<TheReal9bob9>: Better than I thought it would be!<dailymanup>: Oscillating between wanting to be invisible and wishing you weren't so lonely can be a problem for many people. For guys, this not only impacts social relationships, but the opportunities to meet women and have intimate relationships. If you're a guy struggling with meeting women, these videos are the foundation of starting to have success attracting women into your life and having relationships. Put the techniques into action as soon as possible. [Here's How To Make Her Chase You](http://dailymanup.com/how-to-attract-women-turn-girls-on/) [How Not To Give A Fuck &amp; Just Approach Girls](http://dailymanup.com/how-to-approach-women-attract-girls-get-laid-make-her-want-you/) [How To Eliminate Approach Anxiety](https://youtu.be/V2M3g-HQGHU) [How To Make Girls Obsessed With You](http://dailymanup.com/make-women-obsessed-with-you-complete-system/)", "num_messages": 7, "avg_score": 1047.5714285714}
{"start_date": "1544782835", "end_date": "1544786420", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<shiskeyoffles>: How to come back from an awkward attempt to start a conversation? It's an auditorium and I'm sitting with my friends. There's one empty seat next to me and there's a beautiful girl sitting next to that. Not that I was interested or anything, but I'm learning to speak to strangers (I grew up highly introverted) and I thought why not? But the anxiety was real! To make matters worse I could see that she too wanted to start a conversation (Reading body language better than 90% of my guy friends is a curse I have. I mean, what is worse than knowing she'll 100% reject you? Knowing she'll probably accept but you can't man up to speak). Anyways I just spoke something when (I thought) she was leaning towards me. My voice was so meek I'm not sure if she actually heard or whether she ignored. I was just awkwardly staring at her face and she continued fiddling with her phone. And there were 4 other girls in the previous row observing all this and one of them burst into laughter. They were trying to be as discreet as possible but I've that curse you see? I knew what was going on. I got pissed and turned back and stared at one of them for like 3 seconds. Then they all stopped laughing. This awkwardness continued for like another 10-15 minutes before the session was over and I was so happy to run from there. But now I can't help but wish things would have gone differently. Any tips pleaseeee? <Reddit_Mods-Are_SJWs>: Speak up next time idk or if say what u said again if u think she didnt hear u.. i mean.. if she didnt hear u then theres nothing awkward so u couldve tried again.<shiskeyoffles>: That was the thing. What if she actually heard me but ignoring? Maybe I'd come across as pushing too hard or somethin.. <Reddit_Mods-Are_SJWs>: If she was ignoring you then there is literally nothing you can do. She doesnt like you. Its that simple.<shiskeyoffles>: 😢", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1543645614", "end_date": "1543648926", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "<lovesteph4ever>: I just sent a note to a girl that I met in the library [removed]<MakeLoveNotWarhol>: Hey you took action and that’s what’s important! It’s always kind of nerve racking at first, I hope it turns out well :)<lovesteph4ever>: She did！！！！thanks buddy ！<MakeLoveNotWarhol>: That’s awesome man!! :D", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544785193", "end_date": "1544786556", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 2, "text": "<gjbujfd>: How do I deal with drug addicted friends when I have drugs on me and they are forcing me to give it to them for free? Also they are peer pressuring me into doing drugs with them.<Context>: I am forced to spend at least 6 hours with them every day because we go to school together so we spend all of that time together in one room. There is 6 guys in the class including me and the rest are girls. But all guys are fucking addicts. I used to also consume with them, and I want to stop now. But they are not letting me. They always want me to give them the stuff I buy for myself for free. They always take all of my money. I do not know what to do. I try to resist but they always find a fucking way to talk me into giving them money and drugs. I'm fucking sick and tired of this. I have told this to them multiple times but they don't give a fuck. <Tldr>: All of my friends are addicts (including me) and are constantly taking my money and drugs. And I can't cut them off because we go to school together. <Note>: I do not need any life lessons or advice about how drugs are bad and stuff like that. I know that already. Thank you.<maikeruuu>: If you give in to them they will keep trying. Especially if they know you'll eventually crack. So, what can you do to stop them from persisting?<gjbujfd>: Yes. Exactly this. I do not know what I can do to stop them from persisting. Please help me<maikeruuu>: Well, to see what you can do you have to look at what you're doing now. Paint me a picture of how the conversation usually goes.<gjbujfd>: Ok, it usually goes something like this. <Friend1>: Yo, want to smoke during brake between class? <Me>: No, I don't want to smoke today at all. <Friend1>: Come on all of us will be smoking (lists the names of my other friends from class) <Me>: Whatever, I don't care. I said I do not want to smoke today. <Friend1>: Ok. (5 minutes later) The exact same fucking convo. (Brake starts) They all fucking approach me and start to be VERY confrontational. <Friend1>: Hey let's smoke. <Me>: I already told you that I do not want to. <Friend2>: Come on it's going to be so good. <Friend1>: Yeah let's go. (Literaly starts draging me). <Me>: No! Stop I already told you. Are you retarded? <Friend3>: Come on you have to smoke with us don't be a pussy. <Friend2>: Yeah, what's the problem? <Me>: Fuck off. (Friend4 joins) <Friend4>: Yo wtf, where are you guys, lets go fucking smoke. <Me>: No I was already talking to them. <Friend4>: Come on you have to. (They literally start to push and drag me) I finally cant take it anymore and just give in. Then they ask me to give my part of the drugs, and I do but they always say how I undercut them and they take more. But I am sure that I never undercut them. Man fuck hard drugs.<icarebot>: I care", "num_messages": 6, "avg_score": 0.3333333333}
{"start_date": "1543647905", "end_date": "1543686320", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 11, "text": "[deleted]: I feel like i accidentally keep acting like a asshole [deleted]<burgeoningboysclub>: Get out of you're head. How are the subjects responding? That answer will tell you half of what you need to know going forth.<Jacob3900>: its just i see the reaction the person gives and it looks like disappointment/ minor irritation <burgeoningboysclub>: That reaction can mean alot of things. But what you don't want to do is go around just changing yourself to make your self more palatable for the honeys. What is your definition of a \"dick\"? Do YOU consider yourself a \"dick\" by your standards? Has you're pickup game gotten you to a desired outcome with the opposite sex (date, sex)? <Jacob3900>: i don’t consider myself a dick and i don’t get the desired outcome <burgeoningboysclub>: Reevaluation time.", "num_messages": 6, "avg_score": 1.8333333333}
{"start_date": "1543532923", "end_date": "1543795573", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 59, "text": "<trapped_beneath>: I just don’t understand As a college student, in every class I observe my peers engaging in conversations and joking with one another, even if they had never met before the semester. The last time I experienced anything like this was 11 years ago, when one of my current best friends kept inviting me places after soccer practice. Now, it just feels like I’ll never have anyone want to be my friend ever again, and I can’t seem to pinpoint why. No matter how many times I see it occur, that sort of interaction and friendship process seems so foreign to me. I feel doomed to a life of invisibility :( <splitshema>: Join a club or a recreational sports team. You will meet people when you are engaged in an activity you both like. <trapped_beneath>: I see this advice all the time, but ever since freshman year of high school (I’m 21 now) all of my teammates have made fun of me <FlamingLobster>: So every team you joined has made fun of you? Or is it the same team ?<trapped_beneath>: A few different teams across soccer and bball <FlamingLobster>: And the people in the teams are from different social groups? I remember in HS and even in college, we had this friend who would play soccer with us and what not. I dont want to say everyone but majority of the people teased and bothered him because he had this way doing things. He was very meticulous and uptight. He was(is) kind of like Dwight from the office. Anyways, he was okay with that and he understood why we bothered him and we missed him when he wasn't there. What im saying is that what are their intentions? Are they trying to harm you? And which of your qualities are they attacking?<trapped_beneath>: They weren’t my friends. The people making fun of me were from several different social groups. They teased me for a multitude of things, including the way I act, my name (my name is very uncommon and ends in “ance”), the way I play (I was a late bloomer and didn’t grow until my senior year after quitting sports, was shorter and chubbier than everyone else up until then). It was a pretty clear cut case of finding a weak member of the group and bullying them<FlamingLobster>: They sound like shitty people", "num_messages": 8, "avg_score": 7.375}
{"start_date": "1543616801", "end_date": "1543618010", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 10, "text": "<Evolutionmason>: Does it make me immature that I don't like reading books? I'm 25 years old and some people make such a deal out of it. I don't mind reading short quick articles on the internet on a certain topic, and I may read some Marvel comics if I'm on a plane or the power goes out, but I just never found reading actual books that entertaining. My parents forced me to read as a kid but it just never grew on me. I know how to read, and I remember teachers would say to my parents \"oh he's a great reader \" but I just never enjoyed it. People seem to get bothered by that for some reason, and I had one person say \" good luck actually finding an intelligent girlfriend \". I'm like what the hell lol. Is it that serious? Please tell me, I'm not looking for validation I'm just very curious. I don't brag about not liking reading, during conversations I'll have people ask my favorite book or something.<thegirlontheledge>: I would say it's not unusual, but to be honest I am definitely not attracted to anyone who says they don't like reading (barring dyslexia or something like that). Do you listen to podcasts or watch documentaries? I rarely have the time to read anymore, but find podcasts and documentaries an enriching way to spend my time.<Evolutionmason>: Yeah, I do like listening to some podcasts and I find the ancient alien documentaries interesting.", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1544624901", "end_date": "1544792609", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 65, "text": "<witsend2384>: 40 and socially inept. Are there any, and I mean *any* success stories of people at this age coming out of their shell and finding joy? I've pretty much stayed indoors since I was a teenager and the regret of a wasted life is so completely overwhelming me I often find my mind drifting in destructive directions. I don't want to quit before I've actively tried, but I'm nowhere near an actual person and I lack every assumed social skill I should have by this age. Has anyone been here and prevailed over their hangups and inability to get out of their own head?<CoolAssJason>: Go to a store ( bring cash) say hi to the cashier when entering buy something ask the cashier how is his/ her day is (making eye contact and smiling) then go on with your day. 👍🏼<witsend2384>: See, in my opinion that's just \"wearing the mask\", really. I've got \\*so\\* many masks. Idle chitchat with someone I'll never see again or outside one specific context is something I'm proud to admit I'm capable of. &amp;#x200B; It's small talk that I struggle with. I think of small talk as innocently probing questions that can hopefully lead to deeper conversation. That stuff? I can't do that at all. Mostly because I flat out do not have a past. <Consultant511>: You know what's sought after in today's society more than anything else? Really? Really really? Something genuine and honest. You DO have a very interesting life and it has nothing to do with your past and what you might have missed. It's about what you want to do. It's clear you've got dreams and goals. I bet you've got an interest or two that you're passionate about. These are the things you can address when small talking. If it get's really awkward? GOOD! Then you'll have a story for next time! Also, one thing I've learnt the last year is to ask the other person questions. You've heard it before but it really works. People love talking about themselves and if you can't think about what to say - just ask another question. You need to put down those masks man. I lived behind one of mine until I was little over 30 years old - and I wasn't even fully aware. You need to accept yourself as you are. You can't change the past so take advantage of it instead and use it in whatever way you can for the future. <witsend2384>: I've been trying the questions thing lately. I'm not great at it yet, it feels like I'm just interviewing people and then trying to sneak a quip in like I'm Letterman or something. People love talking about themselves, though so it's almost like we've had a conversation. <Consultant511>: Yeah and it's important not to stick with closed question but instead always ask open ones. The hardest part for me was that I felt I wasn't interested in other people. But I'm slowly realizing that was just an excuse to not talk with people I didn't know. Since I looked at it as a chance of getting better at something I now have a purpose which pushes me to talk with people. And don't forget that it's not what we have been or done that makes us interesting or not. It's how we present it to the world.", "num_messages": 6, "avg_score": 10.8333333333}
{"start_date": "1544794972", "end_date": "1544799423", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 21, "text": "<TheNobleJak>: Im attractive but introverted (male) I dont wanna brag or anything but im considered hot by females and im 19. socialising with new people feels like a knife in the chest. Thinking about it i get paranoid and question my existence (not kidding). Especially when people say you are alone but good looking. That makes me drive insane. But sometimes i have days where i give zero fucks snd dont care at all. Wtf is wrong with me? Its like switcjing persona Have any advice ? <siammang>: There is nothing wrong with you as far as having good physical appearance and being introvert. These two traits are not totally correlated. Although, it does help interacting with those who find you attractive. The true question is what is it that you don't like and try to change?<TheNobleJak>: Well i sometimes become really anxious and when why im getting anxious it gets even worse. And the thought of being attractive and smart and still feeling anxious makes me think theres sth wrong and it can drive me insane. I mean it<siammang>: Being anxious is your internal state of mind and it is not always dictated by your physical appearance. Calm your inner thoughts. Knowing that people finding your attractive and be willing to converse with you is 80% there. Just keep in mind that beauty if is in the eye of the beholder. Not everyone will find you attractive, so there's nothing wrong with that either. Try to interact with people with small talks as often as you could. Pay attention to the response from what you say and what you do. If there is something that people seem to be commonly enjoy interacting with you, then focus on that (e.g., talk about weather). This may help you gain some confidence and reduce anxiety.<TheNobleJak>: Wow, never thought about it like that. Really helpful. Calming inner thoughts. Thank you", "num_messages": 5, "avg_score": 4.2}
{"start_date": "1543650159", "end_date": "1543721174", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 5, "text": "<thearctemis20>: My close friend is always with another group of friends who I don’t like, what should I do? me and my best friend of 10 years stopped speaking a while back no reason just drifted apart and recently starting catching up together, every time I want to catch up Friday night he’s with this other group and asks me to come out somewhere like a bar but it’s just me tagging along and not getting my friends full attention. Tonight for example I wanted to see him and he asked me to come to bar. I feel awkward rocking up to a group of people I hardly know or don’t like. What would you do?<JenaCee>: Deleted <thearctemis20>: I’m finding that, we really have zero in common anymore now that we left high school years ago. I always want to do things with just him and he’s keen but he will either bring someone or just change plans and invite me to go said place with another group and him. It’s really annoying. I’m not trying to be selfish but I only want to see him when he’s by himself, I couldn’t care about his new friends and want nothing to do with them but he can’t seem to seperate himself from them for one night so I guess that’s a deal breaker for me. Any advice? Should I ask him can we do things just us sometimes? It’s not to much to ask is it?<JenaCee>: Deleted", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1543427438", "end_date": "1543717162", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 241, "text": "<CallitKarma87>: I feel lonely and always sad that I don’t have a girlfriend, but when the opportunity presents itself, I suddenly lose interest. Any idea what this is and does anyone else deal with this? <happymale7>: Could be nerves,, or just fear of rejection. Also sometimes dreaming about someone is better than reality - and when faced with a opportunity to ask a woman on a date, reality may not seem so appealing. If you ask a girl on a date and she says no. Hey, just move on, she is not the one for you. Also try to just talk to women, and girls, so you can be more comfortable around them. <UrethraX>: This would be my assumption, those fables of \"thrill of the chase\" and such are bullshit terms that stem from elsewhere. Fear of inadequacy, fear of failure, fear of rejection, something along those lines presenting itself like this. Could be totally different but it's not some old fable, we don't live in a book<happymale7>: Everyone is different, and for some men, it is just 'the thrill of the chase.\" An example being men with narcissistic personalities.<UrethraX>: Yeah, which comes from other psychological elements. Narcissism doesn't simply exist on its own, it's a group of other elements. Insecurity being a major part if not the whole thing because that doesn't stand on its own. Also you mentioned men specifically, which means you likely have some level of emotion related to it, the same things come out in both males and females though differently because both groups have different social pressures. <happymale7>: Yes, but you can get female narcissists too. <UrethraX>: I agree, you almost certainly didn't consciously specify men, I just over thought that and mentioned it on the off chance Either way the narcissism comes from deeper within than what it seems", "num_messages": 7, "avg_score": 34.4285714286}
{"start_date": "1544795073", "end_date": "1544802854", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "[deleted]: How do I get my confidence back? [deleted]<21Mazza21>: you are the only one who can change how you feel.. you have to watch your diet and intake what gives you the energy to deal with people.. you have to choose who you spend your time with and if you find yourself around people with the same energy levels then that is ideal for you.. if you find your self around shy and depressing people maybe that is not ideal because they will trap you in that mind frame.. you need to find like-minded people in whatever community you are in.. if you enjoy a sport or whatever you can join a local club and find happiest through the sport and share a common interest with them.. if its just social interactions that you enjoy then maybe just talk about what's in the paper to the old man/women sipping a coffee at 7am at the local coffee store..<Compverson>: Thats one of my problems. Finding people with the same energy levels as me. Im pretty chill but I enjoy going out. Took a personality test and in a fifty fifty split between extroverted and introverted. Most people I know are either highly introverted and mainly don't talk or are highly extroverted and do drugs and shit <21Mazza21>: don't let a test tell you who you are.. the government are only out to profile everyone so they can control the masses and bully them into how they should be acting and obeying..just do what makes you happy and stop thinking about it.. do what you enjoy and you will meet those people along the way.. rome was not built in a day you just need a carefree attitude.. nothing stopping you and no one thinks about you more then yourself so just keep that in your head and maybe get out of your head and just enjoy whats available to you<Compverson>: Ok. Was just using that as more of an example and I'm not looking at it every day letting it determine my life but thanks for the advice I appreciate it!", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1543557234", "end_date": "1543557694", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 13, "text": "<teadrinker69>: What is your definition of a friend? How do you know when someone is considered a friend? What requirements do you have for friendship? What does a friend do for a friend? How often do you talk to a friend? Do friends call each other often or can they just text? Friendship is confusing for me, the entire concept, I don’t know if I actually have any friends or if they are all just acquaintances? I don’t have anyone I talk to on a regular basis or discuss what’s going on with me normally. Nobody asks to hangout with me ever or see how I’m doing. Social constructs are very confusing to me, I just want to understand.<123lowkick>: A real friend? A work friend? A girl friend? Friend w benefits? What kind of friend?<teadrinker69>: Just a real friend. I didn’t know there were different types and rankings of importance tied to what defines as a friend.<123lowkick>: A real friend is someone you can be yourself around, and you got each others backs about stuff. Real friendships are pretty uncommon, and take time to develop.", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1543402462", "end_date": "1543431205", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 45, "text": "<simcity4000>: [Long] Advice on dealing with passive-aggressive personalities- Flakey complaining friends and bitchy coworkers. I've noticed a trend in posts in this sub where posters have problems dealing with a 'difficult' person. This often touches my favourite subject of late: passive aggression and passive aggressive personalities. So I've complied my posts into one long one: (Note, I am no psychologist or expert all, all advice I'm giving comes from my own reading and experiences. I had a falling out earlier this year of a an ex friend of many years who used to drive me absolutely crazy. Since then I've done a fair bit of reading on the topic of What The Hell Is Wrong With Him and in doing so found the information useful for dealing with others too.) <https>://www.psychologytoday.com/gb/blog/communication-success/201508/10-signs-passive-aggressive-relationship &gt;The NYU Medical Center defines a passive-aggressive individual as someone who \"may appear to comply or act appropriately, but actually behaves negatively and passively resists.” The ten common traits of passive aggressive behaviour: &gt; Disguised Verbal Hostility &gt; Disguised Hostile Humor &gt; Disguised Relational Hostility &gt; Disguised Psychological Manipulation &gt; Guilt-Baiting &gt; Stalling &gt; Resistance &gt; Underhanded Sabotage &gt; Self-Punishment (“I’ll show YOU”) &gt; Victimhood **Why are they like this?** The fact is everyone is a bit passive aggressive sometimes, people tend to do it when they feel like they’re unable to voice their hostility openly for whatever reason. Sometimes even for good reason (service workers would go insane if not for passive aggression because of the inherent power balance of their job) Often this is done under the guise of ostensible ‘niceness’. When you know someone who's *always* a bit like that as an inherent facet of their personality style its very possible that they see themselves as ‘too nice’ to ever stoop to outright hostility, which makes getting them to admit to their disguised hostility incredibly frustrating. The most compelling theory around passive aggressive personalities is that it comes from having overbearing and critical helicopter parents, who enforce ‘niceness’ on the child. The resulting adult wants the things all adults want (recognition, love, attention) but never learned the proactive, positive, assertive ways to get them. So they fall back on the default one that worked as a child - sulking. I don’t want to get too deep into psychoanalysis and nature vs nurture but I like this theory because it gives the best roadmap of how to deal with a passive aggressive personality - don’t allow yourself to become their parents. Their sulky behaviour tends to push people around them into the roles of either marshmallow parent (The one who goes 'fine...I'll do it' who meets their needs without them having to ask) or critical parent (who is an unfair tyrant to be rebelled against). They resent their dependance on marshmallow parent almost as much as they do critical parent though, their stalling roundabout bullshit is how they deal with this conflict, a way of saying “no” without actually saying no. Passive aggressives tend to see themselves as fundamentally nice but frustrated and chronically unappreciated, making everyone else feel as frustrated and unappreciated as they do is their passive revenge against the world. **Never get angry at a passive aggressive** They crave it. They unconsciously enjoy soliciting extreme reactions in others while they sit back and go 'I don't know what *you're* so upset about I'm just being reasonable/logical/joking\". Whenever you blow up at their provocations its a relief for them since it shifts responsibility for their emotions from them to you. You've just validated their 'everyone is against me' worldview. They want a villain for their lives, if you're not careful it will be you. **Passive aggressives and complaining** Common sense would dictate that when people complain about their problems, they want help. Don't assume this. Understand that with his constant complaining and sulking PA is (unconsciously) playing a kind of game, the game is called “bet you can’t make me happy”. It suckers in well meaning people and leaves them drained. He “wins” the game every time he frustrates efforts to help him because it means he’s successfully demonstrated that his problems are uniquely hopeless and insurmountable. He’s manipulating you with his sulkiness. Never try and point this out though, you’ll just end up hating him and yourself. I don't want to to say never help any friend in need, but set boundaries that there is a time and a place for when you can help. Don’t play along by trying to fix the problem without an explicit limit on how much time and energy you can extend. If stuck, give empathetic but *un*helpful responses- “oh that sucks”. **Confronting paggro “jokes”, hints and backhanded comments.** The spotting technique for dealing with passive aggressiveness and paggro 'jokes' can help: It goes something like this. Toxic person makes a passive aggressive joke or comment. <You>: \"It sounds like you’re upset”' Toxic person denies it vehemently (\"oh I'm only joking, lighten up\") <You>: \"ok then! Just a thought I had. I'm probably wrong. Silly me.\" Basically the key is that when you respond to their comment, it has to be extremely not-angry and not-defensive. Almost like as neutral an observation as you can make it. Use neutral language (it seems like, it looks like, it sounds like) Don't use \"I think that\" which is unmistakably a personal challenge. Point out that it 'sounds like they're upset/concerned' but don't say that they *are* angry or upset or jealous, just that the *signals* that they're acting so. When they deny the ill intent (they will) don't try and corner them. Give them an out. You want to hold a mirror up to them in a way that says *I see you motherfucker, I see what you're doing*, but not be so aggressive with it that you get drawn into a conflict. Either they admit what they’re bitter about and it can be dealt with openly, or at the very least once their tactic has been 'seen' they have to switch to a different one. If you want a role model for this, think the TV detective Columbo. He keeps suspects off guard with his jovial, harmless and self effacing demeanour. The Columbo tone is gently challenging but not accusatory. Almost like you're testing a theory. It’s often necessary to focus on a specific action of theirs to uncover what they’re doing (if they’re rolling their eyes or sighing or looking at the time or some other subtle non verbal show of disinterest for example, say explicitly “are you comfortable here? I ask because you’re looking at the time”). This is called **holding up a mirror**. I cant emphasise enough it needs to be done very dispassionately and non-aggressively though. Heres another possible response: PA makes a comment. You, *raised eyebrows*: “oh wow, ouch” Nothing else. No explanation. Keep it dry. Just something that hints that they’ve gone too far but in a way that can’t be painted as an overreaction on your part. It can be a tension relief for you just to express “ouch” at a jab jabs least. **Dealing with exhausting requests for help** One trick that you can use to stonewall demands for help with logistical questions. The king of stonewalling questions is *”I'm sorry. How am I supposed to do that?”* Don't say it in an irritated way, try and phrase your question in a way that suggests innocently, I'm *sorry* but help me understand, what are you asking? How do you expect me to fulfill what you’re asking of me? Logistical steps please. How, what, when, what next, what are you aiming to get from this etc The goal is to: a) if they’re asking you for a favour, get them to have to openly *ask what they want*, rather than just nudging you into thanklessly doing it. (Passive aggressives love the “non ask” where they just sulk until you agree to do something, then when you expect gratitude in return then well...they never *asked* you to do it) B) get them thinking about the logistics of the situation themselves, and trying to solve the problem with their energy (if this sounds familiar, it’s because it’s fundamentally similar to what PAs often do to you, nudging you into solving their problems by being useless at it). Asking questions also sends the subtle hint that you’ve been asked to do something difficult and unfair (again, this is something PA might often do to imply this to you) c) Make asking you for shit he could just find out himself more difficult and unsatisfying than just doing it. Asking questions to stimulate engagement is a technique which you'll often see teachers employing on little kids who ask 'why' a lot. \"Why?\" is a subtly paggro question in itself (kids know this, which is why they ask it). Stick to \"how\", and \"what\"-practical questions that move towards solutions. **If they’re really giving you a headache** “I want some time to think about what you’ve said” is a good way to gain some temporary breathing space from needy emotional vampires to think about what to say next and not let it devolve into an accusation match (you'll lose). It’s hard for someone to complain about taking what they’ve said seriously. If you need to call a PA out on a behaviour, focus on the *specific behaviour* (i.e their lateness) and how it makes you feel, don't overwhelm them by get drawn into criticising their pattern of behaviour or saying stuff like \"why are you always like this?\" which is always a phrase which sends an argument into the toilet. In summary, with passive aggressives: * Avoid using punishment, never get angry at them, they thrive on evoking unpleasant reactions in you that make you look like the asshole and will rebel against criticism with a barrage of plausible sounding excuses. If you have to call them out on their behaviour, express confusion with their actions and words not anger, or perfect your “I’m not mad, just disappointed” father tone. * Never step in and do their responsibilities for them no matter how uselessly they flail at it and sulk. * *Boring* them with a dull or unsatisfying reaction is a more effective punishment than condemning them. Use opportunity costs wherever possible. Opportunity costs should never be referred to explicitly as punishment, just unfortunate necessities that raise the price of messing up. Whoops you failed to turn up on time? Well you missed the deadline so I left already. Failed to do the task? Now you have to do the tedious backup thing sorry. Get creative here- Paperwork and meetings and busywork. (The problem here is that this is easier to enforce from a manager than peer perspective but I’m sure you can think of some “price” for your time) * Don’t try to convince them by appealing to “their own good”. Paradoxically despite how selfish they come across as this doesn’t work. **Their key emotional driver isn’t actually selfishness in the traditional sense, it’s their fear and hatred of other people’s expectations of them.** They’d rather cut off their nose to spite their face than do something someone else is telling them is “for their own good”. (this is something kids learn early in childhood, when mother says \"you’ve got to study for your future\" you can rebel by devaluing yourself, by not *caring* about your future! Who are you to make decisions about whats good for me?). For a PA self-defeat and martyring is the height of virtue. A PA will routinely act *against* their self-interest if it maintains their sense of autonomy. * Get used to “illness as metaphor” PAs will frequently fall sick with vague somatic complaints when they need to. Don’t call them out as liars, 99% of the time the sickness will have some degree of truth. And getting them to try and admit exaggeration will just make you the villain. (Their conception of self is so poor *they* don't even know why they're sick, or that their vague anxiety is actually repressed anger.). Speak in terms of results not intention “it’s terrible that your vague somatic complaint is acting up again, you’re very brave...but since you can’t deliver the results I’ve had to go with someone else sorry” * Don’t make plans with them as a critical piece without a backup plan. * Make all agreements as explicit as possible, never operate on unspoken agreements. They are masters of ignoring the unspoken rule everyone else abides by. Also if you get a favour from them *always* balance your cheque. They tend to be very sensitive to perceived “(un)fairness”. * Reinforce that it’s ok to say “no” to you. They tend to say yes to stuff they don’t want to do with their words then say “no” with their stalling actions. * **Praise them and use positive reinforcement when they act mature and responsible or do something you appreciate.** Tell them explicitly what makes you happy and praise them when they do it. It’s hard praising someone who gives you a headache but they often relish opportunities to show how nice they can be and *desperately* crave praise. (This is likely what their parents did NOT do, they focused on criticising their child when they did wrong rather than building a sense of pride in doing things right). When you understand that people act passive aggressively because they feel either trapped, or unappreciated, then you understand their emotional levers. If you *really* want to help a PA (a tiring and thankless job) this is your role: training them towards productive behaviours, and removing the payoff from disruptive ones. Remember they will do whatever you teach them gets a reaction. * If this person shows no signs of change and is a friend seriously consider how much they add to your life. If they’re an employee enforce company rules on lateness until they quit, if they’re a relative you have my condolences. <Sources>: The Passive Aggressive Personality - Max E. Bowen Emotional Vampires: Dealing With People Who Drain You Dry - Albert J. Bernstein Never Split the Difference - Negotiating As If Your Life Depended on it - Chris Voss Games People Play - Eric Berne [Personality &amp; Character Disorders Pt 5: O-C &amp; P-A Types in Depth](https://www.drgeorgesimon.com/personality-character-disorders-pt-5-o-c-p-a-types-in-depth/)- George Simon Break Free From Passive Aggression - Susan Keller<unpetitnuage>: Reading this, I fear that my coworkers think this about me. The truth is, it's easy to mistake someone's reserve or awkwardness as passive aggressiveness. I've been at multiple workplaces where I feel like people end up disliking me for reasons I don't understand. I go through an intense period of transition where I am really anxious in a new workplace and it takes me a long time to feel comfortable. However, by the time I get over it, it feels like everyone has made their minds up about me being unfriendly. I recently got bed bugs and the inspector thought I got them from my internship in a nursing home. I told my supervisor this and they did not find any; now it seems there's a subtext that he doesn't believe anything I say or thinks I am just stirring the pot for attention. I try to stay positive and not say anything bad about any one, but I've found that usually puts me on the 'out' group. I'm never sure if I'm the problem or the people I'm around in the workplace are. Any thoughts?<simcity4000>: I added an addendum", "num_messages": 3, "avg_score": 15.0}
{"start_date": "1543661508", "end_date": "1543678481", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 16, "text": "[deleted]: All my friends are more like acquaintances. I haven't had a close friend in a long time and I always find myself with no one to talk to or hang out with. Advice? [deleted]<tiffythebomb>: The older you become, the harder it will be to make friends. Patience is key. If you look at someone who is “popular” or friends with the popular crowd, chances are that most of their friends are just acquaintances too. (I saw your other comment.) Check FB for local young figure skaters, maybe a group near you. If there aren’t any, start a group! Have a meet up in a public place, you’ll find that you guys have a lot to talk about. Even if your group only has 4 or 5 people in it, that’s 4 or 5 potential new friends. Make sure your skating instructor knows about your new FB group, and can tell other people to join too. You only need one good friend. Don’t worry about having too many, just find one who fulfills your needs as a friend. When you’re meeting your new potential friends, don’t tell them you’re actively seeking new friends, fake it till you make it. Be the person you want to be (out going, adventurous, ect.) Don’t be the person your old friends expect you to be. Good luck! <ditsobeh>: Haha, unfortunately I'm in the top skating class and I'm pretty much the only one who's my age, everyone else who is already goes to my school. Rest of the advice is pretty solid, thank you. <tiffythebomb>: Good for you, that’s impressive! You could apply this to any of your interests, paiting, photography, a TV show you’re obsessed with, ect. I’ve made some of my best friends from meet ups in local Facebook groups. Good luck! You sound like you’re going to have a successful life ahead of you. People naturally gravitate towards successful people. <ditsobeh>: That's really motivating, thank you :) <tiffythebomb>: Just make sure to remember me when you’re rich and famous! ;) <ditsobeh>: Haha, in my dreams.", "num_messages": 7, "avg_score": 2.2857142857}
{"start_date": "1540564865", "end_date": "1540584488", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 2, "text": "<Cy_Mann>: My ex says that I grab people by their strings and play them like puppets. She's not wrong, in all honesty. But I do it for many reasons, according to a conversation with my mom. My mom says that I'm this way because I'm \"just doing what I know\" and that I really don't know better. I personally think that I'm manipulative because I want people to understand me, because I'm misunderstood a lot, and that I've been played like a puppet myself.<Luck128>: Here’s the thing. What do you do with your powers? Because it obvious that your powers wasn’t so powerful that you could keep your ex gf. You’re born with a gift that you are very aware of other people and their motivation. If used for bringing people together great. If you’re using it to separate people that’s horrible. But guess what. You’re not the only person with this power. So if someone else observe you using your power for evil they might expose you. After being exposed you’ll find people not wanting to deal with you and new people avoiding you (you’ll be surprise how news travel fast in the restroom). So use your power for good and not evil and you will not have to worry if Someone will reveal you or even care about your powers. <Cy_Mann>: I'm a straight guy so....... &gt;your ex bf ......You *might* wanna change that......<Indigo_Fera>: That's what you took from that?<Cy_Mann>: Of course I'm an asshole for correcting you.......<atwevkey>: The point is that one letter, a b instead of an g, is irrelevant to the advice given to you. Perhaps if you are going to respond to something, you should actually respond to it. I’ve corrected people on minutia like that before and as long as I actually make a relevant statement that people can focus on they won’t be offended and don’t care, typically. People are upset at you because that person spent effort trying to give you advice and your comment made it seem like you didn’t care.", "num_messages": 6, "avg_score": 0.3333333333}
{"start_date": "1543648594", "end_date": "1543739101", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7, "text": "<forthecounter>: Friends Aren't Crazy About Socializing, But I Need To. I'm a 21 year old dude, not currently attending school. My friend group isn't interested in meeting new people but I feel the need to branch out. Is it strange for me to go to a bar, concert, any local event by myself just to meet new people? I know I need to get out there, but I'm having trouble deciding how I'm going to do that since this is new to me. Where do I go, what do I do, what do I say? Do I just talk to strangers? I've met most of my current friends through ordinary means, school, work, online friends, etc.<Glamerous-Batman>: I feel like the easiest way for me to socialize is to play a sport so maybd join a sport I would prefer team sport<forthecounter>: Hmm, I've never been too into sports but I could give it a try! Some group activity sounds good.<Glamerous-Batman>: Great! Love to hear how it goes.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543664118", "end_date": "1543668522", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 12, "text": "<MrLoserCow>: Am I reading too much or overthinking on this chat message response? There was a college men's basketball finals game today (Game 1 of best of 3 series). My friend's younger sister school (let's call it team A) is facing against team B of the finals today. I am supporting her younger sister's school to win. Apparently, team B won the game. Here is the breakdown of our chat message: **Me**: Team A lost. The fight was close until the end :( **Her**: Sigh **Me**: Bounce back on game 2! #BeatTeamB! Sincerly from a team C fan (I'm from a different university and supporting Team A) **Her**: Hahahahahahaha She just replied with the word \"Hahahahahahaha\". Is she trying to kill the conversation? Or am I overthinking it too much that she literally found it funny on my last chat message?<Pandacorn23>: Why are you texting your friend’s younger sister? Do you like her to be more than friends?<MrLoserCow>: I am not texting my friend's younger sister, I am chatting my friend. I am just supporting my friend's younger sister school since I also wanted them to win.<Pandacorn23>: Maybe she does not feel the same about it. She could also be busy. Or she’s devastated for the loss. 10pts in the last 10min was kinda brutal. Don’t fret about it.<MrLoserCow>: What do you mean by \"Maybe she does not feel the same about it\"? Obviously, she is also supporting her younger sister to win<Pandacorn23>: Unless her sister plays on the gane itself, does not necessarily mean she would be that invested in the game itself. You did say it’s her sister’s school not hers. Maybe she’s not even a die hard basketball fan, just supporting the team out of loyalty. Like I said, don’t fret too much about little things like this or you’d lose a lot of sleep unnecessarily.<MrLoserCow>: Yep, her sister does not play the game itself. She is not a die hard basketball fan and just supporting the team out of loyalty \"Like I said, don’t fret too much about little things like this or you’d lose a lot of sleep unnecessarily\" Any advice on this? I tend to fret a lot on people I care, even for small things :(<Pandacorn23>: It’s all about finding things to occupy your mind other than trying to solve an imaginary puzzle. If you’re super excited and you call a friend and they gave you a half hearted reaction: instead of hanging up then spending the night awake wondering if your friend hates you or is not happy for you ask them right then and there: hey are you alright? is something bothering you? Most of the time that people don’t give us the reaction we expected from the scenario in our head is not because of us but because of what they may be going through at that moment. Ask questions of concerns and most of the time you’ll find out it’s totally unrelated to you. <MrLoserCow>: So overall, she is not mad or upset at me? She is my new close friend btw. We have known each other for more than 5 months already.<Pandacorn23>: Act like you normally would and if she is upset with you, you’ll know, she’ll show it. Don’t conclude from a short chat.<MrLoserCow>: Yeah. Because yesterday I talked to her in chat and it was really a chill and fun conversation throughout. Today, it was just really a short response from her. That's why I did fret whether she is upset at me or not.", "num_messages": 11, "avg_score": 1.0909090909}
{"start_date": "1544798868", "end_date": "1544805498", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "<crystal_leaf>: She takes too long to reply a messenger! Lately whenever we have an online conversation, it always takes my crush too long (about 15 minutes or more) to reply and then she remains silent in the next 15mins but she's still online. This really makes me feel confused so can anyone give me some advices about how to politely ask her the reasons or to stop this? Maybe in a polite or and not very serious way? Thank You!!<Breezy1209>: She's probably busy talking to her crush. <crystal_leaf>: Haha sounds like a harsh truth", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1544725016", "end_date": "1544741452", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 12, "text": "<DeadIronGolem>: How badly did i mess this up? Alright. So, there is a girl at my school. She's a grade below me (grade 11), we met like two months ago and talked a few times (by that i mean two great 10min conversations and i spent some time every few days at her table making smalltalk). I really enjoy talking to her and tried to become her friend. Anyway There was an event at our school last week where we could buy chocolate SantaClauses and give them to other people. I bought one and wanted to give it to her, but i didn't meet her and could talk to her, so instead i wrote a note that said something along the lines of \"you're really nice and i just wanted to make you feel good, so i bought you this\", but a little more detailed. It definitely didn't have any over-the-top content. I taped it to the santa. During lunch break i walked up to her table, placed it in front of her (she had 4 friends with her) and because i was insanely nervous and scared, i pretty much ran away. I did not see her reaction or that of her friends, but i was told by someone who watched that they all read the note and didn't seem pissed or laugh at me or the note, but were probably confused and overwhelmed. She and 2 of these 4 other ppl later walked past me. They did not confront me about it, but looked at me (for a VERY long time). It's been a week. I haven't talked to her yet and i still have no idea how badly i messed this up and what to do. I tried to get an opportunity to talk to her alone but it hasn't worked yet. Sometimes i notice her looking at me (not in a negative way but she isn't smiling either). I \"know\" one of the other girls from that table and when she walked past me in the hallways today, she \"interacted\" with me pretty much (but not exactly) the same way she did before the santa thing: she noticed me, smiled and said hi in passing. Is that a good sign or nah? What am i supposed to do? Will confronting the recipient of the santa make it better or worse? <Btw>: 1. I do not have a crush on her, even though i am aware that everyone, including the girl herself, probably think that 2. Yes, i am aware that the santa thing was stupid, especially the running away part, but i guess my brain cells left my body because of how terrified i was 3. I hope you can actually understand this text because my thoughts are all over the place and i have no idea if what i wrote makes sense Anyway, thanks already for your help <WhatAboutTheMilk>: That’s was really sweet of you. Just try to be yourself. You are over thinking it. She may think you like her but don’t sweat it. Just continue to be friendly. <DeadIronGolem>: Yes, i'm super overthinking it :/ literally the second i left the room after i gave her the santa, i felt the doom coming and imagined several worst case scenarios and all of their consequences in my head. Ended up sitting on the stairs nearly shivering for a few minutes. It's something i always do, i always do something or have something happen to me and spend the next week(s) losing my shit over it because i keep imagining how the people involved in the situation now hate me and want to never talk to me again. Even if the situation turns out absolutely fine. I have no idea how to get rid of it. It's most likely a trauma thing from the bad bullying during my early childhood. Thanks for saying it was sweet. I honestly ASSUME she thinks i have a huge crush on her. It would make sense to her on so many levels, not just with the santa. It doesn't really bother me that she thinks it, because i know i can just explain to her how it really is if i need to (i get ridiculous attached to people that are super nice to me, like she was). I hope i can be friendly without many problems... she is hard to talk to since she's almost always in a group or with her best friend. <WhatAboutTheMilk>: Oh man I know what you mean about your mind running scenarios. That’ll mess with you pretty good. You can get control of it though. You have to be conscious of your thought process. Instead of thinking about what could happen you force yourself to go through this scenario of what you want to happen and what the different positive outcomes could be. It takes a long time to retrain yourself but look at it this way, you’re what, late teens? So your mind has been working this way for 10 or so years? It’s going to take awhile to change something you’ve been doing subconsciously for that long. I’ll pm you a link for a book that helped me. <DeadIronGolem>: Thank you! It will definitely be difficult, especially considering i'm not always wrong when i imagine terrible things that could happen", "num_messages": 5, "avg_score": 2.4}
{"start_date": "1544612346", "end_date": "1544640490", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 61, "text": "<ArjunZxyagent47>: Where to look when someone's approaching This is a weird thing that I've noticed about myself. Whenever, someone passes by friend/acquaintance/relative/family member/Stanger/girl I've never known where to look at. Do I look at them? If so for how long? Where else can I look at after our eyes meet? I would like someone to teach me the mechanics of this situation that I'm describing. <TheStumblingWolf>: I used to struggle with this. As I've become more confident overall it's changed. Now I look people in the eyes, smile and say \"Hi\" or something. I just find it interesting how people react to it.<bebetleon>: Saying hi is a good icebreaker, seems simple but it’s effective. I do this, and I try to emulate people who are outgoing.<TheStumblingWolf>: Yeah. I find that people only remember the points and highlights of a conversation anyway so what words specifically you use doesn't matter so much.", "num_messages": 4, "avg_score": 15.25}
{"start_date": "1544056982", "end_date": "1544076911", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 13, "text": "<Hoshiboii>: I think I'm weird Hi, I'm a 16 year old girl and I don't know why, but I really can't talk to or create bonds with people. When I was little I had no problems communicating with my peers at all until I became about 12 years old when we stopped playing with each other and began to talk instead. I don't know why but I found it really difficult talking to my classmates and I felt lonely but didn't think about it too much. Then I began high school (at thirteen years old) where I really never talked much. The only people that I said anything to were my closest friends, 2 of them which I’ve had since first grade and another one who I met when I began highschool. But I even had, and still have, trouble talking to them and it was impossible for me to hold conversations to the other people in my class. I felt lonely but didn't really care about it at first because I was obsessed with cartoons and games at the time but when I was 14 and started 8th grade I began too notice how weird I was. This year I moved to secondary school which meant that I had to start a new class without my closest friends being in the same class (we still go to the same school, but we never have classes together) and had to get to know new people. I thought that this could be my chance to redeem myself and get to know my new classmates and start new friendships, but I couldn't because of my lack of communication skills and weirdness. The thing is I never know what to say or how to say stuff. When I try to talk with people, I often end up saying things at the wrong time, stuff that just are inappropriate or repeat the same thing over and over again and I never notice this until I've said it. I stay quiet instead of saying anything so people will think of my as the quiet girl instead of the weird girl. But this really isn't working as I've heard that people think that I'm weird in a bad way. I always compare myself with how other people talk and behave with each other, (as an example, I often eat with my closest friend and her friends and they talk a lot with each other while I'm just sitting there which makes me think I'm really boring &amp; weird) and I try to mimic them but it doesn't work out. All of this makes me really scared of the future because I know I won’t be able to get friends or a partner and I really don’t want to be all alone when I become an adult even though I really want to have a normal life. I feel really weird and don't think I was meant to live as a human and often think that I would be better off dead. I’m sorry if I wrote too much or badly, English is my second language and I’m generally bad at explaining things. I don’t know if anyone will relate to this or if typing this will do any difference but I just needed to do something because it's slowly killing me. Thank you for reading this. :)<StayCalm07>: Practice with strangers you meet on the street. Start with only women. Time won't make this better. You need to be I tentional. Also, role okay with your friends. I know it sounds silly but ask then to pretend to be an old lady waiting for the bus. Role playing is an unde valued resource. Lastly, try going on some online video chats and see if you could hold a conversation.<Leulera>: Lol that'd make most people with average social skills shit their pants. Although when I had real bad SAD... I somehow... mustered the courage to start hitch-hiking just to cure myself, oh god. Video chat rooms are a good practice ground, OP. Even text chat rooms mimick the fast pace of IRL conversations.", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1544802888", "end_date": "1544804896", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<Ashley_Bean>: Am I a complete dork? Last night my bf told me that putting an 'L' at the end of a sentence doesn't mean anything. I'm 40yrs old and he's 30. I remember YEARS ago chatting and using an L to indicate that I was laughing. Not necessarily laughing out loud, just amused. I prefer not to think of myself as a dork (although I have my moments) and I was wondering if anyone else uses an L in this way?<SanPedroLover_>: Roflmfaocopter<Ashley_Bean>: You lost me after the second O. Lol<Ashley_Bean>: Oops...I meant the first one.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544805324", "end_date": "1544826844", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 17, "text": "<StandardDog>: When using social skills, how do you distinguish truth from trust, and why is truth important in social conversations? You have to be vulnerable for conversations. I know that. But you can only give out so much trust. How do you find the gray line in trust and the truthfulness of a person in conversations. <PHOENIX_THE_JEAN>: You have to be willing to accept the person, with his/her flaws. Including Impulsive lying. You've got to KNOW someone's a liar, KNOW that they WILL lie about you, CAN lie about you, and that it is INEVITABLE that they are going to lie, and still be their friend. You can try to avoid these people ALL YOU WANT in life, but you can't. They're in places of power, at school, they're related to your boss, are around you everywhere and they know they will get away with their behaviors. You can have healthy boundaries with these people to limit the damage they do in your life. &amp;#x200B; For example. A person like this, I would trust with words, but not actions. I would hang out with them, spend time, socialize, but if they ever asked me to borrow any amount of money (over $20), I'd say no. If they offered to do something, or volunteered to help me out, I'd think about the potential damage they could do, and figure out an acceptable amount of crap to take. It is perfectly okay to take ZERO crap from anyone. Just know that it will be a lonely life since nobody's perfect.<morethan_nice>: This is really good, the last sentence especially. I find myself not being vulnerable because partly not trusting and a lot of people aren't very friendly to me. Certain coworkers are downright a holes. I have a lot of struggles and I really don't want people to know about them (people I am not close to). Because humans are SO judgemental and classist. Many act like they feel superior<PHOENIX_THE_JEAN>: I recommend these books by Dr. David Burns. They've changed my life 100%. My social anxiety has somewhat disappeared. I'd say it went from 90% severity, to about 40% severity. Seriously, I cannot recommend these books enough. I RECOMMEND the Disarming technique SPECIFICALLY, for dealing with these people. It has worked for me, and improved my relationships at the office with these assholes. &amp;#x200B; Feeling Good: The new mood therapy When Panic attacks &amp;#x200B; both by Dr. David Burns.<morethan_nice>: THANK YOU!!!!! i had a feeling u would be helpful, thank u!!", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1543672169", "end_date": "1543672777", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 3, "text": "<whyusernamestho>: A friend pointed out a flaw today. 20M here. I've had problems with making friends for as long as I can remember. I was extremely shy during my school days, and I'm far better now, though I still struggle to make conversation with peers or family or whoever it is. When the internet came I would attempt to make friends by chatting people up and what my friend pointed out rang so true throughout my social interactions. I talk more when texting people than when I am with them in person. And now that I think about it, it really sucks. It's kept me from cementing friendships and I would really really like to fix it. Does anyone else experience this? I would appreciate any kind of advice to work on this. Feel free to PM and thanks so much. <SimpleYetClean>: I think a good advice is to try and limit yourself while chatting to little short chats and use the phone for any conversation that is..well, a conversation. If you catch yourself chatting on an app for more then like 2 or 3 minutes, ask if you can call them instead.<whyusernamestho>: I find I fare fairly well on phone conversations as well. It's being in person that gets to me. Would've been great advice othetwise.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1543657796", "end_date": "1543761986", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 51, "text": "<XIVTemperance_>: LPT: If a friend looks more groomed or different than usual, tell them it’s probably important for them. Someone who cut their hair, changed their clothes or altered their appereance probably expects commentary from other people. You’ll probably make someone’s day and you will ve the message that person is important to you and you value that person. I can’t believe how many people are not aware of this rule. <420fairy>: absolutely agree. interesting use of word choice, why have you chosen to call it a rule? :)<XIVTemperance_>: Not a native speaker :-) [deleted]: Oh what do you speak?<XIVTemperance_>: Turkish, but I am kinda obsessed with language learning though.", "num_messages": 5, "avg_score": 10.2}
{"start_date": "1544806803", "end_date": "1544812946", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 20, "text": "<Jeffcallahan3>: What big or small social success have you had this week? As we improve our social skills, it's really important to celebrate wins. (big or small) What win have you had this week? Share in the comments! <xTobias97>: Zero<Jeffcallahan3>: Are you okay with that number?<xTobias97>: Not at all.. <Jeffcallahan3>: Okay, so what’s one small thing you can try this next week to improve? (Keep in mind there are many good resources in the Wiki, sidebar, and top posts in this sub.) What will you try this next week?<xTobias97>: I dunno tbh. My social skills aren't that bad, but atm i am pretty lonely and i have no opportunities to interact with people. I have one \"friend\" who would hangout with me, but i don't know if i want. I mean.. I like him kinda but i am not super excited to see him. I don't really have anyone i really like that i could spend time with. <Jeffcallahan3>: You have control over more than you think... What would you do to create one opportunity to interact with someone next week? Where would you go? What small thing could you do? <xTobias97>: I don't need \"small things\" I can perfectly fine talk with the cashier or what ever. What i need is not being isolated. I'm just to afraid of doing everything on my own. Atm i live my dad. I should get my own flat. Get a Job etc. But i have no confidence in anything and i'm afraid of the consequences when i fuck up<Jeffcallahan3>: Those are great goals! They sound really important to you. What [Large/Medium/Small] action could you take to move closer to those goals of job/flat, etc? Confidence is a result, not something needed to get started.", "num_messages": 9, "avg_score": 2.2222222222}
{"start_date": "1544732175", "end_date": "1544821511", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 10, "text": "[deleted]: Everything feels forced [deleted]<artinum>: I used to care too much about stuff. After years of effort, I've managed to kill my emotions so much that I don't really feel much of anything. I have to be careful in social situations that I don't give the wrong emotional reaction (like making a joke when someone's dog has died, for instance). I've basically done such a good job at learning not to care that I can't figure out how to turn it back on again. Still, it's not so bad. I've learned to fake it pretty well now, and all I have to do now is wait for this urge to care about stuff to die. In a few years time I won't care about anything at all...<EnoughReserve>: My god, I've had similar thoughts before, but that has to be one of the most depressing outlook I've heard in awhile. A life like that would be unbearably empty and some part of you knows that. I've tried not caring, killing off every emotion because it just hurt too much and 7 years later I'm still trying to turn it all back on and fight against the developed instict to not feel. I wish i had advice to give you and the poster because I can understand and relate to both, if i did I'd be in a better situation to deal with my own, but accepting that your emotions are off isn't the answer. <artinum>: It wasn't really a conscious decision. It was the result of growing up learning that any emotional reaction was a Bad Thing. Any negative emotions were bad, and I had a LOT of those. But positive emotions are also bad - if you show enthusiasm for something, you'll be ridiculed for it. If you show kindness or empathy, you were weak. Interestingly, adults punish you for negativity and your peers punish you for positivity. In the end, it's easiest not to react to anything.<EnoughReserve>: You are right in that, people will ridicule and punish you for feeling, that's probably never going to change. People want everything to be easy and simple, for everyone to be \"cool\" and composed because it doesn't rock the boat and they won't have to think about what they really want as individuals. So it is easiest to not react to anything, but its also empty. Not feeling, not being true to yourself it denies you every chance for fulfillment or joy and so much else. The truth is that every emotion you feel is yours and is for a reason, even deep dispare and consuming rage is a good thing when you know its real. For me, I lost..so much and endured so much pain, parts of me started to fade away as I tried to endure. At some point I just accepted that they couldn't come back and that it would be better if i wasn't here at all. I became a walking corpse, I still am, and it hurt the few people i care about more than i could have known, but I want to fight. I want to come back to who I was before even if it means pain because nothing is worse than this empty haze. Its a struggle, and so much more so if you are alone like I am, but it IS worth it. People may see it as weak to feel things but it takes strength to feel and not run from it, and the people who matter will see that.", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1543672306", "end_date": "1543673917", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4, "text": "<aikuistenlelu>: How to stop over sharing ?? I don’t even realize it when I’m talking, but afterwards I start overthinking and get super anxiety about it. <SimpleYetClean>: Try and make a habit of thinking on what you're about to say for a few seconds before saying anything, be calculated.<aikuistenlelu>: Adhd doesn’t make that easy for me to do, but I really need to learn how", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544736706", "end_date": "1544808872", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7, "text": "<SlimyFrog7>: How can I practice my social skills/meet new people? I used to be pretty social as a kid (almost extroverted, even), but then I hit puberty I became so insecure that I gradually lost the ability to talk to people... As a result (and probably due to some other reasons too), I wasn't able to make any friends upon entering high school and have now been alone for over four years. During that time, I barely ever talked to anyone (besides my mother) and my social skills just kept worsening. After some therapy and becoming more optimistic about my life, I feel a lot better than I used to and would like to get my social life back. The problem, though, is that I *cannot* talk to people. When I try, I either blank out completely or just say the most standard, boring shit I can think of. This may very well have to do with a lack of topics (I dislike most mainstream media, don't ever do anything exciting and though I have various hobbies and interests, I'm not particularly passionate about any of them (except for science, maybe, but I don't feel like I know enough about it to discuss it with confidence)), but my nearly nonexistent social skills probably play a big part in it too and I feel like practice should be the best way to remedy that problem. I don't how how to do that either though. Am I just supposed to start a conversation with someone, despite the high (speaking from experience) risk of fucking it up? Just take a chance and hope that it might actually go well? I think so, but I'm very afraid of it. What if it works as negative reinforcement and I become unwilling to talk to people again? That isn't really an excuse, but teh fear still makes me avoid it endlessly... Is there some kind of easier way to do it, or should I just go for it regardless of how scared I am? If so, do you have any tips for trying to hold a conversation with people you don't really have anything in common with and avoiding deathly silences and intensely awkward moments while doing so? Also, *how the fuck* do you meet new people? Even as a kid, it seems like social situations just came to me. I'd just be playing somewhere and - out of nowhere - I'd easily find someone to talk to. Nowadays, though, that's not gonna happen. At the moment, all the people my age I ever interact with are my classmates (who have mostly ignored me for four years now). I live in a rural town, there aren't a lot of people, all available extracurricular activities (don't know if that's the right term in English, I mean things like sports teams to join, courses you can do in your free time etc.) are either sports (which I suck at) or music (which I'm not the least bit interested in) and the closest even semi-big city is over an hour away (by train). Add to that that I am a somewhat \"unique\" person (fun fact, my teachers actually called me this regularly back in middle school (and not in a good way, either; hahaha, it still hurts-)) and finding anyone within my interest group in real life (I think it'd be easier to talk to them) seems almost impossible. Which makes me wonder how people meet online. If I want to meet someone, should I just hang around forums and hope someone nice person comes along or try to approach someone that seems interesting? (This is the first post on any social media platform (does reddit even count as social media?) I've made in years, so I don't know how people actually behave on here...) I'm generally a smart person (this may not sound all that good, but I'm basically my country's version of a straight-A student, which should count for something?) and am interested in science, art (visual), comics (by which I mostly mean manga, but I also read manhwa and manhua occasionally, so, you know. Sadly, I'm not into popular stuff like AoT, BnHa etc. (basically Shonen in general)), philosophy (from a scientific standpoint) and stories (which means books, I guess...). Are there any good places to chat about this type of stuff? Thanks in advance for any advice, I'd really appreciate it. &amp;#x200B;<zimba_fuel>: First off it's great that you've taken the step of posting considering you don't normally do that, so well done, that's a good start. You should definitely try and start conversations with people as it's the only way to practice. You must realize that if you don't then you're never going to change or improve. You've got nothing to lose and you need to adopt this attitude. Before you start doing this I'd suggest learning some things about conversations so you actually have something to practice. One thing that keeps coming up here is that you should be curious about the other person and ask them questions about themselves, so straight away that's one thing for you to try. However I'd suggest reading some social skills books to get more tips on how to start and keep conversations going. My suggestion is \"Improve Your Social Skills\" by Daniel Wendler. As for your question on how to meet new people, well try not to focus too much on this. You want improve your social skills and you can do this with existing people that are around you. Take a chance and try have a brief conversation with a classmate to practice a new conversational skill that you've learned. Talk to the shop assistant or someone standing in a queue, you've got nothing to lose here. As you build up your skills and confidence you can get braver and try new activities you wouldn't normally consider or use a site like meetup.com Best of luck SlimyFrog7! <SlimyFrog7>: I guess the meeting new people thing was because I'm really sick of being alone at this point, but I guess I shouldn't make it into a priority - practice comes first. Thank you very much for the advice, I'll try my best!", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1543675254", "end_date": "1543678142", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9, "text": "[deleted]: Out here having a cigarette by myself... [deleted]<SimpleYetClean>: Baby step man, keep at it! Ask someone somthing about themselves.<das_superbus>: Cigarette 2. Don't think that's an option. Can barely hear my own thoughts, let alone carry a conversation.<SimpleYetClean>: Well that sucks, I hate places that are loud.", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1543673513", "end_date": "1543688991", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 18, "text": "<whyusernamestho>: I can make conversation better on text than in person. 20M here and my friend pointed something out to me today. I've had problems with making friends for as long as I can remember. I was extremely shy during my school days, and I'm far better now, though I still struggle to make conversation with peers or family or whoever it is. When the internet came I would attempt to make friends by chatting people up and what my friend pointed out rang so true throughout my social interactions. I talk more when texting people than when I am with them in person. And now that I think about it, it really sucks. It's kept me from cementing friendships and I would really really like to fix it. Does anyone else experience this? I would appreciate any kind of advice to work on this. Feel free to PM and thanks so much. [deleted]: Fuck this is me too! My text game is on point. I'm witty, quick, funny, to the point, and always have something to say. In person my intellect is halved. I just have nothing to say and can't think straight. At least I'm aware I guess...<ScreaminPassion>: Knock. Check the message I just posted on your text thread.", "num_messages": 3, "avg_score": 6.0}
{"start_date": "1543675425", "end_date": "1543682429", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 13, "text": "<racer5001>: Is there a way to avoid putting on a character, or is that normal? I don't know if I'll be able to adequately describe this, or if this is the correct sub to post on (if not, please let me know where I should post this). I have an idea of who I am and for example, how I sound and how I appear to other people -- and how I act. However when I've had a chance to see recordings of myself, what's on the recording differs from how I perceived myself. And sometimes I cringe because of this difference. Quite a lot of times, when I'm interacting with a person I find myself emulating some person. Either that's a person who I want to emulate at that point, or I just whatever thing that person did to my interlocutor. And I realize that the interlocutor I'm interacting with isn't seeing the person I'm emulating, but *me trying to emulate that person*. Is emulating normal? I suppose this issue boils down to how I express myself, and how I have an idea in my head of how people see me but that's not really how people see me. Is any of this a problem? If so, how do I fix it?<ErebusEntity>: Be unapologetically you. Others judgements shouldn't factor in, they will have them regardless of how you act. Become comfortable with the fact that you are not validated by the opinions of others, positive or negative. The you that is yourself when no one is around is the person you are, and they don't need a mask to hide behind because they are real. As for social interaction, we all have different aspects of our personality that come through in different situations. We as individuals have to be able to gauge for ourselves when we cross over from self expression into mimicry. Emulation of others isn't uncommon or unusual because in actuality you are simply trying to personify the character traits you admire in that person. But the goal is to integrate the traits into our own persona through time and understanding. If you simply act like someone else the traits you admire will always be \"theirs\" because you are expressing them as if you were that person, not genuinely as yourself. Don't play the role, absorb them, keep what you like, discard the rest.<racer5001>: Thanks for your response! I think you articulate what I'm trying to say well: \"trying to personify the character traits I admire in that person.\" If I could assk you some follow-up qs, how do I absorb them? How do I ensure that I'm being \"me\" -- or am I navel-gazing too much and should focus on doing and completing what I'm trying to do? ^for example, as I'm writing this reply, I don't really have a sense of self -- I'm just trying to finish this reply. Maybe this is the fundamental problem, I'm trying to create a sense of self -- maybe sometimes that's not needed...?<ErebusEntity>: The only way you can find yourself is by knowing yourself. Take time away from others and do some things on your own. Find out what makes you happy or excited or curious about the world when no one else is involved. As above so below, as within so without. We can learn everything we need to know about both ourselves and the world by looking inside and introspectively learning about who we are and what moves us. Just by having these thoughts and concerns you are already doing the work, keep it up and you will achieve your goals.<racer5001>: Again, thank you for your encouragement and advice. I appreciate it.<ErebusEntity>: I'm glad I could help, even with just words.", "num_messages": 6, "avg_score": 2.1666666667}
{"start_date": "1543675188", "end_date": "1543695674", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 10, "text": "[deleted]: Lebanon [deleted]<thehuhman>: I married into a Lebanese family, here in the U.S., and you are right. They are all very friendly. My advice for you, is to focus on what you hear instead of what you say.<dhwkfhsjc>: Thank you for your advice", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1544814044", "end_date": "1544817051", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "<brownieofsorrows>: Why cant people be direct? When someone doesnt accept invites(party, meeting up) wihle adding that he has plans more than a few times, does it mean that person just wants no contact? Things like next time and surely another day have been dropped. I dont like people not being upfront about stuff like this. firstly I never was best at reading these cues, secondly it's just so much room for interpretation I had buddies that thought I was ignoring them but in reality I was just busy. &amp;#x200B;<Kill_Time_XIII>: People don’t like confrontation. People think being direct will result in confrontation. Therefore, they lie and make up excuses to avoid what they think will produce a confrontation.<brownieofsorrows>: people need some guts. I say, sitting in my chair browsing reddit, being single haha<Kill_Time_XIII>: It’s all good.<brownieofsorrows>: propably, my fridge is almost empty, but other than that, all fine and dandy", "num_messages": 5, "avg_score": 2.8}
{"start_date": "1544807015", "end_date": "1544826983", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 67, "text": "<runningtowardstheend>: I finally asked a girl on a date yesterday I finally worked up the guts to ask this girl out. I’ve known her for a couple years but only recently become pretty good friends with her. I was kindly rejected. Honestly, I’m kind of relieved I asked her though even though the result wasn’t quite what I would have preferred. I’m normally a relatively introverted person, I have pretty good social life with both guys and girls but when it comes to starting romantic relationships my brain just starts shutting down and second guessing itself. It feels like a weight has been lifted off my back, where now I can simply move on with my life rather then try to formulate scenarios on how it could have been. Deep down though, I do feel a hint of jealousy to towards the guy she will choose to be with because she is one of the coolest people I know. Which is kind of weird because I usually feel like I have decent control over my emotions. I have read in the past that being rejected is healthy and just part of the game. I’ve never put much thought into rejection but after yesterday I feel like this rejection has helped me learn something about myself and will shape my character forever. She was super cordial about it too, we both agreed that we are super good friends as we both leaned on each when we needed help in dark times and this wouldn’t and shouldn’t cause us to fallout. Maybe something will happen in the future, maybe not. But life is a road of learning and I feel like I have learned something about myself. Life will go on and be ok. I might just be talking into the void but I just wanted to let this all out. Longtime lurker here, thanks to this sub I was able to push the boundaries of my comfort zone <Zhoakazii>: I hope you don't mind me asking this, but when she rejected you did it leave you in anyway shock? See recently i got turned down before i even tried anything and i was fine with it as i was barely getting to know her but if anything my mind was in a state of shock for that moment. <Not_unique_enuf>: Thats normal yea.", "num_messages": 3, "avg_score": 22.3333333333}
{"start_date": "1544719188", "end_date": "1544814922", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4, "text": "<bean7797>: Boring life, is it me or my parents? From a 21y guy Hi, I'm a 21 years male college student that have been struggling those past months thinking if I know \"how to live\". My daily life is going to college, eat at home or grandparents, go to gym and use computer to play games, read/watch things. It's literally this, everyday. Sometimes (monthly) I go to a friend's house to hang there with 4-5 college friends (all male). Around two times I go to college parties every semester. And that's it. I've been thinking if it's because my sheltered upbringing. I still live my parents, and they aren't the kind of people that go out much. My mother goes out to work or to groceries store and my father go to work and church. They rarely go out to hang out with friends (talking about once a year). Studied only on private schools (which I'm grateful) and now I'm on a public university, where I'm realizing how things truly works. Only around the age of 15y I \"learned\" to say thank you, good morning, because of my friends. Only at 18y I learned how to understand the financial struggles of some people, because of the people at the university. Only at 20y I cooked something by myself (a terrible hamburger btw). And it goes on. The sudden change from high-school to the \"variety\" of college confused me. It felt like everyone knew how to live by himself, drink lots of beer and go to clubs/bar. And I drank my first beer at 18y. I still never went to a bar. My idea of hanging out is to watch a movie or go to someone's house. When I was a child, my mother pressured me to eat when I didn't want, because of this and always eating at home, I have social anxiety when eating with people that aren't my parents. Beucae of that, I don't eat outside. Every thing related to sex I learned from internet (how to use condom, what to do/what not to do), even though I'm a virgin. Same thing about how a healthy relationship works (my mother defend the idea that the girl need to know how to cook and clean everything). In other words, I think my parents taught me how to be a good son, not a good (independent) person. Now, is it me that failed to learn how to live or the way I was created? Just to have an idea, my older brother have been recently dating a girl (first time) and my parents are freaking out. Judging her for the different color hair, that my brother spend the night at her house. He has terrible social skills with stranger people. If my parents disappeared over night, I don't think me or my brother would survive of how dependant we are. I'm using Tinder but combine my boring life, Asian, short guy (5'5), low self esteem, social anxiety when eating, and I haven't been successful. I did randomly got a hook up with an older girl, but the logistic didn't help (both live with parents). Now, the only thing I do is play games. I don't play alone though, I like to play with friends. And I think I like to use the computer because it's the only place I can feel free,to do whatever I want. The only moment I don't have social anxiety and actually enjoy a food is when I'm late at night at the computer. I could go on, but it's probably getting confused. Now I'm on vacation, only going to gym and playing games. I want to go out with someone. But I don't know where to go, what to do if I found someone on tinder. What can I do? How to recover from lack of social skill? Im the one that is doing wrong or my parents? Sorry for long and confusing text (could have been muuuch longer though haha). I don't if I will find help here. Maybe it's to get it off my chest.<lebalder>: you, my friend, suffer from narcissistic parenting, the only way to improve is to stop it and recognize the your parent's opinion about you doesn't define you. is a good thing that you have some friends to hang out with, most people with narcissistic parents don't have any. You should use them as an excuse to go out and learn more about how to move around (further and further away) and start making some money on your own. what you will have to learn the most is that to accept you parents you don't have to take the kind of relationship they want to push into you. Set your own limits and know what you can ignore about their behavior. Become more independent in advance in case things go awry (I guess there are some parents that would push their offspring away if things don't go as they want). also, don't worry so much, you need a lot of embarrassment to learn, and people underestimate just how much they can get away with<bean7797>: Thanks for the reply. The good thing is that I'm aware that my parents opinion don't define me. I do think that I would be able to do something and live by myself if it wasn't for the social anxiety with eating. Its a string that I can't cut.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544815686", "end_date": "1544855193", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 12, "text": "[deleted]: Told a girl I liked her and don’t know how to feel about her response [deleted]<JenaCee>: It means she thinks it sweet you like her. But that she doesn’t feel the same way probably. But the only way for sure is to ASK her what she meant. Say “What exactly does aw haha mean?” Good communication will help you now and in dealing with life in the future as well. If she says it means it’s not reciprocated don’t take it personally. Don’t feel angry. Or sad. Just know that this is a part of life. Happens to everyone. But how you choose to let it affect you is up to you. Choose to not let it affect you in a negative way. When one door closes another (and usually better) door opens. Also if she gives you a lame or not very descriptive response that still leaves you wondering - just drop it. If her communication skills are that poor - there’s no sense in pushing the issue. (There’s also no sense in liking someone with poor communication skills) <BubblySun>: I replied with “what do you mean by that?” She was like what?<JenaCee>: Yeah. Ignore her. If she can’t even explain herself it’s not worth your time. You can do better. Everyone deserves someone who has the capability to communicate properly. You’re not a mind reader and neither is no one else.", "num_messages": 4, "avg_score": 3.0}
{"start_date": "1544816132", "end_date": "1544825376", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 8, "text": "<CrestedSegment>: Embarrassed and made a fool of myself at the work Christmas event I'm mid twenties and took my first ever shots. There were about 6 people there from work, all basically Senior Management, whereas I was the youngest one there. I felt totally out of my comfort zone. After the shots I felt tipsy and said some things that I regret including the fact that the manager I don't directly work under found out I didn't want to work on certain projects (which isn't true, I was just listing projects and I was kind of tipsy so had no responsible response), and that I had said something about his appearance which one of my dick co-workers told him to his face. Anyway I was going to leave without the shots but then I somehow said yes to them because I'm not assertive enough. Feel like I made a total fool of myself, but everyone seemed to be enjoying the fact that it was my first time. At the end of the night my coworker was worried about me getting home. I like to give an illusion that I'm confident and independent. But felt like I lost that illusion when I had my first shots that night. The next day all my coworkers found out about the night and were asking about the \"big night\", even though I'm not a heavy drinker at all and literally started the night with soft drinks with good intentions. I know I should have left at 7pm but felt like I outstayed my welcome by staying till 9.00p.m. I suffer from anxiety and the next day I had a whole lot of negative thoughts about hurting myself because of that night, the fact I made a fool of myself and the fact my co-workers found out that I was led astray by the people who were there with me. I don't know if I can redeem myself from this and don't know the way forward from here. I really need some advice.<brownieofsorrows>: so first question, did anyone say anything negative about you because of that?<CrestedSegment>: They didn't say anything negative I don't think. The people who were there were recalling what happened. However my stupid anxiety makes me care what people think and it's telling me that the illusion of being sensible and mature has all gone.<brownieofsorrows>: 1. Making a fool of yourself when drunk isn't that bad. It's relatable for 80% of our population as they did the same. Everyone knows what alcohol does, it's all good. We all are not ourselves when really drunk. 2. I had the same problem with fussing about what people think, but someday it was enough. I said to myself what reason is there to think about them. They are neither freinds or family. think about yourself and what you want, not what others think, because in the long run, they propably dont know themselves. 3. most people really dont care about what someone is doing, too busy thinking about their own plans and insecurities. mby it will be a funny story with no ill intent for a while but that's it.<CrestedSegment>: You make good points. Thank you. How did you get to the point where you stopped caring what people thought? I am going to get some professional help with this, but man when I reach breakdown point like I did the night after, it was a horrible feeling. And I've been reaching that point time and time again. I stress what people think. Even though people in my team had even more to drink than me, they received no attention. But for me I got the most attention because I made such a scene being it my first time with shots.<brownieofsorrows>: Well, I would say what got me to that point was a mix of telling me everyday, and in the fitting situation\"What does it matter what they think?Nothing!\" visiting a professional 10 times and also mushrooms(dont recommend it, until you educated yourself on it in all ways possible). These things I give credit for my overall healthy mind.", "num_messages": 6, "avg_score": 1.3333333333}
{"start_date": "1544816423", "end_date": "1652067005", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 16, "text": "<trenton_f>: Adderall and Social Situations I’m a freshman in high school and just took Adderall for the first time. I took 30mg. I don’t know if that’s a lot or not, but I felt great. About an hour after I took it I started to notice it. I was energized and motivated. I was doing all my work in class, and doing well, and I felt a lot more social. It wore off after PE. I think it was because we were running and playing basketball. Tomorrow is Saturday and I have a friend’s birthday party to go to. I’m planning on taking the same amount tomorrow to take away the social anxiety. I’m pretty good with recognizing when something I’m doing is doing harm to me, and when I should stop doing it. I do smoke weed from time to time, but I just do that for fun. When I’m sober I can be pretty awkward, unmotivated, and sad. Is what I’m doing ok? I feel like this is benefiting me a lot.<abigfuckingnope>: Not worth it. Was prescribed it for 17 years. Used it and abused it for the same reasons. Got off of it a year and a half a go and had to completely relearn life. Relearn who I was and everything. I did not feel like a person. I realized my entire fake \"social\" personality was based off a drug. 17 years of who I thought I was down the drain.<youngjak>: I’m going through this right now and it’s fucken awful, realizing that I’m a two different people adderall me and non adderall me. And I don’t know which one is actually me<abigfuckingnope>: Still here. It's gotten slightly better but still figuring it out. Don't give up.<youngjak>: Yeah I’m still in the realization phase cause I can’t stop taking it because my grades would probably suck, and also I feel somewhat trapped in it where I’m the quiet guy at school and I feel like I’m trapped in that persona of how people view me<rsphygmomanomete>: How are you doing nowadays? I can relate to a bit of your comment but I'm also, perhaps, foolishly curious about experimenting with stimulants to combat social anxiety.<youngjak>: I’m better now than I was definitely. Your mindset matters a lot on it. Like my crashes are not as bad now. Well started working out and stuff too try to get some good natural dopamine going(not the constant artificial adderall kind) working out helps out a lot. I put myself in situations where I have to speak and challenged myself. So instead of sitting alone during two study halls i sit with a group of girls now. I still have mood swings just not as bad. Some days I’m more robotic than others. And I’m still nervous quite often(I was diagnosed with generalized anxiety disorder). But for you specifically about stimulants to combat anxiety. I would say it does the opposite. But still it’s so weird cause it goes through phases. One phases I’m so happy and confident without a care I’m the world. And the next I’m overthinking everything and nervous as shit. So if you want to combat anxiety with stimulants personally I would say it’s inconsistent", "num_messages": 7, "avg_score": 2.2857142857}
{"start_date": "1544805023", "end_date": "1544817319", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "<CTZNSQRL>: Timing recommendation So I've been talking to a girl from my college that I've known for a few semesters now a lot recently. We have a lot in common, and I think she's amazing so I've been working up the nerve to ask her on a date. The only issue is that finals week is next week, and then we're both going home for break right after. I'll see her when she comes to a chill end of semester party I'm throwing but that's just meant to be a chill hangout with some mutual friends and not a \"party\". As a result if I ask her out before break, I likely wouldn't be able to take her out until next semester anyway. Would it be better for me to just wait until break ends and I see her again to ask?<staywithme26>: Maybe just try to grab lunch? Something quick and casual and if it goes well then tell her you’d like to take her out next semester? <CTZNSQRL>: Yeah that could work! I genuinely dunno if we'll have time because finals at this school are ridiculous and her major has the heaviest workload by far, but I'll see if she has time. I don't like asking people out online because I feel it's impersonal, but I feel like that would be a little different yeah?", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1543676359", "end_date": "1543746219", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 5, "text": "<sharonaflemming>: How can I get better at handling criticism? I find myself constantly struggling to handle negative comments or constructive criticism even over the smallest things. I'm not generally someone who takes themselves too seriously, I have no problem with friends joking at my expense and don't get offended easily in most situations. But sometimes I'll have to actively suppress the urge to get immediately defensive over a minor thing a friend or acquaintance said. It always catches me off guard, too. I've tried figuring out if there's a pattern or a specific subject I'm touchy about, but I've found no common denominator. I guess it's more that I am sometimes already feeling down and talking down to myself, and during those times, any lighthearted comment someone makes about me will be perceived as negative by my subconscious. I know that my friends have noticed this and will avoid making certain comments around me when I'm in one of these moods. I want to tell them they are free to be themselves around me and I don't want them treating me differently because of my own insecurities, but I don't know how to say that. I hate that this makes them feel uncomfortable and I would like to change this behavior. Does anyone know of any strategies I could use to learn to be less defensive in situations, to better handle criticism and to be easier on myself when I'm feeling down? I'll accept suggestions on books, articles, podcasts etc on the subject too. Any help is welcome! Thanks in advance. TL;DR: when I'm feeling bad I get very sensitive about anything and it makes conversation with friends awkward because they feel like they have to walk on eggshells around me. How can I avoid doing this?<trysummoningdemons>: Epistemology. How do they know if they're right or wrong when they criticize? They're not you, and the heuristics they believe apply to what you should do in your life to achieve success, are simply heuristics that may have worked for them in memorable situations, or that they're guessing could help you out in situations they haven't personally experienced. If you like, your goal could be to \"doubt them\" - to hold what they're saying mentally at arm's length, to just regard their remarks without instantly accepting or rejecting them as truth. What the people around you are criticizing you about are heuristic suggestions to do something else. (...or, less charitably to these people, they might be complaining after the fact with 20/20 hindsight about the outcomes of a judgment call under uncertainty which you reasonably made. But hey.) Sure, it's ok to perceive the comments as negative. What happens if you're negatively commented upon? You said you feel defensive about it. Alright. That's fine. It's ok to feel defensive and to defend yourself. You're making decisions now and then about heuristics to use, and people nearby might criticize your choices. But you're alright. We don't need to pick optimal heuristics and carry them out with optimal efficiency. Are you sure your friends are on eggshells around you? Maybe when you're feeling bad, they perceive how you feel, react sympathetically, and go easier on you / choose to be present with you because they're kind, and because your choice of heuristics isn't always that important. We don't have to call their care for you walking on eggshells. It doesn't feel great to feel bad, why rub it in and make you calculate alternatives, increasing your stress, when there's no need? If you want advice from your friends when you sense that they're being nice to you due to your evident mood, then just ask 'em for the advice directly. It's alright to get your heartrate up when your hear criticism. Grin like a maniac. Revel in it. uh, was any of that good? I want to get my heartrate up<sharonaflemming>: Oh, I guess I never thought of it that way before. I believe the part about \"doubting\" what they say will be especially important in my journey to change this - I always immediately internalize the criticism as true. That, and learning that I don't always have to make perfect choices. Thanks for this really well thought out explanation! It really helped me see things in a different light.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1541740984", "end_date": "1543690376", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 8, "text": "<thesurveyer10>: What Is The First Thing That Goes In Your Head When A Person Does Not Give You Eye Contact (This is for a school project for a survey so I am a third party in this). &amp;#x200B; I will NOT write your names in the report. &amp;#x200B; Does NOT matter the gender of the person avoiding the eye contact. &amp;#x200B; \\-Discuss<NovaAurora504>: they're not interested in me, i'm a step above furniture <JacobMcDo>: How did this comment get downvoted it’s probs the most useful one<NovaAurora504>: Lol, dunno. Pessimistic maybe?<JacobMcDo>: Feel like it’s something that a lot of people on this sub might need to hear including me", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1544824414", "end_date": "1544879989", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 3438, "text": "<Intelligent_Genitals>: I just got abandoned by 15 peolle I know I can be difficult but I've just been abandoned by my work 'friends' on our Xmas party night. After the meal, which I set up and didn't get a single thanks from 25 people and had my drinks orders ignored, we were meant to go for another drink at another bar. I quickly went to say Hi to a guy whom I knew from another job, I turn around, and they're gone. Nobody answers their phone. Nobody wants to know. I feel terrible. I don't know what to do. I'm 28 and feel like an unlikeable mess. How am I meant to face these people on Monday? What have I done wrong? EDIT 1: Sorry I posted this here. I didn't know where else to post it. EDIT 2: My top post and it's about how incredibly isolated I feel. Go team! EDIT 3: Some people asked what I meant by calling myself 'difficult'. It's hard to explain, I don't think I can word it right. I have aspergers syndrome and can pick up enough social cues to know I'm seen as different by them. I'm not aggressive, ever, and I'm generally very chill. I'm not very funny but I try and keep myself involved in a conversation. <UPDATE>: Hi people. After EDIT 3 I got home, hugged my SO and slept for nearly 12 hours. This thread got pretty big and all I can say is thanks. I'm still hurt, and emotionally confused as heck, but I'll be OK. Some redditors have suggested I take a long look in the mirror at myself, which may suck in the short term but there we go. So many thanks from me to you. You wonderful people of reddit.<Vitalic123>: \\&gt; Sorry I posted this here. I didn't know where else to post it. That's alright man. Anyway, that sounds really tough. It's very difficult to not take something like that personally. You can either try anyway, and assume there was no ill-intent. Or you can look at it as an affirmation of where you're at with them, in that they just see you as a colleague, and get friends elsewhere. But that's something you're gonna have to figure out for yourself. As to how you'll face them on Monday? Professionally, no more, no less. Don't mention the party if they don't. If they do, or god forbid, if they ask \"where did you go, man\", or something like that, just matter-of-factly say \"You guys kinda left me behind. Made me feel like crap.\", or something to that effect. Important to not be accusatory or too emotional, but just state it as a fact. That's basically all you can do, imo.<mheyk>: dont even mention the feeling like crap part just say you met up with an old BC and one thing lead to another <Black_Robin>: Best answer. They probably didn't even mean to leave him behind. He should not play the victim role, it happened, it sucked, but for the good of his professional relationships and ongoing personal growth, the narrative should be he lost them, and not the other way around. <Edit>: I assume I’m getting downvoted because I said they probably didn’t mean to leave him behind, yet I realise OP mentioned they ignored his calls too, and the fact that he had organised a lot of it made it extra shitty for them to leave him. I agree with the downvoting on this basis and I apologise for how I worded it. It can happen though that if people are drunk, they become forgetful and insensitive, following the pack in a herd like mentality, and making bad decisions. No excuse, but that may have played a part. What I said about OP’s narrative going forward though I still believe holds true, and is in line with the precious posters opinion ie. don’t mention it on Monday, there’s no point, unless it’s to a trusted confidant <happymomma40>: They didn’t mean to leave him behind but wouldn’t answer his calls? I’m going to call bs on that one. He isn’t playing the victim. He clearly stated he know he’s different. However they ghosted him after he did a lot of work for them. That makes them shitty people. They could have just said yeah we are going to head home or something. <Black_Robin>: Yeah good points. What I meant, and probably not articulated well, is that it probably wouldn’t do much good to make a point of being victimised at work on Monday. Like someone else said, might be best just to put up a facade that everything is ok at work. Either that or ask a trusted confident at work what happened and why they ditched him. I’m not trying to belittle him or rub salt, just offer an opinion on how to maybe deal with it going forward, understanding that it also did In fact suck <happymomma40>: That’s true. If they ghosted him there is really no point in talking to them at all. They are assholes and not worth the time. OP if you read this. These people are not your friends. They used you to plan a party for them then treated you like shit. Move on. Hold your head high even though it hurts. Know that they were wrong and shit people.", "num_messages": 7, "avg_score": 491.1428571429}
{"start_date": "1544824853", "end_date": "1544825599", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9, "text": "<daintysunflower>: I fucked up for the past few days. I got in a fight with 2 people and I was feeling really down. I hung out with another friend and I was kinda annoyed with him. I basically messaged him out of the blue. The pictures explain more. I fucked up so much and I ranted to someone about this and he said I was a really bad friend. What should I do? <https>://imgur.com/a/sF3pdLp<PrincessCuculina>: I would wait a couple of days and then send a serious message to him acknowledging that you were in the wrong and apologizing for behaving how you did.<daintysunflower>: Yeah. He probably was talking bad about me to the other people who cut me out of my life. <Edit>: I’m tired and I feel like a bad person.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1544819785", "end_date": "1544850216", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 6, "text": "[deleted]: I'm supposed to give a speech but I fear my anxiety will get the best of me. [deleted]<AmrElshamyy>: You should practice and do rehearsals. It's a normal thing, everyone should be nervous before speeches regardless of his position, skills or age. Just write what you want to say on a paper and keep rehearsing it. The more you practice the more confident you will be during your speech. Good luck and Congratulations !<Karu-ma>: Thanks for the advice!", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544825762", "end_date": "1544864862", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 27, "text": "<thornphoenix>: Feel emotionally incapable of connecting with others Hi, one of the things that i have started to notice about myself is that i don't feel like i am capable of being emotionally connecting with others during conversations and social situations. There are many times when they say something which i think they expect me to laugh at but i get no emotional reaction to what they have said. It makes me a feel a bit robotic. I also feel like i am just some smiling observer of the conversation, i don't really know how to add to the conversation and just feel like some creepy sentinel hovering in the room. Does anyone else have this, and have you managed to do something about it? &amp;#x200B; Thanks<elk227>: Is it just general apathy and numbness or a disinterest in the conversation topic? Or sometimes you want to say something but maybe you think it’s so obvious and common knowledge that it’s pointless to say? Or is it that you think they wouldn’t care about what you said? <thornphoenix>: Its not really numbness its more like an absence of clarity, there is no instinctual or knowledgeable idea of what to do with next. I want to say something but i don't have any idea what to say that would help the conversation, sometimes i can ask a question but it seems forced and really only increases the speed that the conversation comes to an end. I don't think that they don't care what i would say, its just a lack of idea of what to say next, like its my turn to hit the ball in this conversational tennis but i have turned up without a racket and minor head trauma. <elk227>: “its just a lack of idea of what to say next, like its my turn to hit the ball in this conversational tennis but i have turned up without a racket and minor head trauma.” I know I shouldn’t, but I did giggle aloud when you described it like that. Hmm...the times when I didn’t know what to say is when someone tells me something and I don’t know what to make of the information—like why are you telling me this and what do you want me to do with this information? Like do you want me to find a solution? Does it relate and build on to something that person or I have said previously? Does the person just need to vent to someone or organize their thoughts? Sometimes I get slightly irate if I can’t categorize it, but then this too is an opportunity to ask about it for clarity, which I remind myself after the fact but in the moment, since I’m so used to trying to figure stuff out on my own, it doesn’t come naturally. Other times, am I bored by the overall situation, company or topic or distracted by inner thoughts? Or am I just not comfortable enough with the situation to accept the rate of conversation? I guess what I mean is have other people complained of your lack of communication? Do you worry you’re boring them? If you’re less talkative and everyone else is doing the talking they may think you’re a good listener and may not notice who’s doing most of the talking or even find it problematic? Or maybe you have several thoughts but don’t know which to go with? You mention not knowing what to say to help the conversation, but maybe it’s pinpointing the point of the conversation as I sort of mentioned above? Also, reiterating what they said in your own words can help because they think you’ve listened, but they can also correct and clarify your understanding since everyone describes things differently and uses language differently. Not sure if any of this helped you, but for what it’s worth, I think you’re not a bad conversationalist. Oh and that reminds me, maybe it’s because you need longer to compose your thoughts? Like you may be an eloquent communicator in written conversations than actual talking conversations? I mean I know I definitely need some time to process my thoughts and it’s perfectly fine to say you need time if that’s the case. As for the joke, not everyone’s humor is the same so it’s fine to just polite laugh or be confused (which could lead to a longer conversation when they explain it).<thornphoenix>: \" I know I shouldn’t, but I did giggle aloud when you described it like that.\" Thanks :) \"Maybe it's because you need longer to compose your thoughts?\" I think this might be it. Once a conversation is over then I have usually thought enough about it to be able to say something, sometimes i am lucky that the conversation is still going on and the context is enough for me to say what i have just thought up. But i am not always that fortunate. Thank you for your reply and for taking the time to do so. I have some new things to think about. I think that I need to stop being so aware of my lack of speaking and focus on the conversation at hand, try and figure out better ways to continue the conversation via repeating what they said back to them in their own words (like they said) or being able to ask questions so that i can take the time to formulate a response whilst they are asking the questions. <Rkikkas>: The advice I can offer you is to focus on the task at hand and don't get lost in your thoughts with it.", "num_messages": 6, "avg_score": 4.5}
{"start_date": "1543482015", "end_date": "1543695067", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 9, "text": "<gfuds>: Success in conversations! I read a post on here that said small talk is completely ok. It is a bridge that leads to connections. I used to think that small talk was a waste of time and prevented me from making connections. I used to beat myself up in conversations and felt extremely anxious with one on one conversations. Well, I overcame that fear today. I told myself that small talk is ok and if I don’t form a connection it’s not my fault. This helped me SO much. I talked to so many people and it felt natural! I used to force myself to talk before but now it feels so easy! I’ve been on this subreddit for a couple weeks now and I’ve learned so much. Thank you all for being on this sub. You all are amazing :)<Dagobert_Juke>: Congratulations! Care to share some of your favorite small talk topics? Mine is food, I love to talk about food and ask people for their favorite/most fancy/comforting food. Only if it makes sense in context of course, but I am always happy to lead the small talk there!<gfuds>: Thank you! I love food as well but find it hard to talk about because most of the people around me don’t cook. I like talking about video games, movies, music, and so many other things. I talk about whatever comes to my mind. <Dagobert_Juke>: Nice. Music and movies are excellent topics. My standard strat is to ask people for their recommendations for me. This can be in movies to watch, bands to listen, games to play or whatever. This way, they talk about what they like and why and it makes them often a bit joyful. Also, crucially, it saves me from having to talk. The downside is you can not use it too often.", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1543686103", "end_date": "1543697328", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 13, "text": "<EwwJason>: Why does no one care about what I have to say? You ever feel like you are just here to hear? Wether it’s my close friends or family, what I have to say has no meaning. No value that holds to them to really enjoy what I have to talk about. It’s not like I talk all the time or discuss about boring topics. I’m 21 M who does enjoy talking with others and is lively about it too. I don’t wanna say everyone only cares about themselves (which can be mostly true) but I will say that I’ll turn a ear towards whoever is talking me and actually form a conversation about whatever it is, but why does no one really give me the time of day? Is there anything I can do more to really hold the attention and interest of someone while speaking?<thatbatcat>: Whenever anyone talks to me about themselves, even if I want to talk about myself, I lean in and listen closely. I really am interested about what they're saying, even if it wasn't wasn't what I wanted to talk about as by listening and asking appropriate questions, I'm improving our relationship, both by learning more about them and by establishing myself as someone they love to be around. This will yield returns. People love talking about themselves, and in turn, they love those who listen to them talking about themselves. As you keep listening, and engage with them about things they care about, your relationship will improve and this will make you far more important to them, and they'll be so much more likely to do things for you, but they'll repay you in their own way. It's unfortunate that those currently around you don't seem to want to listen to you, or maybe you're just picking up on the fact that it's a rare man who prefers to listen than to speak. Either way though, from my perspective, this is brilliant news! As seems that you can easily improve your relationships with all your close family and friends, just by listening! To answer your question though, perhaps you are just there to hear. I'm sure your friends and family would be fine to listen to you, but if they aren't interested, it'll be awkward for the both of you. That's too bad. I must stress though that I'd really recommend listening to them regardless in order to maximise returns on your relationships. In turns of people listening to you, I'd recommend two options. The first would be to find the person in your family and friends that will tolerate listening to you the most, and see if ranting to them every once in a while is enough. If it isn't, then find someone new who will tolerate listening to you more, these people do exist. It's a crap answer I know, but let me explain. You're interested in increasing peoples interest in you when you speak. There is only one way to do this however and it is to talk about something they are interested in / care about. Obviously, they care about you, but do they care about you more than themselves? The romantic answer would be yes, but... in reality we know otherwise. After all, you are here complaining that people only want to talk about themselves and not you! You, my friend, are part of the problem too! :) As are we all. Perhaps therefore, people who care about you more will listen to you more, but I don't think think that is correct. I think that some people are simply more predisposed to listen than others. So find someone who will listen to you. There is nothing you can do about people who don't want to listen. While this answer is annoying, I hope I've convinced you that listening is a superpower and your family and friends being self obsessed is actually a blessing in disguise! Have fun improving your relationships with them all despite their flaws and good luck in finding someone to listen. Perhaps have an understanding with a friend that they can call you whenever they like and rant so long as you can do the same. I've had an arrangement like this and it got me through some really tough times. I hope you find what you're looking for, All the best, \\-Ryan<EwwJason>: Wow. This is what I needed. I appreciate the time you spent responding back to me. You helped me understand a little more about the people I’m close to and myself. Thank you Ryan.<thatbatcat>: Godspeed!", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1544826515", "end_date": "1544832924", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 14, "text": "[deleted]: I like a girl in my class but I'm shy [deleted]<capacitor15>: Just ask her a question about the class like before or after it’s starts (even if you know the answer to it). Then try to start a conversation and crack a joke about the class or something and see where it goes. You might feel nervous but even if it goes nowhere it’s a situation to learn from and don’t beat yourself up for coming off as “weird”. As you do this more and more it won’t be as scary.<naxx99>: Best thing to do, I did the same thing at the college start and after sometime it becomes a daily routine to start up convos", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1542627462", "end_date": "1542678128", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 4720, "text": "<Jay_Primrose>: If you’re a guy take the risk. It’s worth it As a guy I definitely believe if you don’t try to approach women you’ll be single forever. This isn’t the case for everyone but in my experience it is. I’ve never been approached by a woman in my life. It started with me overthinking every word to say, body language, facial expression, and calculating what was the best possible outcome out of the multiple scenarios I created in my head. I would literally plan my conversations in my head like good icebreakers and as many possible responses I could think of to my icebreakers so when the actual conversation came it would be easier. Then when it was time to actually do it I would hesitate and revise my planned conversations. This cycle would just repeat itself until one day I was just like forget it. The worst that can happen is a simple no. Few months later of shooting my shots and it hit. You’ll feel so much more confident doing this. It also helps with the everyday conversations too. <EDIT>: Girls shoot your shot too! :) <axiuluo111>: To be honest, I found this also applicable for women too. When it comes to career and friendship and sometimes also romantic relationships, as women we also have to be brave enough to ask for it. It’s a bit easier for women sometimes because women are naturally more vulnerable than men or more willing to show vulnerability than men. <tombstoning>: I beg you, just once, to be open and honest and stop exaggerating. Romantically women have to ask for anything in minuscule effort and vulnerability compared to men. This is just a gross egregious lie. Lie because of how far off from the truth it is it cant be called an exaggeration. Career? Okay. I agree SOMETIMES. Wanna know a time it doesn’t, and a lot? Getting a degree or skill to open your own practice. My Gyno mom and vet sis never fought with equality since the 60/70s. Why? They removed the equality obstacles stat. Open your own practice! Friendships? Sorry that scale is dead even. Men and women deal with friendship issues the DEAD SAME. So let’s tally folks! Dead same friendship. Barely any difference in career. MAJOR UNBALANCED POWER PLAYS in the dating world. Uhh, sorry honey but if you’re gonna teach that shit to your daughter, expect some problems down the road. <axiuluo111>: Your gross generalization is also one of the biggest problems of inequality. Do you really believe that your mom and sister can literally just relax and chill now that they have their own practices?Work politics and sexist bullshit never ends just because you open your own practice. What about the times when you have to promote your own business? Ask for investment? Market yourself? Your mom and sister did better probably not because they opened up their own practice - btw that is a stupid over generalization, but because they work their ass off and they are competent in their skills. But just by harnessing that skills is not everything, you still need to go out their to get business and feed your peeps. Promoting your own business and getting clients in itself is ASKING FOR IT. Then let's also talk about people who actually don't work in private practice which I assume is most of us out there. When you need to advance in a career, especially as women, you need to ask for it instead of maintaining the mentality that it will come to you like what you think dating for women is. fewer women self promote at work than men. Just for a fact, women who are aggressive enough in their career will end up going a bit further. We are not talking about gender differences here, but we are talking about \"working for it/asking for it\" is definitely NOT a gender thing. Not sure your friendship comment - not sure what you are talking about. If you agree that women and men are the same, you essentially agree with what I said above. I will for sure continue teaching my daughters to work hard and ask for things that they want. If I don't teach that, they will probably end up like the sad male in an unbalanced play dating world like you mentioned and will have problems down the road. I'm sorry but what you are saying sounds really stupid. <tombstoning>: Everything you said was stupid. Didn’t just sound it. You plagiarized my words and coin phrases and did your best to sound intelligent but your basis of premise was wrong to begin with. Wrong. They removed the obstacle. Are there not more women than men in the world??? Some if a women owned a private practice and women supported other women then there wouldn’t be a problem money wise right??? Holy shit you don’t think thugs thru. Now let’s take this further into you gross exaggerations again as a woman : promoting your Biz is asking for it?? WAY TO DEMONIZE THE WHOLE MALE GENDER!!! Way to give your fellow humans some benefit of the doubt!! You’re a saint! Last paragraph : way to lie honey. You know you lied and that’s why I called you liars in my first reply. You know that’s not what I said and the context too. Spin doctor master manipulator is another common tactic of women. You’ve had to, admittedly, get your power from the word game over the past thousand years. One defense tactic is to tweak, twist, lie and purée a mans statement to fit your discrediting agenda. I’m 45, been around the world a few times and dated women of all Color and cultures. Ain’t foolin guys like me and most of the younger ones you do fool will only grow to realize it and then fault you. You’re messing up your bed when it was already messy <axiuluo111>: Yeah dude. You sound really hostile and angry towards women. By stating your age and your own experiences don't give you any credits in this topic you know. In fact, it makes you look really sad...Your traveling around the world and dating different colors and cultures of women must have done you well. Do you know when you promote your own business, you need to go out there and get your name heard by people? Do you know how to do that? You make phone calls, you go to events, you network and you advertise. These are called asking for it. Not asking for it, meaning you sit your ass on your chair and just wait for opportunities to happen to you. Your comment is so stupid that you didn't even understand the fundamentals of business. And again, all i'm saying is that as women, we also have to face certain obstacles men also face. By no means I am DEMONIZING THE WHOLE MALE GENDER. Actually, that is what you are doing..you are demonizing the whole female gender. When you call me gross exaggerations as a woman, why don't we look at what you have saying: \"Spin doctor master manipulator is another common tactic of women. You’ve had to, admittedly, get your power from the word game over the past thousand years. One defense tactic is to tweak, twist, lie and purée a mans statement to fit your discrediting agenda.\" Who is over generalizing and labeling now? You already have your \"world view\" against women written all over your statements. And you are wrong too. Even it's business for women and women supporting women, you still need to go out there to get business. It's still working hard and proactively getting the things you want. Do you really think that just by being a woman, things just come in our hands like nothing? I think you need to look deep down in your own views and understand what it is that makes you so angry towards women when your mom and sis worked so hard to support themselves and hopefully they are strong female examples in your life and you learned nothing from them about a single definition of \"hard work\"? <tombstoning>: 1. You said I didn’t understand the fundamentals of business like it was a one time event. I’m a loan officer, airline employee, own 2 homes, super host status on Airbnb, 200+positive rating on eBay. Wrote over ten mil in loans. Have a 820+ FICO score. Only debt is mortgage, 100k savings... yep I know nothing about Biz little gurl. Did you not make a hypothetical about the dangers women have from men blatantly with no proof, just a abstract generalization?? Yeah that’s why I did that back to you. Chronological order, ever hear of it? Lastly, idiot moron pea-brain, where did I saw women’s clients walk to them?? You know what I said and you MANIPULATED THAT just like I called it. I said specifically IF IF IF IF IF IF women supported each other then off the simple basis of larger population you’d have more biz than men! But you’re a liar and spin doctor and unabashedly arrogant about it too <axiuluo111>: Aww so sad you know so much but still can't form a grammatically correct sentence. I really didn't understand your words with so many repetitive words, all caps and grammar. Do you need a pair of magnifying glasses grandpa? A busy and successful person like you shouldn't be lurking on the internet all day. Please go out and actually contribute something positive to the society you keyboard warrior. Have a nice day!<tombstoning>: Aww so sad all you got is grammar and selling defense? Mommy and daddy couldn't pay for your schooling? &amp;#x200B; No evidence, proof or substance to contribute little child? Are you threatened by my PROWESS? &amp;#x200B; So you admit youre a loser in your parents basement with no money and frustrated your not farther along in your life? &amp;#x200B; Aww soooo sad!!! Cheers mate! Im a 20yr airline employee, been around the world3 times working on the 4th. I do plenty and see more countries in a month than you have in your whole life! Ill report back when I land and have internet again you mind reader. Sorry Im flying to Cabo today and not working. Sorry you guessed wrong again ;) lol &amp;#x200B; Children trying to play adult games, haha<axiuluo111>: Hahaha hey dude, your lies are exposed by yourself. You mentioned before that you are 45 and now you are 20?? Who's lying!? Hey kid, get off the internet. Your mommy and sissy are watching! They will be so disappointed to see you so naughty like this :p<tombstoning>: Wow get that reading comprehension and schizophrenia checked buddy! &amp;#x200B; How you get 20yr old from being a 20yr airline employee is beyond rationale. Serious illness my friend &amp;#x200B; Back away from the keyboard champ. I wish you the best in your recovery!! &amp;#x200B; <axiuluo111>: Make sure you get all the help you need buddy. Life is rough for you I get it. Especially hard in your world when all women trying to steal stuff from you right? I'm so sorry for you and sorry for your mom and sis who have a loser like you in the family :) Love much!<tombstoning>: Wow the illness is real. Gross exaggerations and lying just like I already stated. Proof in the print sweetie. Thanks &amp;#x200B; But seriously. Get help. Youre obviously a pathological liar and you know it. You dont fool regular people. You know youre a SPIN DOCTOR and lied i said 20yrs old. &amp;#x200B; Is that fun for you? Lying incoherently in attempts to make yourself look intelligent or gain advantage in discourse? &amp;#x200B; Yep, if youre a fair representative of your generation then youre all fucked. Thats whats sad honey. Cheers<axiuluo111>: You know that you are not contributing any valid points to a conversation except insult right? That is so sad and lonely though. You know when you fly to Cabo today can you make sure to get your symptoms checked? Health care is probably cheaper there and you probably need it. Women must have done something traumatizing to you when you grew up so that you hate them so much huh. Well that's sad that you let them get to you. Please get well soon. As a 45 yo man to have so much time typing away at work, you must feel so useless and unworthy at work. Aww I'm so sorry to hear. Is that because your job is being taken away by women and you internalize that hate? <tombstoning>: You still lying about lying little girl? Imitation is the highest form of flattery remember... &amp;#x200B; I already called YOU out for not contributing anything sweetie. I have a memory honey even at 45. EVERYONE read back and see where she's just copy and pasting me now. Its flattering but also signs of metal illness. &amp;#x200B; Honey. For reals. Get a grip. Youre a pathological liar and youre not even ashamed your own replies are here to see that proof &amp;#x200B; The illness is real with this one folks &amp;#x200B; Edited to highlight my FREE FLIGHTS from my airline job thats so sad for me, :) lol Wow this one is quick isn't she?? Couldn't even put 1+1 together equals FREE FLIGHTS SWEETIE !!! haha &amp;#x200B; EDITED AGAIN : EVERYONE !!! URGENT !!! Look at this girls profile, she's a mental health therapist or worker and she's clowning peoples mental health!?!?! &amp;#x200B; Honey you better delete this profile in a quickness. Hate to see you lose your job for picking on the people your supposed to be helping! Ill take some screen shots to save for a rainy day okay! Ill pass this on the to NALM chapter you just signed up to or whatever. Im sure they'll be super pleased to hear this!<axiuluo111>: You know you are answering your own questions right loser? No one ever asked you if you have a free flight or not. You just wanted to show off your free ticket to everyone? Is that because no one really takes your seriously in real life? Who the fuck cares about your free ticket buddy? You know what, I am not a mental health therapist, but I can tell already you are deeply in trouble. Well I guess if you talk with your penis, you probably only have dick to say right? Something must have happened to you when you were young and that's why you turned out to be so messed up. I'm so sorry for you. Take care internet stranger, I wish you the best in life. May all your hatred towards women goes away one day and you will see the world is a lovely place and you never need to use all caps or so much punctuation maniacally to sound loud or obnoxious. It's all in the heart too. You keep calling me honey sweetie, that's very nice of you to do that old man. You know what I don't really take that as insult. Have a safe flight to Cabo and stay warm :) Btw, I'm also saving your screenshots too, not for revenge, but it just makes me laugh. I'm saving it to cheer me up whenever I have a bad day. Much love &lt;3<tombstoning>: Pathological liar lying again... I never said anyone asked me but you did TRY to clown me about being some loser with no life, yet im at the gate waiting to board right now. Know who cares about my free flights? EVERYONE WANTS MY BUDDY PASSES LOSER. Do you even have a Passport? I have girls offering services and best friends and millionaire all vying to buy them of me. but ya know what? I dont care about money or solicited pussy. I care about where im going and who would be the best travel partner for that place or event. Or who deserves it. &amp;#x200B; Who taught you that cute line about dicks, youre Mom? She sounds classy too. What is the NALM then if youre not in the mental health field LIAR? &amp;#x200B; Seriously ill. You're a pathological liar and you still haven't retreated on the 20yr old issue. You just bounce around like the airhead you are. You cant stay on topic and are actually bad at lying for practicing so much. &amp;#x200B; No Love. Youre trash. Youre already of age and still defiant and dont even care. Actually youre a sociopath. Look into it. <axiuluo111>: Lol 😆 <tombstoning>: What a sociopath would reply... DING DING DING! :)<axiuluo111>: 😂😂😂", "num_messages": 20, "avg_score": 236.0}
{"start_date": "1538502438", "end_date": "1538572938", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 737, "text": "<Fortify5>: Easy ways to become funny? Not looking for shortcuts, but somethings I can do everyday to become funnier. I know humor is subjective, but some people are all-around funny people. How do I become funnier? <wlee25>: Watch some stand-up daily, pay attention to how they deliver a joke and try to incorporate some of that into your day-to-day interactions.<witeowl>: Just be aware that very, *very* few stand ups actually are coming up with anything on the spot. Robin Williams was likely an exception, and Howie Mandel *might* have been an exception, back in the day. So watch them, learn from them, but don’t necessarily try to emulate them. <jcspresc>: Watching Williams do improv was something else. I feel the same way about *Who's Line Is It Anyway*, they've got some wicked fast minds and if they were into engineering instead of comedy we'd have already colonized Mars.<RhinoMan2112>: There's a whole lot of fantastic improv comedy podcasts like this too, I'm always just as impressed as i am laughing my ass off.<truecrisis>: I have a friend who does improv. Thing is, a lot of it is recycled. When you do it as a profession, you keep running into the same situations and it becomes pretty mechanical. They have a lot to pull from<RhinoMan2112>: Do you mean certain concepts are recycled like \"yes, and..\" or whatever, or literal jokes/scenes/etc? I listen to a good variety of improv podcasts and there are maybe broad concepts that are recycled, and perhaps certain inprovisers use their own styles over again, but i can't say I've noticed recycling to the point where it's no longer unique or funny. <salikabbasi>: link me :D<RhinoMan2112>: You mean specific podcasts? My personal favorite is Spontaneation with Paul f Tompkins. He's a master improviser and always has on a host of funny people to improv with. Show has a great format too. I also love Comedy Bang Bang, teachers lounge, questions for lennon, threedom, the Aunty Donna podcast, might be some more I'm forgetting but those are my go-tos. Hope you enjoy them too!", "num_messages": 9, "avg_score": 81.8888888889}
{"start_date": "1544829850", "end_date": "1544834181", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 10, "text": "<Imnotsure12345>: Is it immature to block someone who constantly ignores your messages? Also people who take like 3 days to reply to *every* message you send. It’s so hard to have any sort of conversation, and I end up losing interest. It’s so insulting because I can *see* that they’ve been online during that time. I find that I end up ‘subconsciously waiting’ for them to reply, and it keeps me in a weird sense of anticipation. If I block them, the problem goes away as I know I won’t be hearing from them again, if that makes sense. For example, I blocked my ex when I needed to get over him, because every time I heard my phone ring, my first thought was ‘that could be him!’ Blocking kinda gave me peace of mind. Also, I’m at a point where I only want to communicate with people who actually put in the effort to talk to me. Would I be immature/overdramatic to block the people who ignore my messages or take 3 days to reply? This has been ongoing for the past few months, it’s not just a recent occurance.<Vativ>: Yes<Imnotsure12345>: Care to elaborate? <Vativ>: Some people just don't reply right away because they are busy and at that particular moment it's not worth their time to reply to you. It's kinda self centered to block them after not responding for a day or two. Just don't message them anymore or call them.<Imnotsure12345>: Hmm yeah, it’s just the annoying ‘waiting’ feeling is still there. <Vativ>: Waiting for what? If you have the urge to block them just act like you blocked them lmao<Imnotsure12345>: Waiting for them to reply.", "num_messages": 7, "avg_score": 1.4285714286}
{"start_date": "1543691054", "end_date": "1543769212", "thread_id": null, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "total_score": 7, "text": "<nomnomr>: I don't know how to fix myself. There are so many things wrong with me that make me terrible at socializing. \\- It is so hard to keep up and act interesting. I have to work so hard to think of something to say, and by then everyone moves on. I freeze up a lot and can't think at all, especially with new people. \\- My personality is poor (child tantrums, fears confrontation, quiet, \"too serious\", etc.) \\- I can't be bothered to talk to people everyday. I dread having to spend the morning with people because I know it will be boring and awkward and it's my fault. \\- I don't use social media often (snapchat, facebook, instagram, etc.) I just don't care and don't have anything interesting to share. &amp;#x200B; Where am I even supposed to start?<Dozer42>: Start off by realizing that your not broken man. We are all individuals and we gotta own that shit. Be yourself and don’t get too caught up if your doing it right. We constantly grow and change as people anyways so it’s not something you have to try too hard at. Let it all flow and just try to enjoy however much time you have left <nomnomr>: It's just hard to remember sometimes, y'know? We can always point out what we should've/could've/would've done after the fact.", "num_messages": 3, "avg_score": 2.3333333333}
