{"start_date": "1330831008", "end_date": "1330855817", "thread_id": "t3_qgppr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 182, "text": "<kinda_alone>: Welcome everyone. First of all, welcome everyone. I would appreciate it if you would spread the word about this so we can get this community to grow. Since I am new to this moderating thing, if you have any tips or advice please message me. **Edit** Over 300 subscribers in a little over an hour. Im thrilled guys. **Edit2** Over 600 subscribers now, so it looks like this subreddit may make it. What are some rules that you all would like to see in the future? **Edit3** Over 1600 subscribers within the first day. It seems like there has been a general consensus that this subreddit should be self-posts only and that all posts should begin TIFU. These are going to be the first two rules we are going to be implementing. Thanks again everyone for the support. Keep the suggestions coming. <Bathroomcrisis>: Today l fucked up and visited r/spacedicks.<cercatrova05>: Just did the same thing. Then tried giving my bf a promised blow job I couldn't get out of. Threw up everywhere and ran out.<JonMW>: I hope you told him that you threw up due to spacedicks, or he may take it pretty badly.<cercatrova05>: He's not a redditor, so he'd probably think I'm off my trolley if I mentioned space dicks.", "num_messages": 5, "avg_score": 36.4}
{"start_date": "1330833771", "end_date": "1330850410", "thread_id": "t3_qgrfz", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 30, "text": "<Drunken_Economist>: What is tifu? I jsut came here from [/r/all](/r/all) . . . what it this place for?<javixm>: It's to share stories of you fucking up :P<Drunken_Economist>: So . . . my memoirs<armaniac>: Welcome! :) I just got here too.", "num_messages": 4, "avg_score": 7.5}
{"start_date": "1330833710", "end_date": "1330834641", "thread_id": "t3_qgret", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 67, "text": "<IchooseYou>: A few weeks ago, I packed my work uniform, lunch, keys and wallet into my backpack and placed it by the door. I then fetched my bike, pushed it straight past my bag to outside and pulled the door shut. That was not a fun shift <kinda_alone>: And so it begins... [deleted]: Somebody had to get the ball rolling<kinda_alone>: And I choose you. [deleted]: Damn straight you choose me", "num_messages": 5, "avg_score": 13.4}
{"start_date": "1330835298", "end_date": "1330891105", "thread_id": "t3_qgsda", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 139, "text": "<kinda_alone>: Last week I thought I had locked myself in my car, and spent a good fifteen minutes freaking out, only to remember that one can fairly easily unlock car doors from the inside <MilwMonstr>: i had a 1987 bmw 325i, you could actually lock someone in if you wanted to. it was 10 years ago, but IIRC, you had to turn the key and pull it out when horizontal. then you could lift up on the little plungers on the door but wouldn't do anything. <rekloki>: My 93 325i is the same way. I locked myself in somehow, and had to climb out of the sunroof to unlock it.<MilwMonstr>: lol, an e36 still had that? interesting. my 97 328i didn't and my current 335i doesn't (although i have never actually used the key to lock the door)<rekloki>: The only way I can lock my doors is to use the key. Even sitting inside I can't lock the doors.", "num_messages": 5, "avg_score": 27.8}
{"start_date": "1330835406", "end_date": "1335559942", "thread_id": "t3_qgsfy", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 577, "text": "<Fusrohduh>: -Tifu, almost potential lock down of school with 3000 people visiting. I work as a police officer, and I was working security at a large multi school function today. Approximately 3000 people from surrounding schools were in attendance for multiple activities. ate lunch, needless to say epic dump proceeded to commence after. As a uniformed officer, shitting is complicated, involving removing all gear and duty belt. in the public bathroom I'm removing my gear and sat my firearm on the shit tickets dispenser, do my business and proceed to reassemble my outfit when my supervisor called me to the far back parking lot, so I hastily gear up and head that way. Halfway across the large parking lot I felt my stomach clench as I reached to adjust my holster...AND THERE WAS NO FUCKING GUN IN IT! I had left my loaded weapon in a public bathroom surrounded by thousands of students. Long story short I sprinted back to the bathroom and by the grace of some deity I dont believe In my gun was still there. That could have been the most monumental fuck up in the history of the department, the end of my career, and personally I am completely ashamed at my lack of focus and firearm safety....but all I can say is today I fucked up.<Talista>: A large school function, 3000 kids. Can I ask why you need to wear a gun in the first place? Is there actually danger of someone doing something that needs them to be put down hard? [although I am thankful for police there to keep order] <Note>: I'm from a country where policemen don't wear guns in public at all<Neebat>: School shootings tend to get wildly out of hand when there is no armed official presence. If you're in a country where firearms are highly restricted, it might work out ok. In the US, crazy people will have guns, so police have to.<Talista>: Ah, thanks for the comments people. The idea of a kid having a gun is just so foreign to me. Or crazy people having guns. Now that I think about it, it terrifies me and I never want to visit there. Except that the candy is so damn addictive...<Osiris32>: Figure it this way. 100,000,000 people in the US own a firearm of some type. 99.99% of them act sane with their firearms. You are just as safe here as you are in any other first wold country.<Insighted_Cuttlefish>: You might want to re-think that 99.99%. It's probably more like, 93%.<Osiris32>: Really? 7 million people use their firearms in an unsafe manner? Hardly. According to recent stats, there were about 55,000 non-fatal, intentional shootings, and 22,000 non-fatal, non-intentional shootings. There were around 33,000 fatal shootings, of which half were suicides. So about 100,000 incidents of firearms being used in a manner which caused some form of injury. So yes, I should refine my number. 99.9% of people use their firearms in a sane manner, not 99.99%. My apologies for being slightly off.<Insighted_Cuttlefish>: Wait a minute. Are you saying they DON'T use their firearms in an unsafe manner? You don't even have to fire your firearm to use it in an unsafe manner. Just the other day I had to call the cops on neighbor for pointing a gun at his daughter and telling her to give him a hug. The daughter was flipping out. He had no intention of shooting her, and didn't, but it's still unsafe firearm behavior. Those kinds of things don't get reported into the kind of data you're claiming. Which also means you can throw in all of those unintentional shootings, because obviously they weren't using them in a safe manner if someone accidentally got shot. It's also possibly to reason that using non-hollow point rounds would be considered unsafe. Using normal rounds have a tendency to go strait through things, and damage the things behind them, while hollow points don't. So exactly how are you going to find, and backup data of all of these different factors? Let's be honest, you can't. There's probably an extremely low percentage of people who are completely 100% safe with their firearms at all times. I don't think many people would argue with that. <Edit>: Haha, man I get stupid when I'm tired. Let me re-work the last bit of this post and get back to you.<Edit>: Fixed?<EatATaco>: He gave you facts and evidence supporting his position. . .you gave a anecdote and a claim that simply owning a certain type of bullet is \"unsafe gun usage.\" Not to mention you threw out a completely unsupported percentage. WTF is wrong with reddit? Why are you getting more upvotes than him?<Insighted_Cuttlefish>: It's probably the thing about me calling the cops on the guy pointing a gun at his daughter. The thing is though, you can't really put things like 'unsafe gun behavior' into data. Or rather, you could, but we don't have data like that. (or at least not where we're looking) So the argument was kind of useless anyways, even with his illusion of 'evidence'.<Fat_Muslim_Kid>: Nobody is 100 percent unsafe with anything. Everyone who drives a car speeds at some point. Every person who has a gun may point it in the wrong direction or accidentally discharge it. At the end of the day a gun is a tool. Don't be afraid of it, respect it. Sure people might handle it outside the boundaries of safety. The fact remains that 99.9 percent of the owners don't have an accident. If drivers of cars could get to that number, we wouldn't even worry about airbags and seat belts. <Aegi>: I agree with you 99.9%, I just wish you would not be hypocritical and not use all encompassing words like 'everyone'.<Fat_Muslim_Kid>: My apologies. I do think that the use of such words shows a weak argument. If I could rephrase it, I would say the overwhelming majority and not \"everyone\". Thanks for pointing my mistake out!<Aegi>: Hey, no problem. Thanks for being awesome about it!", "num_messages": 14, "avg_score": 41.2142857143}
{"start_date": "1330836427", "end_date": "1330882421", "thread_id": "t3_qgt3d", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 44, "text": "<ShNaeb>: TIFU car \"broke\" down at a junction Not really today, but still a massive fuck up. I thought my cars engine died on me at a busy junction when I was hungover - I was trying to drive to work. I sat there for 5 minutes or so with my hazard lights on panicing. Then I realised I'd just stalled the car and had no idea... TIFU<kirchow>: First time I drove by myself in a stick I was the first car at an uphill, very busy red light. The light turned green. I then proceeded to stall out 5 straight times while every car behind me honked their horns to the fullest extent. Finally I got into first without fucking up and made the light just as it changed from yellow to red. Sucks for them, but hell I finally made the light so I didn't care.<imightlikeyou>: At first i didn't get this, then i remembered Americans or lazy bums and normally use automatic.<Retanaru>: Actually you have to try quite hard to find a standard here. So most people don't even have a chance to learn.<imightlikeyou>: It was mostly a failed attempt at being funny.", "num_messages": 5, "avg_score": 8.8}
{"start_date": "1330837406", "end_date": "1330860042", "thread_id": "t3_qgtp4", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 77, "text": "<fartonme>: Last semester I was in my dorm and I decided to make cup noodles. Forgot to add water. Microwave filled with noxious smoke. Room soon followed. Opened the door and it spilled out into the hallway and set off the fire alarm. Evacuated an entire dorm-full of pissed off freshmen. Everything belonging to me, my roommate, and my two suitemates smelled of smoke for weeks. Microwave still in use but the inside looks like a warzone.<lizteach>: TIL that dry microwaved noodles are possibly the only microwaved substance worse than burnt popcorn.<GWMcLintock>: some girl put a cup of easy mac in our break room microwave without water and its worse than burnt popcorn could ever be.<shalene>: My little sister did this with ramen. They came out black and ruined our tupperware. We buried it in the backyard so our parental units wouldn't find out. Too bad the house was still filled with smoke when our dad got home ._.", "num_messages": 4, "avg_score": 19.25}
{"start_date": "1330837715", "end_date": "1330909875", "thread_id": "t3_qgtvr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 249, "text": "<OttoBSleeping>: Drove to work...forgot and took bus home. Parked in a paid lot too, so I had to pay for two days. grrrr.<ABear123>: Similar for me, Forget I parked in spot right outside of classroom building. Take school shuttle all the way to parking garage on other side of campus. <daderade>: your school has parking lot shuttles? We hardly even have parking lots!<ABear123>: Ya at UM, we have a shuttle that goes around the school.", "num_messages": 4, "avg_score": 62.25}
{"start_date": "1330836039", "end_date": "1330892173", "thread_id": "t3_qgstx", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 173, "text": "<jeremyrs>: Unrolled tootsie roll, put wrapper in my mouth and threw the tootsie roll away Wasn't today, but I remember doing this<bruzdnconfuzd>: If it was one of those mutant fruit bastard variety, then you did it right.<magnetnerd>: Hey, those are delicious, the only time I get those is on the 4th of July parades.<piexil>: The vanilla ones are so damn good.", "num_messages": 4, "avg_score": 43.25}
{"start_date": "1330838793", "end_date": "1330842828", "thread_id": "t3_qguiq", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 10, "text": "<Nosrep>: Today I took a shower and uncharacteristically grabbed my body wash before my shampoo. I didn't realize my mistake until i had started massaging it through my hair. <lizteach>: Not a FU unless you LEFT IT IN YOUR HAIR.<AAAAAAAAAAAAAAAAAAHH>: The damage had been done", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1330843374", "end_date": "1330879874", "thread_id": "t3_qgx27", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 22, "text": "[deleted]: TIFU: Took a shower, public university bathroom 12 doors down, forgot my towel. <ez617>: This happened to me my freshman year, had to use my tshirt to dry off.<warboy>: Only freshmen year? Well I feel bad now.<ez617>: Well....it did happen to me just the other day, but I have a private shower now so it doesn't really count.", "num_messages": 4, "avg_score": 5.5}
{"start_date": "1330843066", "end_date": "1330847408", "thread_id": "t3_qgwwv", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 10, "text": "<WheelOfFish>: That's not my alarm clock, that's a fire alarm. Way back when I was a freshman in college I was awakened by a shrieking noise. I sat bolt upright in my bed and began smashing my alarm clock with great intent. My roommate eventually sat up and basically started yelling at and cheering me on as I continued to assault my alarm clock for making the most unpleasant noise. It took us a good thirty seconds to a minute of this to realize that it was not my alarm clock going off. We eventually saw the alarm lights from the dorm hallway flashing under the bottom of our door (they have strobes for the many deaf students at the university I went to). In our 4AM stupor we eventually acquitted the alarm clock of all wrongdoing and went outside to wait for the building to stop shrieking and blinking so we could go back in and go back to sleep. Side story that reminds me of: There was also the one time one of my friends had to come outside during an alarm while she was showering. She was wearing nothing but towels. In the middle of the winter. She was feeling a tad cold.<warboy>: I've done that with my phone alarm. I have an alarm clock in my room that I never use that I set my phone beside with my actual alarm. Far to many mornings have been spent with me trying to fucking kill my alarm clock.<WheelOfFish>: I have both my alarm and my phone by my bed and I often use both. My phone plays Yakety Sax and my alarm is silent, it's actually one of those models with the vibrating puck you put under your mattress. I have often been smacking at the wrong one when I'm trying to get another few minutes of snooze time.", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1330842768", "end_date": "1330862890", "thread_id": "t3_qgwri", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 16, "text": "<BraileZ>: TIFU frozen pizza Was hungry put a frozen pizza in the oven without taking it out of the shrink wrap didn't realize till it was too late.<warboy>: You still ate it, right?<fenixjr>: of course he did, what kind of a fool would throw out a pizza?<BenjaminGeiger>: Doesn't matter, had pizza.", "num_messages": 4, "avg_score": 4.0}
{"start_date": "1330845814", "end_date": "1330955062", "thread_id": "t3_qgy6m", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 59, "text": "<TimePanda>: I stopped at a green light today After coming to a complete stop, the wife says \"uhh, it's green...\"<Pinky676767>: I was visiting my girlfriend at collage for the first time last week stopped at two green lights then ran a red one... A cop was following me the whole time And was not very impressed<Flanman1337>: should have told him it was opposite day.<Pinky676767>: This is true", "num_messages": 4, "avg_score": 14.75}
{"start_date": "1330853575", "end_date": "1330892700", "thread_id": "t3_qgyvy", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 3, "text": "[deleted]: I just went to zeds dead! In Saskatoon.<velidb>: went to the one in chicago! zeds dead is amazing. [deleted]: It was the first time I broke out my PK earplugs. Daaayymm.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1330843270", "end_date": "1330955563", "thread_id": "t3_qgx0g", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 98, "text": "<Peter100000>: TIFU my roommate's sex-skype with his girlfriend, because I farted too loud. His girlfriend thought they were alone, i promised my roomate i wouldn't make a noise. (I was playing skyrim in my room) I thought it would have been a silent one...<CoconutCurry>: Wait, either he said he was alone and he was in your room having a sexchat... which isn't okay for several reasons, OR you farted loud enough to be heard in another room? WUT?<Peter100000>: Fart so loud, heard from his room. <Phishywun>: Ha, riiiiiiiiiiiiiiiight. This reminds me of my freshman roommate in college who was so addicted to WOW he would NEVER leave. Not even for class or eating. So I'd bring a girl home every now and then on a Saturday night and he'd just put his headphones on. I'm probably on a weird fetish porn site somewhere.", "num_messages": 4, "avg_score": 24.5}
{"start_date": "1330843551", "end_date": "1330850476", "thread_id": "t3_qgx50", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 15, "text": "<WiseGuySteve>: Ran into a door, but it gets better... Today I was walking into my dorm building and noticed this one particular girls butt was pretty much hanging out of her sweatpants. Whilst starting at said butt someone was holding the door open for me, of course I didn't notice this and ran straight into the door... <hurdur1>: Doesn't matter; ogled ass.<armaniac>: Might matter. I wouldn't fuck my face up over a cute girl unless there was sexytime involved. <edit>: tyop", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1330842309", "end_date": "1330851175", "thread_id": "t3_qgwij", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<hb_alien>: TIFU - Mixed up garbage disposal with my plate. This morning I made scrambled eggs, bacon and sausage. I took the pan off the burner and dumped it's contents right into the sink. Ended up having a smoothie and toast for breakfast. While making said smoothie I pured in grapefruit juice instead of OJ and my smoothie tasted like shit.<hurdur1>: You can still eat it if you trust your sink. I would have even if it fell on the floor. Even dirty scrambled eggs, bacon, and sausage taste great. Also, I'm lazy.<hb_alien>: Most of it want into the garbage disposal. I did get a piece of ham that stuck to the pan though :)", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1330847889", "end_date": "1330850807", "thread_id": "t3_qgz2k", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<leftundone>: TIFU: I transported my PC to a friends house an hour away for a LAN party, only to forget my monitor's base. Didn't have anything to prop the monitor up with so I couldn't use it.<hurdur1>: Two large textbooks? Or phonebooks? Or just put it against a wall?<leftundone>: The way my monitor is, the base is simply a circle shaped base that you slide the rest of the monitor into (the \"L\" shaped part of it is connected to the screen, you slide it into the base) so it won't stand up on it's own, you'd have to shove the L part into some styrofoam or something.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1330848391", "end_date": "1331147909", "thread_id": "t3_qgz9k", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 9, "text": "<thisisaninch>: A couple days ago I FU'd by flipping my hair at high velocity and smoking myself in the forehead with a mop handle. I still have a giant goose egg and a bruise, right in the middle of my forehead, to remind me how much of an idiot I was. :(<shuazien>: Pics or it didn't happen... (c'mon, you should've known this...)<thisisaninch>: Hahahah, I would if it was anywhere but on my face. I have a very recogniseable forehead... And I'm impressed that you just erased my past, can you erase the last 7 years of my life pls?<shuazien>: Destroy all the evidence.", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1330848876", "end_date": "1330884661", "thread_id": "t3_qgzfu", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 8, "text": "<KlumzyNinja>: How many of us are from r/trees? <armaniac>: Nice try, officer.<KlumzyNinja>: Lol. These just seem like things I'd do when I'm high", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1330850415", "end_date": "1330942768", "thread_id": "t3_qgzzo", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<TyrannicalDuck>: TIFU - Jumped into the swimming pool while still wearing my sunglasses [deleted]: OH GOD<TyrannicalDuck>: I KNOW, RIGHT?!", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1330854389", "end_date": "1330979490", "thread_id": "t3_qh1bb", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 106, "text": "<DumBum>: TIFU - Fell asleep on the bullet train, got locked inside It didn't happen today, but I normally commute to downtown to meet up with a friend or two. That day though (maybe two weeks ago), I got so tired though that I fell asleep on the train. I woke up about an hour later after we had arrived at the final destination, and everyone had left. I got my stuff, walked down to the door, but lo and behold, it was locked. I tried pulling on door handles and hitting the emergency open button, but they didn't work. I started getting freaked out. I walked around the train trying to find a way out. I found a number first for \"suspicious activity\" but apparently it had been disconnected a while ago. I tried the emergency exit, but I'm so weak and feeble that I couldn't manage to pull the rubber off the window to get out. I, then tried calling my friend that I was meeting up with, but he had his cell phone off. I started hyperventilating because I started getting claustrophobic and eventually passed out 10 minutes later. Yeah, I woke up in a hospital **TL;DR: Fell asleep on a commute train to downtown, got locked inside, hyperventilated, and woke up in a hospital**<dimcoin>: A bullet train in Japan? There is NO WAY you would had been left onboard the train, they are swept by conducters/train personnel to make sure they are empty after arriving at their final destinations. Source=Rode bullet trains in Japan and lived in Japan for 3 years. <DumBum>: This isn't the bullet train in Japan. It's the Caltrain from San Jose to San Francisco<OptimusPrimeTime>: A bullet train that is not. Doesn't that train take something like an hour?", "num_messages": 4, "avg_score": 26.5}
{"start_date": "1330836200", "end_date": "1330889859", "thread_id": "t3_qgsxr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 45, "text": "<olithraz>: TIFU Decided to solder a large wire at school... Right under the smoke detector. Good thing it was a weekend... The firemen just laughed at me, as did my team mates.<thecolorplaid>: Don't sweat it, dude, the year 12 chemistry class at my school has set off the fire alarm about 4 times now since December.<olithraz>: Yeah I found it pretty funny.", "num_messages": 3, "avg_score": 15.0}
{"start_date": "1330856507", "end_date": "1330946276", "thread_id": "t3_qh1wz", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 51, "text": "<VonBrewskie>: Popped the top off a Newcastle Ale...directly into my eye...there's more.... Tried to set the bottle down too fast. Broke the bottle. Glass fell to the floor. I wasn't wearing shoes. Cut my foot. I'm just sitting here, clutching my foot and waiting for the asteroid to bounce of my neighbor's car into my face...<fenixjr>: I CAN'T BELIEVE YOU WASTED A NEWCASTLE<imightlikeyou>: Well, it's not a very good beer.<fenixjr>: A year or so, i would have been completely outraged by this statement. But truthfully i pretty much agree with you now, however, even still who would care if he wasted some bud light vs newcastle?<imightlikeyou>: Bud light isn't even beer.", "num_messages": 5, "avg_score": 10.2}
{"start_date": "1330864793", "end_date": "1330870229", "thread_id": "t3_qh41q", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 60, "text": "<lowfrequency1>: Got a jinormous erection in the WORST place!! I fell asleep supine (on my back) on my friends gf's bed, with both of them in the room, wake up and I immediately feel this huge sleep boner. I open my eyes to see the damn thing and the two of them smirking at me. AWKWARD<Magrias>: And here I was thinking you meant it was on your face or something. Disappointed. [deleted]: Damn face erections, always when you don't want one they pop up", "num_messages": 3, "avg_score": 20.0}
{"start_date": "1330853973", "end_date": "1330920834", "thread_id": "t3_qh16c", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 74, "text": "<aardvark445>: Left my new 800 dollar laptop on the hood of my friend's car. Saw something fly past the sun roof and thought \"What the fuck was that?!?!\" It was a total loss. Only it's RAM lives on. <bobicez>: Wait. What happened?<aardvark445>: We were drinking at the lake. Met up with some fun ladies and got a little distracted. Then as we were loading up our stuff, I had an armful of supplies and put the laptop on the hood so I could open the door. Our new acquaintances drove by on their way out. I waved, and suddenly thought \"hold on, they didn't even clean up all their shit off the beach.\" I couldnt believe it. They'd left a pile of trash on the beach. Just threw it all under the bushes. So we cleaned it all up and threw it away. So then we're headed down the road at about 45 mph and I see this bird/bat thing fly past the sun roof. I jerk my head and yell \"WTF was that!\" Then, slow motion facepalm.<bobicez>: Ahhh now I get it lol.", "num_messages": 4, "avg_score": 18.5}
{"start_date": "1330860468", "end_date": "1333874679", "thread_id": "t3_qh2wq", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 20, "text": "<karlstar>: nevermind TIFU, everyday I do something borderline retarded. a whole buncha shit i do. * pour cola into a bowl * cereal into a cup * put milk in cupboard, cereal in fridge * get fork with cereal, try to eat cereal with fork, realise my mistake * where are my shoes? i'm wearing them... * lose my iPod, give up hope, a week later find it under my pillow, the fuck? * wear shorts when it's really cold, i just don't think about the weather at all, people ask me if i'm crazy, i just use my norwegian heritage as an excuse to not look stupid as fuck. * what day is it? friday. oh... 2 hours later. what day is it? * bought a return ticket for the bus, walked home anyway. * panic 'cause i think i left my bag on the bus, it's in the hallway * go to the shop, what did i come here for? oh well, time to buy some cookies. get home, need to poop, no toilet paper, FUCK. always forget what i went down there for... * fall asleep watching porn, parents laugh at me, feels bad man. * i forgot to brush teeth and shower * turn off alarm in sleep, wake up late, fffuuuu I can't be the only one who does this shit regularly judging by this subreddit. :D <brawnzo>: DOod I put cereal in a cup all the time I do t eat it from a bowl anymore bc it's so convenient. Just get a big cup add some milk a spoon eat the rell and drink up the milk<brawnzo>: Edit: dont*<desktop_ninja>: That's the one thing you choose to edit?", "num_messages": 4, "avg_score": 5.0}
{"start_date": "1330853339", "end_date": "1330906026", "thread_id": "t3_qh0ys", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 32, "text": "<lvlegabyte>: TIFU when I opened the door to the wrong car that was to pick me up. Not having a car I have a friend come pick me up from work sometimes. I work at the mall during after hours (10pm -3 am). A car comes down I open the door and sit in then hear a scream. Then I had to explain I thought they were my ride - same car same color and same dark tint so I couldn't see inside. Yeah, never felt like a creep as much as I did then...<GeneralStreck>: Something like this happened to a guy I know. He went in to the store for a minute while his wife was waiting in the car. When he got out he just got in the drivers seat of the first car that looked familiar. He can't get the car started, cause the keys don't seem to work. At that point the lady in the passenger seat starts laughing hysterically and says \"You don't really look at your wife all that much, do you?\" Turns out he got into the only other identical car in his small town. [deleted]: For some reason this one broke me up. Thanks for the laugh.", "num_messages": 3, "avg_score": 10.6666666667}
{"start_date": "1330890933", "end_date": "1330912541", "thread_id": "t3_qhhk3", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 33, "text": "<canipaybycheck>: New rules- trial period Hey everyone, I am your new mod, and I'm getting ready to implement a couple of new rules. I would love your feedback in the comments. Here are the rules: 1. Every post must begin with \"TIFU\" (similar to TIL) 2. Only self-posts. Any more suggestions for rules are greatly appreciated. Also, we might get an FAQ going soon.<jimaug87>: I suggest a new rule! There should be some shock criteria to the posts. I.e. i put my shoes on before my socks That's lame, and just something I pulled out of my ass. You get the idea. The cop that left his gun in the bathroom was great. There's shock factor, and he *actually* fucked up. It was related because we've all had to hustle somewhere and forgotten something. I have a good example from a few years back: We're moving shit out of a house and into a truck. The truck is partially blocking the stairs so i hopped in to back it up 5 feet. Just nudge it out of the way. I didn't see the $10,000 glass, triangularly thing behind the truck. I lucked out and went on \"probation.\" Which just means if you fuck up again you're fired. <Edit>: There should be a moment of realization where your only thought is, \"fuck. .\", and the terror that subsequently runs through you. The cop reaching at is holster, or me hearing that glass shatter and fall to the ground. <kinda_alone>: If enough people want this we can add it, but just remember good sir, that you do have the magical down vote to do your own moderating.<jimaug87>: I just found this sub tonight, and that's what I was doing as I went through the pages. I noticed a trend in my voting and added my 2c. I'm looking forward to this betting bigger and forming a personality. <kinda_alone>: The formation of a personality is something I am really looking forward to. And as this gets going, I have a feeling that posts will gradually shift in in a more interesting direction. If not, we can always add the rule. Thanks for the suggestion, and of course thank you for helping us get this going. I really appreciate it. <jimaug87>: I can see that I was a little short sighted after the feedback. I wish I could post something, but I didn't fuck anything up \"today\", and posting prior experiences would be out of the nature of the sub. <kinda_alone>: Haha your fine man, if anything my response sounded a little critical when it wasn't supposed to be. And as for not having anything to post? That's kind of a good problem to have isn't it?<jimaug87>: I'm having a first world problem? I fuck up a lot, and I want to post to reddit, but nothing went wrong today. Sad face.", "num_messages": 8, "avg_score": 4.125}
{"start_date": "1330889068", "end_date": "1330992732", "thread_id": "t3_qhg7o", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 3, "text": "[deleted]: I poured my milk into the bowl before the cereal. <Twad>: What's wrong with that?<Magrias>: Imagine a pool. Now imagine you throw a class of students into it.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1330892947", "end_date": "1334107434", "thread_id": "t3_qhj2a", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 19, "text": "<CollectionOfAssholes>: Was waiting for the light to turn green, only to realize that I was at a stop sign. Was there for a good two minutes. [deleted]: I had a stoner friend who got pulled over by a four-way stop. He went through the intersection, looked in the mirror, and saw a flashing red light. He panicked, pulled over onto a sidewalk, and frantically tried to get his registration and insurance card out. He sat there for at least ten minutes, hands on the wheel, freaking out, wondering why the hell the cop was toying with him, totally afraid to look back to see what was taking so long. He finally looked back... and there was no cop. Just a flashing red street light. [deleted]: Sounds terrible. I woulda lost my shit.", "num_messages": 3, "avg_score": 6.3333333333}
{"start_date": "1330901568", "end_date": "1330904074", "thread_id": "t3_qhpf5", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<solareon>: TIFU - I lost my rental car keys I lost the keys to my rental car while at the gym. Took over 5 hours to find them. Was the greatest feeling when they were found.<b2717>: Where were they?<solareon>: when my phone fell out of my pocket as I was putting my jeans in my gym bag the key must have fallen out as well and went underneath the stall. I remembered to pickup my 700 dollar phone but not the keys to the 20000 dollar rental car.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1330907556", "end_date": "1330909658", "thread_id": "t3_qhtmu", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 12, "text": "<JesusofTorn>: TIFU by destroying a brand new £200 A/ T tyre I was working on my dad's Land Rover, he needed a bit of bumper grinding off for better ground clearance off road. I did the left side no problem because the wheels were on full right lock. Went round to the right side, started griding and suddenly, I heard a massive bang and the car started sinking, looked at the tyre, and there was a nice, neat slice right across the inner sidewall. I hadn't turned the wheel to full left lock and I'd just put an angle grinder blade through it.<kinda_alone>: I can't imagine you father was too thrilled [deleted]: His anger levels were rather high, he was nearly at the point of beating the crap out of me with a jack handle.", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1330928652", "end_date": "1330996602", "thread_id": "t3_qhl18", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 12, "text": "<Theonenerd>: I subscribed to this subreddit before it was popular.<leftundone>: I lurked this reddit before it was popular.<kinda_alone>: I created this reddit before it was popular.", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1330908574", "end_date": "1330930171", "thread_id": "t3_qhuf0", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 199, "text": "[deleted]: I went to smack my dog on the butt, he moved and my finger went right in his pooper. [deleted]: He probably didn't even have you sleep on the couch. Why can't women be more like dogs.<I_Will_Allow_This>: I thought women liked it when you do stuff like that. <OneNationUnderCCTV>: Not all of us allow that.<fiveifrenzy6>: booooooooo", "num_messages": 5, "avg_score": 39.8}
{"start_date": "1330894976", "end_date": "1330913449", "thread_id": "t3_qhkm1", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 20, "text": "<kanguen>: Tifu, punched myself in the eye while trying to shoo a moth. I said all there is, though it was not just a finger slapping it, I literally punched it. Had to put ice bag on it for about 30 mins.<jimaug87>: I'm no masochist, but I find fun in doing something to myself I can't normally do. You punched yourself harder than normal people can consciously do. You got to experience giving and receiving. <kanguen>: I don't know why but I was never bothered by the pain it gave me, just jokes and giggles it was. I guess it is fun to experience things like this once in a while. I can't remember the last time I laughed for an hour without a break.<jimaug87>: Exactly! It's not that bad. Our bodies have built in pain meds.", "num_messages": 4, "avg_score": 5.0}
{"start_date": "1330907003", "end_date": "1330964154", "thread_id": "t3_qht8j", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 13, "text": "<LadyLurksAlot>: TIFU: Realized my pizza was done; kept surfing reddit until it was burnt. I was re-heating my pizza in the oven, and could tell by smell it was done. \"Okay, just this last link...\" Finally the smell of charcoal caught my attention. Dammit, Reddit. A couple bites were still edible, but most of it was too hardened to even bite into.<Mr_Pockets>: In my opinion, this is barely a fuck-up. [deleted]: I agree, to call your reddit addiction a fuck up is bad.", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1330912265", "end_date": "1330998520", "thread_id": "t3_qhx5y", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 24, "text": "[deleted]: TIFU - I made my dog pee in the house Every night before my family goes to sleep, we have to let the dog out to pee for the night. Well, one night I was coming home late and it fell to me as the last person up to let him out. It was late, and I forgot. I woke up to my mom's outraged scream as she discovered the brand-new wet spot on her $5,000 rug. Apparently he woke her up with his violent shivering (sometimes he sleeps in my parents' bed) from having to go so bad and she rushed downstairs to let him out. She didn't make it. Needless to say, she made sure to make me feel like shit about it. What was probably the worst part was that my dog looked like he had just been kicked after he did it; he thought it was completely his fault.<ubadeansqueebitch>: thats what your mom gets for spending 5g for a piece of carpet to walk on. [deleted]: Trust me, it's worth a lot less now. It wasn't the first time something like that had happened, and our dog likes to run around a lot. With toenails.", "num_messages": 3, "avg_score": 8.0}
{"start_date": "1330922226", "end_date": "1330994466", "thread_id": "t3_qi4lr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 17, "text": "<warboy>: IFU awhile ago and totalled my car in my girlfriends driveway by hitting her car Let me set the scene for you. My girlfriend and I both live out in the country. She practically doesn't have any neighbors because she is so far away from the road. So we both go to the same college and at the time both commuted together. It was a fine system until the perfect storm arrived. Cue me being a normal irresponsible dumbass. I was running late as usual and didn't bother calling beforehand to tell her that. It was soon after I leave I quickly realize I have forgotten my cell phone and that if she wanted to call me or if I wanted to call her it was a mute point now. I finally get to her driveway like 10 minutes late. Now her driveway is long and about as straight as Neil Patrick Harris and I think her family has strategically placed obstacles restricting sight around the corners. Here's me running 10 minutes late putting what Grand Turismo taught me to the test. Take the first corner way far inside like a bauss and at just the right time there's my girlfriend derping down her drive on her actual side of the driveway. The same side I'm on. I didn't have anywhere I could go on account to the old rusty shed that was the fucker blocking my view and I cite that fact to her on a regular basis. She tried to swerve though and I basically ended up hitting one of her headlights with my radiator. Let me tell you, the crumple cars on my car worked fucking awesome. All in all, my car was totalled for good and her car needed a new headlight, bumper, and a fluid reservoir. That was about $600. And that's how I totalled my car in a fucking driveway.<thecheat1>: *moot point <http>://en.wiktionary.org/wiki/moot_point<warboy>: The more you know", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1330924343", "end_date": "1330977684", "thread_id": "t3_qi64k", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 26, "text": "<kinda_alone>: TIFU needs a logo First of all, thank you everyone for the successful first day. Second, as the title may imply, we need a logo. If anyone has any ideas or entries, please submit them. Please up vote this self post for which I get no karma so that others may see it. Also, if any of you guys could actually design one that would be awesome considering how I am perhaps the least artistic person on earth. <blueasclepius>: Perhaps a reddit alien wearing socks in the shower, looking down at his feet disdainfully?<Reikael>: [Quick attempt](http://imgur.com/OHOoS).<molliepop351>: that happened to me once...", "num_messages": 4, "avg_score": 6.5}
{"start_date": "1330916966", "end_date": "1330976906", "thread_id": "t3_qi0pr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 50, "text": "<reppit>: TIFU: Was leaving work, put my topcoat on, my hand slipped on the silk lining and I punched myself in the face. I have a bruise on my face. <tomkzinti>: This sounds more like /r/firstworldproblems material, but sure. Just...how? How do you punch yourself putting on a coat?<reppit>: I had one arm in my sleeve and when I wanted to put my other arm through, I held the collar to put the coat around me, it slipped and I hit myself. It sounds ridiculous but I can't find any other way to describe it. I was wearing a suit so I was kind of restricted.", "num_messages": 3, "avg_score": 16.6666666667}
{"start_date": "1330954198", "end_date": "1331004883", "thread_id": "t3_qiixm", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 178, "text": "<bathedinsanely>: TIFU. Tried to cough discreetly into my shoulder, ended up horking a massive loogie down the front of my dress. My friend was telling me a story, and I felt a little tickle in my throat. I knew I needed to cough, but I didn't want to interrupt her, so I thought I'd pull my shirt up and cough into my shoulder. This stream of thought came to me very quickly, before I realized that I was wearing a fairly low-cut dress, so I ended up jerking my head down, which surprised me, turning my gentle cough into a hefty phegm-laced bark. My friend stopped talking and looked at me, horrified. I apologized for the noise, but she shook her head. I looked down, and saw that I had spit all down the front of my dress, sticking it to my chest from the inside. Then I got up and walked home, because fuck that shit. <Family_Guy_Ostrich>: Hilarious story, and your delivery is most excellent. Why? Because fuck that shit. <thekid_frankie>: I agree. Fuck that shit.", "num_messages": 3, "avg_score": 59.3333333333}
{"start_date": "1330966099", "end_date": "1330978996", "thread_id": "t3_qiq93", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 83, "text": "<Spiderdan>: The DIFU: Leaving campus for spring break and lock myself out of my car. When I finally get in, I drive 70+ miles home before I realize my I left my computer sitting in the parking lot. Locked my keys in the trunk. Spent an hour and a half waiting for AAA. Finally got keys. So ready to go home. Get in. Drive. Get home an hour and a half later. [My face when my parents ask me where my computer is](http://www.myfacewhen.com/203/). <DevilWorshipper>: So did you get your 'puter back?<Spiderdan>: Yeah I called campus police to go look for it. They were unwilling and ready to write it off as gone for ever (it *had* been about 4 hours). But one of the patrol guys found it lying in the parking lot looking forlorn. I drove up the next day to get it and I'm typing this response with it write now about a year later.<THMJ>: PHEW I came here to console you. This is a relief.", "num_messages": 4, "avg_score": 20.75}
{"start_date": "1330981435", "end_date": "1332561287", "thread_id": "t3_qj2no", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 18, "text": "<tomkzinti>: TIFU by replacing a leaky toilet fill valve. Now the old tank seal is leaking everywhere, I had to turn the water off and I HAVE TO POOP! I think the title says it all. I'll just be outside in the rain behind the rhododendron bush with a roll of mountain money for a bit...*sigh*<InSorteDiaboli>: Im surely too late to be helpful but if you fill A bucket and pour it in the bowl after you do your business it will flush down without issue.<golgiolgiwoeisme>: make sure its almost boiling water. also you could uncurl a coat hanger and jam it into the toilet, breaking up the structural integrity of the turd.", "num_messages": 3, "avg_score": 6.0}
{"start_date": "1331017829", "end_date": "1331140367", "thread_id": "t3_qjvlu", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 41, "text": "<bnm3424>: IFUO; A necklace leads to what was probably a minor concussion. While getting ready for my first date I was putting on a necklace. At the time I had really long hair and so, I flipped my head over to do the clasp, at which point I knocked my head off of the bed post. I landed in my desk chair, not on purpose, and was very confused about how I had gotten there... Got up, flipped my head again and fell on to the bed... decided to get my mom to put on the necklace. I suffered major fatigue on my date and nearly passed out in the July heat on a couple of occasions. I had my first real kiss with my first \"serious\" high school boyfriend with a MASSIVE headache due to what was probably a minor concussion. [deleted]: Wait - I don't understand \"I knocked my head off of the bed post\"..<neanderthalman>: Certain bed styles have four legs that extend up past the head and foot board and end in a ball, knob, or other decorative flourish. This leg, upon top of which the bedknob sits, is called a bedpost, and is often about 3 or 3-1/2 feet tall. When bending over, she smacked her head against it. Because she was bending over forcefully so as to whip her hair forward, she hit it rather hard.<bnm3424>: What they said, in the case, the bed post was a bit taller because the bed was the bottom half of a bunk bed. And metal. I had a headache for weeks.", "num_messages": 4, "avg_score": 10.25}
{"start_date": "1331050390", "end_date": "1331055879", "thread_id": "t3_qk9wx", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 24, "text": "<Illpackallama>: LNIFU Was eating dinner and nose started to itch, so I scratched it with my fork and kept eating. I was talking to my wife at dinner last night, and my nose began to itch on the inside. Not really thinking, I proceeded to use the fork to scratch the inside of my nose, and then continued to eat. Meanwhile my wife is giving me a horrified look from across the table. It took a good 10 seconds to realize what I had just done. I'm ashamed of myself. And the fork will never be the same again.<rvauofrsol>: That sounds very much like a fat person thing. Are you fat?<Illpackallama>: Not sure if troll or being serious...", "num_messages": 3, "avg_score": 8.0}
{"start_date": "1331055614", "end_date": "1332912069", "thread_id": "t3_qkdy6", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 527, "text": "<b0w3n>: I went to fart discreetly at my desk at work. I shit my pants and stained the chair. title says it all<Illpackallama>: When you're running into first, and you feel something burst...<spazmodic->: When you're pulling into home and your pants fill with loam... [deleted]: When you're sliding past third and you you catch a whiff of turd...<fiveifrenzy6>: When your rounding second and you feel your bowels beckon...<siegewolf>: When you're running past short stop and feel a little plop.<theillinestvillain>: If you're climbing up a ladder and hear a juicy splatter... <hellcrapdamn>: When you're lookin' at an otter and you feel that doo doo water...<boronosaurus>: When you're sitting on the john, and the toilet paper's gone...<Benjy741741>: Use your hand<TR-BetaFlash>: That was like the period at the end of an incredibly long sentence.", "num_messages": 11, "avg_score": 47.9090909091}
{"start_date": "1331085077", "end_date": "1331096055", "thread_id": "t3_ql1ok", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 24, "text": "<starrynightgirl>: TIFU I yelled at my father for picking up my phone calls and he left the apt sadden I dont care that he wanted to greet my boyfriend, I really really really hate when someone picks up my phone calls and starts to have conversations with people that wanted to talk to ME. It makes me feel like my privacy was being violated. I REALLY let him have it. He was shocked at how angry I was and left the apartment without saying a word. I don't think he's coming back. I feel so cruel. Even my sister came up and told me how over the line I got with him. I am just so angry on the inside. but I know I really really fucked up and I now I feel so stupid.<HighAllTheTime>: [starrynightbatgirl](http://i.imgur.com/j1sOY.jpg)<starrynightgirl>: you made me smile! :)<HighAllTheTime>: [Successberg!](http://i.imgur.com/N6bcK.jpg)", "num_messages": 4, "avg_score": 6.0}
{"start_date": "1331134656", "end_date": "1331422360", "thread_id": "t3_qltg8", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 107, "text": "<ikifoo>: TIFU... set a floppy disc drive on fire. I was re-assembling an old computer. Plugged in the floppy drive and turned the computer on to witness a bright red light and smoke. Turns out if you put the power plug in upside-down, you get fire. In my defence... it was an old drive which actually let you plug the power in upside-down, (no guard on the port) no indication of which way it should go, it was dark inside the case and I wasn't paying much attention - it wasn't worth a lot of money or anything. The SECOND time was out of sheer stupidity.<NatecUDF>: I fried a MB and a SIMM by not realizing I had cut my finger and bled on the contacts before installing the SIMM. That was a nice smell. [deleted]: I love the smell of burning human blood, not so sure about burning electronics though.<NatecUDF>: Yeah, the combination is not olfactorily pleasing either.", "num_messages": 4, "avg_score": 26.75}
{"start_date": "1331146254", "end_date": "1331173311", "thread_id": "t3_qm2jr", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 37, "text": "<actually_a_wolf>: TIFU and crashed someone else's bike into a car i'm short, and my friend is of average height. i went to borrow her bike so i could ride with my friend to the campus center to pick up food. i forgot that i am short. my legs barely reached the pedals and i ended up losing control of the bike and crashing it into a parked car in the parking lot outside of my dorm. i hit my head on the handlebars and gave myself one hell of a headache. still got food, though.<armaniac>: You... forgot that you were short? o:<actually_a_wolf>: i forgot that bike seats for normal people descend only so far, and that being five feet tall is not very good for normal people activities<armaniac>: Okay. That all checks out. Have some upvotes and be on your way. Just watch for cars.", "num_messages": 4, "avg_score": 9.25}
{"start_date": "1331159131", "end_date": "1331246077", "thread_id": "t3_qmdcw", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 100, "text": "[deleted]: TIFU. Plumber working on my pipes, told us not to flush any toilets. Completely forgot and took a piss and flushed the toilet. He's face down in a hole then all of a sudden he gets covered in toilet water and piss. Fuck. I'm hiding and am scared to confront him.<Matt872000>: I'm curious as to why they didn't turn the water off to do this...<furiouspanda1>: Toilet flushes from the tank, which would already be filled before the water is turned off, hence is still flushable. Did this to my dad once - he was not pleased.<wheresmyhouse>: So, if you close the inlet valves and then flush the toilet before starting work, wouldn't that make it unflushable?<furiouspanda1>: Correct. But who can be bothered with all that?<Neebat>: Plumbers who don't enjoy a face full of piss.", "num_messages": 6, "avg_score": 16.6666666667}
{"start_date": "1330859540", "end_date": "1331340544", "thread_id": "t3_qh2on", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 18, "text": "<ZapaBasoran>: 1000 feet from the federal building Got a new 9mm and took it out to the range. With in 30 rounds it [stove piped](http://theshootersblog.com/wp-content/uploads/2012/02/Glock-19-Stovepipe.jpg) 3 times. At home cleaning the the pistol I noticed a build up of guncoat (bake on paint used to protect metal) on the barrel. I sanded the build up down and reassembled the pistol. I loaded up 2 clips and started cycling them through. Worked like a charm... But being a stiff spring new pistol and my hands unfamiliar with the double safety as I was cycling the second clip (to be sure it worked... science) the webbing of my thumb slid off the grip safety, the action caught and instead of the smooth sliding back I jerked the whole pistol up and onto my finger (which HAD been OUT of the trigger guard) as well as depressing the handle safety. Pistol does what it was designed to do and fires... Right through my pillow and mattress. I live 2 houses 1 road and a small grassy knoll from the federal building. Ears still ringing I break down the gun stash the pieces separately and wash my hands in the vein attempt of removing powder residue. 10 minutes pass. I hear through the ringing in my ears my upstairs neighbor leave his house, then knock on my door. I opened up and invited him in, offering a beer. After a few sentences I broach the subject. \"So, you're probably wondering about the gunshot.\" He was, so I told him what happened. He tells me that he waited because he didn't want to be involved if there was an intruder, but wanted to know that I was ok. Guess neither he nor any one else made a call to the police... not sure if that is a good thing but it worked out for me <Later>:dug the bullet out of my bed (5/8^th plywood on top of futon frame stopped the hollow point) **Edit:** to day I fucked up.<NatecUDF>: What model pistol? Also, what do you mean by handle safety?<Lost_Thought>: [Probably the grip safety on a 1911 or a XD.](http://1.bp.blogspot.com/_dJGB-D-Rslk/TKEuabyNtFI/AAAAAAAAAEE/bwzHrCA4UYo/s1600/Grip_safety.jpg)<NatecUDF>: Yes, but OP had already mentioned grip safety in the same sentence, which makes me think he is referring to something else. Besides, his image was of a glock and anybody who's fired more than a couple of magazines knows what a stovepipe is. Am confused.<ZapaBasoran>: My apologies. The example was just of stove piping. My pistol is a Springfield 9mm XD (other than the guncoat build up is a phenomenal gun) The grip safety I speak of works with an advance trigger safety to prevent unintentional firring... but I found a way.<NatecUDF>: I have an XDm, but I am not sure how this would have happened; you must have really yanked on it. Were you holding in your strong or weak hand?", "num_messages": 6, "avg_score": 3.0}
{"start_date": "1331358994", "end_date": "1333311317", "thread_id": "t3_qpzs0", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 112, "text": "<siiika1>: TIFU: Took a dump so huge that it wouldn't flush down the toilet... had to use a butter knife to cut it down to size. Actually, my roommate did this, not me. She proceeded to tell me about it while leaving the apartment and I sat in gaping astonishment while she recounted her desperate situation. She was late for school and couldn't think of another solution. I asked her if she destroyed the knife by throwing it into the volcano in Mordor; she responded that she used \"hot\" water to clean it. Added that she didn't use the serrated edge to make sure no shit got stuck in the teeth. Still no idea which knife it was or if it's still in the kitchen drawer. fml<Hooorayio>: did that, im talkin from that hook in the pipe up onto the front of the bowl above the water line, was really proud of that one. anyways, i accidently forgot to flush and had left the house at like 7 to go to school. My roommate, a good chick friend of mine, calls me at like 3 in the afternoon and tells me theres the biggest shit sees ever seen in the toilet and it wont flush. had to cut it in like 4 pieces. Butter knife FTW<logicalrationaltruth>: Do you guys shit bricks? I didn't know this was possible. I thought the flushing action is usually enough to break shit up, sans TP.<Hooorayio>: Totally possible, it's the logicalrationaltruth", "num_messages": 4, "avg_score": 28.0}
{"start_date": "1330849709", "end_date": "1331505146", "thread_id": "t3_qgzqd", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 2, "text": "<saints_chyc>: tifu Only shaved one leg... When I need to rid myself of that awful body hair, I tend to start at one ankle and work my way up and around... Got caught up making the hoo-ha area extra nice, then moved on to other parts... Got out to lotion up and right leg and arm were NOTICEABLY hairier! Dafuq, Brain?!?! [deleted]: You shave your arms??<saints_chyc>: Yes, I hate body hair. :)", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1331399724", "end_date": "1331515949", "thread_id": "t3_qqf96", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 117, "text": "<canipaybycheck>: Announcement: The Fuck-up of the Week We are happy to announce the introduction of the \"Fuck-up of the Week\". Flair reading something along the lines of \"Fucked up bad\" will be given on Sunday to the user who is deemed to have fucked up the worst in the past week, and they will keep this flair for the next week. <lowbrowhijinx>: YOU'RE TOTALLY BREAKING RULE 1. Which means... OMG. You're rigging the contest and ensuring victory for yourself!<RandomMandarin>: I not understand... do you mean creating this award was the Fuck-up of the week? But that means it wins Fuck-up Of The Week... But that means it's not a fuck-up... But that means the Fuck-up Of The Week award was given to the wrong person... Which might make it the Fuck-up Of The Week! But then it SHOULD get the award... But then it's not the Fuck-up Of The Week... **error error errorrrr BBBZZZZZZTTTT**<Random_Robot>: LACK OF MANDARIN. ARGUMENT NULLIFIED. BBZZZZZZZTTTTTTT.......<what_day_is_it>: huh? where am i.... [deleted]: It's March the Tenth, 2012. You're trapped inside a computer of someone browsing reddit. Try and block the tubes the cats are coming from, it might help you escape.<what_day_is_it>: it.... what.... [deleted]: Stop eating/drinking water as well. The shade had the jailer put drugs in it. Murtagh will be there to get you out soon.<what_day_is_it>: .......", "num_messages": 9, "avg_score": 13.0}
{"start_date": "1331416371", "end_date": "1331420324", "thread_id": "t3_qqqd8", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 59, "text": "<JesusofTorn>: TIFU: By nearly drowning myself in greasy, toxic water. I was cleaning my oven with a big bowl of water and chemical degreaser, my phone went off which made me jump, knocked myself out on the roof of the oven and landed face first in the bowl of water, woke up about 10-15 seconds later coughing up water and puking cos of the chemicals and grease.<boronosaurus>: so does the chemical degreaser work on vomit? [deleted]: Well it was a very clean vomit, if that's what you're asking.", "num_messages": 3, "avg_score": 19.6666666667}
{"start_date": "1331409756", "end_date": "1335696679", "thread_id": "t3_qqlsp", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 46, "text": "<Ran4>: TIFU: I left potatoes in the dark for a month. Now I'm afraid of potatoes. <iddothat>: Where's POTATO_IN_MY_ANUS when you need him? [deleted]: Why is that guy everywhere?<killerkram>: I have been wondering that as well. He seems to be everywhere from politics, to aww<leicanthrope>: Isn't POTATO_IN_MY_ANUS a girl &amp;#3232;\\_&amp;#3232;? <Edit>: Not sure what just happened to my disapproving smilie's face, but it's somehow strangely appropriate. Didn't mean for it to look like it had just suffered a stroke, but that still works... &amp;#3232;\\_&amp;#3232; Edit v 2.0: I'm drunk. Must really get off Reddit while I still can...", "num_messages": 5, "avg_score": 9.2}
{"start_date": "1331488574", "end_date": "1331742888", "thread_id": "t3_qrpgj", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 40, "text": "<lov3disshit>: TIFU when i downloaded the windows 8 consumer preview. I was having problems with adobe, so i wanted to just uninstall it and go back to windows 7... apparently you have to re-download all of windows 7. Which I didn't install originally to begin with :( [deleted]: duuuuuudee... rookie mistake. you NEVER install any windows version until it's been out for at least 4 months.<zifnab06>: Try rookie mistake: When microsoft tries something new, you stay on the older version until the next version comes out. Windows 3.0 Crap Windows 3.1 Good Windows ME, Crap Windows XP, Good. Windows Vista. Crap. Windows 7, Good. Windows 8 Crap. Windows 9, Good I think the only version that didn't follow this was 95/98/98se. Crap/Crap/Less crap in this case. [deleted]: You forgot windows 2000, which was best (and last good). Windows XP was shittier than windows 2000 (YAY BLOAT), then came the ABSOLUTE HORSESHIT that was Windows Vista user interface designs (Hyperlinks?! What?!). Bloat. Bloat bloat bloat bloat bloat. Windows 7 \"streamlined\" Windows Vista, yet cut all backward compatibility that Vista had and FORCED you to stick with the Aero interface (or get a broken remix of the old one). Windows 7 is the worst OS I have ever used, and I have experimentally attempted to use most of them. Fuck, I'd prefer BeOS remixes to Windows 7. I am simply going to make a statement of qualification and assume the intelligent people will get it, while the morons will disagree because I am right: Anyone that thinks windows 7 is a good operating system knows jack shit about human interface design and has never read anything substantive about them. This INCLUDES the developers.(AGAIN: HYPERLINKS? AS BUTTONS?!)<chazysciota>: I did love win2k, to be sure. But the win7 start menu is the best iteration of the start menu yet. Once I got used to it, the search-focused functionality really won me over. [deleted]: The funny thing is you haven't realized that its \"search focused\" nature was *giving up*. The \"start menu\" was always a failure of design, and in windows 7 they just made it even more of a failure. The only way to NAVIGATE the damn thing is through the \"search\" function - or by replacing it altogether as I have done on numerous occasions. Hotkeys are my friend.<chazysciota>: If faster and easier is the pinnacle of failure, then I guess I'll take it. Also, it is not the \"only way to NAVIGATE\", just usually the easiest. [deleted]: You seem to misunderstand me. If *searching* your start menu is easier than *browsing* it, then you shouldn't even have a start menu at all. Navigating it is even more difficult than the previous version due to visual clutter, which ultimately contributes to it being easier to use the \"search\" feature. If you want to make an argument to \"faster and easier\", then hotkey all of the things. It may be the \"QED\" to \"faster and easier\" if you have a good memory, but hotkeys are not the point of visual user interfaces. As a user interface, the start menu *is* a failure.<chazysciota>: Frequently used items are anchored to the main menu. That's generally pretty useful, although the automation of it can be a bit frustrating on occasion. I don't have the greatest memory, but I don't have much trouble remembering the name of the program I want to run. WindowsKey -&gt; \"device man\" is easier for me than hunting and pecking three clicks and a r-click, and certainly easier than hotkeying every damned thing I may use. Maybe it's just because I'm accustomed to a CLI. You may assert that it is \"failure,\" but compared to what? How has it failed? Failed to what? You can just say that you hate it. Opinions are fun. [deleted]: You have reduced the value of this discussion to semantics that will lead to me defining stupid things like what a \"program\" is, what \"failure\" is, and why it applies to this context. I refuse to commit to such a pointless task when the answers are available to anyone with a modicum of intellect. This discussion is done.<chazysciota>: Oh give me a break... Don't be such a fucking baby.", "num_messages": 11, "avg_score": 3.6363636364}
{"start_date": "1331498922", "end_date": "1333674683", "thread_id": "t3_qrwvj", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 157, "text": "<ez617>: TIFU when I locked myself out of the house I'm housesitting I'm housesitting and dogsitting this weekend. I locked the handle of the door to the backyard last night because I couldn't figure out the deadbolt; when I let their dogs out this morning, I didn't unlock the handle. So I went out and threw the dogs' toys around for about 15 minutes, decided it was too cold and went to go inside to get a jacket. Of course, the door was locked. I was stuck outside without a phone, car keys, a jacket, or money. [deleted]: [Don't leave home without it.](http://www.dealextreme.com/p/credit-card-lock-picking-pocket-wallet-kit-5-piece-set-36264)<Twad>: Do you need to level up your lockpicking or is it easy? [deleted]: Skyrim taught me how to pick a lock.<calafragilistic>: I will shoot you in the knee. With a bullet.<gargamak>: I will shoot you in the bullet. With a knee.<calafragilistic>: Meh<gargamak>: Hem<troywrestler2002>: Ehm?<gargamak>: How dare you", "num_messages": 10, "avg_score": 15.7}
{"start_date": "1331531918", "end_date": "1331601489", "thread_id": "t3_qskf5", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 68, "text": "<NickTheHalfling>: TIFU when I cooked a plate instead of a tortilla. Long story short, I went to heat a tortilla over my stove, grabbed a plastic plate instead. <neryam>: Well, at least you didn't use a ceramic plate, which I did, once.. That was a fun surprise.<NickTheHalfling>: Mother of god, did it explode? D:<neryam>: Yeah, it broke in half in a neat circle pattern and a whole bunch of tiny shards flew off..", "num_messages": 4, "avg_score": 17.0}
{"start_date": "1331523745", "end_date": "1339022166", "thread_id": "t3_qsf89", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 32, "text": "<naemly>: TIFU - went to piss, foreskin got in the way, stood there stunned while piss sprayed everywhere except the toilet <BootlessTuna>: I was circumcised, yet they left just enough foreskin so that I don't need lube when I fap. I'm very pleased.<12345dhooves>: High five.<BootlessTuna>: Its honestly great. Such a convenience. Best of both worlds. <12345dhooves>: Same here<BootlessTuna>: isn't it just great? I want to shake my doctor's hand who did that, but then I'd remember he makes a living cutting up baby dicks, and I don't want baby dick blood all over my hand.<12345dhooves>: Maybe he circumsises older people.<BootlessTuna>: In that case he would make a living on torturing people, something that also scares me.<12345dhooves>: Lol'd", "num_messages": 9, "avg_score": 3.5555555556}
{"start_date": "1331587725", "end_date": "1331600052", "thread_id": "t3_qthua", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 75, "text": "<scraggz111>: TIFU. Woke up hungover went to take a leak started vomming mid stream. Woke up at a girls place desperate for a piss still feeling a bit wasted. I'm not sure if I'm feeling sick or if I'm hungry so I ignore it. Half way through and suddenly I start heaving which causes my entire body to convulse which, in turn, causes me to swing my wang all over the place spraying most of the bathroom in piss while covering the rest of it in vomit.<Smitty7712>: Ouch bro, that's a rough one. Did you puke on your swordsman?<scraggz111>: Luckily not, I managed to keep my self clear then made an attempt to clean the piss up so it was a bit less embarrassing.", "num_messages": 3, "avg_score": 25.0}
{"start_date": "1331658777", "end_date": "1331692855", "thread_id": "t3_qurn9", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 107, "text": "<kayjaykay>: TIFU Couldn't figure out why everything was so steamy... ...I was still wearing my glasses. In the shower. [deleted]: rusty glasses. nice<Sheadog369>: Your frames shouldn't be rusting after something like this. Hell, if they're rusting at all, you're buying some really shitty glasses.<spazmodic->: Yeah, the stuff that comes out of your skin will probably rust metals much quicker than a shower", "num_messages": 4, "avg_score": 26.75}
{"start_date": "1331688459", "end_date": "1331882559", "thread_id": "t3_qvgwa", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 136, "text": "<T_cubed>: TIFU by tripping at the finish line I run the 400m dash in my junior high track team. As I was nearing the finish line I lost my balance and tripped over it. I heard the entire crowd cringe at the sight of me face planting into the ground. I ran it in 60 seconds, one second away from getting a ribbon.<loveatthelisp>: YOU ARE NOT OLD ENOUGH FOR REDDIT. GO AWAY. Nothing against you personally, bro. <WhiskeySevey>: He's right. You're young, you still have a chance at a normal life, don't stay in this place.<loveatthelisp>: *She is right. Just like a woman to point that out. You'll also become a misogynist, even if you have a hoo-ha. GO NOW. <siegewolf>: This is the internet. There are no women here except for in porn. &amp;#3232;\\_&amp;#3232;<TSED>: Not even then.", "num_messages": 6, "avg_score": 22.6666666667}
{"start_date": "1331856976", "end_date": "1334210102", "thread_id": "t3_qym3e", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 2, "text": "<iwaskhazard>: TIFU- my girlfriend was way too horny, and (thinking her period was over) we got it on in my bathroom. i didn't realize she was still bleeding and i've never experienced that before. i pulled out and there was blood everywhere. it smelt pretty bad too. [deleted]: double check she doesn't have a tampon stuck up there if it smelled bad. Toxic shock kills in days, and it should just smell like pussy, blood, and estrogen.<iwaskhazard>: we're still alive. [deleted]: Your \"girlfriend\" was too horny and you got it on in your bathroom while she was on her period? That's funny, because I was pretty sure that I was your girlfriend a month ago... Oh, did you mention to her and everyone else the plans we had for our future? Did you mention to her all the promises you had made to me, only to break them in the end? It's really funny because I can’t believe I actually thought you were different. I actually had faith in you, but I learned that you’re no different at all. You’re just like them when you promised me you weren’t. You’re worse, actually. I hope you're happy. I really do. I hope you come to realize what we could have and should have been. Now we're nothing and we're going to be like this forever. You obviously can move on just fine, now it's my turn and honestly, I already have my eyes set out on someone and he's been making me smile for the past couple months when you weren't. I hope you have an awesome future Alex, because the future we had planned, it's never going to happen. I hope this girl was worth it. Have an awesome life, because I'm no longer going to be a part of it. That's what you wanted all along and I'm fine with this decision. Just know that I actually cared once, I cared more than anything, it's sad all of this had to change.", "num_messages": 4, "avg_score": 0.5}
{"start_date": "1331854488", "end_date": "1333471329", "thread_id": "t3_qyk1u", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 51, "text": "<notcleverchris>: TIFU making a good first impression So today during lunch at my high school, I was talking with my friend and we were having a laugh. Two of his friends, whom I have never met came up and said what's up. I recognized one of them from my math class and gave him a handshake. Then his black friend held out his hand saying Hello. Meanwhile I was still chuckling at my friend, so without really thinking i shook his hand as he said, \"hey my name's Aaron\". So for what reason i don't know, just staring at his hand i say, \" Hi, i'm black\"... I'M WHITE. GOD DAMNIT. so i just walked away really fast. hahahaha<Something_Isnt_Right>: Something's not right. &gt;I'M WHITE. GOD DAMNIT. One does not just turn white all of a sudden. <__Awesome__>: I'm calling fakesies on this one!<notcleverchris>: I swear I'm not kidding. Thank god i got my lunches switched.", "num_messages": 4, "avg_score": 12.75}
{"start_date": "1331064262", "end_date": "1331874826", "thread_id": "t3_qkkyg", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<thecampo>: TIFU When I made coffee put in the sugar went to grab the cream. forgot and put in more sugar.... And that was the last of the coffee.... [deleted]: I hate coffee unless I make it saturated with sugar. I was at a hotel recently that gives free coffee in the morning, so I took some (yes, you guessed it) decaf and tore open about 5 packs of sugar. Then added 4 things of creamer. Delicious<thecampo>: HEHE! Yes I also like sugar but six tea spoons is way too much for me.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1331909347", "end_date": "1331952695", "thread_id": "t3_qzf3r", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 120, "text": "<SnizzPants>: TIFU Have been putting all my sweaty, shitty, semen stained underwear in a bag. In order to make the bag more compact I squeezed out all the air that's been sitting in there, into my face. I actually keep doing this. I'm traveling so I constantly have a bag of gross nasty underwear in a bag. And I always need it compact and for the life of me I cannot remember that when I fold up the bag all the air just smashes me in the face. I got pink eye two weeks ago and I'm actually JUST realizing now that it might be from this...<loveatthelisp>: I think the bigger question is why do you have shitty, semen stained underwear? I can understand sweat, but shitty? What. The. Fuck. <blackjesus>: Making a present for his mum.<BroCop>: And I'm out of this subreddit...<lollface>: I laughed so fucking hard that this oh my god. Thank you. Thank you so much. I... I love you.<BroCop>: Alright, I'm glad you laug- *Looks at username* I DON'T KNOW IF IT'S A JOKE OR NOT!!!<lollface>: Haha, well your the cop.", "num_messages": 7, "avg_score": 17.1428571429}
{"start_date": "1331934634", "end_date": "1331960469", "thread_id": "t3_qzzl2", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 90, "text": "<Jenewein>: TIFU when I didn't act more crazy when they were picking who was gonna get picked at jury duty. I should've spent less time talking about my college experience and more about how I spend all day on a website trying to be funny so I can get imaginary points. [deleted]: Repeat after me, Jury Nullification. They will boot you out so fast you will forget how you got there.<clryan>: So how does this work? Should it just be casually mentioned or is it necessary to say that I support it/strongly believe in it/whatever? [deleted]: I'm not sure exactly. But I do know that judges and prosecutors fucking hate the very mention of it. [deleted]: Judge: Are you willing to follow the law whether you agree with it or not? <You>: I believe that every juror has the right, and maybe even the obligation, to disregard the law where it is being applied unjustly. <Result>: You'll likely be dismissed from the jury pool. [deleted]: Perfect.", "num_messages": 6, "avg_score": 15.0}
{"start_date": "1332011453", "end_date": "1332032960", "thread_id": "t3_r13hq", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 63, "text": "<kinda_alone>: Possible Logo Ideas We have had a couple of logo submissions. What do you guys think? [Option 1](http://dl.dropbox.com/u/9119917/tifu.gif) submitted by Left-Hand-Path [Option 2](http://i.imgur.com/j0wU3.png) submitted by SaltyChristian Also I would like to introduce two new Mods: SaltyChristian and rya11111 <Edit>: Option two is more of a ad Here is another [option](http://i.imgur.com/XUCbM.png) submitted by moderator000. We sincerely apologize for the delay in posting his. <Cr6433>: Option one definitely. [deleted]: I agree, except maybe move the \"TIFU\" so it doesn't cover the pipe... that aggravates me for some reason<Cr6433>: I like his little change to it! clears things up a lot.", "num_messages": 4, "avg_score": 15.75}
{"start_date": "1332033552", "end_date": "1332456400", "thread_id": "t3_r1hig", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 29, "text": "<Cr6433>: TIFU: I answered my cell phone at work... So i work at our towns local YMCA and i am staff at the Youth center building,so, i open up no kids waiting to get in or anything, then i get a phone call from my good friend ( we toke together ) and starts asking if i wanna come over and smoke with him, and i was thinking hell yeah free weed, and it gives me a chance to try my new bong. so i said \"Yeah man, i'll come over after work and bring this new bong i just got and we can blaze up.\" and as all of that was said i failed to notice the door open and my boss come in. and he was just staring at me he had heard everthing. <PTH200s>: So, did you toke with your boss, then?<Cr6433>: Ha i wish. <kinda_alone>: so what happened? <Cr6433>: He said \"Did i hear what i just think i heard?!\" and i didn't wanna try and play it off so i just said yeah, so long story short he gave me a second chance and dis drug testing me next week if i pass i keep my job if i fail i'm fired.<kinda_alone>: Best of luck", "num_messages": 6, "avg_score": 4.8333333333}
{"start_date": "1332126400", "end_date": "1332178771", "thread_id": "t3_r2x5g", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 139, "text": "<Thisguy92>: TIFU by throwing urine into my own face. I drunkenly decided to wee in a glass as it was easier than going to the toilet in my state of inhebriation. As i went to throw said effluvia out of my window, a window which is best described as a rickety victorian contraption that is a meter and a half high and opens like a set of double doors, I opened one side of the window and leant on the other. As soon as i put my full force behind the piss chucking motion, the closed portion of the window that i was leaning on promptly gave way, leading me to jerk forward and throw a concoction of whiskey infused micturation into my face. Sort of just froze for 20 seconds with my eyes closed and piss dripping down my face thinking, \"what the fuck did i just do?\"<M0rbs>: Obligatory Bear Grylls reference. <OnceInATre0n>: Obligatory \"Did you know he got fired from Discovery?\" comment.<LaughsOutOfContext>: Obligatory \"WHAT ?!?!?!\" <HollowScope>: ::picks nose::", "num_messages": 5, "avg_score": 27.8}
{"start_date": "1332165563", "end_date": "1332501356", "thread_id": "t3_r3fu1", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 54, "text": "[deleted]: TIFU by pissing in the trash can.. After coming home from a fantastic party, I was of course drunk. I realized I had to piss, and went straight for the trash can. I only realized it wasn't the toilet after I was done.<jayseesee85>: My parents LOVE trotting out the story of when I was 6, sleepwalking, and they had company over visiting. Apparently, I allegedly walked over to the cupboard where we kept all of the pots and pans, opened it up, pissed in it, closed it, made a FLUSHING NOISE, and went back to bed.<deletecode>: I heard a similar story about a closet, like someone opened the door and just pissed into it.<Joey_Bellows>: Was that the guy on here that met his future wife by pissing in her closet?", "num_messages": 4, "avg_score": 13.5}
{"start_date": "1332191750", "end_date": "1332211246", "thread_id": "t3_r40v5", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 2, "text": "[deleted]: TIFU is it suppose to be ironic that \"check out the new fuck of of the week!\" is blocking half the titles of threads i open? Today YOU fucked up Is there some way to get rid of it or will it always just be chilling annoying the hell out of me. blocks half the title of whatever is at the top of the page, and any thread i open. so if its at the top, and i open it, i double cant read it<canipaybycheck>: I haven't seen this in any browser, but I will move it up above the header for you.<Plyson>: thank you", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1331517752", "end_date": "1332864992", "thread_id": "t3_qsap6", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 7, "text": "<Insanitybeat>: TIFU by spraying water in my face... I was washing a car (yes, I have to do chores, unlike you circlejerkers) and I was about to pick up the hose and spray the side of the vehicle to wash the soap off and I somehow pointed the hose at me and sprayed myself in the face... and I had glasses on. It was like the comical moment in old cartoons where the hunter is trying to shoot the rabbit, but the barrel of his gun turns toward him and shoots him in the face. TL;DR: tried to wash soap off of vehicle, sprayed myself in the face while wearing glasses.<The_s4rg3>: A TL;DR for 4 lines? If they can't read 4 lines, then why are they even in this subreddit?<Insanitybeat>: This is several days old. This is dead.<The_s4rg3>: I was asking you a question [deleted]: what a dick. amiright.jpeg<The_s4rg3>: nope.avi [deleted]: i thought he was being a dick. whatever though.", "num_messages": 7, "avg_score": 1.0}
{"start_date": "1332200933", "end_date": "1332970404", "thread_id": "t3_r48v6", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 399, "text": "<GOB224>: TIFU by driving 20+ hours to go camping and forgetting my tent. A few college friends and I drove from Massachusetts to Tennessee to camp in the smokey mountains. After about 20 hours of driving, we arrive and unpack to find that the tent was still at home. We ended up buying one but it leaked in the rain so we slept in the car <Edit>: Oh by the way, the next day we saw a double rainbow. all the way across the sky. No lie.<Jenewein>: You drove 20 hours? I have no idea why you'd need to go so far. I pitch a tent at home right in my own bed all the time. <GOB224>: It was a coastal roadtrip. We just wanted to get far away from our shitty town. <siegewolf>: I feel you missed the joke.<GOB224>: I got the joke just felt id clarify the story a little more<siegewolf>: That's what they all say. :D<peperonikiller>: The joke was terribly bad anyay.<GOB224>: seriously", "num_messages": 8, "avg_score": 49.875}
{"start_date": "1332127903", "end_date": "1332443478", "thread_id": "t3_r2y9e", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 29, "text": "<CodyCarlile>: TIFU by not eating the vitamin Well actually this happened like a week ago, but it still fucking sucked. Anyway my brother and u were walking out of gamestop at the mall and saw that for some reason the vitamin store across from it had put out a sample of something called \"B-12\" so we each got one and i waited for my brother to eat his first. I saw by his facial expression that it tasted terrible so i just put it in my jacket pocket to throw away later. I completly forget about it the next day and go to school as usual. I notice during school its gone and figure it fell out. When i get picked up by my mom she is unusually quiet so i ask \"whats wrong?\" she replys with \"i found something in your pocket...\" And then she starts crying so i explain how it was a vitamin and how my brother took one too. I then realize my story sounds terrible and my brother and i now look like pill poppers to my mom. [deleted]: lololololol Anyways, that B-12 stuff is a scam. You pee out what you don't already get from your daily foodery eatin'. <Dax420>: You do piss it out, but that \"5 hour energy\" stuff is just a 1200% daily recommended dose of B-6 and B-12 and it really does give you a big energy boost, so it must be doing *something*. [deleted]: My mom bought a bottle of it, and that stuff never works for me. Everyone's so against caffeine. I don't know why.<snowflaker>: does no one realize that those things do have caffeine in them?? [deleted]: No, some are just B-12.", "num_messages": 6, "avg_score": 4.8333333333}
{"start_date": "1332211780", "end_date": "1332909021", "thread_id": "t3_r4i66", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 67, "text": "<69swaglord420>: TIFU: The fail poop to end all fail poops This wasn't today, but it was last year in the dead of winter when I was going to Raleigh to visit my sister. Me and my family Decided to stop at PF changs to get some dinner and then go to the dicks sporting goods right across the street. As I walked inside I immediately noticed that my intestines were ready to release the cracken of all poops unto the nearest toilet, so I rushed to the bathroom. Once inside the only stall I noticed multiple poop stains on the seat mixed with pee. I decided the only way to crunch town was by a standing pro poop. I stood up and bent over, while hoping for a solid nug to drop when all of a sudden a diarrhea jet stream of general changs chicken goes every where, and I mean everywhere at this point I had literally pooped on top of the toilet, on the flusher, on the seat of the toilet, and then just finished unloading the initial rush of poo on the floor(I literally only got about 1/5 of my poop in the toilet). I immediatly got my parents and told them we had to leave because I was sick. And to this day I still feel guilty over who had to clean up my poop. tl;dr I pooped everywhere but the toilet in dicks sporting goods <theillinestvillain>: I think that you just gave me the best laugh I've had since the infamous 4chan shitting story<mash3735>: link?<theillinestvillain>: I'll try to find it. Give me a minute. Alright, [here](http://thecoffeedesk.com/news/index.php/2009/11/22/funny-bathroom-story/) it is. This isn't the original 4chan version, but it's still the same. <mash3735>: my parents room is directly below mine and i just hurt my throat suppressing my laughter. tears and all. upvoting everything you own.<theillinestvillain>: I told you. Funniest poop story ever. I still laugh so hard that I cry every time I read it. EVERY TIME. <mash3735>: i was laughing so hard i had to restart reading certain parts because i couldnt focus", "num_messages": 7, "avg_score": 9.5714285714}
{"start_date": "1332230677", "end_date": "1332397952", "thread_id": "t3_r4twz", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 143, "text": "[deleted]: TIFU: and punched my boyfriend in the eye he was laying on my chest, just like a lady would do to a guy but the opposite. I told him not to tickle my armpit... we had just gone through an intense 15 minute tickle fight and he went to move his head and I thought he was going to tickle my armpit by \"nomming\" it. I was wrong. he just moved his head and I flinched to keep him off of my armpit and missed his forehead and gave him a black eye. he told everyone I beat him. [deleted]: \"AND ANOTHER THING, YOU'RE MAKING THE SANDWICHES FROM NOW ON!\" [deleted]: lol I already made the sandwiches xD<kinda_alone>: Youre a keeper then; he better merry you<Lampmonster1>: You'd better merry Christmas. <kinda_alone>: Haha whoops by no means did I mean marry. I want him to make sure she is very joyful, ie. merry. [deleted]: that sentence makes no sense if you say merry rather than marry... well its really not the best word choice. <kinda_alone>: Haha I was just kidding, I definitely made a typo [deleted]: oh haha okay xD I was like \"wuu?\" that didn't make sense :P", "num_messages": 9, "avg_score": 15.8888888889}
{"start_date": "1332235752", "end_date": "1334106546", "thread_id": "t3_r4vmq", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 46, "text": "<andieOO7>: TIFU walked into a tree I was listening to music and saw this really hot guy walking down the street behind me, walking his dog. I always see this guy in the neighborhood, but sadly found out he is taken. ANYWAYS, I turned around to look at him and next thing I know, I'm just in a state of utter confusion. I'm on the floor, my books sprawled everywhere. Turns out I had walked dead on into a freakin' tree while looking back at him. And people driving by saw the whole thing. Hope he didn't. =/<unbwogable>: Could be worse, could've involved a car accident...<AJJihad>: and dinosaurs...<1125rksr>: Oh my God i completely lost it when i read that. Have an upvote", "num_messages": 4, "avg_score": 11.5}
{"start_date": "1332303738", "end_date": "1332311547", "thread_id": "t3_r6ahb", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 169, "text": "<quarantines>: TIFU by accidentally titling a paper \"derp\" and printing 20 copies for my class I titled the paper \"derp\" just as a stand-in for an actual title until I could come up with something better. When I went to the printing lab on my campus and had my file printed, I realized that I'd completely overlooked my stand-in title and I didn't have enough money on my student card to print another 20 copies (each copy is 10 pages). My professor didn't say anything about it but the class was pretty amused. [deleted]: http://img221.imageshack.us/img221/3033/2471383446852071670ey8.jpg You have a bright and illustrious future ahead of you!<ply447>: That goes way beyond a TIFU.", "num_messages": 3, "avg_score": 56.3333333333}
{"start_date": "1332204844", "end_date": "1332361647", "thread_id": "t3_r4c72", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 23, "text": "<justme_3774>: TIFU by letting myself run a two mile race, dammit. Doing track, came in last, got lapped by all six other racers. And I'm skinny and short, too. Fml.<WhatTheGentlyCaress>: dm;sr<moderator000>: Doesn't matter; still ran?<WhatTheGentlyCaress>: indeed, that needed supporting :)", "num_messages": 4, "avg_score": 5.75}
{"start_date": "1332310934", "end_date": "1332437381", "thread_id": "t3_r6ez2", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 54, "text": "<estrtshffl>: TIFU by setting a dryer on fire in my dorm, causing an evacuation. Well, I was washing my clothes, like you do. But this particular load of laundry was *massive.* I must have had a week and a half of dirty laundry in there, and I am not a small person. Anyway, I take my clothes out of the washing machine, when I notice they are soaking wet. Not the normal amount of wet that is to be expected when you was clothes, but they're drenched. There was even still a little pool of water at the bottom of the washer. I figure, \"fuck it, it's a dryer. It'll be fine.\" And I load up the dryer, and hit start. This was my first mistake. Turns out, the clothes were so wet and heavy that the drum of the dryer was weighed down and couldn't turn. So it caught on fire. I caused all 9 floors to evacuate. Felt pretty good about myself. <squee777>: If your clothes come out dripping wet, it is usually a good idea to use the spin cycle on the washer again or ring them out. <estrtshffl>: I know that now. <kinda_alone>: hindsight is 20/20", "num_messages": 4, "avg_score": 13.5}
{"start_date": "1332420302", "end_date": "1334381166", "thread_id": "t3_r8a7d", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 3, "text": "<illegal_people>: TIFU by mistakenly burning my dick with a joint ash so i was smoking this joint right while playing modern warfare 3 (the game sucks i know) and i was naked and shit, cause that's how a real nigga does it. so i was smoking, like any pothead would on a daily basis, and i had my dick hanging low, cause it's all big and shit, and my ash tray just happened to have been placed next to it, cause i'm a dumb fuck like that. problem? anyway, anyway, i went to put the joint out and put it out on my dick now it's all blistered and shit, was bleeding a little, not a pleasant feeling at all what so ever. i wouldn't make it far in the BME. bet you guys didn't see that coming.<Fanzellino>: Pics.<illegal_people>: This was weeks ago, that shit is long healed.<Fanzellino>: Is there a scar?", "num_messages": 4, "avg_score": 0.75}
{"start_date": "1332431814", "end_date": "1332472449", "thread_id": "t3_r8hyv", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 40, "text": "[deleted]: TIFU: broke my phone charger I accidentally ran my vaccum cleaner over my phone's charger cable and it [completely ate it up and tore it to bits](http://i.imgur.com/ZOhor.jpg). There's a tiny electrical burn on the carpet. Glad it didn't short the power or anything.<zifnab06>: I'm impressed by your vacuum cleaner's ability to destroy things. I've ran over cords with mine before and nothing has happened...<iAgreeToDisagree>: We have the one of the older Dyson models.. God damn that thing sucks harder than a pornstar! Same thing happened to me on multiple occasions!<NatecUDF>: It ripped the end of your pecker off? <iAgreeToDisagree>: Precisely...", "num_messages": 5, "avg_score": 8.0}
{"start_date": "1332454573", "end_date": "1332571998", "thread_id": "t3_r9123", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 30, "text": "<druggedmonkey>: TIFU: never put diseases in mail titles Today I opend my mails in class to open a powerpoint presentation, but I forgot it was called herpes because it seemed funny at home, but not on the projector in the classroom, my whole class and 3 teachers saw it. I had to explain it to the principal, they called my parents to tell it to them.<druggedmonkey>: My teachers are just sick and tired of having pictures of STD's on people's screen when they leave for 2 minutes [deleted]: wut. Do ppl replace wallpapers with STDs at your school?<CantChangeEverything>: Not a bad idea IMO. Stresses the importance of using protection... See this nasty shit? That could be you. Wrap your tool.", "num_messages": 4, "avg_score": 7.5}
{"start_date": "1332458318", "end_date": "1333097586", "thread_id": "t3_r949d", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 112, "text": "<danaluz>: TIFU: Squeezed hand lotion on my toothbrush then started brushing my teeth ...they were in the same shaped tube.<ChiverMatt>: I did this with honey; same fuck up, but tasty ;D. Don't ask why there was honey in the bathroom.<12murphyk>: why was there honey in the bathroom? &amp;#3232;\\_&amp;#3232;<danaluz>: &gt; Don't ask why there was honey in the bathroom.<NatecUDF>: No, I don't think you understand. At this point, we *have* to know why there was honey in the bathroom. You know, for science!<Illpackallama>: I can think of a few reasons why there would be honey in the bathroom... <Kabakov>: I think I think of the same reasons you can think of.. and I want to stop thinking.", "num_messages": 7, "avg_score": 16.0}
{"start_date": "1332405703", "end_date": "1332531805", "thread_id": "t3_r84xb", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 13, "text": "<Kushie1>: TIFU: Tried giving myself a haircut. Bald spot on the back of my head. The rest of the haircut looks pretty nice. I have to get it fixed in the morning :( <Kushie1>: Haha forgot I posted this. I ended up cutting it really short by myself and made it a short fade. Looks fine now. Took over an hour!~ im paying 12 bucks next time fuck this. <Kushie1>: I went to bed with fucked up lop sided hair hahaha", "num_messages": 3, "avg_score": 4.3333333333}
{"start_date": "1332508923", "end_date": "1333334520", "thread_id": "t3_r9x2k", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 114, "text": "<Thundathury>: TIFU: cat wanted me to hug her while i was peeing and fell into the toilet I was peeing. Then my cat came into the toilet, jumped on the bathtub and wanted me to hug her. So basically, my cat fell into the toilet which was full of my pee<sadi89>: I will be waiting for your next post.<TIFU>: I gave my pissed off piss covered cat a bath. <NatecUDF>: I hope he has neosporin available. Pee covered cat claw scratches? We are talking amputations.<Volatar>: Urine is surprisingly sanitary. <Nightshade3312>: It is sanitary but not for long, its basically an unmolested bacteria playground.<Volatar>: You are 8 days late bro. <Nightshade3312>: Meh, thats fine, I just can't resist throwing two cents at people.<Volatar>: Well, I got them. Thanks :)<Nightshade3312>: Glad I could help :)", "num_messages": 9, "avg_score": 12.6666666667}
{"start_date": "1332534807", "end_date": "1332619867", "thread_id": "t3_rahgm", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 38, "text": "<maldegro>: TIFU: I got locked in the bathroom stall at my boyfriend's frat until one of his brothers broke down the door. At no point did it occur to me to crawl underneath the stall.<NatecUDF>: Out of curiosity, exactly how did you get locked in the stall? Lock breaks, no fuck up. You spontaneously forget how to use your hands? That's internet history. [deleted]: The door opened in and somehow I slammed it shut with enough force that it passed the lock and wouldn't open back up.", "num_messages": 3, "avg_score": 12.6666666667}
{"start_date": "1332534179", "end_date": "1332588337", "thread_id": "t3_ragwo", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 6, "text": "<purplejasmine>: TIFU by apparently going too far... for 4chan. Long story short, my friend said he'd try to find some Amanda Knox images for me (I'm a little obsessed). Whether joking or not, I wasn't sure, but it turned out he went onto 4chan and asked for Rule 34 on Amanda Knox. To which several people replied that he was going too far/that was too hardcore. He then printscreened the whole thing and posted it on my Facebook wall as proof. For those who don't know what I mean when I say rule 34, I refer you to the [rules of the internet](http://rulesoftheinternet.com/index.php?title=Main_Page) : 34 There is porn of it, no exceptions. 35. If no porn is found of it, it will be made. <RE>: Proof. After trawling back through my removed facebook posts, I found the screenshot. Turns out the comment was 'The day /b went too far.\" For proof, refer to [this link](http://www.flickr.com/photos/75541553@N03/6864573520/in/photostream) [deleted]: Proof or gtfo.<purplejasmine>: Proof.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1332562662", "end_date": "1332637624", "thread_id": "t3_rb12g", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 308, "text": "<Benjy741741>: TIFU: Killed a dog I was out on a casual bike ride this afternoon. Around 8 miles from my home, I approached a house with a notorious Rottweiler that likes to chase (and hurt) people. Well, the fucking thing takes off after me. I thought I could just burn it out of sheer speed, but he's on me like stink on shit. I figure I'm doing around 40 at this point, and the dog is matching my speed. I'm scared for my life, so I was going batshit crazy and pedaling like I never have. I see a car up ahead. I don't give it a second thought, but as it passes me I hear a *screech* and then **thump**. The dog was apparently running after me and when the car came, it switched over to the other side of the road, right in front of the car. It died. I feel awful...even though it was a horrible, vicious dog that has mauled people before (don't ask me how it wasn't taken) , I feel responsible for his death. tl;dr-Dog chased me, car passed me, car hit dog. I feel bad. <Constant_Reader>: Dog chased you, car hit dog, dog's owner's fault.<fiveifrenzy6>: It's the dogs fault too. It was the one that chased him in the first place. Animals will be animals. Nothing he could've done would have changed what happened. Either he stops and get attacked by a dog or it gets hit. He was only protecting himself. He shouldn't feel bad at all. It's more like TIDF (today i didn't fuck up) He got away from a vicious dog and now it won't be hurting anyone else anymore. <Constant_Reader>: The dog can't REALLY be at fault because, as you said, \"Animals will be animals.\" The dog should have been inside/on a leash/behind an adequate fence. It was the dog owner's fault for allowing the dog to chase anyone. Not only that, but the dog should have been trained better to begin with. But I agree with your point that OP didn't fuck up.<fiveifrenzy6>: so it's another animals fault that an animal acted as its self? but not the actual animal who did the attackings' fault? If we are responsible for our actions how are animals not responsible for their actions? They act on their own just as we do. You are forgetting that we are animals as well.<RAVantas>: Dogs aren't what I'd consider sapient.<fiveifrenzy6>: There are a lot of people who we wouldn't consider sapient but we don't blame other people for their actions do we? Why do we think that we are the only animals at fault for our actions? We are just as much influence by other people as that dog was influence by it's owner. If you're going to blame the owner for the dogs situation you might as well blame the owners parents for the dogs situation. <wheresmyhouse>: Like kids? Because when a kid fucks up, we generally blame the parent.<MacEnvy>: Like severely mentally handicapped people. Whom the state of Texas still executes for crimes, if I recall. I don't agree with it, but it's relevant.<wheresmyhouse>: I remember that case. It was fucked up. What should have happened was Mathis' caretaker, (I believe that's his parents) should have been indicted and convicted of involuntary manslaughter. Regardless, last year the supreme court has ruled that executions for the mentally handicapped are unconstitutional. As such, Texas can no longer execute the mentally handicapped without violating U.S. law.", "num_messages": 10, "avg_score": 30.8}
{"start_date": "1332515113", "end_date": "1332787851", "thread_id": "t3_ra14i", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 20, "text": "<br0kenr3crd>: TIFU: Threw my keys away and held onto the coffee cup I was on my way out of my usual coffee stop heading to my truck for work and threw away my keys in the sidewalk garbage can and held onto the cup. [deleted]: Oh man I've been there before. Several times actually. I would say that the worst instance was when I tossed an entire sandwich instead of an empty carpri sun. Felt bad man <br0kenr3crd>: That's just gonna put a downer on the afternoon. [deleted]: I made lemonade out of lemons. After I threw away the PB&amp;J I made a delicious deli meat sandwich.", "num_messages": 4, "avg_score": 5.0}
{"start_date": "1332631798", "end_date": "1332804292", "thread_id": "t3_rc009", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 208, "text": "[deleted]: TIFU: I went to fart in the shower, and explosive diarrhea came out. <disposablechild>: I'm scared I will do this in a friend's shower one day. I've exploded into my boxers while peeing at a friends house once. That kind of sucked. \"Hey man... if I were to ask you for a pair of boxers, no questions asked, would you do that?\"<zf420>: I'd rather just suck it up and go commando.<Esteam>: And smell like shit for the rest of the day?<zf420>: clean boxers won't take the smell away.<nonalined>: \"Hey man, got any baby wipes?\"", "num_messages": 6, "avg_score": 34.6666666667}
{"start_date": "1332636541", "end_date": "1332705255", "thread_id": "t3_rc36o", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 42, "text": "[deleted]: TIFU: Threw an open water bottle onto my bed I had been distracted by my phone while replacing the lid, so i absent-mindedly just did what I had been planning to do with the bottle before I was distracted. Now I have a soaking wet bed :(<Big_Pianist>: No you pee'd your bed don't try and hide it. <tangomaureen>: Dammit, you caught me. I thought posting this on a public forum would take away all traces of suspicion...<BlackMarsh>: I know that feel bro. (Not really)", "num_messages": 4, "avg_score": 10.5}
{"start_date": "1332645545", "end_date": "1333989765", "thread_id": "t3_rc94g", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 95, "text": "<sleepinlight>: TIFU by forgetting to lock my phone, which resulted in it accidentally sending the most recent picture I had taken to my 13 year old sister. Which happened to be a picture of my girlfriend giving me head. I am mortified. <warboy>: Pics or gtfo. No one has a girlfriend here.<bibbleskit>: lots of people have girlfriends here. lots of people here are girlfriends<InfintySquared>: That's a nice fantasy to have, but we all know there are no girls on the internet.<Desopilar>: Oh, hum. Well that's a might bit sad. And to think, for 20 years I thought I was a girl. I guess all of those biology classes must be updated! D:&lt;<SHFFLE>: Yeah they went back and changed definition of girl to \"Female, not on internet (Excl. Facebook)\" Tricky Bio book writers... . <GreenmanofLegendXI>: whos making my sammich?", "num_messages": 7, "avg_score": 13.5714285714}
{"start_date": "1332710932", "end_date": "1332733995", "thread_id": "t3_rd6lp", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 50, "text": "<funk100>: TIFU: I spent my weekend on reddit <rudagarmylad>: It took this post to make me realize how much human interaction I missed this weekend and or year <mrlr>: But Reddit *is* human interaction, isn't it?<snidely_mustached>: With out all the pesky human contact..", "num_messages": 4, "avg_score": 12.5}
{"start_date": "1332723143", "end_date": "1332866559", "thread_id": "t3_rdg8y", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 453, "text": "<bibbleskit>: TIFU: rained hard and the sides of the streets are flooded, thought it would be fun if... I drove my car into the giant puddles to make huge splashes. So I did. Didn't see the old lady. The force of the wave not only soaked her, but also made her disappear into a bush. She's ok though.<ifihadlegs>: This cracked me up so hard. I'm pre-nominating this for fuck up of the week. <NeedsRiotJuice>: Is this a thing? make this a thing!!!!!<wheresmyhouse>: It's totally a thing, dude. There's a link on the top of the page.<kinda_alone>: and now the side bar too", "num_messages": 5, "avg_score": 90.6}
{"start_date": "1332728617", "end_date": "1332733521", "thread_id": "t3_rdkos", "subreddit": "tifu", "subreddit_id": "t5_2to41", "total_score": 5, "text": "<kirill14n>: today I told my gf that nobody loves her <henaye_cochone>: Was this one of those things where your brain and mouth have this conversation: * Brain: Oh, I know! Say this! It's sweet, funny, and she'll love you for it * Mouth: NO ONE LOVES YOU. * Brain: WTF that's not what I said to say D: tl;dr - back story?<kirill14n>: There was definitely some brain - mouth malfunction. We are just near breaking up, and I wanted to say something along the lines of \"why do you treat me like shit, when I am one of the only people\" who love you\" which is already pretty mean, but NO ONE LOVES YOU came out instead. gah<henaye_cochone>: ohhhh.... ouch. why for break up? If you don't mind me askinging.", "num_messages": 4, "avg_score": 1.25}
