{"start_date": "1543561958", "end_date": "1543602362", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 25020, "text": "<EnoughPM2020>: A 9-year-old girl wrote a letter to NBA star Steph Curry pointing out that his Curry 5 sneakers appeared only in boys' section. After he saw the letter, Curry and Under Armour (his shoe sponsor) fixed the situation, sent her a pair of Curry 5s and told her that she will receive the new Curry 6s. <Johndabonbon>: This is great<jokar1134>: This feels like a giant advertisement.<Dheorl>: Every single thing a company does is an advertisement in one way or another. Would you rather they just never did anything but take your money?<Slappants>: I wish corporations did a bit more with their tax breaks and profits, especially those “Triple Bottom Line” companies, but this is an important sentiment to remember. <magicishappening>: Patagonia just announced that they are donating their $10 million tax break they received from the recent tax cuts to environmental groups fighting climate change. https://www.cnbc.com/2018/11/29/patagonia-10-million-tax-break-could-help-save-the-planet--and-set-an-example.html <Bells_Ringing>: As a conservative, I'd view this as a success story. They know where they'd like to use their money and elected to put it into environmental causes. That's exactly how we'd hope this works. My family will be giving more to charities this year that are local and immediately impactful ijy area as a result of the tax law changes. <DHPNC>: except this is an exceptional story. most companies that aren’t run by Yvon Chouinard will use this money to compensate the CEO more or do something besides charity. when there’s no incentive to do good only the very very good people will do it.<Bells_Ringing>: Frankly those are valid options as well. I'll likely buy a Patagonia jacket this month versus a different brand because of it, also using some of the tax savings. Is that bad as well? That's me selfishly using some of the windfall in a non-charitable manner. <DHPNC>: exactly. Holding up Patagonia as a model of why the tax windfall is good and charity deductions, etc. are bad is stupid because they are one example in a sea of shitty examples.<Bells_Ringing>: I don't follow. I will keep more of my money this year due to the savings. If I buy something I want with it, I'm doing what the bad companies do, which is bonuses or raises. If I give to charity, I'm good because I'm like Patagonia. Either way, I get to do what I want with the money. Is that not a good thing intrinsically? And if Patagonia were truly philanthropic minded with no ulterior motive, they would not have revealed the charitible gift, which is giving them far more than 10 million in free advertising. Again, I don't care what they do with it.<SenorBirdman>: Yeah I doubt it is worth the price of what you can buy for $10m in advertising. Citation needed. And no, the whole crux of the disagreement is that other people think that is not intrinsically good. That's the point. Companies should be taxed so the money can be put to good use in a way that has been determined as beneficial for society as a whole by people whose job it is to make those informed decisions, rather than letting the companies spend the money on whatever they want and hoping that some might choose to do some good with it. You seem to fundamentally disagree with and/or not understand the point of tax.<Bells_Ringing>: Perhaps you are the one who doesn't understand what taxes are for? Taxes are to find government services, such as roads, military, post office, and other essential services. All taxes are paid by people, either as personal income taxes or through higher prices for goods and services in the form of corporate taxes. Tax revenue is the highest in our history this year. If the reduced rates are unacceptable, what is a fair rate that everyone should pay? Also? Those informed decisions on spending are policy decisions. If you believe there is General consensus on policy in this country, how does one explain bush -&gt; Obama -&gt; Trump ?<Talanaes>: From each according to his ability, to each according to his need seems fair enough.", "num_messages": 14, "avg_score": 1787.1428571429}
{"start_date": "1544716695", "end_date": "1544894769", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 1226, "text": "<speckz>: Millennials Are Driving The Worldwide Shift Away From Meat - Thanks to shifting tastes amongst those born after 1980, 70% of the world’s population is reducing meat consumption or leaving meat off the table altogether <theinspector5>: Does this really deserve to be here? I'm not saying it's bad, but it's not objectively good. It's simply describing how a certain age group has certain dietary preferences. This sub is for news that we can all agree is good. This is a neutral story.<plzstayrad>: I think it’s being considered “good” because the global scientific community agrees that raising livestock for meat is a huge contributor to deforestation/water pollution/the climate crisis. <veregat>: Lol it’s very small contributor to all aforementioned topics<TITTY_WOW>: Ummm no it’s not? The beef industry ALONE is so wasteful, and so damaging to the environment<veregat>: Yes it is. But again, it’s a fraction compared to just about any other industry. And what, you really think the beef industry or meet production will ever cease? You’re daft if you think that is the case. Down vote me all you want, I’m right. Pick your battles, this is a silly futile one, people will always eat meat.<TITTY_WOW>: ‘Meat isn’t damaging BECAUSE people will always eat meat’ Think. It’s a fraction but a rather large fraction. Around 15% of global emissions stem from animal agriculture. <veregat>: Exactly, so worry about the other 85%.<TITTY_WOW>: Well it’s not like the other 85% is coming from one single source. A large portion of it is industrial, which I really have no control over. Why should I just ignore it when I can do something about it? That would just be pathetic. I’m pretty convinced that you’re trolling actually<veregat>: No, there’s just so many more things to be worried about in the world than this. Pick your battles better.<Nomriel>: [http://science.time.com/2013/12/16/the-triple-whopper-environmental-impact-of-global-meat-production/](http://science.time.com/2013/12/16/the-triple-whopper-environmental-impact-of-global-meat-production/) &amp;#x200B; boi, do you have to read more. Meat is disastrous to the environment and food production is the second most polluting activity we do, soon to be the most &amp;#x200B; more than 80% of the arable land is used for meat, and meat is less than 20% of calories eaten by humans. it's hilariously ineficient. a steak is the least efficient food you could find on earth <veregat>: Now your argument is meat is not as efficient as what? And what is your solution? There isn’t one, people will always eat/want meat. I’m guessing you’re just a mad vegan, am I wrong?<Nomriel>: you are dead wrong i stopped eating meat during the week and still do during the week end or during special event. and even then no beef, Chicken or turkey has a way smaller impact on the planet and fill my need of meat. Meat is bad for the planet, reducing your consumption of it is absurdly easy and good for your health it’s inefficient, polluting, dangerous for the environment. It drives deforestation, reducing our global consumption of meat would free so much space you could easily feed billions of people today. just think about it, you give all your food for a cow, and you eat said cow only at the end, such a waste of ressources we deeply need. the mad person here is you. i’m not telling you to do anything, do whatver you want. but saying that the meat industry is a minor player in global warming is blatantly false <veregat>: Dude, there is just so much else wrong in the world, and this is so insignificant to real problems. Pick your battles, and cattle isn’t one you should loose sleep over lol. Worry about world hunger, or disease, or poverty. <Nomriel>: poverty is going to explode thanks to global warming, and meat consumption is one of the leading cause &amp;#x200B; Disease is also going to be increased thanks to the meat industry who prefer to shove as much antibiotic as possible into some animals, creating antibiotic resistant batceria &amp;#x200B; finally the world hunger could be fixed right now if we stopped giving about 80% of our land to feed our animals we then eat. Also Global warming is going to destroy all the efforts we made in this domain, as a matter of fact, for the first time in decades, the number of persons who are starving is rising again thanks to global warming. &amp;#x200B; trust me, i pick my battles, and the way we eat is a leading cause of what await us during this century.", "num_messages": 15, "avg_score": 81.7333333333}
{"start_date": "1543608360", "end_date": "1543651815", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 3962, "text": "<flyZerach>: 'I can use my old ID': Face transplant patient reveals results a year after surgery <AlexanderWolf90>: Damn, Face Transplants have come a long way in a short amount of time. <papayaa2>: Absolutely. I remember pictures where people looked like Frankestein's monster - you could clearly tell which part where added. He looks pretty normal now, it's amazing! <iamasian1>: It’s really satisfying that you said Frankenstein’s monster. <AcidicOpulence>: Also quite insulting.<CannotDenyNorConfirm>: I mean, please, do you need sugar coating on everything? Ain't reality and truth better?<AcidicOpulence>: Well I wasn’t the one being insulted, but I have empathy, you could try it some time.<CannotDenyNorConfirm>: I absolutely got that, that's what I said, do you need sugar coating, you, on every reality and fact? Life is tough, life is ugly, sometimes very much so. And sometimes it's very beautiful and not chaotic at all. Accept reality. One can love himself for what he is, but that doesn't negate the reality. I have a friend who's ugly and very aware of it, he brought it up once, instead of saying he was ugly, I told him he could improve in some areas to compensate what he disliked about himself, but why would I ever tell him \"oh no honey, you're beautiful, and so much better in the inside\" come on. <AcidicOpulence>: Dude loses his FUCKING FACE but some basement dweller hardcoreing it on the internet, wants to call names. That’s the hill you want to die on? No one asked you to call the face transplant dude beautiful. Just don’t call them a monster. But I guess that’s too much for you.<Maddogg218>: In all fairness, he turned himself into a monster by shooting himself in the head. Also, It's not like hes calling him a monster to his face (haha).<AcidicOpulence>: Yeah I guess it’s funny because op hasn’t the balls to call transplant guy names to his face. But likely not the way you were thinking it was funny.<Maddogg218>: Life is gonna be hard for you when pointing out realities is gonna trigger you into having a meltdown, not the mention the person you're talking to wasn't even the one who even mentioned Frankenstein's monster. The guy had a busted mug, someone didn't sugar coat that fact in the same sentence that said his face looks good now and you got your knickers in a twist over it.<AcidicOpulence>: No twisting under ware here, unlike the other guy on the thread that had to resort to name calling. What is wrong with you people that you haven’t got the common decency to see what’s wrong with what you are saying and defending?", "num_messages": 13, "avg_score": 304.7692307692}
{"start_date": "1544710648", "end_date": "1544810556", "thread_id": "t3_a5t4lv", "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 200, "text": "<throwyatrashaway>: Idk man, one of those dudes is a Canadian businessman with ties to North Korea - I wouldn’t be surprised if he was actually doing some shady shit that they had previously ignored but after the Huwawei CFO incident are cracking down on. The enforcement may be politically motivated, but foreign businessmen set up in China who have had their picture taken in North Korea smiling next to Kim Jong Un aren’t exactly positioning themselves as innocent. Not sure about the other case.<jlialp>: I dream of a world where corrupt businessmen are imprisoned on a daily basis.<Battalkruvazor>: I dream of a world where all businessman are imprisoned on a daily basis.<I_am_Hecarim>: .... Why?<Battalkruvazor>: Short answer: Because I have seen all my life how communities changed, how people became bitter and desperate, how depression skyrocketed and how ignorance became a virtue and ignorant the king just so that we could live in an environment that suits businesses. Longer answer: https://monthlyreview.org/2001/03/01/global-media-neoliberalism-and-imperialism/ Really long answer: https://www.amazon.com/Capitalism-Competition-Conflict-Anwar-Shaikh/dp/0199390630<I_Plunder_Booty>: Yeah things were so much better when we were living in tribes in the jungle while tigers ate our young. The quick ones that survived the tiger attacks soon died of an easily treatable infection. It amazes me that now a days ideologies of edgy 13 year olds are unironically being spouted by people who are old enough to know better. What happened to society to make it so damn ignorant in recent years?<Battalkruvazor>: I'm 33 and I have a PhD in Statistics. Here's another 13 years old edgy socialist you may know: https://monthlyreview.org/2009/05/01/why-socialism/<UWantWhatUGet>: Oy vey! The ends always justify the means...YAWN. Here's a stat for you doc, the likelihood that a sixth grader in Baltimore City Public Schools will graduate with a college degree within 6 years of graduating high school (if they do and even 2-year AA degrees counts in this stat), is ~4%. The government in Baltimore and to an extent Maryland largely controls the means of producing educated people there, why not put them in control of many other things? <StockDealer>: &gt; Here's a stat for you doc, the likelihood that a sixth grader in Baltimore City Public Schools will graduate with a college degree within 6 years of graduating high school (if they do and even 2-year AA degrees counts in this stat), is ~4%. I haven't seen the stat you're referring to, but let me interject with \"no, you're almost certainly misunderstanding this statistic.\" Here's some (non-cherry picked) stats for you: https://www.towncharts.com/Maryland/Education/Baltimore-city-MD-Education-data.html<UWantWhatUGet>: American Community Survey? Why not use the actual data from the State? Additionally, you cannot compare the number of people with college degrees in the City to the number of people that went to City Schools and got a college degree. The people in the ACS in B'more who are doctors and lawyers and business pros are largely not BCPSD grads, they are imports from other areas. <StockDealer>: No, it's not my job to discredit your obviously on its face erroneous statistic. If you cite it then I can look at how you are both misunderstanding it, and cherry picking it.<UWantWhatUGet>: [The consortium also](https://www.baltimoresun.com/bs-md-ci-college-completion-report-20110907-story.html) found that only 5.8 percent of those who started at a two-year college earned a degree in six years compared with 34 percent of those at four-year-colleges. The report — the most comprehensive look to date at college acceptance and completion trends for city school graduates — used data from the class of 2004, tracking degree completion through 2010. Start with 5800 sixth graders, about 75% graduate, so you're at 4350. 47% of those, 2044, go to college. 50% go to 2-yr schools and 5.8% graduate - that's 60 kids and 50% go to 4-yrs and 34% of those, 348 graduate - so 408 out of 5800 get a degree - so 7% - oops, I misspoke. Keep believing 75% or w/e they tell you. <StockDealer>: So about half go on to college. It's right there in your document. If you want you could help with this by increasing taxes to pay for these things, as many other countries successfully do. But I suspect it's not the poverty and cost of education that you want to focus on with your grossly misleading statistics.<UWantWhatUGet>: 7% graduate within 6 years. That is not grossly misleading, that is the fact. &gt;about half go on to college Of that 1/2, only 20% graduate in 6 years (and that includes the 1/2 of that 1/2 that go to 2-yr schools. &gt; you could help with this by increasing taxes to pay for these things Any qualified kid from that district gets to go to college for free, are you kidding - colleges are dying for qualified minority kids. Did you know that in Baltimore, if you are a qualified (like barely minimally qualified) BCPSD graduate, you can get a free ride to Johns Hopkins? Really. Not many do of course because after $16,000/yr/student education, only about 10% are even close to qualified. 1/2 the kids are not proficient in anything...literally. Public education is the biggest boondoggle going, especially in urban districts where it is effectively day care. Spend more money - what a crock. Money doesn't buy you shit in education, except votes. Look at the KCMO school district and the $2B they got - only metric that went up was drop-out rate. Zuckerberg got sucked into corey booker's scheme to get Newark kids $200M - he lost $100M as the money was \"squandered\" and you still wouldn't send your kid to Newark schools if you had to. There are plenty of other instances as well. Ever wonder why your local school board never touts the successes of their kids after the previous bond initiative victory when they advertise the next one? because there is no advancement. Putting more dumb kids in college is the most insane idea ever, and the left laps it up like it will do something without ever doing the research - they simply want more money to scam from productive people to buy the votes of the unproductive. Unbelievable. Stats PhD tries to tell us that 75% or some GROSSLY MISLEADING number of Baltimore City Schools' kids get degrees. Suckers. <StockDealer>: &gt; Any qualified kid from that district gets to go to college for free, are you kidding - colleges are dying for qualified minority kids. You're now arguing with the same article you just cited which states that it is clearly the financial burden which is preventing higher graduation rates. Do you want me to cite your article that you just posted or not?<UWantWhatUGet>: The devil's in the details. \"qualified\" matters. Nearly 2/3rds of the graduates are not proficient at 'grade-level.' Grade level is basically can read and write in complete sentences and maybe form a decent paragraph and knows a bit of algebra. Those kids don't know that stuff. 25% of all 4-year college course across the US are remedial level. These kids aren't even qualified for that. They get their grants and fed funding, then they do terrible and lose the funding because they are not qualified. They don't leave because they cannot afford it, they leave because the people that were paying for them no longer will. Regardless, you're at 7%. Quit pretending that we are missing out on the cancer curer or the next Newton. People aren't pets, quit treating them like they are and maybe they'll stop acting like they are owed everything in life.<StockDealer>: You just keep gish galloping all over the fucking place. I blame the school system for your inability to follow even your own citations.<UWantWhatUGet>: give me money...i'll learn better<StockDealer>: No, you literally haven't even read the report that you're trying to barf out. There's no way to learn if you don't actually read the real numbers, rather than some bullshit hate that you're trying to prop up. The numbers are 40% and 11% and were increasing in 2013, as is stated in the report. Plus this is city-only. But let's be honest, you're not interested in that. You're literally using 2 year schools, which have a track record of ripping people off and also going out of business, the ones that exploit the poor, to slam people who are literally on FARM assistance. That's a dick move. I notice you don't say \"Hey, 40% are graduating from four year schools, not including non-city enrollees and those that complete later!\" Let me ask you this to illustrate how little you researched about this: what's the last number in table three of the actual report? This number is important. <UWantWhatUGet>: 40% are not graduating from 4-yr colleges. Only 47% (of graduates - don't forget to back out the dropouts, too, so that number is much less) enroll at all, half go 4-year and half 2-yr. 2008 - 535 graduate 4-yr and 62 from 2-yr within 6-years; out of about 5800 kids 2009- 565 &amp; 84 2010 - 520 &amp; 89 [Here ya go.](https://imgur.com/a/GhjczjK) I do not care if the are FARM kids or not. And we are talking Baltimore City for a reason. It is an entirely dysfunctional waste of money. [source](https://baltimore-berc.org/college-fact-book/) - link goes to pdf <StockDealer>: Oh, you're switching to 2017 now? And the BERC fact book rather than the original reports? Okay -- you're a big moving blob but sure. Good googling! Now you're actually sort of reading what you're writing about. That's an improvement. You don't care if there are FARM kids or not? That's another dick move. Poor kids are much less likely to be able to graduate, as the report states. And the reason we're even discussing Baltimore is because you cherry picked it in the hopes that it would reinforce you. Because you call that thinking. Firstly, yes, the numbers will change when you google a different year. Secondly, you don't seem to be understanding that these numbers are all not all graduates of all programs everywhere. These are students who stayed in the city to complete their degree or diploma. Thirdly, as before, you forget that the two year \"schools\" such as ITT tech and shitty, horrible offensive and disgusting criminal schools like \"Trump University\" fed off of and exploited the poor. Fourthly you don't seem to realize that these city schools include \"charter schools.\" Now, if you're interested in comparing how it does, let's compare it against, say, one of the shithole states in the middle of the country. Would you like to pick Texas, Alabama or Mississippi?<UWantWhatUGet>: No, I'm not switching to another year. That report shows the years i was discussing from the beginning. The entire reason we're looking at 2017 data is because we need the 6+ year college activity of the 2010 HS grad class. You have nothing of substance to offer. You are flailing about trying to invoke racism and Trump U. Come back when you have some real data and intelligent analysis - you'll need to cite those because clearly you aren't bringing it. I picked one of the 24 districts in one of the most highly rated public school systems in the nation. If you want to dumpster dive, go right ahead. Public schools everywhere, except for a very very few cloistered districts are a scam. time for you to bring something to prove it otherwise.<StockDealer>: Okay, let's recap what you discussed in the beginning since you've forgotten: &gt; Here's a stat for you doc, the likelihood that a sixth grader in Baltimore City Public Schools [wrong] will graduate with a college degree [wrong] within 6 years of graduating high school (if they do and even 2-year AA degrees counts in this stat [wrong]), is ~4%. [wrong] You only got the \"six\" right. And now you're trying to draw a line between \"highly rated\" school systems and graduation rates [wrong]-- while you blow off poverty rates which are the more critical predictive variable. Was your goal to prove that libertarian \"philosophy\" is fucking moronic? <UWantWhatUGet>: What are you talking about? &gt; likelihood that a sixth grader in Baltimore City Public Schools [wrong] (RIGHT) How can that be wrong? I made the premise. &gt; will graduate with a college degree [wrong] (AGAIN, RIGHT) Again, I made the premise. &gt; within 6 years of graduating high school (if they do and even 2-year AA degrees counts in this stat [wrong]) (RIGHT) Are you even reading? The data is right there in the chart and further in source. ALL COLLEGE DEGREES - 2-yr or 4-yr. &gt; is ~4%. [wrong] (Wrong) The number is 7% - whoopty fucking do. &gt; And now you're trying to draw a line between \"highly rated\" school systems and graduation rates [wrong] No I did not. This has always been about Baltimore City Public Schools. &gt; while you blow off poverty rates which are the more critical predictive variable. Poverty rates are correlative with poor education success - of course it is, most poor people are below average in IQ and poor parenting. I showed you that pouring money into a school system does not benefit the students, you ignore that because it doesn't fit your pre-ill-conceived guess as to what makes kids successful in school. You have offered no support for any of your assertions because you know you are simply making shit up or regurgitating what some hustler told you to think. congratulations on joining a long and getting longer list of people that think they know what they are talking about here who then get schooled because they have no support or ability to refute anything i have said.", "num_messages": 24, "avg_score": 8.3333333333}
{"start_date": "1531875508", "end_date": "1532008715", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 54, "text": "<stevenjo28>: Man Uses AR-15 To End Multi-County Crime Spree <MFAWG>: And he needed a 30 round magazine to do this?<Bazilthestoner>: Well not from what I read. After he ran out he just pulled out a second gun.<MFAWG>: So spray and pray? Well trained professional, that one.<Bazilthestoner>: Did you even read the article? It took all of 90 seconds. <MFAWG>: I had a hard time wading through the bullshit.<Bazilthestoner>: Just because something doesn't fit your narrative doesn't make it bullshit. Maybe it isn't true, but maybe it is. <MFAWG>: Here’s a narrative: hick retired cop is too freaked out to grab an extra mag and reload and has to go back to the truck for another weapon. How’s that?<Bazilthestoner>: So which is it? Did it happen and the cop is a dipshit because he managed to stop the guy without actually killing him? Or is it all bullshit? Either way, it sounds like you just want to argue, and I don't have time for that. Chill out, and have a nice night. <MFAWG>: 30 plus rounds and he couldn’t seal the deal? Not impressed.<MetaCommando>: /r/iamverybadass<MFAWG>: It’s not hard to get extensive practical training in these things.<Joshington024>: And I'm assuming you know this because you've had extensive practical training and have been in a similar situation where you're fighting for your life with adrenaline pumping like crazy through your body?<MFAWG>: I have had extensive practical training, yes. <Again>: it’s not hard to get. They even pay you’", "num_messages": 14, "avg_score": 3.8571428571}
{"start_date": "1543583809", "end_date": "1543623022", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 46, "text": "<speckz>: France to close 14 nuclear reactors by 2035: Macron <TheZenMann>: This is honestly bad news rather than good news.<HoldThisBeer>: Why? The article also says they are closing coal-based plants and increasing solar and wind power. Is there something the article is not telling us or do you just think that nuclear power is better than solar and wind?<TheZenMann>: Nuclear reactors have no CO2 emissions, and closing them down at a time when the world desperately needs emission free power does not seem like good news. Even if they replace it with renewables they could sell the extra energy to foreign nations who rely on fossil fuels. Plus Nuclear power is much cheaper than renewables.<SilverNicktail>: Article literally states they're replacing it with renewables and potentially new nuclear reactors...", "num_messages": 5, "avg_score": 9.2}
{"start_date": "1543424719", "end_date": "1543519788", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 61674, "text": "<God_Wills_It_>: Outdoor clothing company Patagonia Inc. has committed the $10 million it saved from federal tax cuts championed by President Donald Trump to nonprofit groups who work on conservation and climate issues. <venomous_frost>: what's with all the people saying this is exactly how the tax cuts are playing out and it's way better than going through government bureaucracy. The majority of tax cuts will just go to company profits, there just are some exceptions which is why this is news. <puddingfoot>: You’ve got to remember that these are just simple farmers. These are people of the land. The common clay of the new West. Trump supporters. You know… morons. This thread is being heavily brigaded.<bovineblitz>: &gt; People with a different perspective from mine = they're dumb/we're being brigaded/bluescreen<puddingfoot>: Nah, the brigading here is obvious (you are part of it), and they're/you're stupid because their/your views are stupid, not because they are contrary to mine.<bovineblitz>: You can't brigade a neutral subreddit thread that makes it to r/all. It's called participating.<puddingfoot>: Uh, yes you can.<prollyshmokin>: I legit feel like I'm in a black mirror episode right now, reading these comments.<puddingfoot>: With you on that. The last two years have made me uncomfortably good at spotting astroturfing and brigading.<mason240>: It's a little scary that you think everyone who disagrees with you is part of some plot to get you.<puddingfoot>: Lol, fuck off shill. I don't think anyone is out to get me, I'm just some guy.<mason240>: You seem to know a lot about this. Where can I sign up to be paid? I'm already making these comments, may as well be paid. You seem certain that's happening, so unless you're full of shit you'll be able to point me in the right direction.<puddingfoot>: I didn't say anything about people being paid, dummy. That's you projecting, typical of Trump supporters and conservatives. I also don't have to know where you sign up for something to know that you can be signed up for something. I don't think all brigading and astroturfing is paid, because I'm not a conservative who thinks everyone on the other side is making those sweet Soros bucks. There's enough dumbasses out there to do it for free.<mason240>: &gt; The last two years have made me uncomfortably good at spotting astroturfing . &gt;Lol, fuck off shill. Maybe you just don't know what the words you're repeating mean.<puddingfoot>: shill: an accomplice of a hawker, gambler, or swindler who acts as an enthusiastic customer to entice or encourage others &amp;#x200B; Trump is a hawker and swindler and you are the customer<bovineblitz>: There's shills for corporations, local businesses, legitimate politicians, lobbyist agendas, upstart projects, etc. It's not limited to any one category.<puddingfoot>: What the fuck are you talking about? Those can all be hawkers or swindlers.<bovineblitz>: Jesus dude. Calm the fuck down.<puddingfoot>: Nah, I'm good.<bovineblitz>: &gt; I'm good Somehow I doubt that<puddingfoot>: Your doubt is worth less than the dog turds I picked up this morning. Want to keep telling me about how there's more than one kind of shill, or do you want to move on to how there's more than one kind of geometric shape?", "num_messages": 21, "avg_score": 2936.8571428571}
{"start_date": "1543600113", "end_date": "1543626609", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 369, "text": "<songsandspeeches>: Terminally ill 14-year-old wants to get as many Christmas cards as he can <DonnieMoscowSwine>: If the kid is terminal, this isn't uplifting news at all. In fact, it's pretty fucking depressing. <Pokemongoplayer11>: And just when you thought you were in your safe space<LSARefugee>: I feel heartened that he has such a positive attitude and would like to reach out to the world, while there is still time. Blessings.<OzzieBloke777>: I fail to see how this is a productive positive attitude. What is it supposed to achieve? Bring more attention to cancer in general? Or the specific type of cancer he has? It's not like a portion of every card bought will be donated to cancer research or something else useful. So, what's the end-game here? Just get a pile of cards?<carguy07>: How about who cares? Whatever makes him happy. If it's a pile of supportive cards from caring people all over the world then so be it. Kids dying, who are you to question his choices. The article also said he's raising money for cancer...", "num_messages": 6, "avg_score": 61.5}
{"start_date": "1543409227", "end_date": "1543625221", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 13175, "text": "<progress18>: Bus driver buys homeless rider dinner, lets him stay on warm bus all night <Rumplestiltman>: I wish there were go fund me pages for local hotels. I'd rather donate a room for the night than support a habbit by paying the panhandlers.<takingmykissesback>: There's probably several local organizations near you that would be grateful for your generosity. Homeless shelters/organizations, food banks, \"soup kitchens\", heating assistance programs, coat-a-kid.<Rumplestiltman>: I'm not trying to throw my money away.. unfortunately there are a lot of people who aren't homeless that take advantage of the places you mentioned. I don't like giving hand outs.. I believe people have to show responsibility and respect for themselves before I try to assist. I just don't want people to freeze to death. If its summer they can sleep outside... I go camping often and its actually pleasant.<ChurlishRhinoceros>: You do realize that a lot of these people have mental illnesses and drug problems and it's often hard for such individuals to show responsibility and respect even though they may be trying to. You need to understand the whole situation.<Rumplestiltman>: I do.. I was in jail with a lot of them for 3 months..DUI.. Most of them just want to do drugs an coast. I was told some story's about how dumb people are. People used to shame the town drunk. Now we put a participation ribbon on whatever their addictions are. There is no incentive to change when the system supports their lifestyle. Be kind. Be generous. Be good hearted. But be aware that there a lot of completely able, and shamelessly selfish, people that will take you for everything you have.<ChurlishRhinoceros>: We don't shame people anymore because we've come to the realization that the situation people find themselves Isnt necessarily all their fault. It's called empathy. And sure there will always be selfish people. But that's a stupid reason to just not help.<Rumplestiltman>: Ok just don't think throwing money at an addict helps.<ChurlishRhinoceros>: You're just making the assumption that it won't.<Rumplestiltman>: An educated conclusion is how I put it.<ChurlishRhinoceros>: I wouldn't.<Rumplestiltman>: Find your way into an equal conversation with a panhandler. When they aren't after your sympathies they reveal a much different approach.<ChurlishRhinoceros>: Did you even read anything I said? These people often have mental illnesses.<Rumplestiltman>: Yeah some do and some use it as a hard to disprove excuse to shamelessly mooch off of good hearted rubes. Be nice to everybody you see with a hand out if you want to, that's your choice. Its my choice to look at a 22 year old able bodied drug addict as a burden that is unnecessary.<ChurlishRhinoceros>: Ya sure. I just think that's the wrong choice. Ur hurting more people then helping.<Rumplestiltman>: I'm not hurting anybody. I'm just not supporting their habbit. I'm not helping them hurt themselves. Therapy is the answer to mental illness. Not doing heroin.", "num_messages": 16, "avg_score": 823.4375}
{"start_date": "1544751078", "end_date": "1544820709", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 16650, "text": "<r4816>: With scientists warning that the Northwest’s beloved killer whales are on the brink of extinction, Washington Gov. Jay Inslee announced dramatic plans Thursday to help the population recover — including $1.1 billion in spending and a partial whale-watching ban. <sonnet29>: Breach the four dams on the lower Snake River. Restore chinook salmon runs. Do it now. The dam on the Elwha River was breached just a few years ago, and salmon began running just a few days later. Breaching the dams is the most effective, most immediate solution. <timtombackwards>: And your solution for the loss of power is...?<girlinmotion>: Nuclear. <Annihilator4413>: People freak out about nuclear power all the time thanks to Chernobyl, but as long as they're built CORRECTLY things will almost never go wrong. A nuclear power plant could provably go on for hundreds of years. And with space travel becoming cheaper and more common we could have our nuclear waste tossed into the sun rather than being buried in storage sites that are at risk from earthquakes.<beejamin>: If it's too dangerous to bury nuclear waste, it's much too dangerous to try to launch it into orbit. Where does the waste go when the rocket fails or explodes? It also takes a _lot_ of energy to get to the sun - you've got to cancel all of Earth's orbital velocity, as well as adding whatever extra speed to make the travel time shorter. You're talking about getting this stuff out of the earth's gravity well, then accelerating it to well over 100,000 km/h. <Badjib>: That depends, the capsules we transport it in are rated to survive just about anything short of a bunker buster bomb, so theoretically it would survive a rocket explosion<beejamin>: Those are for transport by train. The construction might be a shade on the heavy side for space launch. To put the weight limits into perspective, the Parker Solar Probe is heading to the sun right now - it weighs roughly half a ton. It launched on a [Delta IV Heavy rocket](https://en.wikipedia.org/wiki/Delta_IV_Heavy) for the low, low launch price of USD350,000,000. You can dig a very big, very deep hole in the ground for that kinda money.<Badjib>: Wasn’t saying it was practical, was saying it was theoretically possible<ChunksTheMan>: Dude this is a round cow in a vacuum situation. If that's your definition of theoretically possible, it's functionally useless. Those train flasks weigh 50 tonnes, and they're to transport 2.5 tonnes of spent fuel. That's not even theoretically possible, you'd need a rocket the size of the Empire State building, and if the rocket blew up it would probably murder that flask. Why can't people just admit when they're wrong? Or keep quiet.<Badjib>: I think you’re taking this the wrong way, and who says that we would launch the same capsule instead of launching a smaller capsule? Plus the space shuttle is 74.84 tonnes alone, so you’re also wrong about lift capacity.<ChunksTheMan>: ... the space shuttle was an LEO vehicle. Not even remotely fucking comparable to going to the sun.<Badjib>: Irrelevant, getting the stuff up there is the hard part, and why even bother sending it into the sun, send it up and fling it off into space<ChunksTheMan>: Go play kerbal space program for a week and then come back and tell me why this is a stupid idea.<Badjib>: Irrelevant, the question wasn’t whether or not it’s smart, but whether or not it’s possible<ChunksTheMan>: You're a really terrible troll.<Badjib>: Irrelevant, has nothing to do with the question at hand", "num_messages": 17, "avg_score": 979.4117647059}
{"start_date": "1543336699", "end_date": "1543627241", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 62, "text": "<speckz>: Globally, the suicide rate has fallen by 38% from its peak in 1994. As a result, over 4 million lives have been saved. <ArenVaal>: I gotta wonder, though, if by \"suicide rate\" they're including failed attempts as well, or only successful ones? If we were miraculously able to find and stop every single attempt and save every single one of them, would the claim be made that the suicide rate was zero? Because that would be misleading.<PietroDellaVigna>: I’m sure that their family members would disagree with you <ArenVaal>: You misunderstand; I'm wondering if they're counting all suicide attempts, or just the successful ones. Either way it's good news, but how it's reports d can make a big difference. I not casting aspersions on anyone who has attempted suicide. If you knew my personal history, you'd know that.", "num_messages": 4, "avg_score": 15.5}
{"start_date": "1544622367", "end_date": "1544760902", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 109, "text": "<sisyphushaditsoeasy>: A Utah toy factory is run by volunteers who give away all the toys for free <EricHunting>: This is my dream. To be able to make beautiful and useful things and give them away. Lately, I've wanted to do CNC fabricated housing and furnishings. But, always, I might as well be speaking a foreign language...<marblebag>: Let's take our next vacation there and build some cars!<EricHunting>: Wish I could. Health problems limit my ability to travel and compelled me to live in the desert SW. Haven't been on a 'vacation' since I was a child. If it weren't for that, I'd be out there gleefully participating in all sorts of volunteer building/making like this; Open Source Ecology projects, fab labs and makerspaces, Open Island, Habitat for Humanity, on and on. <marblebag>: thanks for the other ideas", "num_messages": 5, "avg_score": 21.8}
{"start_date": "1543570025", "end_date": "1543782131", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 234, "text": "<BAPEsta>: Ad signs in Stockholm will guide homeless people to shelters when the temperature drops to -7°C(19,4°F). <aris_boch>: It'd be nice if these signs weren't needed, but unfortunately, they are, so Sweden is being awesome to install them!! 👍🏻<johnjohn909090>: You can get an apartment if you want to. But most homeless people dont<hurfery>: Why not?<johnjohn909090>: It comes with strings attached, you have to meet up with the municipalty and Get job training and so on working towards getting self-supporting a lot of homeless dont want or cant do that", "num_messages": 5, "avg_score": 46.8}
{"start_date": "1544751375", "end_date": "1544808069", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 380, "text": "<bebesiege>: The 100% renewable energy movement is unstoppable. From here, the debate is likely to shift away from whether or not electricity will be decarbonized. It is about when and how fast this will happen, as well as what resources will be included. The world is changing. Fast. <szegedin74>: The last thing I want to do is burst this bubble, but... In the next 100 years or so, the majority of population growth will be in Africa and the Middle East. These societies -- developing would be the nice way to characterize their economies -- will continue to use fossil fuels, because the price of the fuels will plummet, the fuels will still be there, and those fuels will have a tremendous value to them. Why won't they use renewables and electric cars? They won't have the dough for that infrastructure development -- it costs billions and billions. There will be millions of used internal combustion cars kicking around. They will get used. The developed world will not be able to stop 400 million Nigerians from pumping their own dinosaur juice into your old Volkswagen. Have fun, millennials! I plan on checking out by then.<hashcheckin>: they're just as likely to leapfrog the fossil-fuels stage. Myanmar and parts of India, for example, went from zero phones to smartphones without an intermediary step. as these new developing areas become industralized and modernized, they aren't going to go straight to the old, polluting tech; they're going to buy up the new, shiny stuff that gets sold to them on the cheap by companies that move into their markets specifically *because* there's no preexisting infrastructure. as we've seen already, China in particular is willing to take a hit early on in order to be the tech sugar daddy to a developing world. what you're more likely to see is a sudden influx of those Africans and Middle Easterners with better phones than you, powered by 3D-printed solar cells, calling your descendants dicks on Reddit because of Gulf War II.<szegedin74>: Well, hope springs eternal, I guess. There are several economic things in play: The \"new shiny\" stuff will always have a certain price. China is not handing out free candy, they are laying crippling debt traps for developing nations. It will be up to their elites whether their sovereignty gets sold for some solar panels and a windmill. Another factor is that, contrary to what some people think, there is no such thing as \"how much energy the world needs.\" Human beings will always consume all the resources available. Moreover, monopolies will develop (ie, Google owns all the power generation sources) so renewable won't necessarily be \"cheap\" like it is today. People will always consume all the resources there are, so nobody is going to leave oil sitting in the ground unless you prevent them at gunpoint. Then there will be a dispute about it. That's the direction I expect things will go. Just as people have always chopped down trees -- all of them -- they still do in places where people are very poor. Nigeria can produce oil at $20/barrel. The world is going to have a lot more poor people (proportionally) in 50 years, and this is not at all about consumption, it's about production. Color me skeptical on the tech solutionism.<hashcheckin>: it's not so much my faith in tech as my noticing recent history. you give a developing nation solar panels and cell phones, and they don't need infrastructure. it might be debt traps, sure, but those aren't environmental and a lot can change as the situation develops. don't get me wrong. I don't think that we can put our faith in just magically innovating our way out of the jam we're in. I do think that expecting a consumption-based carbon bomb to go off in India is short-sighted, particularly as the situation degenerates, given what we've seen in similar scenarios in the very recent past.<szegedin74>: I wish I could share your optimism. You can see my age in my username. What will drive the direction of developing nation's carbon footprints is their economic production, not their consumption. Look at China's appalling emissions, and India's, and then look at Vietnam, Indonesia, the Philippines, and all of Africa and the Middle East. The will be burning coal and petroleum. In order to produce economic value. Cell phones are a total non issue. People scoff at Luddites like \"oh, you guys would have said steam engines were a bad idea!\" Weren't they? Everything we've done up to now as a species has been part and parcel of the environmental catastrophe that we are in. That trend line is not changing. <hashcheckin>: you aren't that much older than I am. the cell phones are an analogue, not an actual part of the issue. as new energy technologies emerge, there's not going to be as much reason for widespread fossil-fuel adoption, particularly in developing areas. it's just a question of generating, keeping, and continuing the momentum towards that development. I'm honestly not that optimistic, but the alternative is drinking myself to death.<szegedin74>: Look global emissions are rising not falling. The fact that Germany is getting greener has everything to do with India having higher emissions. There's only one system. This is going to sound a little bit dark, but my outlook is that people have to accept the end of the human species just like they have to accept their own end. It is inevitable and nothing to worry about. And a beer along the way is not a bad idea. Cheers!<hashcheckin>: nah. assuming that the species is inevitably going to go extinct from this is basically the same thing as denialism; it's a way to avoid having to do anything to deal with the problem. we have options. they aren't necessarily fun ones, and the next decades are going to be spectacularly \"interesting\" no matter what, but pessimism as a justification for inaction isn't any more logical than optimism as a coping mechanism. I think we've met halfway, though, in that shit's gonna get weird and violent before any kind of equilibrium comes back.<szegedin74>: You might have noticed that there is no \"we.\" We don't sit around in a council of elders and issue decisions on a species level. That is a very weird thing to overlook. We are all acting and making decisions every day. Individually. <starchington>: There is a we. It sounds like you don't want to be a part of it. That's fine.", "num_messages": 11, "avg_score": 34.5454545455}
{"start_date": "1543628266", "end_date": "1543710010", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 1093, "text": "<Sariel007>: Michael Bloomberg's charity donates $50m to fight opioid crisis <braapbraap69>: He should donate to the American Kratom Association... Kratom is a big part of the solution for the opioid crisis.....<CPTCIBRIAN>: I heard thats used to help heroin addicts or something, I have to look into it. <CatastraTilly>: Kratom is actually fucking awful. Legalize weed instead.<BadgerSilver>: Nope, it's not. I've been on the forefront compiling studies and it would take over 5lbs of kratom to kill you according to the most recent one.<CatastraTilly>: Care to share? All I've ever seen are people getting addicted to the shit, complaining about shorter and shorter highs, blowing loads of money, and generally not feeling any better.<BadgerSilver>: Of course! The studies being done point to kratom being an exciting new prospect for safe pain relief, opiate withdrawal, alcohol sobriety, anxiety, depression, and plenty more. Tens of thousands have now used kratom successfully. Anecdotal reports are so frequent now, it's becoming a statistical certainty that kratom is repairing communities and opposing opiates. Literally every person in the community is anti-opiates. It's vastly better than the alternative. It has real side effects, but that's almost exclusively when someone is taking much higher doses than they should be. These include constipation, runny nose, nausea, etc. This actually highlights one of the best aspects of kratom: if you take too much, you'll get sick and throw it up. It's not glamorous, but it's absolutely amazing how self-regulating it is. This deters most of the people trying to abuse it and makes it impossible for someone to overdose on it alone. The FDA has \"linked\" 50 or so deaths to kratom, but this is a total smear campaign. Every single one of those people had several other drugs in their system. Fentanyl, heroin, oxys, and just about every other srug under the sun was found in high amounts in yhese people's systems. One of the \"linked deaths\" is a guy who shot himself. Another is a guy who jumped off a a bridge. It's truly beyond absurd how hard the FDA is fighting kratom and the misinformation they've been peddling to the media. They're really worried it will be the next big thing and they're right. Lucky break for the 70,000 people who are going to die next year if they can't find something to manage their pain/opiate addiction. Kratom is a safe, coffee-family plant, that has minimal side effects, a ridiculously high ld50 (6-10lbs), and is coming out of the literal woodworks when it's needed the most. Addiction to kratom has not been shown in trials. Physical dependance takes consistent heavy use for many months. Compare to legal tobacco, alcohol, weed, St John's Wort, Nutmeg, etc. It has no place being banned. Education is key.<CatastraTilly>: Any sources? <pick-axis>: Go to r/kratom and check the sidebar for the section that says studies. It links to a drive account with tons of .pdf files that can educate you on various scientific studies. <RTL300>: Got any unbiased sources<pick-axis>: Unbiased??? That is all scientific research. What's your problem anyways?", "num_messages": 11, "avg_score": 99.3636363636}
{"start_date": "1544626220", "end_date": "1544723058", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 19274, "text": "<Sumit316>: Scottish wind power smashes 100% production threshold - Scottish wind power produced more than 100% of the threshold for the first time, generating enough energy to power 6 million homes. <Sir_Monk>: A Scottish success story you'll hear next to nothing of in the UK press. &amp;#x200B; &amp;#x200B;<Eladriol>: That's because It's not a Scottish success story. They're a GB success story, just like the (larger) wind capacity of the coast of England and the solar in the south of England are GB success stories. They're all built with GB subsidies levied on GB consumers, selling power to GB consumers through grid infrastructure paid for again by gb consumers. The gb energy system just placed the assets where it made sense (ie where its windy, Scotland and off the coast of England). <Ultra_Sonic>: Lol unionists truly are pathetic.<Eladriol>: Mind explaining what I said that was wrong or are you just circlejerking? How much do you know about the gb power grid? Do you for example know that there is no Scottish or English grid, they are one energy system (with Wales) with the same wholesale price and subsidy systems? <Ultra_Sonic>: Blowing a fuse every time the words Scotland and success are mentioned together. '#justunionistthings<Eladriol>: Ah you're just circlejerking a d don't care about reality. Carry on then. <Ultra_Sonic>: Lol, you're the one who got in a frothy mess because Scotland was mentioned as a success. Just can't stand it can you?<Eladriol>: Meh, if you can't be bothered to dispute the facts I presented, I think we know whos right. Have fun meming dude. <Ultra_Sonic>: Yeah but you're twisting facts to suit your agenda, so you're full of it!<Eladriol>: &gt; twisting facts Which facts are those and how have I 'twisted' them?<Ultra_Sonic>: That Scotlands success here is because of the UK. That's simply not the case. It's a lie. By a desperate unionist to belittle Scotland and make a case for the desperately failing UK. I actually enjoy it because every lie pushes Scotland that little bit closer to independence.<Eladriol>: Can you point to me a commercial Scottish renewable generation asset that is not subsidised by one of the following GB wide schemes: Renewable Obligation (FYI there is a Scottish renewable obligation - it's the same scheme with different branding) Contracts for Difference Feed in Tariff &amp;#x200B; and that does not spill onto the GB National Grid &amp;#x200B; tyvm. &amp;#x200B;<Ultra_Sonic>: Irrelevant; they are all National Grid / UK reserved schemes. The Scottish government has the final say on energy planning policy in Scotland; therefore ANY scheme the UK government is permitted by Scotland to undertake is purely thanks to Scottish decision making. Boo hoo unionists.<Eladriol>: &gt;Irrelevant; they are all National Grid / UK reserved schemes. nice you admit I'm right, you're just trying to shift the goal posts to planning permission. Now; [https://en.wikipedia.org/wiki/Walney\\_Wind\\_Farm](https://en.wikipedia.org/wiki/Walney_Wind_Farm) &amp;#x200B; this is a GW capacity windfarm built in England. It's entirely subsidised by two of the schemes I mentioned, and is additionally supported the GB power market. This single site by itself is equivalent to \\~10% of the installed wind capacity in Scotland, probably close to 15% of the Scottish wind generation due to high load factor from offshore winds. &amp;#x200B; You as a GB consumer (equal to me as another GB consumer!) are paying for all of this . Directly, not through taxes. Assuming typical consumption \\~£90 of your energy bill is direct subsidies to plants like the one I linked, and \\~£150-£200 goes to the wholesale market demand, which indirectly supports the other \\~half of money these things generate by selling onto the wholesale market. &amp;#x200B; But because this received planning permission in England, this is an English success right? The fact that you're paying for this equally alongside me doesn't matter right? Any suggestion that this is a national market placing assets where they make sense, not individual regions building everything, is ridiculous right?<Ultra_Sonic>: Oh my God, Unionism, not even once. You truly are a dense bunch. Scotland did not allow nuclear power stations to be built. It told Westminster to get ti fuck. Scotland pushed renewable. It's irrelevant who paid for it, Scotland decided what was and what was not allowed. It's not even up for debate. I am telling you, you are wrong. Silly, petty little unionist. ps &gt;but because this received planning permission in England, this is an English success right YES!<Eladriol>: &gt;Scotland did not allow nuclear power stations to be built. It told Westminster to get ti fuck. Scotland pushed renewable. It's irrelevant who paid for it, Scotland decided what was and what was not allowed. you're fucking hilarious mate, when did I even mention nuclear power? Are you like one of those dolls were upon pulling a string you get one of a few prepacked phrases? &amp;#x200B; &gt;but because this received planning permission in England, this is an English success right &gt; &gt;YES! &amp;#x200B; Thanks for paying for my renewable power then I guess? Very generous of us to pay for eachother like this, it's almost like we're in the same energy system. Fyi planning decisions are mostly made at local council level, so unless you happen to live next to a big windfarm you probably can't even claim success under this bizarre metric.<Ultra_Sonic>: You're slow. That's OK, you're statistically likely to be less bright being a unionist. Scotland decides energy policy by deciding what will and will not be allowed. Nuclear was not allowed. Renewable's were. Funding is utterly irrelevant. Policy is what matters. Just admit you're wrong and retain a semblance of dignity.<Eladriol>: &gt; Funding is utterly irrelevant. Policy is what matters Tell me, has anyone ever built a wind turbine because the Scottish government says it's policy is that it wants renewables, without all that funding (11bn/yr by 2020) by the UK government policy that it wants renewables?<Ultra_Sonic>: Irrelevant. Scotland made the decision. It's Scotland's success. Your bitter tears make the success all the sweeter.", "num_messages": 20, "avg_score": 963.7}
{"start_date": "1543530142", "end_date": "1543941894", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 27, "text": "<NiuStart>: Vermont-made colorful cat collar gives birds a fighting chance <mikeitclassy>: &gt;The study found that collar-wearing cats killed 19 times fewer birds than un-collared cats in the spring, and 3.4 times fewer birds in the fall. What the fuck does 19 times fewer mean?<NiuStart>: I'm no math wizard, but I would guess that instead of 600 birds it dropped to 30, or something like that.", "num_messages": 3, "avg_score": 9.0}
{"start_date": "1543596708", "end_date": "1543634819", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 68, "text": "<bbcnews>: Teacher tells class not to buy her Christmas gifts but to donate to charity instead, as a lesson on \"giving and kindness\" <usernumber36>: so... &gt; teacher rudely assumes kids will buy her gifts &gt; teacher then rudely refuses to accept their kindness and expression that they like her &gt; teacher then tells media to be centre of attention Seriously how do these things ever make news unless the person directly makes contact wanting there to be a story about them?<DixonMyAss>: Virtue! Gotta cash in whenever you can.", "num_messages": 3, "avg_score": 22.6666666667}
{"start_date": "1542892552", "end_date": "1543639050", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 105, "text": "<IanSausage>: South Korea closes biggest dog slaughterhouse complex <mikhail1234>: While I fully support the closing of unethical slaughterhouses I don’t think that eating dog is bad per se. I’ve tried dog in Korea before. It tastes just like any other meat. I fully support ethical and humane animal husbandry that results in meat on the table. <Patoux01>: How do you humanely kill something/someone?<-AnonymousDouche>: Quickly without pain.<loudcheetah>: How would you define pain? Is fear or prolonged discomfort considered pain? Also, would you support eating humans as long as they are \"humanely killed\"?<-AnonymousDouche>: I would define pain as \"the feeling of pain\" No, I wouldn't eat humans because I am a human. Eating your own species leads to terrible diseases.<loudcheetah>: I think you're avoiding the question, because you know your reasoning is flawed.<-AnonymousDouche>: I literally answered.<loudcheetah>: Yes, but you avoided the fact that pain is a spectrum. Obviously farming animals for food will cause some amount of pain at some point. Since you don't support death that isn't quick and painless, I'm assuming you don't eat any farmed animals. Is this correct? &amp;#x200B; Also, I believe your personal ethics regarding eating humans has little to do with the \"terrible diseases\" it can cause. We know processed meats are carcinogenic, are you against eating pepperoni?<-AnonymousDouche>: I said killing them without pain, merely existing causes pain in many forms. Everything causes cancer, I live in a suburban area, I'm not going to stop breathing. I was talking about specific diseases related to cannibalism.<loudcheetah>: Would you be okay with torturing animals prior to killing them, as long as you\"\\[kill\\] them without pain?\" Also, there are \"specific diseases\" associated with processed meat consumption. Killing humans for food is unethical for numerous reasons; however, the \"diseases related to cannibalism\" aren't related to the ethics of life and death.<-AnonymousDouche>: So it's either torture or freedom?<loudcheetah>: Is there a reason you avoided the cannibalism argument? &amp;#x200B; Also, you're attacking a strawman. I never implied that it is either torture or freedom. I was pointing out that you said you support meat that is \"ethically killed,\" and stated that ethical killing involves inflicting a minimal or no) amount of pain at the point of killing. However, you didn't state what you feel is unethical treatment prior to the death of an animal. I asked if you feel torture is ethical, because I wanted to start with an extreme and then narrow in to what your position actually is.", "num_messages": 13, "avg_score": 8.0769230769}
{"start_date": "1543539400", "end_date": "1543546301", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 91, "text": "<Kunphen>: New Zealand Now Recognizes ALL Animals As Sentient Beings! <Sparkle_Flippyfoot>: Of course they're sentient, they can feel can't they? Doesn't mean they're sapient <Raskolnikoolaid>: Not all animals can feel. It's just mostly mammals<Sparkle_Flippyfoot>: Are you saying my pet crab can't feel disappointment when I fail the triathlon? <Raskolnikoolaid>: No but you can always boil the little fucker to make up for it", "num_messages": 5, "avg_score": 18.2}
{"start_date": "1544716874", "end_date": "1544750686", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 277, "text": "<BenderB-Rodriguez>: Congress To Make Members Pay Out Of Pocket For Sexual Harassment Settlements <samuraipanda85>: Was that not already a thing?<BenderB-Rodriguez>: it was not. They were using tax payer money to settle their lawsuits because they are public employees. <Noughmad>: Why would any employer pay for this? <NapClub>: fox always has... and we know how the government likes to be more like fox recently...", "num_messages": 5, "avg_score": 55.4}
{"start_date": "1544731519", "end_date": "1544764617", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 178, "text": "<V2O5>: Chemistry professor dispatched a team of mercenaries into an Islamic State war zone to free one of her doctoral students. \"I got so angry that IS was ... disrupting the research.\" <TreeHugChamp>: The part that got me was at the end when it said his family has almost paid the university back in full for the operation.<Darryl_Lict>: Wonder how much something like that costs.<Beoseal>: Averages 150-200k for this operation.", "num_messages": 4, "avg_score": 44.5}
{"start_date": "1543459156", "end_date": "1543512515", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 60, "text": "[deleted]: Cards Against Humanity have purchased land in an attempt to stop the boarder wall. [deleted]<hiholiday>: The government can just eminent domain the land. This is an empty gesture, and pretty old too. <robsbob18>: They've also got a retainer on a law firm that specializes in fighting eminent domain. So yeah the govt can take the land but they're gonna make it as hard as possible.<hiholiday>: Yeah it's gonna work out like Standing Rock, i.e. at the business end of a gun. <Howdocomputer>: Standing Rock was different. The pipeline was never going to cross into the reservation's land, the problem was that it crossed near a major water supply.<hiholiday>: The point isn't that there's some technicality that will cause this to be different, the point is that if there's something the government wants to do, they're going to roll directly over everything in spite of the oppositions to it. Secondly, the amount of money they'll spend to defend a small piece of land for the purposes of... What, exactly? To leave a gap in the wall that very likely isn't going to be built in the first place? To theoretically create a bottleneck for migrants to squeeze into only to get arrested and abused the very second they leave the plot? Who the fuck does this help besides Cards Against Humanity?<Lots42>: I disagree with the first paragraph and your second paragraph makes absolutely no sense <hiholiday>: Ok", "num_messages": 8, "avg_score": 7.5}
{"start_date": "1543644235", "end_date": "1543646564", "thread_id": "t3_a20g55", "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 9, "text": "<hurtsdonut_>: I doubt they're in too much pain. Dude was old as hell. He's been sick for awhile and his wife died a few months ago. It was neither unexpected or a sad ending. We should all be so lucky to live 90+ years. <brucebrowde>: &gt; We should all be so lucky to live 90+ years. Though I see your point, I have mixed feelings about that. After 60-70 you're basically a sick sack of human flesh with partially functioning brain, more or less. It's kind of hard to imagine it would be a good 10-20 yrs going through that. Kind of sad, but still mostly true.<hurtsdonut_>: I agree with you. My grandma is now 95 and thinks her neighbor is trying to kill her. She had cameras put in and there's nothing on them but he somehow made mushrooms grow in her yard and sneaks into her house every night to try and kill her. She calls me almost every day to tell me what he did the night before. Poor dudes never done anything. Not only that every day is hell for her thinking some one is trying to kill her. She also can barely hear so you can't explain anything to her. It's sad she's been through a shit ton in her life. Ran from Siberia, Russia in WWII only to be captured and put in concentration camp in Germany. Then she had a few decent decades with my grandfather who liberated her. Now she's back to being a tortured soul.<brucebrowde>: Sorry to hear that about your grandma. It's sad, but we're all going that way. You live while you can enjoy and your mind and body can support you. IMHO, when you're past 60-70, you're done. I guess I'll maybe live to confirm and report back here ;)<hurtsdonut_>: Well I'd say she was good till about 89. But I get what you're saying and reminds of Jim Gaffigan talking about how old people always look shocked they're still alive. <https>://youtu.be/EAx7u11LHX8<brucebrowde>: &gt; Well I'd say she was good till about 89. Well at least she had a long run! &gt; reminds of Jim Gaffigan That was awesome!", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1544640396", "end_date": "1544763152", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 21, "text": "<Rugby11>: Prisoner to manager. Inmate to leader. It can happen, and it starts with a second chance. <Herrderqual>: I am one such person. I am a Canadian ex-convict who spent nearly a decade in prison and now I'm a manager in the car industry. I would be happy to answer questions any of you have or to share more of my story.<Rugby11>: &gt; I would be happy to answer questions any of you have or to share more of my story. I would like to hear your story.", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1544762968", "end_date": "1544796727", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 29, "text": "<Rugby11>: Southwest flight to Dallas turns back to Seattle to drop off human heart left on board | Airlines <gaurddog>: This isn't uplifting this is terrifying.<RedRaiderTravis>: Alternate headline: morons leave heart on plane, putting a life at risk and seriously inconveniencing everyone aboard, making many miss their connecting flights. <gaurddog>: Exactly! Like they try to minimize the effect by saying that it wasn't earmarked for anyone but it was a HUMAN HEART! There are thousands of people waiting for those and needing them to live and some moron forgot it in the overhead bin.", "num_messages": 4, "avg_score": 7.25}
{"start_date": "1543305729", "end_date": "1543414162", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 22776, "text": "[deleted]: India is now a world leader in renewable energy <yew420>: Soon it will be us, Australia who will be the world leader in coal energy! Muhahahaha!<grimrecka>: Who will we sell our clean coal to now?<Diaperfan420>: The best coal. <DivisionXV>: You realize what coal is also used for right? Its needed to create steel which removes our need to rely on some other country to produce it. It's better if we produce it rather than our neighbors which dont give a shit about human life.<Diaperfan420>: Costs too much for you to produce it. It will choke every industry that it supplies to. This is why companies outsourced it to begin with. So it would remain profitable to stay in business (cause you gotta pay those executives 4+ million a year instead of buying local) <DivisionXV>: &gt;Costs too much for you to produce it. It will choke every industry that it supplies to. This is why companies outsourced it to begin with. So it would remain profitable to stay in business (cause you gotta pay those executives 4+ million a year instead of buying local) Umm.... it doesnt cost too much to produce it since well... we are producing it again. Certain bodies of government made it too expensive to produce hence why it was outsourced.<Diaperfan420>: https://www.homemodelenginemachinist.com/threads/why-is-steel-so-expensive.14746/ It's environmental protections, you bafoon. To, you know, preserve the environment and make it so we can all live here a little longer? You're producing it because to import it would now cost more thanks to an artificial, and un-needed tax on foreign materials imposed by your government's leader. If you want to sell out your environment, and tape it for everything, you need to move to Russia. Generally Americans want to preserve what they have. <DivisionXV>: You act as though we cant develope ways to effectively mine this efficiently with minimal impact and your solution isnt better.... basically saying it's ok for other countries to fuck up their environment as long as it isnt ours. Such logic buddy... We have stricter safety guidelines so over all, it would be better for us and our environment to be a producer. A good example of that are exhaust scrubbers that we currently have which can be safely used on equipment so that they operated indoors. You think our foreign equivalents give a shit like that when they are the major polluters of the world? Move to Russia? Sorry buddy... there still isnt proof no matter how hard you keep digging the grave.<Diaperfan420>: It's cheaper to get it from overseas. End of story Any arguments you make are null The amount needed for steel is also peanuts compared to the coal required to meet energy demand, so yet again, your arguments are null <DivisionXV>: And why is it cheaper to get it overseas? You cant just straight up disregard the points I made because you want to. <Diaperfan420>: Why it's cheaper matters not in the capitalist world. The fact of the matter is it's cheaper. <DivisionXV>: It does matter because companies like Caterpillar shut down plants thanks to greedy Democrats who love fucking companies with taxes. It cost jobs.<Diaperfan420>: Fwiw a tarrif is a tax. And is it greedy Democrats, or greedy board members? <DivisionXV>: Tariffs are a whole different ballpark.", "num_messages": 15, "avg_score": 1518.4}
{"start_date": "1543349587", "end_date": "1543738988", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 74, "text": "<2littleducks>: A dog has acted as the surrogate father to a baby possum, letting it snuggle in his fur until it was reunited with it’s mother. <Arknell>: But that possum is cute? What is the difference between this one and those creepy white-pink things with the really deep-set eyes?<2littleducks>: These cuties are of the type you find in Australia and the 'creepy white-pink things' are the critters that resemble demon spawn (but still cute) you find in the USA.<Arknell>: Another excuse for me to come visit! One of these might drop on my head in a park under a tree. :)<2littleducks>: Yeah, [our possums are pretty adorable](https://www.google.com.au/search?q=australian+possums&amp;tbm=isch&amp;tbo=u&amp;source=univ&amp;sa=X&amp;ved=2ahUKEwin1tmx3PXeAhUKWX0KHSA4AzwQiR56BAgDEBM&amp;biw=1366&amp;bih=632) and you don't have to go to a park to see them. At night they come and visit me in my back yard, on my verandah/porch and a lot of the time they chase each other on the roof of my house and wake me up. Cheeky little buggers :) <bendybiznatch>: Do they hiss like ours do?<2littleducks>: They hiss and make blood curdling screaming noises especially during mating season. The noises they make from their feet slamming on the roof as two of them chase each other around during that season is pretty frightening too until you realise what it is.<bendybiznatch>: So a little cuter but still demon spawn. <2littleducks>: Think Tasmanian Devils. Soooo cute but the noises they make are the reason why the early settlers of Australia quickly refereed to them as 'devils'.", "num_messages": 9, "avg_score": 8.2222222222}
{"start_date": "1543635836", "end_date": "1544138937", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 26, "text": "<Strongbow85>: In Bosnia, a Boy Fights for Inclusion <Windy958>: This is a very inspiring story. Glad you posted it.<Strongbow85>: Thanks, glad you enjoyed it. I read/submit a lot of generally negative articles on the subreddits I mod, so it's nice to spread some uplifting stories. It's too bad all of Reddit doesn't share /r/UpliftingNews attitude. The comments in some of the major subreddits are absolutely toxic.", "num_messages": 3, "avg_score": 8.6666666667}
{"start_date": "1543249136", "end_date": "1543302267", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 27075, "text": "<Sariel007>: Tunisia becomes the first Arab nation to approve gender equality in inheritance law <ScienceGuy9489>: Actually Lebanon already has gender equality inheritance if you are a non muslim.<Goosebump007>: This is a problem. Only the non Muslims get gender equality because Muslims don't want gender equality. What is with Muslims and they're hatred of women?<willmaster123>: Its a bit more confusing than hatred. Women are not merely just individuals, they are apart of a family unit and are basically only seen as mothers and wives, and that is it. In this conservative society, women have to be protected at all costs, covered up with cloths to prevent men from attacking them, provided for and given a home and money to spend, they are not allowed to work or do anything too strenuous. In their view, they are pampering and protecting women, in our view, they are giving them zero choice in their life, which is considered worse. A big factor also is that under islamic law, a man HAS to spend their money on women and children, whereas a woman can spend money on themselves. Its a lot more confusing than just 'ahah we hate women lets make their lives awful'. In their eyes, they think they are doing *good* for women. And this isn't unique to Islam. This is how 95% of the world was before liberal values gradually spread across the world. <Roguelo>: &gt; A big factor also is that under islamic law, a man HAS to spend their money on women and children uh huh And what happens if they don't? Mind sharing an example of a court case where a man is prosecuted for buying a nice car or vacation to Dubai?<willmaster123>: No lmao I dont think you understand. They don't have to spend ALL their money, but they do have to provide as much as possible for them, and its considered against islam to not be as providing as possible. You can divorce your husband if he doesn't provide for you, not only financially. Although of course, that isn't always the reality, but it is technically sharia law. you can still spend money on yourself. But you have to be the main provider for your wife. Even if she works and sustains herself, you still are obligated to pay for her stuff. <Roguelo>: &gt; they do have to provide as much as possible for them right. And so if a man spends money on a personal vacation or a nice watch, then he's not providing \"as much as possible for them\". If this is an actual law, then link to *literally one court case* where a man was prosecuted for it &gt;Although of course, that isn't always the reality, but it is technically sharia law lol well good thing Muslim women aren't constrained by reality then Nothing to see here folks! Black people theoretically had the right to vote in 1865, so there was no reason to criticize American laws regarding race back then!<willmaster123>: I dont really know where I would find a SPECIFIC court case for that. I tried googling \"islam divorce for not providing enough\" and all that came up was about the UK. In most countries, islamic or not, if the sole breadwinner of the family is not giving any money to the other members, that is grounds for divorce. If you are earning money while your wife has nothing, that is grounds for divorce on her part. But specifically in Islam they have pretty strict laws, both societal and legal, about men providing for their wives. Its considered very, very bad for a man to have money and have a wife who doesn't see a lot of that money. In general, money spending is the wifes duty, although this varies country to country a bit. Similarly, its considered bad for a religious man to be buying luxury cars and going on crazy vacations as you said. That is more the secular arabs in the gulf states, not the hyper religious crowd. Also nobody is saying \"nothing to see here\". People are just talking about the laws surrounding this stuff, not supporting it. Calm down. <Roguelo>: &gt; In most countries, islamic or not, if the sole breadwinner of the family is not giving any money to the other members, that is grounds for divorce In all good countries women can get a divorce for *any* reason they want, because they're not property<willmaster123>: okay strawman. Once again, we are not arguing morality, or whether these are good or bad countries. Nobody is bringing that stuff up except for you. All I am saying is that in islamic law a man is required to do as much as possible to keep their wives financially happy. Nothing more and nothing less. Stop putting some crazy agenda into everything here. <Roguelo>: You: &gt;In their eyes, they think they are doing good for women. Also you: &gt; we are not arguing morality, or whether these are good or bad countries So Sharia law is fine because Muslims think they're doing good, but when I point out that they're objectively misogynistic suddenly morality is irrelevant Nice!<willmaster123>: Notice how I said 'in their eyes'. If you ever talk to muslims about this stuff they will use every excuse in the book about how their laws and religion actually helps women and all that. Its not actually good for women. I even pointed that out in the next sentence. Nobody said that its good for women, at all. Nobody said 'sharia law is fine'. You're making strawmans out of nothing. <Roguelo>: &gt; Nobody said that its good for women, at all Muslims do. They say it all the time. And you're defending that reasoning with this \"it's the law!\" nonsense<willmaster123>: Oh my god nowhere at all did I defend it, at all. Literally all I did was explain the basics of it and how Muslims justify it. I can’t tell if your retarded or being purposefully obtuse. You seem like the type of person who couldn’t handle a class about WW2 without yelling about how the professor is justifying nazism. <Roguelo>: &gt;You see, what the Nazis did they did for the sake of their own people. They even had laws against murder and other bad things! Yeah, I'd consider that a defense of Nazism<willmaster123>: \"You see, what Muslims did they did for the sake of their own people.\" Where did I say this, or anything remotely close to this? Explaining how islam treats men and women in terms finance is the same as saying Islam is good and all that to you somehow? I seriously have never seen a strawman this ridiculous. <Roguelo>: &gt;In their eyes, they think they are doing good for women. <willmaster123>: Yes, in THEY'RE eyes. Just like how the Soviets thought, in their view, they were doing good for the poor people of Russia. That doesn't mean they actually were doing good. Did you not notice the sentence right after where I say that its not *actually* good for women? <Roguelo>: &gt; the Soviets thought, in their view, they were doing good for the poor people of Russia lol no they didn't They were power hungry despots who used the terminology of \"for the people\" to justify staying in power Stop justifying Stalin, he's responsible for a genocide<willmaster123>: Okay now I am just pretty sure you are a bad troll at this point", "num_messages": 20, "avg_score": 1353.75}
{"start_date": "1544756000", "end_date": "1544834888", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 74, "text": "<BlankVerse>: The untold story of how India's sex workers prevented an Aids epidemic | Today, 2.1 million Indians are living with HIV. The prevalence of HIV is 0.22%, lower than that of the US. <Testrna>: We need to legalize prostitution here. Weed was first...cocaine should be next (people die from fentanyl, not sniffing a line). Legalize and clinicalize ... create addiction centers to help people... not lock up idiots for using the stuff. Legalize it and the illicit MONEY for drugs (and the killing) ends. <Veloci_faptor>: The legalization of weed is a great example of how the government can actually make something safer through regulations, rather than criminal penalties. Now, I don't have to meet some shady dude in a parking lot where hopefully I don't get robbed or attested; I can just walk into a store. On top of that, the weed has to be tested for pesticides, and they have to write the potency on the label so you know what you're getting into. Everything has to be sold in child proof containers, and edibles even have limits on the amount of THC content per package, and the doses are broken down into 5mg pieces. Way safer than before, and now CA gets a nice bump in tax revenue.<schmeckesman>: I’m with you all the way but fuck it if I don’t really miss the Korova black bar with its 1000mg of active thc. The “who needs such strong edibles” argument is silly because if I want to I can go to BevMo and buy enough whiskey to kill myself in the parking lot and no one bats an eye.<Veloci_faptor>: I agree. They can still be pretty expensive, too. I'd suggest checking out either ease.com or Chyll.com (can't remember which). I got one of those Delta 9 chocolate bars and it was 240 mg, broken into 4 60mg sections. I think it's because some of their drivers have medical licenses, and the restrictions only apply to recreational sale, but I'm only guessing. <schmeckesman>: I think coming soon all edibles have to be under 150 mg but don’t quote me on that. I’ve been a medical user (wink wink) for years and usually just go to a local dispensary. Eaze is cool if you want some mid level bud or wax at 10pm and delivered. Not the best prices or selection though. Shout out to purple star md, if you are reading this and are in SF, that’s a solid place!", "num_messages": 6, "avg_score": 12.3333333333}
{"start_date": "1544760340", "end_date": "1544787656", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 350, "text": "<Boofing_with_Squee>: More than two dozen monkeys that were test subjects in nicotine addiction research have been moved from an Arkansas lab to a Florida primate sanctuary <karmatic89>: I really hope they weened them off of the nic first. Moving 2 dozen jonesing, pissed off monkeys sounds like a great way to get your parts ripped off.<workyaccount>: It’s like taking a discount flight from Phoenix to Las Vegas.", "num_messages": 3, "avg_score": 116.6666666667}
{"start_date": "1543650611", "end_date": "1543650794", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 6, "text": "[deleted]: War Criminal George HW Bush dies at the age of 94 [deleted]<Fate_III>: Uplifting news?<MichaelS10>: He's a commie<Fate_III>: But he's also a president of the United States that passed. I don't think it's uplifting.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544395097", "end_date": "1544825097", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 280, "text": "<Readdator>: Stranger gives his first-class seat to mom flying with a sick baby <solarpowerz>: Things are real screwed up when doing the decent thing makes it to the newspapers. The rich are going to have to give back the money they’ve been systematically robbing from the middle class for decades. It was a nice thing this person did but come on. Also I am looking forward to when first class is outlawed in planes. Everyone gets the same size seat with plenty of legroom and space- the rich getting good seats while everyone else has panic attacks from being squashed in the back is baloney. <TequillaShotz>: If that ever happened, everyone's seats would cost a lot more, for the airline to stay profitable. Law of unintended consequences.<solarpowerz>: nah. seats used to be decent before and the price wasn't any higher. folks are mad. we are going to take back the govt, take back the money, and we gonna take back the leg room too. you can only steal for so long before folks revolt.", "num_messages": 4, "avg_score": 70.0}
{"start_date": "1543632804", "end_date": "1543692778", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 8783, "text": "<Sariel007>: A community-wide search for an elderly blind and deaf dog that went missing from a foster home over Thanksgiving ended successfully Friday evening, Nov. 28, a rescue worker said. <mss6099>: I'm happy the dog is safe, but this article makes me unreasonably mad at the bonehead lady who picked him up, only to dump him again. Aarrgh!<ShamelessFox>: He was picked up and then dumped again **twice**. And neither of these dumb broads contacted the shelter first!<RealStumbleweed>: This is the opposite of uplifting news.<ShamelessFox>: Its r/PupliftingNews but also r/PeoplesuckingNews But do rejoice that the doggy is in a safe warm loving place for his final days. <sneakpeekbot>: Here's a sneak peek of /r/PupliftingNews using the [top posts](https://np.reddit.com/r/PupliftingNews/top/?sort=top&amp;t=year) of the year! \\#1: [UPS Driver Adopts Shelter Dog Who Jumped Into His Truck](https://people.com/pets/ups-driver-adopts-shelter-dog-he-met-on-delivery-route/) | [15 comments](https://np.reddit.com/r/PupliftingNews/comments/a1c066/ups_driver_adopts_shelter_dog_who_jumped_into_his/) \\#2: [A rescue organization specializing in older dogs agrees to let 104-year-old dog owner foster a dog \"for as long as he's able.\" The photos are heart-warming!](http://www.bbc.com/news/world-us-canada-44146481) | [3 comments](https://np.reddit.com/r/PupliftingNews/comments/8kreto/a_rescue_organization_specializing_in_older_dogs/) \\#3: [America's Got Talent's Simon Cowell Donates Over $32.6K to Shut Down South Korean Dog Meat Farm](https://people.com/pets/americas-got-talent-simon-cowell-donates-to-shut-down-south-korean-dog-meat-farm/) | [7 comments](https://np.reddit.com/r/PupliftingNews/comments/9jycfp/americas_got_talents_simon_cowell_donates_over/) ---- ^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)<Beef_Daiquiri>: At first I thought there was a 104 y.o. dog", "num_messages": 7, "avg_score": 1254.7142857143}
{"start_date": "1544658428", "end_date": "1544674602", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 384, "text": "<bookchaser>: Rescue personnel pull submerged car from icy river, surprised to find driver alive inside, surviving in an air pocket for 5 hours <predictingzepast>: &gt;The red 2018 Ford Fusion was located in the Klamath River on State Route 96, west of State Route 263, on its roof, almost fully submerged, and the four-way emergency flashers were on. Man, I had so many questions going into that article and now all that is going through my mind is at what point during that 5hr underwater visit did that guy decide to put his hazards on..<firemanjoe911>: IDK if Ford has it, but a lot of vehicles will automatically launch their 4ways when involved in an accident. My question did they go into the water to check on the patient? The article certainly doesn't clear that up! <predictingzepast>: Yeah the wording made it seem that they just expected it to be empty or a body, I took it as they didn't notice until they went to tow it out", "num_messages": 4, "avg_score": 96.0}
{"start_date": "1543504197", "end_date": "1543554930", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 19884, "text": "<Sariel007>: UPS Driver Adopts Shelter Dog Who Jumped Into His Truck <PookAndPie>: This is how I got my current dog Eva 8 years ago. It was dead of winter, snow on the ground, and I stopped by my in-law's place and opened my door. This little emaciated black lab jumped into the car and into my lap, freaking me out. The in-laws came outside and told us the story of the dog: They had seen her running around the hills and trees for a couple months, because the people across the street from them owned her but stopped taking care of her. My in-law's were kind of upset at the dog because she would eat out of the trash and was eating snow to stay hydrated. She was a fully grown lab, but couldn't have been more than 20 pounds-her ribs were poking out and she just looked terrible. My wife marched right up to that house and told them we were taking their dog, and they could either be fine with it or we'd call the dog warden and request he give us the dog since clearly they were incapable of taking care of her. We took her home that night and she wandered through the house scaring our cats, found our bed, jumped right up on it and fell asleep on my pillow. She's the best dog I've ever had, literally everything I have ever wanted. Sometimes dogs select people and I think that it's beautiful. <mayhempk1>: That is so sweet, I love it.<PookAndPie>: lol thanks. She's a real cutie. She's a about 50 pounds, now, and does nothing but love.<Skyshaper>: Is she a pitbull?<PookAndPie>: Nah, she's a mutt but she seems to be predominantly black lab. [Here's](https://imgur.com/5YldQAM) a picture of her.<Quarterafter10>: She is super, duper adorable! Got a recent pic? 😊<PookAndPie>: This one was just taken a couple days ago. She's laying on my wife in this pic, which is her favorite place to be! <https>://imgur.com/D43MOPv<Elyseux>: How anyone could abandon that cutie is beyond me.<countvracula>: I don't understand why people get dogs when they have no intentione of taking care of it, I mean if you even have half a heart u would surrender it or put it up for adoption but no I am just going to pretend it does not exist. Absolute assholes.", "num_messages": 10, "avg_score": 1988.4}
{"start_date": "1540277058", "end_date": "1540296344", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 20, "text": "<randominternetdood>: stoners all say weed is harmless, but... <40somethingOMG>: Wait a second...... wrong subreddit <randominternetdood>: its great news for non stoners. validation, if you will.<Haterbait_band>: But they're not even talking about marijuana.<randominternetdood>: saying that is the same as saying fentynol isn't the same thing as opium. which it is, its just factory made, pure, and stronger.<Haterbait_band>: I guess, but the article didn't really go into details about what exactly is killing people. Concentrated THC? Or maybe some other thing being mixed in?<randominternetdood>: cannabis overdose. it happens with non synthetic too, when they break psychotically. stoners all band up and deny it, but the synth is strong enough that they OD on less, making it far more obvious and easy to track. yes, too much weed, can kill you. and smoking any amount can tar up your lunges, don't smoke kids. get oils/pills if you need it for medication. don't do recreational intoxication, it fucks up your life and I don't wanna hear the bitching about it.<Haterbait_band>: Interesting... So the homeless people are obtaining some highly concentrated THC that's cheap and easy to produce? Usually concentrates are expensive so it's weird that a miracle source of THC would be available so cheaply and yet all the existing dispensaries are charging an arm and a leg for it. Are you sure you haven't been smoking this stuff yourself?<randominternetdood>: I don't smoke, I value my health.<Neezieduzit>: Didnt you say on another post that you weigh 400 pounds? <randominternetdood>: I do. im 11% body fat, which is 4% less thant he 15% of average healthy males. im just massive in every aspect of the word when compared to average.<Neezieduzit>: Except from intelligence judging by the conclusions you have made about cannabis from this article about a synthetic drug. <i_saw_u_slippin>: You’re arguing with a troll. 400 lbs and 11% bodyfat is impossible.....<Neezieduzit>: Yeah I figured that....I sensed a mother's basement dweller and stopped answering.", "num_messages": 14, "avg_score": 1.4285714286}
{"start_date": "1543690150", "end_date": "1543694960", "thread_id": "t3_a23qel", "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": -8, "text": "<Skrillerman>: Yeah this propaganda is everywhere. They even made movies about it to show how sad their veterans feel and that they are the real victims. Like with American sniper. Chris Kyle was a diagnosed psycho but potraited as a hero. They can all go fuck themselves, zero sympathy for them and their war criminal leaders <firezzzzzz>: &gt;zero sympathy I doubt any of them are looking for validation from some kid on reddit who plays video games all day <Skrillerman>: the world literally laughs at the USA. Nobody gives a damn about your veterans and their problems buddy. Nobody thinks they are hereos. Even half of your country doesn't give a single shit about them. The only thing they gain is some mental illness hahahaha. Congratulations <firezzzzzz>: I’m not even American <Skrillerman>: So why even defend these mentally ill people. Pretty low<olmikeyy>: I don't think many of us are worried about the opinions of a little twerp who asks for relationship advice from strangers on the internet bc things move too fast with girls lol<Skrillerman>: oof creepy profile stalker and NO LIFE redditor with tons of karma. Dude your opinion is even lower than that of a guy with anime profile picture. Get lost <firezzzzzz>: You are the guy with the anime profile picture <Skrillerman>: That's the reddit bear but yeah, great anime you 30IQ beast. <firezzzzzz>: Not very smart are you lmao What are you studying buddy? <Skrillerman>: Runescape history but I'm new , bet some no life nerd like you can help me out there <firezzzzzz>: nO LiFe CrEePy StAlKeR &gt;no life nerd Is that all you know how to say buddy? I can feel you getting angrier and angrier with every reply nO LiFe NeRd hOw ShOuLd I tAlk To GiRls GuYs!?<Skrillerman>: You are the guy defending mentally ill killers. For some reason it triggers you that I fuck women and you don't while succumbing on reddit. Plus using some unfunny sarcastic stuff while creeping on people's profiles. And I'm the angry one ? K den<firezzzzzz>: &gt;I fuck women r/ihavesex Lmaooo <Skrillerman>: It's literally in my profile you should know after stalking around ;)<firezzzzzz>: Man I hope I wasn’t this cringey when I was 20 <Skrillerman>: Damn , a 40 year old virgin ? A rare sight <firezzzzzz>: My guy, you are literally the embodiment of the following subreddits r/teenagers r/ihavesex r/cringe r/iamverysmart r/incel <Skrillerman>: Why incel ? Incel is someone that is a forever virgin and angry at successful men. That's more like you. Who the fuck cares about how many girls a guy fucked..No one. But for some reason you do You literally stalk other people profiles and defend mentally ill people. You are the cringe in person bud <firezzzzzz>: Yep that’s you, because you are a virgin And class president of the r/teen subreddit All I’m saying is that you are one stupid ass 20 year old lmao Good luck in life kiddo, you’ll need it, especially with out easily upset you get on the internet 😂 Also, &gt;defend mentally ill people Just read that out loud 😂👌🏼<Skrillerman>: I'm still 21 , what are you , retarded ? Yeah I'm a virgin because I fuck women and ask some shit about it on reddit. Dude you are the dumbest adult I've met on reddit. You can't even add one and one together <firezzzzzz>: No you’re not, you’re 20 <Skrillerman>: Nice topic change <firezzzzzz>: And you are a virgin <Skrillerman>: I'm still not. I know it hurts your soul ,but I'm not <firezzzzzz>: You know how I know? You’ve mentioned you have sex like 7 times in this interaction without anyone asking lmao <Skrillerman>: bro you literally went on my profile and started that discussion. I didn't mention it until YOU started. YOU are the triggered one. I'm just defending myself from people that can't read and aren't able to use their brain. People like you", "num_messages": 27, "avg_score": -0.2962962963}
{"start_date": "1542112883", "end_date": "1542132577", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 29538, "text": "<Kublaiiii>: Toyota will replace burnt Tundra as a thank you to brave nurse <k1rage>: if they were really nice they would replace it with a decent truck lol <Beamspex>: None I can think of. Help anyone?<k1rage>: well id take almost any truck over a Toyota <BasedCavScout>: We can't all be smart.<k1rage>: lets not sink to personal attacks you're better than that <BasedCavScout>: Lol dude Toyotas are some of the best trucks around. What are you even going on about?<k1rage>: im just going to agree to disagree there Id take any of the big threes full size trucks over a tundra but I respect your opinion <BasedCavScout>: Not really an opinion. Truck quality isn't subjective, which is why there are industry standards - all of which Toyota pretty much leads in. The Hilux is one of the strongest trucks in the world, just as an example. Just because you prefer one brand over another doesn't make you right. You're certainly entitled to purchase whatever product you want, but having the opinion that inferior trucks are superior is categorically wrong.<k1rage>: well I guess we will just have to agree to disagree <4thetrees133333>: That's not how being objectively wrong works you idiot. It's like talking to a child.<k1rage>: you are the one name calling but im the child? ive do nothing to you but you attack me because our truck preferences differ? I think ill just wish you good day sir <4thetrees133333>: If idiot is name calling to you I suggest you put the video games down, get off reddit and participate in the real world. Yeah I'm being an ass but frankly types like you need to have your bullshit shut down. OPINIONS ARE NOT FACTS and fucks like you are why this world is devolving into childish bullshit. <k1rage>: you seem angry im just burn time at work like the rest of us good day sir <4thetrees133333>: So you're a slacker ass well. Gotcha. Forever alone seems about right. <k1rage>: why do you feel the need to attack me? <4thetrees133333>: Why do you feel the need to spout opinion as fact with no substance to your comment to even back up that opinion. Why do you feel the need to shit on something positive just because you're bored at work. Fucks like you need to be called out, that's why!<k1rage>: all I said was that I preferred other trucks over Toyota you were the one that jumped on me for liking a different truck live and let live bro <4thetrees133333>: No you didn't. You initial post was clearly a dig at Toyota, there was nothing about your preference, it was obviously meant to be edgy but you just come across like a child. Fuck it theres no getting through to cavemen like you, spend some time examine why you felt the need to be negative on a positive post and maybe your relationship issues might start to figure themselves out. Fuck not even sure why I bother. <k1rage>: it was a dig but it was never meant to be interpreted as a statement of fact, it was an opinion. you disagreed and then went to personal attacks which seem to be your bread and butter, lets leave my personal life out of it shall we? I have refrained from attacking you all I ask is the same courtesy good day sir <4thetrees133333>: You dont understand how English works. It was written as a statement of fact. N yup if I've got to attack a slacking low life idiot to get across to others that opinions aren't fact and just having an opinion doesn't make it valid then yes I will. Fuck you're an incel aren't you. The good day and faux calm superiority just scream s it. <k1rage>: all I did was state what trucks I preferred why do you care so much and why do you keep attacking me instead of just saying you piece you dont need to throw insults around, its kinda rude <4thetrees133333>: No you implied toyotas were crap. Your first post says nothing about preference so stop teying to change what you initially said. We live in a world on the fucking brink and people like you are the ones dumbing down our collective narrative. You were shown how you were objectively wrong by another poster pointing out Toyota leads the packs on all metrics used to rate trucks and you just say agree to disagree. That's not how being objectively wrong works and people like you need to wake up to that so as a fucking society we can find a way forward. Is your preference of truck the be all end all, no of course it's not but I'm going to bet you're the same with many other topics having equally wrong opinions. Which as I've said. Is not valid. <k1rage>: if I say toyotas are crap thats my opinion am I not entitled to that? I was never shown to be objectively wrong, no one ever linked anything proving what truck was better, you just told me I was wrong there was never an outside source just let it go dude, mellow out (oot if your happen to be Canadian) its ok for people to disagree <4thetrees133333>: Yup you would be wrong, and again your opinion is not valid, not everyone's opinion matters, parents dont set school curriculums for a reason, we have judges in courtrooms even with a jury for a reason and the idea that every person opinion is valid is utter bullshit. <k1rage>: so its not ok to like one truck more than another do well all have to drive the consensus best truck? <4thetrees133333>: It's perfectly okay to like one more than the other, but it doesn't make it valid, and if you cant even give reasons as to why then dont muddy the public discord. More people need to take time and think, do I need to post this. The answer is almost always NO<k1rage>: well I can post whatever I like so long as its within the rules of the given sub, I try to be polite and have a little fun thats all. <4thetrees133333>: Yeah you can, but maybe you and alot of others shouldnt. As a society we might actually be able to have rational discussions and fix things in this world if people like you who think their opinions matter will shut up and let people who know what they are talking about figure things out. I'm guessing you're also canadian since you brought it up, well how about you dont contribute to the americanization of our discourse eh. <k1rage>: I'll continue to do as I see fit, however thanking for leaving out the personal attacks in your last couple messages, they really didn't contribute much.", "num_messages": 30, "avg_score": 984.6}
{"start_date": "1544748323", "end_date": "1544784296", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 26, "text": "<sullg26535>: Us looks to ban Chinese officials unless Tibet is opened <Centrifuze>: How is this uplifting? <Potatrobot>: I know nothing about Tibet other than that China is apparently doing not nice things to it. This sounds like an improvement?", "num_messages": 3, "avg_score": 8.6666666667}
{"start_date": "1544771632", "end_date": "1544787106", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 111, "text": "<stickler64>: Judge halts Keystone XL pipeline, citing ‘complete disregard’ for climate <LittleRenay>: &gt;A supplemental Environmental Impact Statement typically takes about a year, including time for public comment, Parenteau notes. If he had to make a guess, he would say that the project ultimately will not go forward. Particularly if we can get serious about the environment in that time. I am hoping the young people take over with enthusiasm and good morals. <Oh_Yeah_COOL>: And education. Which will result in pipelines since rail is worse environmentally...<LittleRenay>: Which non fossil fuel needs a pipeline or rail car to deliver? Anyway the third google result for environmentally friendly railway... <https>://www.railway-technology.com/features/feature106295/<Oh_Yeah_COOL>: Lol? Sorry but way to miss the point completely with that link. The alternative to moving fossil fuel through the Keystone pipeline is railroad (or alternative sources of oil like importing from the Middle East or shipping to China etc but let’s simplify this to pipe vs rail). Which has had some devastating leaks (derailments, crashes etc.). We aren’t talking about the environmentally friendliness of the train themselves but their cargo lol. And sure reduction of fossil fuel is great, but again, that’s not the discussion. It’s whether the pipeline is more environmentally friendly than the alternatives that would/are being used And proper education would agree that a properly sited, properly monitored, properly built pipeline would likely be far better than the currently used railroads. <https>://www.google.ca/amp/s/business.financialpost.com/commodities/energy/pipelines-much-safer-than-shipping-oil-by-rail-fraser-institute-study-says/amp <LittleRenay>: You are right I misunderstood you. &gt; **properly** sited, **properly** monitored, **properly** built Your optimism in humanity is impressive. That is my wholesome answer to your view. We are different. Ces’t la vie. <Oh_Yeah_COOL>: The keyword being far better. Even a moderately built pipeline would still be better for the environment. Just read the link, get educated. Make informed points. All of a sudden, once you do, you'll be a proponent of pipelines for the near future until we can get away from fossil fuels completely. Until that point, which is no where near, let's do the best for the environment and build those pipelines. &gt;The study concluded pipelines are likely to experience 0.049 occurrences per thousand barrels of oil equivalent transported and rail will experience about 0.227 occurrences per thousand boe transported. &gt;Transportation Safety Board data show 73 per cent of pipeline occurrences resulted in spills of less than one cubic metre (about 1,000 litres), while 16 per cent didn’t cause any spill at all, the study notes.<LittleRenay>: I did not know that.", "num_messages": 8, "avg_score": 13.875}
{"start_date": "1544649356", "end_date": "1544772872", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 10, "text": "<phd_dude>: Freaky Fast Christmas Gift: Jimmy John Owner pays off multiple layaway bills for the holidays. <stanettafish>: So sweet of him to take time away from slaughtering endangered animals to do this.<philberthfz>: Okay, this is the first I'm hearing of this. You've got to give me the deets.<Centrifuze>: Google Image search \"Jimmy John\".", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1544620107", "end_date": "1544773023", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 34, "text": "<mikewall>: Charges dropped against woman whose baby was ripped from her by NYPD officers <CrappyPappy250>: I'm glad they dropped the charges but this hardly seems like uplifting news. It is just plain sad that this type of thing happens.<WhatArePlumbuses>: Welcome to UpliftingNews<Centrifuze>: Things (eventually) working as intended is, sadly, quite uplifting in these trying times...", "num_messages": 4, "avg_score": 8.5}
{"start_date": "1543697565", "end_date": "1543773958", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 129, "text": "<UpHereInMy-r-Trees>: Scientist unveils blueprint to save bees and enrich farmers <generalguan4>: Saving an article click. Instead of planting one crop and using mass pesticides plant a variety of things, some of which provide shelter to pollinating insects and watch yields rise. Easier to do, no technology required just new seeds. Can be implemented in poor countries as well as rich. <beebish>: I almost didn't read the article because of your nice summary, which is accurate. But I'm glad I did read it anyway because it made me hopeful for a brief moment, to know that there's some good stuff happening in the world. Now, if only this would become standard practice. On my drive to work I pass miles of ag land, field after field. It would look so much nicer if it was laid out like this! And holy crap, some of those crop yields were like 500% higher doing it this way....seems like a no brainer.<Nomriel>: it is, that’s why you see more and more farms like this <beebish>: Good to hear<Nomriel>: i see it use more and more in small farms that wasn’t profitable using more conventional ways because not large enough to compensate for the fixed costs it’s also way better for the moral of the farmers who have a more diverse day and take care of several kinds of plants instead of a boring a tedious job", "num_messages": 6, "avg_score": 21.5}
{"start_date": "1543703144", "end_date": "1543875386", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 27, "text": "<undue-influence>: FedEx driver, a former Marine, shows ultimate respect when he sees fallen American flag <Neon_Rust>: You Americans are weird. I feel like you treat flags and the national anthem better than actual people. I get its a nice gesture but it's only viral because the flag holds so much meaning. Which to me is bizarre. It's a flag. Treating it like it has life and feelings is weird.<DaveKast>: you mean the country where people from Europe fly to get better treatment? That's the one that doesn't treat people well?<Neon_Rust>: That's purely only because they do things over there that they don't offer elsewhere. Nothing to do with treating people well", "num_messages": 4, "avg_score": 6.75}
{"start_date": "1538327535", "end_date": "1538348856", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 25704, "text": "<Sariel007>: The two Koreas will start clearing mines from the heavily fortified Demilitarized Zone (DMZ) on October 1 as a first step after they agreed to disarm the border area starting with land mines. <Oldoggy>: Sounds like Trump is doing a good job.<airmarshalljoe>: maybe credit the two leaders of the two nations involved.<Oldoggy>: Without Trump, this wouldn't of had happened. What stopped North Korea and South Korea making peace deals when Obama was in office?<DumpMeImFamous>: Didn't Congress block Obama's decision to start negociations with NK ? <SteakMedRare>: No, that's another bullshit lie. Obama's foreign policy was one disaster after another. <Roosebumps>: Mostly, but the Iran Deal and thawing of relations with Cuba were pretty nice. Thank god those are still around and not ditched for the most asinine reasons imaginable. <SteakMedRare>: Please tell me what was good about the Iran deal? <Roosebumps>: It stopped Iran from developing nuclear weapons, a result found by both UN inspectors and the Trump administration. <SteakMedRare>: While paying them to find terrorism and destabilize the region. How wonderful...<Roosebumps>: You mean un-freezing their own assets because they were upholding their end of the deal, a deal that did not, to my knowledge, include anything about funding terrorism. But if you’re upset by that, be upset about this administration backing Saudi Arabia too. <Migidymark>: It's well known that Iran funds terror, throughout the region. Many American lives have been taken by weapons funded by Iran. Money is fungible. You somehow think pouring water into the shallow end won't effect the depth on the deep end. It's ridiculous.<Roosebumps>: Many other lives too, and many lives are being taken right now by Saudi Arabia with weapons made and sold by America. Terrorism is a completely separate issue to the nuclear threat that Iran posed and now poses again. <Migidymark>: I'm sorry, didn't you imply that the Iran deal had nothing to do with financing terrorism... Terrorism that is responsible for killing American's... You know,who took part in the deal... What do you have against Arabs? That's very messed up. Also, how many atomic tests has Iran done? Was Israel lying when they said Iran wasn't following the deal?<Roosebumps>: Are you fucking with me? There is no provision in the deal that addresses terrorism. So no, it doesn’t. But the US can not enforce what Iran does with its own money and part of our bargain was to un-freeze their assets. I can only assume some of this money may go to funding terrorism on Iran’s part, as that is what Iran does. But that possible cost is insignificant next to Iran becoming a nuclear state. &gt;what do you have against Arabs? What do you have against peace and diplomacy? If you’re going to be intellectually dishonest like every other trumper, this talk is over <Migidymark>: I'll take you up on that. I don't understand why you have so much Animus against Saudi Arabia, but are all pro-Iran... Because that's how it reads. But I'll forget that. I appreciate your admission that giving that money (unfreezing funds... Freezing funds is what you do to terrorists) to Iran is essentially the same as funding Terror. What I don't agree with is that it was a binary choice... Either give the terrorists money so they, among other things, can fund killing you (well not you, because you don't got the brass to go yourself, you're an English Major...that one I'm willing to bet is over your head). Or you can risk Iran continuing their work on a nuclear weapon (even though they continued regardless) and just do nothing to stop them. It wasn't diplomacy, it was about domestic politics. Do you want to talk about how Obama foreign policy was behind the Liyba uprising, followed by Syria, leading to the rise of ISIS, and thus the loss in millions of lives and even more displaced? I mean, you want to be intellectually honest, right?<Roosebumps>: Then you’re reading it wrong. Idc about the rest. <Migidymark>: This is what always happens, you TDS sufferers just can't have sound debate. Nearly nothing you ever say holds water. Keep pretending the current administration is somehow the source of all your imagined problems. By just about any measure, things are good and getting better. At the end of the day, you and I both know what I said is right. Your guy is responsible for the deaths of millions of people, and for the displacement of millions more. The refugee crisis that has effected the entire planet. What's more, you support it... I suggest you be reasonable and change you position.<Roosebumps>: I mean you’re putting words in my mouth lol. Pro-Iran? Anti-Arab? You’re incapable of “debate,” you’re just rambling and virtue signaling now. <Edit>: and enjoy the blue wave lmaaaoo<Migidymark>: You are completely in Iran's corner, saying they act in good faith (while admitting they fund terrorism, that's some mental gymnastics), while we have evidence that shows otherwise.<Migidymark>: Check the polls pal, your Senators ignited conservative enthusiasm all around the country. Already 2 accusers are proven false and incredible. Another, the NYT wouldn't outright reported that not only could they not substantiate the allegation, but that people they spoke to said the accuser had contacted them asking if they could remember because she wasn't sure, yet after a few hours with her attorneys she is 100%... Problem is she never cooperated or offered information to the Senate Judiciary Committee, probably because providing false information to them is illegal. Think she'll do the same with the FBI? Finally, there's a number of problems with Ford's testimony... Claim that no one from the Senate reached out to her as she would have preferred to host interviews in her home or town, her fear of flying, the renovation timeline on her house... Also,who leaked the allegation? We will know all this by the end of this week. Let's see what happens.", "num_messages": 21, "avg_score": 1224.0}
{"start_date": "1543713728", "end_date": "1543763101", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 123, "text": "<freebirdls>: Dark web dealers voluntarily ban deadly fentanyl <SatanMaster>: This is not uplifting news, bleeding fucking Christ. It’s the opposite.<SatanicOnion>: Drug dealers not selling a mostly fatal drug? Seems uplifting to me<---AL--->: I guess he means it’s not uplifting in the “dude helps little old lady across the road” sense. It’s great they’re not selling fentanyl but is this story really uplifting?", "num_messages": 4, "avg_score": 30.75}
{"start_date": "1543714679", "end_date": "1543718287", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 11, "text": "[deleted]: Layoffs hit NRATV after gun sales slump in Trump era [deleted]<AKaysfordays>: Not seeing how this is uplifting news. Gun sales tend to slump in non-election years anyways, and folks are losing their jobs. My spidey senses are telling me this was posted because you're glad to see folks of a different political stance taking a hit. Kind of missing the point in this sub, buddy.<dirtehscandi>: Yeah, the news that other people being subject to unexpected financial turmoil because they disagree with somebody over politics isn’t “uplifting”", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1544609379", "end_date": "1544673088", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 10774, "text": "<BeadyEyed123>: After his best friend died, a 12-year-old Michigan boy raised $2,500 to pay for the headstone <InternetNinjacy>: Why would he have to? That's fucked up.<Razatiger>: the mother couldn't afford it so he being the best friend started a fundraiser to help his bestfriends mom out. thats called brotherhood at the age of 12.<MissCrystal>: It's also fucked up. It doesn't have to be one or the other. <Razatiger>: im confused in your argument. Are you mad that this boy helped this single mother out? Are you assuming she just sat on her ass? She probably already paid for the bulk of her sons funeral which is not cheap in itself. It was a kind gesture that no one forced or asked him to do.<MissCrystal>: I'm FURIOUS that our society is to a point where children have to fund-raise for their friends and family to afford proper medical care and funerals. <seeingeyegod>: You sound like it's forced labor. He didn't have to do shit. He did it out of the goodness of his heart.<BWOcat>: He shouldn't have had to do it in the first place. It was a great action he took, people are mad because he had to do it.<seeingeyegod>: he didn't have to do it, in the first place<BWOcat>: That is not correct lol Try again! <seeingeyegod>: explain?", "num_messages": 11, "avg_score": 979.4545454545}
{"start_date": "1543730884", "end_date": "1543765266", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 41922, "text": "<bpg5075>: Thanks to better science and engineering, no one died in Friday's 7.0 earthquake in Anchorage, Alaska <49orth>: The '64 earthquake was a 9.2 and released two thousand times more energy than this one.<Propera>: That’s true, but 7.0 earthquakes fuck shit up around the globe. Here (Anchorage) there’s barely any major damage. We’ve been hit with major aftershocks for the past 36 hours too and life is pretty normal for most. It truly is a testament to learning from our past and building smarter and better. <bpg5075>: The 2010 Haiti earthquake was a 7.0. As was the 4th deadliest earthquake in human history: https://en.m.wikipedia.org/wiki/526_Antioch_earthquake It's not the always the physical intensity of a catastrophe that matters - it's how well we're prepared. Strong building codes, education and training on emergency preparedness and response, resilient infrastructure and utilities, and insurance are all important components of minimizing loss to life, property, and the economy in a catastrophe.<ruthlessrellik>: How was there a fire after the earthquake? <comparmentaliser>: Poor building materials, plastics and rubbish that are common in built up semi-slum areas in the developing world, couple with poor emergency services<King_opi23>: Semi slum? This is Alaska, there's no slums<Ulairi>: They're comparing the Alaska earthquake to the 2010 Haiti earthquake though; which did have slums. <King_opi23>: Oh, they responded to the wrong convo then, this thread wasn't about that<Ulairi>: Only three up from you: &gt;The 2010 Haiti earthquake was a 7.0. As was the 4th deadliest earthquake in human history. Then two up: &gt;How was there a fire after the earthquake? Then the one you responded to: &gt;Poor building materials, plastics and rubbish that are common in built up semi-slum areas in the developing world, couple with poor emergency services. They were comparing the two earthquakes, and discussing how the building standards of Alaska compared to Haiti is what made the difference between no casualties and the fourth deadliest in human history. Then thru discussed the fire after the Haiti earthquake as an aside, before suggesting that the better fire prevention methods, better fire codes, and better emergency services of Alaska were a huge factor toward preventing said casualties. They were very much in the right conversation, and everything said was relevant to their discussion; I think you just accidentally got off the track of the chain of comments you were responding to.<King_opi23>: No, they got off the wrong track, he was trying to respond to the wiki comment about the Lisbon disaster, but instead mashed two separate threads into one and it made no sense. <Ulairi>: Lisbon was never mentioned in this chain. Antioch was mentioned, which also had a fire; but it was ambiguous if the commentor asking specifically about *that* fire, about what causes fires following earthquakes in general, or about the fires in Haiti following it's 2010 earthquake; which was also mentioned above. The comment you responded to chose to specifically address the general question, why they were more common in developing nations, including Haiti, and why they're less common here. Which, again, was perfectly relevant. You're the one who actually mashed a couple of threads together here, as the Lisbon disaster was an entirely separate chain of comments below the comment referencing the Antioch earthquake of 526. Like I said, I think you got off track somewhere along the way; everything they said made perfect sense in context. <King_opi23>: There was no mention of fire in the chain about Haiti. Im glad you think you're reading into this right a day after the convo, but you're not. The guy meant to respond to the comment which linked a wiki article, about a disaster and consequential fire. There is no mention of fire in the Haiti comment <Ulairi>: A day? The earliest post in this conversation was eight hours ago. The whole post is only nine hours old, and is still only sixth down on my front page. You can't know what the guy meant to respond to, but even if you did your response made no sense given the context. If you *actually* thought it was the Lisbon fire, then you'd have asked about the slums in Lisbon, not the slums in Alaska. That said, if he *was* asking about a wiki article linked, and the subsequent fire, it would have been the Antioch one he directly responded too, as I said above. That, or, *since the thread mentioned the death toll in Haiti*, a good number of which were a result of fires that broke out; it seems possible to think that, after being linked and article about the Antioch fire, and looking up the Haiti earthquake and the fires there too, he asked about fires following earthquakes in general. Which seems to be what the poster you responded too assumed. Something that even OP's comment about Lisbon seems to have addressed as well. Even if it still *isn't even in the chain your responding too.* I'm not sure why you've chosen to double down on this; your own original comment is even at odds with your entire argument since. You can be snarky all you like, but it doesn't make this argument any less stupid, or you any less incorrect. I was originally only trying to point out I think you were off thread at the start, *which you've since confirmed by suggesting the commentor was asking about a article actually linked in response to that commentor...* not turn this into a pissing match, but you do you man. If you'd really rather argue that someone was responding to a comment linked *after* his own then simply admit you made a mistake, be my guest.", "num_messages": 14, "avg_score": 2994.4285714286}
{"start_date": "1544770270", "end_date": "1545016676", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 35, "text": "<AsterJ>: U.S. internet speeds rose nearly 40 percent this year <Griff82>: 2,97 Mbps download .38 Mps upload The internet is up this morning.<smallcoder>: How on earth do you deal with those speeds these days? I know it's a \"first world problem\" and all that but holy crap, that takes me back to 1999 DSL speeds I was getting. You have my utmost sympathy.<Griff82>: Work from home is out of the question. Streaming video is sporadic. It is a drag. There’s been a push for electric co-ops to run fiber. That would be a boon. We just need to get the state government to cooperate by clearing the way for competition with our current provider.", "num_messages": 4, "avg_score": 8.75}
{"start_date": "1544248847", "end_date": "1544300507", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 22718, "text": "<cybersecp>: Mom fighting leukemia gives birth to twins after finding perfect bone marrow match, thanks to viral video <elsieburgers>: Finally something actually uplifting, lol.<happyone44>: So happy for her and the baby thank you God <AxonBitshift>: How about thanking the person(s) who donated, God had nothing to do with it.<Wegotthisguy_notsure>: 'Thank god' is a common saying showing relief and praise for something positive... Also, who hurt you?<AcidicOpulence>: Recognition of fact helps everyone. Giving thanks to an invisible skygod^^tm won’t provide another bone marrow donor. But if you want to attribute an invisible skygod^^tm to having fixed the situation please also acknowledge that the skygod was also responsible for the leukaemia in the first place, so *bad* skygod^^tm fucked up big time. How is that a cause to praise it?<rinabean>: Hope you don't say goodbye to anyone then either, or you'll be spreading more lies!<AcidicOpulence>: What?<rinabean>: If you can't handle people saying thank god when they're relieved I hope you don't go around telling people god be with you. I don't assume people who say god be with you in its shortened form goodbye literally believe in god, so why assume people who say thank god do?<AcidicOpulence>: See ya later, or see ya. Is the general parting words I use. Unless it’s love you. The proper attribution of thanks is important, don’t you think?<rinabean>: Most of the time, but saying \"thank god\" does not mean that you're actually thanking god, any more than saying \"jesus christ\" when you stub your toe means you are invoking him as a power you believe in. Whatever you say when someone's leaving, I doubt you attempt to correct people who say \"goodbye\" the way you've attempted to correct someone who said \"thank god\" here. There are loads of atheists who say these things - I say these things and I am an anti-theist as well. I don't think your inconsistent language policing is helping anyone.<AcidicOpulence>: You have made an assumption that my language is inconsistent, have you spent time with me? Or are you simply going on what I’ve written in this thread? If the latter then please do point out where the inconsistency is? Otherwise stop making assumptions based on your own projections. I think if someone is saying “goodbye” to me I likely won’t correct them as I don’t want an argument to be how I remember them should they die and that be the last time I see them. But in the case of attributing someone’s return to health after serious illness to the truth of doctors skills and a donors generosity, it’s important not to fantasise that an invisible skygod^^tm has had any intervention. How many times have you had leukaemia? I know I didn’t thank anyone except the nursing staff and Drs the two times I had it. Nor did I curse a deity that I had it in the first place. If I’m in the fox hole, I’m in the fox hole alone. [deleted]: Spiritual fulfillment is encouraged in both medicine and mental health for wellbeing and you're kind of being a giant asshole. I don't even care you had leukemia. You're obviously wasting the time remission has afforded you if you're that emotionally invested in badgering people in an uplifting news subreddit. Why not take it back to /r/braincels or something.<AcidicOpulence>: Enlightenment is realising the truth. The truth is the big invisible bogey man in the sky ain’t responsible for your health any more than they are responsible for you ill health. Pointing that out doesn’t make anyone an asshole, but wilfully ignoring it might just achieve the status your heading for. [deleted]: You're right. Willfully ignoring enlightenment will make you out to be exactly that.<AcidicOpulence>: I’m glad you finally agreed with me. [deleted]: /r/woosh<AcidicOpulence>: Yeah, pretty much all of this seems to be over your head.", "num_messages": 18, "avg_score": 1262.1111111111}
{"start_date": "1544661271", "end_date": "1544824916", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 5327, "text": "<guanaco55>: How a man with four months to live restored A Polluted Washington Creek -- and lived another 27 years <brahmidia>: &gt; \"The task sounds monumental, but John had a mantra, a system, that pushed him through: “Just stop where you’re at, start at your feet, and go from there.” This is something I've been saying a lot lately. Things don't go from horrible to perfect in one step. It's more like a tug of war against destruction. You've got to plant your feet down, point in the right direction, and take a firm step even if it seems small. That's how you can be guided and make a difference in these tough times.<fpsmoto>: There will always be resistance, which is why movies that portray a characters overcoming insurmountable tasks are so coveted. People want to be the spitting image of their favorite heros, but most lack the self awareness to do anything about it. The key is to always be doing, even if it seems like going backwards. Write things down, make lists, set goals and then if the goals are too difficult to manage, break down the goals into smaller, more easily manageable goals. What you can handle right now will always change from day to day, so it is important to keep pushing forward.<forcedaspiration>: Hardwork is underrated. I blame our failing public educational system, where the teachers just collect a paycheck and follow their union overload's homogeneous mis-education plan. American kids and young adults are at a severe disadvantage to most 1st world country's kids who systems are better, so its not like the union overlords are right.. at all. They could easily allow teachers to put kids to work on projects like this, that build grit, and teach hard work can payoff. But they cant, thanks to the overlords, who resist any mention of paying teacher more for doing a great job, and firing those that dont care, you know merit? Its so fucked.<drot525>: LoL. Union overlords. LMAO. The teachers union as mentioned by someone else isn't setting the standards. That's your local or state school board, which is usually elected. And the fault with our education system begins and ends with the parents as both the primary educators of their children and voters for funding and school boards. But that's some shit that saying so ain't getting any politician elected. The teachers union is feckless and nearly worthless. Stop believing the propaganda that the only reason things are fucked up is because teachers are smart enough to collectively bargain. <forcedaspiration>: That, smart enough to collectively bargain, means they cant get fired. NOT OKAY in an organization that is responsible for educating our youth. It protects teachers, and should be protecting kids.<drot525>: It protects kids by protecting their teachers from being fired for arbitrary or capricious reasons. It allows teachers to push back against the myriad of shitty ideas some middle management puke or some nutty consultant has cooked up to extract wealth from our education system over and above teaching kids anything. Teachers can be fired. Just not arbitrarily. As long as the SD follow the procedure as per the contract they've signed, they can do it. The problem is their managerial incompetence that keeps them from following the procedure. Also, it's not the teachers as often is it's the administration of the school or the district or the \"brilliant\" ideas from revolutionaries like Gates or DeVos that are a bigger threat to the education of the kids. Many of these \"revolutionary\" ideas are untested, and not founded in reality before they're even applied. But sure, blame the lowest person on the totem pole.<forcedaspiration>: You are full of talking points, when the facts don't back them up. Fact. Private Schools provide better education for less money. Fact. Private schools can fire teachers if needed. Coincidence? Are you telling me that there aren't plenty of public school teacher that suck, you are wrong there, big time. I did public, private, and independent study when i was a kid. I can tell you public is a complete waste of time. They were talking about shit in high school that i learned in 4th at private.<drot525>: LoL. There's a super obvious selection bias at play with comparing private versus public. Take the easiest to educate kids, the best and brightest kids with the parents who are most active in the education of their kids, remove them from one pool and put them in the other pool, and you call that apples to apples? Those kids were going to do well in any case, because they have parents who give a shit and they're usually the most capable as well. Private schools and charter schools also aren't doing much for special ed or ESL kids. Charter schools also have this habit of taking kids up until the state pays them for the year, then booting them back to public school because they are taking up too many resources to teach. Keeping the money of course. All of this is a waaaaaay bigger factor than teacher unionization rates or teacher pay rates.<forcedaspiration>: Well, if it were up to me we wouldn't have ESL kids, that's just a jobs for teachers programs liberals came up with. Americans stopped having as many kids, then teachers got behind open borders. As far as special ed, they are a special segment and you are getting cute, there is a big problem with mental illness in this country, and teachers aren't helping thats for sure. Public School Sux, and needs to be completely reimagined. Including teacher accountability. You just like the status quo, but one day the people will revolt because all teachers like you do is make excuses for your inability to teach. Mean while one day your unaffordable pensions will go bust, and I will still have my IRA because I didn't depend on a unsustainable system. I will just laugh, and enjoy my home schooled family.<drot525>: I'm not a teacher. But I can see T_D is leaking, so to that I say, good day.<forcedaspiration>: Tee hee.", "num_messages": 12, "avg_score": 443.9166666667}
{"start_date": "1544797609", "end_date": "1544894831", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 8196, "text": "<Sariel007>: More than 1000 institutions pledge to withdraw investment from fossil fuels <wishusluck>: More than 1000 institutions pledge to withdraw investment from fossil fuels until their prices drop enough for them to quickly reinvest and make a fortune on the bounce. Story at 11.<AmbulanceChaser12>: Why would there be a bounce? The energy these companies produce is not as cost-effective as renewable energy, which is expanding. Also, these pledges mean the fossil fuel companies are going to lose $8 trillion of working capital, meaning they’re going to go bankrupt. Even if the emerge from bankruptcy, their stock isn’t going to be a good bet.<cataleap>: &gt;Also, these pledges mean the fossil fuel companies are going to lose $8 trillion of working capital, meaning they’re going to go bankrupt. Fossil Fuel companies are amongst the biggest investors in renewable energy. They aren't going to go bankrupt anytime soon. They know what's coming, they're just trying to delay the inevitable, and then continue to profit. <Yodaisawesome>: What's the purpose of delaying the inevitable if they have already invested in renewable energy?<Randomn355>: Higher profits in the oil areas of their business will do 2 things: 1. Keep money coming in. Cash flow is normally what kills businesses, not profit margin (or the lack of those things). 2. It gives them time to get renewables on their feet properly. This will ensure cash flow carried on, and prevent them from making a loss in the meantime. The latter is crucial for directors to keep their jobs and maintain share prices.<Yodaisawesome>: Do you believe renewable energy will be less profitable than fossil fuels?<Randomn355>: Right now? When you include the research costs? And the initial capital outlay, training etc? Absolutely. It also represents a huge risk from the shareholders pov. Don't forget, the directors are employees and shareholders are the owners of the business.<Yodaisawesome>: I don't think it's necessarily a huge risk. This world needs energy and concerns of using fossil fuels are clear. The only way these companies are going to maintain cash flow is if they *do* move to renewable energy. <Randomn355>: Right now it is, as the tech, the infrastructure, and the market hasn't been established yet fully. Compared to the oil market, for which all of these things are in place.<Yodaisawesome>: So the risk would be that investors over invest and lose out because renewable energy makes less money than they thought it would?<Randomn355>: Yes. Which is not in the shareholders interest, which doing so a breach of the fiduciary duty of the directors. Depending on the scale of that breach, it could present the directors with legal issues. To be clear - I'm not arguing the ethics. Simply pointing out how the directors hands are tied by the goals of the company. *What* the goals of the company should be are a different conversation entirely, and obviously brings ethics in.", "num_messages": 12, "avg_score": 683.0}
{"start_date": "1544640893", "end_date": "1544803712", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 140, "text": "<StevenSanders90210>: A Peruvian Father and Son Dubbed 'Coco' Into Quechua So Andean Kids Can Enjoy the Film <STODracula>: I have a friend here in the US who speaks quechua fluently.<TheLittleUrchin>: That's super cool actually!", "num_messages": 3, "avg_score": 46.6666666667}
{"start_date": "1544801662", "end_date": "1544910842", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 1788, "text": "<speckz>: 'It’s the only way forward': Madrid bans polluting vehicles from the city center. Only vehicles producing zero emissions will be allowed to drive freely in downtown Madrid – making it a pollution pioneer in Europe. <TA_Dreamin>: Electric vehicles are not zero emissions... The vast majority of electric power still comes from fossil fuels or even worse nuclear... <_fuck_me_sideways_>: You obviously don't know that much about nuclear. Putting that aside, a fundamental rule of energy generation is that the bigger the generator, the more efficient. So for simplicities sake let's pretend that combustion and electric engines have the same efficiency. Powering x amount of electric cars with a coal plant would still be less total CO2 emissions than providing the equivalent amount of fuel to the same number of combustion engines. Now we stop pretending the efficiency is equal, electric cars win in that aspect giving us an even greater reduction in emissions than a combustion engine.<TA_Dreamin>: You belong in r/iamverysmart<_fuck_me_sideways_>: you belong in r/fearmongering but apparently its a private sub. A grade schooler can understand these concepts, not exactly iamverysmart material. But hey, downvote away because you're wrong about the validity of reduced emissions and nuclear power and you don't like that feeling.<TA_Dreamin>: Butthurt much?<_fuck_me_sideways_>: Children don't bother me.<TA_Dreamin>: And a pedo...<_fuck_me_sideways_>: You're a joke but not funny.", "num_messages": 9, "avg_score": 198.6666666667}
{"start_date": "1544809926", "end_date": "1544883379", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 110356, "text": "<Khaleeasi24>: Hollywood Superstar Keanu Reeves Has Secretly Been Financing Countless Children’s Hospitals <thievingmongoos>: Captialism, and the charity it can bring, are amazing! Good on him!<KDT2000>: Socialism results in way more charity.<JPSchmeckles>: Forcibly taking other people’s money and giving it to who you see fit isn’t charity. <KDT2000>: Yeah it is.<JPSchmeckles>: Charity isn’t charity if you don’t have a choice<KDT2000>: You make your choice as a people when you vote for socialism. So it becomes a collective charity. Say yes to socialism.<JPSchmeckles>: Again, charity isn’t forced. You can support socialism all you want but charity is a choice. Taxes aren’t. <dshakir>: Taxes are a collective choice<JPSchmeckles>: Most of the people voting to raise taxes are the people who don’t pay taxes You guys can try and call forced taxation charity but it isn’t. Charity is the individual free choice to give your money to someone who needs it. Not taxation. <dshakir>: &gt; Most of the people voting to raise taxes are the people who don’t pay taxes Yeah let me see a source on that. I won’t hold my breath. Pretty telling that the *red* states are the welfare queens.<JPSchmeckles>: The only income group that has a majority identitying as Democrats is that making under $30,000/year. <dshakir>: I keep seeing a lot of “facts” being pulled from ass. No sources though. Let me show you how to do it: <http>://www.pewresearch.org/fact-tank/2018/11/08/the-2018-midterm-vote-divisions-by-race-gender-education/ As you can see, the majority of college educated voters went Democrat this last midterm. Contrast that with the uneducated during the 2016 election: <http>://www.pewresearch.org/fact-tank/2016/11/09/behind-trumps-victory-divisions-by-race-gender-education/ Hmm strange, huh?<JPSchmeckles>: Hmmmm yet the only income group you guys lead in are poor people. <http>://www.people-press.org/2016/09/13/2016-party-identification-detailed-tables/ If you’re in any way successful chances are you’re a republican. Wonder who’s clamoring for all those handouts and “charity”? The poor liberals. How strange that poor Democrats want to vote to raise other people’s taxes to give themselves free shit. <dshakir>: What the fuck is that?! lol A site that spoofed the real pew research site?! LOL Damn no wonder you don’t know anything <JPSchmeckles>: It’s part of Pew’s website. Calling fake website because you don’t like the data? That’s funny. What a joke. Then you accuse ME of not knowing anything.", "num_messages": 16, "avg_score": 6897.25}
{"start_date": "1529504830", "end_date": "1529604189", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 34576, "text": "<AskMeAnythingIAnswer>: These parents hoped to raise $1,500 for separated migrant families. They’ve brought in $8 million. <gjon89>: I hope they can reunite all of the children with their parents in due time. <EspressoBlend>: I hope someone can stop this madness and get them reunited ASAP. They never should have been separated, it's disgusting.<cuteman>: How many unaccompanied children come across the border per year? <Hint>: tens of thousands <EspressoBlend>: At 99,999 children that is 0.03125% of the US population. But it would probably make more sense to open up legal avenues for them to come here.<31Oct_ButterFingers>: There are legal fucking avenues!<EspressoBlend>: That's just a lie. I don't know if you believe that or not but it's a lie.<cuteman>: Hundreds of thousands of people gain citizenship every year. How do they succeed where others fail? People are absolutely doing it the right way. It just happens to be a lot easier to walk across the border and get paid under the table. <EspressoBlend>: ~400,000 worldwide. And yet ~400,000/y are still crossing the border. So you believe what exactly? ICE process all these people but they choose to risk death in the desert because... they dumb? So desperate to break the law they don't care how they do it? There are insufficient spaces allocated for legal immigration despite the demand from foreign people *and* the work they're finding here.<cuteman>: &gt;~400,000 worldwide. &gt; &gt;And yet ~400,000/y are still crossing the border. Could be a lot more legal immigrants if we didn't have so many illegal aliens to contend with. How many should we let in per year? &gt; &gt;So you believe what exactly? ICE process all these people but they choose to risk death in the desert because... they dumb? ICE largely handles the people that are caught and detained. They take the risk because the wages are that much better... 10/hour versus 10/day. At 8-12 hour days that is 1000-1200% better pay. That's quite an incentive. &gt;So desperate to break the law they don't care how they do it? Um yeah... It's been happening for decades. That's why tens of millions of formerly Mexican citizens now live in the US. &gt;There are insufficient spaces allocated for legal immigration despite the demand from foreign people *and* the work they're finding here. Demand from foreign people? That's doesn't determine our immigration levels. There is insufficient space because illegal immigration clogs the system. As I said above, we could easily accept more immigrants but not when the same number of people come over illegally. It's almost a million people per year combined legal and illegal. We use Walmarts because detention facilities were meant to house dozens or hundreds, not the thousands that come across. That's a signal that this is a huge problem. The United States cannot house and grant citizenship to the world's poor. <EspressoBlend>: Your whole post can be condenced to your final sentence, which is like the immigration version of the Laffer curve. True in theory, used to create shitty policy like internment camps.<cuteman>: My family is Jewish. Some died in the holocaust. People were pulled out of their homes by the millions, robbed, beaten, starved, tortured and killed. Compare that to hundreds of thousands of illegal aliens entering the US per year. Tens of thousands of which are unaccompanied children. Some have been deported before. Some have criminal histories. Most didn't expect to get caught. Some were assaulted on their journey. Some are being actively trafficked. The vast vast majority are economic migrants looking for 10/hr jobs instead of the 10/day in their home countries. We put house them in old Walmarts because regular detention centers are designed for dozens or hundreds, not thousands of people. It's such a huge problem but they are the ones actively choosing to take action that they know to be illegal. It's not Disneyland but it sure as shit isn't an internment camp. Any other ways you'd like to belittle the holocaust or nazi actions because your ignorance doesn't know any better? <EspressoBlend>: Being Jewish is not the great counter you imagined it to be when defending internment camps because everything you just said was said back then, too. The camps aren't that bad. Theynshouldnt be here. &lt;insert economic anxiety here&gt; And then it got worse because that's what internment camps do. We've been saying Trump is a repeat of Hitler. Winning with a minority of votes, the calls to jail opponents, abuse of power, disturbing divisive language, *camps*.... I mean how far does he need to go before people realize where they've gone? What if he makes the camps uncomfortable? Or expands their use? What if they become permanent to prevent reentry? I mean at what point do you stop going along with these incremental steps?<cuteman>: Being Jewish isn't supposed to be a counter. Only to highlight the ridiculousness of your strategy wherein you call everyone who disagrees with you a nazi. As you've probably been doing since the election. Hundreds of thousands of illegal aliens attempt to cross every year and have done so for decades. This isn't suddenly a Trump problem except in so far as the media has told people to be outraged. The reason they're housed in a Walmart? There are so many of them. But neither did we pull them out of their beds, beat, rob, starve, torture and kill them. They made a choice to come here knowing it was illegal. To compare it to the holocaust shows your ignorance to the realities of of the nazis. <drot525>: Being Jewish doesn't automatically inure you from becoming a Nazi or Nazi-like. Like any other human being you're as susceptible to being propagandized and led astray as any other person.<cuteman>: And yet, not in this case. I grew up in California, I know all too well the realities. Legal immigrants are fine, illegal aliens are not. Wait in line, pay your dues. Simple. <drot525>: Describe for me how the line is formed in other countries waiting to come to the US?<cuteman>: For starters you submit paperwork instead of coming across uninvited and unapproved. Visa, residency, citizenship, refugees, etc. it is all available just like it would be for you to go to another country.<drot525>: Im curious why you want to try to make non Americans comply with American laws, when it seems it would be way easier to make Americans comply with American laws by going after the people who hire illegal immigrants? <cuteman>: &gt;Im curious why you want to try to make non Americans comply with American laws, when it seems it would be way easier to make Americans comply with American laws by going after the people who hire illegal immigrants? por qué no ambos? Did you seriously just say why do we try to make non Americans comply with American laws? Because they're the ones who are choosing to come here when they know it's illegal. Are you suggesting they don't know it's illegal to do? If that's the case why would we want someone that stupid? <drot525>: They're not coming here to hangout. They're here to work. It would be a whole lot easier to prosecute the employers than the employees. You go apply without a visa in Australia and the company will snitch you out to their immigration service. <cuteman>: They're not coming just for work anymore. They're staying more and more. It's a massive bureaucratic nightmare and the choices are enforce the laws against fraud or allow an amnesty but we have a precedent for amnesty and nothing changed, infact it got worse. It incentivized people staying, thinking they'll eventually be made citizens. Where does it end? <drot525>: Bullshit. They're here to work. As shown by when the Great Recession hit net immigration was negative. Meaning with no work those Mexicans figured out it was cheaper to be an unemployed Mexican in Mexico than the US. <cuteman>: Is that why nearly ~20M formerly Mexican citizens now live in the US since the 1970s? <drot525>: It's pretty far to commute. Doesn't change the fact if we prosecuted the people who illegally hired them, the hiring would stop and they won't come or wouldn't have come. And the ones here would leave. Say you got a budget of 200M dollars to solve the problem you want to spend your time and resources chasing 12M illegal aliens or their 3M employers. It's like the 300, you chose your bttleground correctly and 300 men can hold off hundreds of thousands for a good long while. Shit this aint rocket science, you chose your battle ground correctly and choke points like employers seem easier and cheaper to defend than all of the US borders and ports. <cuteman>: We do go after companies that hire illegals. Why are you under the impression that we don't? Liberal celebrities just don't tweet about it and media doesn't really cover it. <drot525>: Sure we are. <cuteman>: It doesn't make leftist news but it definitely happens. In California especially, on the thousands of farms that are there. Can you show me evidence to where we aren't enforcing it? The problem is the sheer numbers of illegals. Border control tried to catch the hundreds of thousands that cross per year, but millions already exist. Many of them commit fraud with fake social security numbers trying to present legitimate identification. <drot525>: You can't prove things that don't happen. But there's circumstantial evidence that we haven't been enforcing the law against employers; tens of millions of illegal aliens working in America. So we might have these small programs that are there as a smoke screen or a red herring, but they're clearly inadequate. Probably purposefully so by the small govt suck big business cock GOP pricks. Just now in January ICE cracked down on some 7-11s. It was in the US News, so much for your liberal media doesn't cover it bullshit. You're missing my point; of course it's hard to accomplish the goal at the border since most illegal aliens fly in, which is why the right wing and the POTUS are idiots with the wall and border shit. You want to have a bunch of nitwits running around in the desert and building a boondoggle on the border meanwhile your average alien flew in on a visa and just never left. It's why you guys look like racist idiots even when you're not, because the only people at the border are the poorest of the poor and usually brown as well. You don't have to arrest 47 illegal aliens working at a farm; arrest the farmer, jail his ass, fine his ass. It's cheaper; you can tag and release those 47 will go home on their own eventually. Now if no one could hire them because they'd be afraid of paying through the nose or by facing jail time for doing so, then it would mostly stop. Absent a job the only pricks overstaying their visa or jumping the border would be ones with money being funded from overseas, and really no one is trying or wants to kick rich kids out or ones where money is coming INTO America. <cuteman>: &gt;You can't prove things that don't happen. But there's circumstantial evidence that we haven't been enforcing the law against employers; tens of millions of illegal aliens working in America. That's like saying we aren't enforcing the border because there are millions of illegals. Guess what? We try. ICE is woefully underfunded to handle it all. Notice we house people in Walmarts because the usual detention faculties house dozens or hundreds but we are dealing with thousands and thousand per month. &gt; &gt;So we might have these small programs that are there as a smoke screen or a red herring, but they're clearly inadequate. Probably purposefully so by the small govt suck big business cock GOP pricks. Just now in January ICE cracked down on some 7-11s. It was in the US News, so much for your liberal media doesn't cover it bullshit. You just said we aren't enforcing it. &gt; &gt;You're missing my point; of course it's hard to accomplish the goal at the border since most illegal aliens fly in, which is why the right wing and the POTUS are idiots with the wall and border shit. You want to have a bunch of nitwits running around in the desert and building a boondoggle on the border meanwhile your average alien flew in on a visa and just never left. So from your perspective: it's difficult so let's not try? &gt;It's why you guys look like racist idiots even when you're not, because the only people at the border are the poorest of the poor and usually brown as well. Every country has immigration and border control. Try to walk into Mexico illegally and see what happens. (hint: you'll be sent to prison) It has nothing to do with color and everything to do with low wage, low skill people who do not want to pay dues or wait in line. &gt; &gt;You don't have to arrest 47 illegal aliens working at a farm; arrest the farmer, jail his ass, fine his ass. It's cheaper; you can tag and release those 47 will go home on their own eventually. Except most don't go home. They stay, and then bring over more family. &gt; &gt;Now if no one could hire them because they'd be afraid of paying through the nose or by facing jail time for doing so, then it would mostly stop. Absent a job the only pricks overstaying their visa or jumping the border would be ones with money being funded from overseas, and really no one is trying or wants to kick rich kids out or ones where money is coming INTO America. Again you act like we don't enforce the laws against employers, but there just isn't enough coverage to get them all. If there are millions and only a few thousand ICE agents how could we ever catch them all? Are you in favor of increased ICE funding? Nope. But of course you'll say that they aren't doing a good job despite woefully inadequate resources.<drot525>: &gt; You don't have to arrest 47 illegal aliens working at a farm; arrest the farmer, jail his ass, fine his ass. It's cheaper; you can tag and release those 47 will go home on their own eventually. &gt; &gt; &gt; &gt; Except most don't go home. They stay, and then bring over more family. If they can't find work in the US, they'll go home. They stay because they find jobs. <cuteman>: And because there are so many you can't possibly police all employers. They are already supposed to verify citizenship but many illegals work in cash industries, recycle collection, landscaping, day labor, etc. <drot525>: Well clearly attacking the supply side of immigration isn't working, but by all means build some more internment camps and keep doing what we're doing. What could wrong by doing the same thing over and over and expecting different results.<cuteman>: I wouldn't say it's doing nothing but the problem is millions of individuals strong. The government does enforce citizenship and immigration laws against employers. I'm not sure why you're suggesting otherwise. Do you think individual illegal aliens are being detained and held to standards that US companies aren't? Most illegal aliens are completely off the books. Unless you want to ban cash, not all of it is trackable until it goes digital and remittances ($50-60B/year) being sent back to Mexico. Hence the orignal plan of taxing US to Mexico remittances to pay for the wall. (orignal plan on the Trump campaign website)", "num_messages": 34, "avg_score": 1016.9411764706}
{"start_date": "1544810904", "end_date": "1544876888", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 58, "text": "<Firesondiego>: Professor hired mercenaries to rescue student from ISIS in Iraq after he said he wouldn't finish his thesis (and they succeeded). <JupitersTits>: This is interesting. How much does a Swedish professor make? This sounds like an extremely tall tale concocted by a propaganda department. How much is an elite merc squad?<OnceInTunisia>: Elite? Expensive. A squad capable of fighting and succeeding over ISIS? Not so much. <JupitersTits>: Erm I dunno if youve noticed but ISIS is basically a bunch of malevolent delusional goat herders who picked up a gun<OnceInTunisia>: That was my point...<JupitersTits>: Oh .. yah. K. Got it now. lol.", "num_messages": 6, "avg_score": 9.6666666667}
{"start_date": "1544412910", "end_date": "1544813359", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 14, "text": "<michapman2>: Christmas dinner arrives at the International Space Station <detroitlibertype>: That's going to be pretty cold come Christmas<michapman2>: True. I think the delivery window was too wide TBH", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1544812984", "end_date": "1544886234", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 355, "text": "<Oneiric19>: Congress just quietly passed a law that could spark a boom for the $1 billion marijuana-linked CBD industry - The US Farm Bill passed on Wednesday legalizes hemp. The bill defines hemp as an agricultural product for the first time and amends a major drug law that hadn’t been altered in 50 years. <begemot90>: Sorry, I’m going to be captain buzzkill. This bill actually makes it harder for individual farmers and easier for Monsanto and other megacorps. You know something’s gotta stink when Mitch McConnell is happy about passing a bill with anything to do with cannabis<BadgerSilver>: Yeah, no. Just because rich people will make money, doesn't mean this is a bad decision. The real tragedy here is that it's being swept under the rug and discounted as anything but a huge step in the right direction. This was overwhelmingly supported by farmers and ranchers nationwide. I'm sure there are a few tag-alongs, but this was bipartisan 386-47 in the House and 87-13 in the Senate.<begemot90>: Gonna have to go ahead and disagree with you on that. There’s $1 billion dollar is corporate give aways in this farm bill. This farm bill also subsidized the tariffs that Trump put in place. If you’re only argument that it was a good piece of legislation is because farmers who would’ve lost a lot of money other wise liked it, and a bunch of politicians who’ve taken money from the agricultural industry liked it, then you should reevaluate how you judge legislation <BadgerSilver>: In fairness, I work in a very similar industry and work daily with those who use CBD as an integral part of their health plan. The greater good here is that millions are getting medication, I don't particularly care if the government had to spend a size-able amount to get there. This will save far more money than that within a couple years. It's the best investment this country has made in years. Funding for those tariff subsidies had to happen. You certainly can't add tariffs without subsidizing the correlating industries, that would end in millions of people losing their jobs. In politics you can't toss an entire bill for something that was negotiated in there. It's something or nothing every day. It's how the country functions.<begemot90>: I get that, and I agree that people having access to proper care is the way things should be. But why not just legalize and walk away from the issue? Why take out a billion dollars and give it to the rich? I would have a different view on things if the government was giving start up money to a bunch of scrappy hemp farmers, but instead it will go the mega farms. And you care about medication, and I totally agree, until these mega corporations start fucking with your formula to ensure they have a customer for life. Lastly, I do not want to be giving my tax payers to fund corporate welfare. It would seem to me that the last thing corporations need is even more of an edge over local growers.<BadgerSilver>: In a Democratic Republic, that's how things work. If you're arguing snippets of the bill. We can do that, but you can't just scrap the whole bill because of it. The bill is way more good than bad. If this isn't progress, I don't know what is. The corporations won't be fucking with the formula, it's a chemical compound. How absurd. The local grows voted for this!<begemot90>: Ok, how does being a Democratic Republic have anything to do with the bill process? But yea, let’s talk the bill. Scrap the whole damn thing and try again. I live in a state that has CBD, and medical marijuana, and we got product without the government pumping in cash, so why do they “need” money too? Why are we paying farmers because a president was warned this would happen? No, take it all fucking down, take that 1 billion in corporate giveaways and shove it. That’s a big fucking bill to just say, “the the price we must pay if we want the crown to allow us to have hemp”. Nope, sorry, not falling for it this time. Just legalize that shit and fucking forget it. <BadgerSilver>: No negotiation is the absolute worst way to communicate and live. This has been shown time and time again. Communist dictators don't negotiate, Kings don't negotiate. A Democratic Republic doesn't deal in extremes like this. If we choose your way and play it out it literally ends in a revolution. Wars. Humanity is flawed in a way that can't be fixed by demanding bills to be perfect. If you can devise a way to go from point A to point B without crashing the government, we'll have a discussion. Yes, they *should* have made that decision, but do we cancel the bill over it? No, because that's extreme and people aren't perfect. We don't stop voting because we don't like either opponent, but maybe those who think so shouldn't. We pick the best we can and hope to god it works. That's what humanity is. <begemot90>: I’ll negotiate all day about what we should include in a farm bill This is a sweetheart bill for special interests. It does not create solutions but problems, and that’s why the WHOLE bill should be scrapped. The problem is that your ascribing the inability to find common ground to common people, not the congressmen who hamstrung the citizens time after time <BadgerSilver>: That's why we vote for who is going to do the best job. That's the Democracy part. What you are proposing is beyond the ability of a normal elected official. If you are saying this in an attempt to get people to vote for people who share your values, then I get it. But you can't actually scrap the bill because, again, that ends in chaos any way you spin it. Anyway. I believe your intentions are good, but I don't think you really know what you are talking about.<begemot90>: Not at all What I’m proposing is that congressmen stop accepting payments from special interests, that would work wonders. That’s well within their ability. Just as it is to debate a bill rather than ramrodding it down “in the dark of night” as this article suggests. So you’re ok with democracy being bought by special interests. You’re ok when our democracy isn’t transparent. And you’re suggesting that as long as it satisfies some requirements then everyone must support it because democracy right? Seems like we have two different understandings to what democracy it, what I listed above isn’t democracy, but an oligarchy masquerading as a democracy. So as my democratic choice to choose, I’m going to continue to say this bill sucks, and should be shot down. <BadgerSilver>: No, that is not how a Democracy works. The people are already voting. If you didn't vote, please for the love of God stop sharing your political views. You seriously have no clue what you're talking about. You're getting caught in a complete paradigm of thinking. Elective officials voted for it, and we voted for them. But, to wind this down, it's necessary that there are some dissenters. <begemot90>: And I suppose it’s necessary we have some sheep as well.<BadgerSilver>: Either way, we'll see ;)", "num_messages": 15, "avg_score": 23.6666666667}
{"start_date": "1543774196", "end_date": "1543775545", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 6, "text": "<blind_killer07>: Michelle memoir sells two million copies in two weeks <BeigeLion>: Those poor trees<EnragedParrot>: Shhh....the Left's Elite don't have to suffer for Climate Change", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544816268", "end_date": "1544816748", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 85, "text": "<emitremmus27>: The Education Department Is Canceling $150 Million Of Student Loan Debt <MyDogsWatchMePee>: Sweet! So now like what, 5 people are debt free? Lucky SOBs<emitremmus27>: 15,000 technically", "num_messages": 3, "avg_score": 28.3333333333}
{"start_date": "1543787902", "end_date": "1543865567", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 16671, "text": "<ClimaticInstability>: NYPD finds British couple who lost engagement ring <kjhgsdflkjajdysgflab>: Why the fuck would you leave and not find someone capable of opening the grate. <ShadowPouncer>: Non-refundable airline tickets is definitely an option.<Speed4ce>: Im sure a ring is worth more than a few nights in a hotel and a plane ticket.<ShadowPouncer>: That rather depends on the hotel, and just how much their airline is going to stick them for the _international_ return flight. And remember, some (crappy) airlines will charge you the change fee _and_ the difference between the cost of the flights, which, erm, unless they can bump the stay out a couple of weeks can absolutely cost more than the ring did.<timeafterspacetime>: Also not everyone gets a super expensive ring. I’ve had friends with rings under $1k or $2k<tlogank>: My wife picked out the ring we got, it was literally $188 on Amazon. She's so low maintenance, I love her so much. <xXTheFisterXx>: My fiancés ring was like 150 at walmart and she literally swoons when she looks at it. Style is so much more important than cost. My best man watches were like 12$ and they all thought they were super nice watches!<SnoosPoo>: Any idea what watches they were? <Dr_Schmoctor>: https://i.imgur.com/T1XVZT2.jpg<hockey_metal_signal>: I have this watch!", "num_messages": 11, "avg_score": 1515.5454545455}
{"start_date": "1543790515", "end_date": "1543817881", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 423, "text": "<ChickenTeriyakiBoy1>: Sierra Nevada and over 1,200 other breweries have pledged to brew a beer and donate all the proceeds to California wildfire victims <prodevel>: I thought Sierra got bought out by A.B. and then Heinekin or whatever Euro overlord bought A.B. (Bud). I noticed as soon as the \"Krausening process\"(sp) went away. Their beer back in 2000-2002 was incredible.<RangerDanger9456>: No<prodevel>: You're right. It's very weird. I guess their ditching of that process led me to believe \"fake news\" at that specific time that whoever bought Budweiser bought them as well. Thanks.", "num_messages": 4, "avg_score": 105.75}
{"start_date": "1543796134", "end_date": "1543879030", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 2535, "text": "<SpammyMcSpammington>: The World’s Largest Ocean Cleanup Has Officially Begun <havereddit>: Great initiative, but the math doesn't add up. Dozens of booms will each remove up to 150,000 pounds of trash per year. OK, so let's say 4 dozen booms or 48 booms each remove 150,000 lbs of trash per year = 48 X 150,000lbs=7.2 million pounds or about 3600 tons of plastic per year (equal to about 3275 tonnes). Meanwhile, about 8 million tonnes of plastic enter the oceans every year. So this clean up, if it succeeds as planned, will remove about 0.04% of the the plastics that enter the oceans every year. We would need about 2440 more of these arrays just to deal with the annual increment in plastic (let alone the plastic that already exists in the oceans). The solution to plastics in the ocean lies not in clean ups, but in preventing the plastics from entering the oceans in the first place. <OverlySexualPenguin>: but that would impact on our lifestyles! we'll do it later.<o_Oo_Oo_Oo_Oo_Oo_O>: All of the ocean pollution comes from China, India, and Africa. The US doesn’t need to change it’s lifestyle. <git_reykt>: That is true but that’s just pushing the blame on someone/something else. The pollution still affects us and we still contribute to it. So if we have the technology and the opportunity why not do something about it? <o_Oo_Oo_Oo_Oo_Oo_O>: Dude we ARE doing something about. Literally that’s what this is about. The shithole countries create a problem and the US has to fix it, AGAIN. <git_reykt>: “We” aren’t doing anything. This is a Dutch person having the fucking potential and opportunity to help everyone. The US doesn’t give a shit and isn’t really helping. <o_Oo_Oo_Oo_Oo_Oo_O>: Same thing. Good country cleaning up after shitty country.", "num_messages": 8, "avg_score": 316.875}
{"start_date": "1543796204", "end_date": "1543803215", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 54, "text": "<EnoughPM2020>: Washington state will start implementing one of the best paid family and medical leave programs in America on January 1 – with employees eligible to take up to 16 weeks off in 2020. <kaffirdog>: Paid for by you. <xanadumuse>: And the employer <kaffirdog>: Who will raises prices. You pay again. <citizenzero_>: you say it like you’re going to be paying $20 today and $100 tomorrow. The reality is that it’ll be $20 today and $21 tomorrow. Frankly I’m okay paying that extra dollar if it means people aren’t going to have to choose between spending time with their sick relative or new child, or losing their job.", "num_messages": 5, "avg_score": 10.8}
{"start_date": "1541668115", "end_date": "1541717837", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 5785, "text": "<REO_SpeedDealer>: All 19 Black Women Running for Judge in a Texas Race Won Last Night <A_Wild_Raccoon>: I couldn’t imagine being a black woman and seeing my race and gender get baited like this for upvotes, like I’m some sort of pet.<Vagabondcam>: what are you on about? it's an unprecedented achievement. are you that ignorant to see that?<A_Wild_Raccoon>: It’s unprecedented, but it’s not an achievement. It’s a result.<Vagabondcam>: Go on Achievement (n) - a thing done successfully, typically by effort, courage, or skill.<A_Wild_Raccoon>: What effort, courage, or skill does it take to be born black? I’d hope that isn’t the low standard we as a society would set for any demographic of people.<Vagabondcam>: Oh, **wow**. <A_Wild_Raccoon>: Yeah. WOW indeed. Just because Cosmopolitan does it, doesn’t make it okay.<Vagabondcam>: I'm more wow'd by your disgusting ignorance. <A_Wild_Raccoon>: Oh wow. I never realized the Oxford definition for racism was disgusting and ignorant. Go up to a minority and tell them they’re stunning and brave for having a darker pigment in their skin. See how they react to that sort of blatant racism.<Vagabondcam>: &gt;Oh wow. &gt;**I never realized the Oxford definition for racism was disgusting and ignorant.** &gt;Go up to a minority and tell them they’re stunning and brave for having a darker pigment in their skin. See how they react to that blatant racism. Are you calling yourself racist? Second, that's not what's happening here. These 19 women ACHIEVED something by winning their races, despite the color of their skin. Black women could literally not vote in some states until the 1960's. I am a minority. I'm afraid I can't even begin to reason with you because you don't think in the slightest that 19 black women winning an election isn't an achievement.... Quite honestly dude, you're too far gone for any type of conversation. Promptly, go unfuck yourself. You're going to live this ragged life always being partisan, difficult to love and no matter what- you'll constantly be pointing the finger at other people. Your entire post history for the past **multiple hours** has been arguing with multiple different people, and you're hard lined in this thought process of yours. Don't you have a job? Don't you have something better to do? Friends? A girlfriend? Its just like, pathetic at a certain point<A_Wild_Raccoon>: I don’t care if black women couldn’t vote in 1960. This is 2018, and black women CAN vote. If they couldn’t vote, I would advocate for them to be able to vote. Why is it wrong for me to not get emotional and caught up about the past? The Oxford definition states that being prejudiced towards a race means you’re a racist. Saying that someone is brave or special for doing something while black is the bigotry of low expectations. It’s a form of racism. I’m not calling myself racist, I’m calling the article racist. It prioritizes skin color over merit. But keep trying to insult my character, as if that’s a valid argument and doesn’t make you look void of the ability to debate. <FYI>: I’m not partisan. I’m a centrist who criticizes racism and bigotry on both sides. If you don’t like that, too bad.<Vagabondcam>: you brigadier solely on posts that support the right. if you need to define the word racism to someone in hopes of pathetically displaying to them that you're not racist- chances are, you're racist. No, the article commends them for being historically disenfranchised individuals that were able to overcome social deficiencies and **achieve** something unprecedented. honestly, this/you are not worth me time. fuck off<A_Wild_Raccoon>: I believe the pendulum swung too far to the left. That’s why. I don’t need to define the word racism, but I want to make it clear I don’t believe that racism = privilege + power. So you’re wrong about that. I don’t think you don’t know what racism is, and I won’t imply it because I’m not an asshole. And my response to the article is that it’s being pretty racist. If you don’t like it, so be it. And since you started this by responding to me, and then had the gull to try and frame me as a racist, how about you fuck off?<Vagabondcam>: I’m not framing anything friend, it’s what your own words say about you. I didn’t make you say those things. Moreover, you're wrong. you *seek* posts where you can defend the right. many of your comments are in subreddits devoted to attacking the right but you are there defending it. Being that you're a self proclaimed centrist, why have you not done that for those subreddits that deeply support the right?<A_Wild_Raccoon>: &gt;Are you calling yourself a racist? No, clearly not. How did you even manage to come up with that conclusion? &gt;you’ll constantly be pointing the finger at other people Name one thing I’m doing wrong and blaming other people for, in regards to this topic.<Vagabondcam>: you edited that post when i first commented on it ... damn dude, you're like off the wall man. you need a reality check it's really pronounces your pitifulness by constantly downvoting my posts.. while me and you are the only 2 people in this conversation...<A_Wild_Raccoon>: Sorry for posting too early I guess? I only downvote the ones you insult me in, because it’s rude and uncalled for. <Edit>: And it doesn’t contribute to the discussion. <Vagabondcam>: I guess i should downvote those that are condescending, unfortunately- im not as petty as you<A_Wild_Raccoon>: Are we going to devolve this conversation into the logic behind downvoting a single person, are you going to address my questions, or are you done?<Vagabondcam>: ive addressed your questions. you're too obtuse to be open to an actual conversation. you also blatantly ignored me addressing your weak \"centrist\" views. [Moreover, i guess this is just more racism to you too, huh? Or maybe not, because one of them is a republican.](https://www.nytimes.com/2018/11/07/us/elections/native-americans-congress-haaland-davids.html) <edit>: [here's another racist one for you!](http://english.yonhapnews.co.kr/news/2018/11/07/0200000000AEN20181107009300315.html)<A_Wild_Raccoon>: The questions in my editted reply I don’t know enough about this to form an opinion. But I will say that highlighting her heritage and sexual orientation in her campaign as if it’s important is weak and off-putting. I don’t care what a person’s heritage or orientation is, and I think minority-point-scoring is lazy. <Edit>: At least they included her name.<Vagabondcam>: as you continue to ignore my point about your \"centrist\" views. in the current (albeit slowly changing) and historical climate, white people have an advantage being born white in america. men have an advantage being born a man in america. is this news to you? it's comical to me how you go from calling another article, which is highlighting the same exact thing just a different race/party, racist but you can call this \"lazy\". selective bias. \"centrist\", right. get over yourself. <A_Wild_Raccoon>: And women have their own sets of advantages, etc, etc. White privilege is a deeply flawed argument. Every race and gender has sociatel pros and cons. This isn’t news to me, it’s just a flawed ideological talking point that I don’t put up with anymore, assuming that’s what you’re implying. The reason I didn’t call it out for being racist is because Natives have their own in-groups and protected communities, given this was originally their land. I don’t know enough about it to form an opinion. I could care less if one of them is a republican. At the very least, at least it means there’ll be more diverse opinions. But yeah, I’m a centrist. More than not I lean right, but I still support left wing ideas. The reason it’s hard to believe is because the mainstream left is becoming more and more extreme. A centrist to them, is a leftist.<Vagabondcam>: Dude, you **seek** extreme left wing ideas and debate them but you do nothing of the sort for extreme right wing ideas. In one post you speak of the 1960s like it’s the distant past but in another speak the past with credence. You also didn’t comment on the Korean American woman. I like how you mention things that solely support your headlined position. You’re being obtuse to facts now. I’m done with this conversation. Please leave it alone. You lost.<A_Wild_Raccoon>: Well that’s the thing though. I don’t have to seek them. I have them shoved in my face regularly, because I’m interested in politics. The extreme left attacks people for their race, and it’s socially acceptable. That pisses me off enough to be concerned about it. When right wing extremists are racist, mainstream conservatism criticizes it alongside the left. It’s not the other way around. The mainstream left HIRES proud racists. Sorry if you don’t think 50-60 years is a long time, but I do. A lot can change in that time. <FYI>: Please just drop the conversation. You lost. (See how easy that was?)", "num_messages": 26, "avg_score": 222.5}
{"start_date": "1532823526", "end_date": "1532960486", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 48434, "text": "<Boxscape>: Homeless man hands out resumes, gets hundreds of job offers <Ted_E_Bear>: Nothing against the dude or his idea, but it seems like all these big companies just want him for his marketing value.<Super_consultant>: I agree here. For all those companies, the standard for software engineers are rather high. His resume, although “pretty” is not particularly impressive, but maybe that lends to just bad communication skills. I would hope that his abilities are fairly good given his schooling and years of experience. <SonOf2Pac>: It is pretty impressive though.. He was a damn web developer for GM and has a bachelor's degree from a decent university <rrrrrrr1131>: i really don't mean to be a snob here but that's often not good enough for the more well known companies in the bay area <Poopybutt22>: what would be considered good for these kinds of companies? genuine question not being snobby<d_ippy>: A FANG type company is what usually gets you noticed. Get hired by one of them or their second tier brethren and you can pretty much go anywhere. <gamerfreakish>: Fang?<crabbyvista>: Facebook Amazon Netflix Google<Open_Thinker>: Throw Apple in and it becomes FAANG. I think Tesla and Microsoft should also be in the mix, but no one's come up with a good acronym yet.<ab0rtedbabby>: FATMANG<d_ippy>: Add Uber in there too <ab0rtedbabby>: FUNMATAG? Doesn't sound as good as the other tho.", "num_messages": 13, "avg_score": 3725.6923076923}
{"start_date": "1543838870", "end_date": "1543939467", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 1029, "text": "<psgenius>: California Man Shows Remarkable Recovery Less Than One Year After Facial Transplant <RealHausFrau>: This fascinated me, his new face looks so natural! <enhanciosacanada>: Well, I reckon that's due in part to the fact that they took 23 year old deceased William Fisher's face and transplanted it onto the recipients face. <RealHausFrau>: Yes, I read an article about this, most of the face transplants that I’ve seen don’t look this good though, They often look just a little ‘off’.<astoriabeatsbk>: You're referring to the face on the right as his current face, right? The one at the bottom isn't his current face. <RealHausFrau>: Yes, the one on the right is the transplanted face.", "num_messages": 6, "avg_score": 171.5}
{"start_date": "1544534026", "end_date": "1544587193", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 26779, "text": "<Redzit69>: Tyler Perry pays over $400,000 to pay off layaway for 1,500 Walmart customers: ‘It's hard times’ <DTru1222>: But its not \"hard times\". This is one of the best times to be alive in all of recorded history...<i_heart_pasta>: Exactly, unemployment is at the lowest its been in a while, where were these guys and the \"hard times\" eight years ago when it really was hard times for a lot of folks.<StevenGannJr>: &gt; unemployment is at the lowest its been in a while People no longer registering for unemployment doesn't mean they are working. Discouraged workers are a big problem, and frankly finding a job is _hard_, especially if you have responsibilities where minimum wage isn't nearly enough, and even with a college education. It took me 3 years, Master's degree in engineering and two years' teaching experience in grad school, to get a company to even offer me an interview due to lack of experience. During that time I wasn't counted as unemployed because I wasn't applying for unemployment benefits.<andypro77>: &gt;and frankly finding a job is hard, There are literally more job openings in the US right now than at any time in our country's history. Literally. &amp;#x200B;<StevenGannJr>: Job openings that pay enough to live on?<andypro77>: &gt;Job openings that pay enough to live on? Hourly wages in the US are currently at all-time highs. And the fact that there are so many job openings means that employers have to compete to get employees and to keep the good ones that they already have, thus pushing wages higher. This is just Econ 101.<StevenGannJr>: &gt; Hourly wages in the US are currently at all-time highs. And all-time lows when adjusted for inflation. That's Econ 101.<andypro77>: &gt;And all-time lows when adjusted for inflation. That's Econ 101. Nope, that's Bullshit 101, because it's not at all factual. (Go ahead try to prove it) When you have to make up shit to try to make your point, it means that you don't really have a point, doesn't it? Making up fake statistics might work with the idiots you hang out with, but it doesn't fly when discussing things with people who have a little bit of intelligence. Do better next time so you won't embarrass yourself again. <StevenGannJr>: According to the [US Department of Labor](https://www.dol.gov/whd/minwage/coverage.htm), the federal minimum wage in 1980 was $3.10/hour and today it is $7.25. Adjusting the 1980 $3.10 to 2018 real dollars using the handy [CPI Inflation Calculator from the US Bureau of Labor Statistics](https://www.bls.gov/data/inflation_calculator.htm), the 1980 minimum wage equates to $20.33 in 2018 dollars, based on the metric of real buying power which includes an analysis of typical food, clothing, and housing available on the consumer market each year. You can repeat this same calculation for every year since the federal minimum wage was introduced in 1938, and if you graph the results you'll see that [minimum wage has been decreasing since 1968 when adjusted for inflation.](https://oregonstate.edu/instruct/anth484/minwage.jpg) Did your macroeconomics class fail to cover inflation, or do you just take the decontextualized metrics from Fox News as gospel? Denyong basic mathematics and reputable sources might work with the idiots you hang out with, but it doesn't fly with people with basic educations. Read a book so you won't embarrass yourself again.<KingCrow27>: Average hourly wages do not equal minimum wage. Newsflash: Not all workers are paid minimum wage. You can't just scrape the bottom of the barrel and then proclaim that it represent everyone. That's why average hourly wage is way more meaningful. Not everyone works at McDonald's. Your pretentiousness is embarrassing.<StevenGannJr>: Average income is an increasingly poor metric for representing the [growing divide between upper and lower economic classes](https://c6dl5x1uaua7tk6u-zippykid.netdna-ssl.com/wp-content/uploads/2017/05/US-before-tax-income-1-768x424.png). A small minority of high-earners doesn't raising the average doesn't accurately reflect the growing numbers of people who are outright destitute. Let's look at a nice, simple example. You've got 100 people. - 1 of them makes $100mil/year - 5 of them make $1mil/year each - 10 of them make $500k/year each - 30 of them make $80k/year each - The remaining 54 make $15k/year each What's the average wage? A whopping $1.13mil! Wow! This must be a very healthy economy where the average income it over $1mil! ...but when you look closer, you'll see somewhere between 50% and 80% of those people aren't making enough to make ends meet. Not everyone is a billionaire consultant. Your ignorance of reality is embarrassing. you'll understand better when you actually have to get a job and pay your own bills.<andypro77>: &gt;**Average income is an increasingly poor metric** for representing the growing divide between upper and lower economic classes. **A small minority of high-earners** doesn't raising the average doesn't accurately reflect the growing numbers of people who are outright destitute. Well, it's a good thing that when calculating US Hourly Wages, the Bureau of Labor Statistics **DOES NOT INCLUDE any of those people you use in your example**. It's simply hourly employees, and doesn't even include supervisors. &gt; Let's look at a nice, simple example....not everyone is a billionaire consultant Once again, you'd have to use a fake example to make your point, because **THOSE IN YOUR EXAMPLE ARE NOT THE SAME AS THOSE THE BLS USES TO CALCUATE HOURLY WAGES.** &gt; Your ignorance of reality is embarrassing. Oh, the delicious irony of YOU making this statement. I'm torn here. While it's sad that you're so stupid, it's becoming increasingly hilarious each time you post your idiocy and further embarrass yourself with your lack of knowledge. On balance I'd say keep it up, because I'm mostly enjoying throwing actual real facts at your made up little fake stories. &amp;#x200B;<StevenGannJr>: &gt; Well, it's a good thing that when calculating US Hourly Wages, the Bureau of Labor Statistics DOES NOT INCLUDE any of those people you use in your example. It's simply hourly employees, and doesn't even include supervisors. Unfortunately, the BLS _does include_ everyone who reports income each year. &gt;Once again, you'd have to use a fake example to make your point, because THOSE IN YOUR EXAMPLE ARE NOT THE SAME AS THOSE THE BLS USES TO CALCUATE HOURLY WAGES. And once again, there's more the macroeconomics than hourly wages., and the BLS includes all reported income in their figures. Median income continues to fall below average. This is a very simple concept. &gt;On balance I'd say keep it up, because I'm mostly enjoying throwing actual real facts at your ignoring of reputable sources. Seriously? You haven't provided a single fact, figure, or source. Shoot, an uncited anecdote would be great. You're denying official figures from federal agencies, as well as simple examples of arithmetic.<andypro77>: &gt;Unfortunately, the BLS does include everyone who reports income each year. Keep it up, you're comedy gold. From the BLS: *\"In the United States, wages are benchmarked using average hourly earnings. Data relate to production employees in mining and logging and manufacturing, construction employees in construction, and nonsupervisory employees in the service-providing industries. These groups account for approximately four-fifths of the total employment on private nonfarm payrolls\"* &gt; You're denying official figures from federal agencies You literally just did that and I corrected you, with the official words from a federal agency. I take it back, don't keep going, you're sad embarrassing of yourself is becoming tedious. Read up a little and come back when I don't have to correct your made up facts each time. &amp;#x200B;<StevenGannJr>: &gt; From the BLS: From the BLS: _Thus, average after-tax income—which equals market income plus government transfers minus federal taxes..._ Yeah. Hourly wage figures only include hourly wages. Super. There's a _lot_ more to macroeconomics than hourly wages, though, and minimum wage represents the floor of the wage (hourly and salary) scale. Now. If you're done quibbling over the hourly versus salary and are interested in discussing _the actual topic_, I'd like some source showing that I am incorrect in my original premise that median wages are on decline. Please be sure to note that, while hourly wages are an important metric to track, I am including _all_ wages (just as the BLS and CBO do when measuring income distribution and average wages) so your tiny Far-Right brain isn't confused by rationality and a consistent argument. Heck, I'll go one further and assert that median wages today are lower than average wages in 1970. In the 70's my father worked 3 months of minimum wage and bought a house in Florida. In nominal dollars I make more than 10x that at just a bit over the national _average_ income, and despite living in near destitution I won't have enough saved for a small house for another 7-10 years.<andypro77>: &gt;my original premise Your original premise was this: **And all-time lows when adjusted for inflation. That's Econ 101.** That is provably false. Then, when I proved that false, you pretended you were proving it true by talking about minimum wage instead of hourly wage. Not only did I expose your stupidity on that score, another poster did as well, as he recognized the same logical fallacy. You then decided to once again shift gears by claiming that hourly wages as measured by the BLS are skewed because a small minority of high-earners raise the average. ONCE AGAIN, I proved you wrong by citing the exact standard that the BLS uses to calculate hourly wages. Not taking the hint, you continued by making the provably false statement that the BLS does include everyone who reports income each year, which I ONCE AGAIN had to correct. Here, in a nutshell, is our conversation so far: <YOU>: I believe this <ME>: Nope, here's the facts <YOU>: Ok, what about this then <ME>: Nope, false, here's the proof <YOU>: Well, then how about this... <ME>: Nope, that's not right either, here's the proof <YOU>: Stop quibbling over issues, HERE is what I really want to talk about. &amp;#x200B; You see, you say something that's false, I prove that it's false, and then you move on to something else. There's no logical reason for me to consider anything you have to say in your ignorance unless you first admit that you were wrong about all the other stuff. Because if I take the time anymore to prove you wrong on the next idiotic thing you say, you'll just bring up something different and continue to ignore the fact that **you have been provably, utterly, and totally wrong about everything you've brought up.** <StevenGannJr>: &gt; Your original premise was this: &gt; &gt; And all-time lows when adjusted for inflation. That's Econ 101. &gt; &gt; That is provably false. Then please prove it. Here, in a nutshell, is our conversation so far: <ME>: I believe this <YOU>: You are wrong, but I have no facts or sources to prove it. <ME>: Ok, here's what the federal agencies say <YOU>: Nope, false, still not citing any proof though. <ME>: How are you disputing this without any evidence to back your argument? <YOU>: Well _technically_ it is false if you restrict your definition of wages strictly to hourly wages, ignoring all other macreconomic metrics <ME>: Stop quibbling over pedantry, HERE is what I really want to talk about. <YOU>: Still no facts to dispute your claim. Sorry. &gt;You see, you say something that's false, I prove that it's false, and then you move on to something else. More accurately, I say something, you say it is false but provide no evidence of it, and when I keep demonstrating it you latch on to a very narrow definition of a term. &gt;you have been provably, utterly, and totally wrong about everything you've brought up. lol sure. The Bureau of Labor Statistics, Congressional Budget Office, and Department of Labor statistics are all provably, utterly wrong. You're as deluded as Gavin McInnes.<andypro77>: So, that's a firm 'NO' on you admitting all the things that you were wrong about, right? Ok, good to know. I'll give you one more chance, just do this for me and I'll admit you're right: (1) Prove that hourly wages are at all-time lows when adjusted for inflation (2) Prove that the BLS definition of hourly wages is skewed by a small minority of high earners that raise the average. (3) Prove that the BLS includes everyone who reports income each year (4) Prove that median wages are on the decline ALL of these things were things that you asserted were true, so now I'd like you to prove them for me, if it's not too much trouble. The alternative is for you to shut the hell up. <StevenGannJr>: 1. Average hourly? No. Median income? I already cited the CBO and you rejected it. 2. Hourly? No. Again I already linked the BLS's figures on income distribution and you rejected them. 3. I already did. I suggest reading. 4. Again, I already provided the BLS figures, plus a couple nice charts compile by UC Berkley, and you rejected them. My turn. 1. Prove income equality isn't increasing. 2. Prove that median income is not decreasing relative to average income. 3. Prove that BLS and CBO _don't_ include all reported incomes in their income distribution reports. 4. Prove that median wages _aren't_ on the decline. Considering you've already rejected official sources and figures supporting my argument and disproving yours, I can only assume you'll cite CBTV or some far-right blog about white genocide.<andypro77>: &gt;Average hourly? No. Median income? I already cited the CBO and you rejected it. HERE is exactly what you responded to: &gt; ME: Hourly wages in the US are currently at all-time highs. &gt; &gt;YOU: And all-time lows when adjusted for inflation. That's Econ 101. YOU said that hourly wages were at all-time lows. These are **your exact words.** I have asked you to prove it. You have not proven it. You are pretending you were trying to prove something else, but have not proven your original point. So either prove it or shut the hell up. No reason for me to read the rest when you've failed on the very first point. Admit you were wrong and I'll consider also correcting the other stuff you got wrong. &amp;#x200B;", "num_messages": 21, "avg_score": 1275.1904761905}
{"start_date": "1543846075", "end_date": "1543858018", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 199, "text": "<speckz>: A poverty reduction charity admits its program wasn’t working. That’s a big deal. <TitaniumTurtle84>: How exactly is this uplifting news?<Sinnersosweet>: I find it uplifting that this charity admitted failure (which is very rare) and therefor can move forward with programs that work better and will help more people. <JustinCaseysLate>: Or makes people even more paranoid and untrusting in charities.", "num_messages": 4, "avg_score": 49.75}
{"start_date": "1543851009", "end_date": "1543867829", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 29208, "text": "<sisyphushaditsoeasy>: Instead of Buying New Car, Retired Paramedic Spends $40K on Overdose Prevention Kits, gives them away for free, and had Already Saved 94 Lives <Droncz87>: Okay but the addicts are taught nothing. Unfortunately it doesn’t keep them off the drugs. The man used his money for an expensive band-aid.<sekips>: Yeah, fuck him for being a decent human being, amirite? Actually caring about people! What a fucking douchebag! /s [deleted]: &gt; being a decent human being But that's what we're arguing. Does it actually make him a decent human being? Or is he now making the world a worse place for more human beings<sekips>: Saving peoples lives makes him a bad person? Ok. Addiction is a disease. Not something you decide to just do or not do. Read up on it, get educated. [deleted]: &gt; Saving peoples lives makes him a bad person? Ok. Does saving a serial killer make you a good or bad person? There's no definite answer here, it's more philosophical than anything else. Shit ain't black and white dude. <sekips>: Saving someone that is dying by providing narcan is never bad. The action doesnt care about if the person is a killer or not. You took the serial killer argument into this. Why? I dunno, comparing a serial killer (might be mentally ill, sure, then we can compare it) to a drug user is just fucking stupid imo. Should Trump be saved? I mean, he have signed orders that have killed thousands. Does he deserve to be saved? This is how ridicilous your argument really is. Keep on the topic instead. [deleted]: &gt; Saving someone that is dying by providing narcan is never bad. Saving somebody who will go on to kill 1000 people is not bad? That's a pretty bold statement. Saving Hitler in 1939 by providing narcan is not bad. &gt; Keep on the topic instead. This is the topic. Is it moral to save people who will provide a detriment to society? &gt; Should Trump be saved? I mean, he have signed orders that have killed thousands. Does he deserve to be saved? According to you, he does deserve to be saved. I don't think you can definitively state that it is good or bad. <sekips>: on Hitler? Yeah, please derail the discussion even more. First comparing a drug addict to a serial killer, now to Hitler? on Trump? Ofc, why shouldnt he be saved? He is a lying douchebag, that indirectly have killed thousands. Doesnt mean he shouldnt deserve to live? I mean, it is his job to do those decisions. Doesnt make it right thou. US is the worst example of a working drug policy. Your \"war on drugs\" have fucked over way more people than this guy saving 94 addicts from death. [deleted]: &gt; Saving someone that is dying by providing narcan is never bad. You stated that saving someone that is dying by providing narcan is never bad, to include somebody like Hitler. You are advocating for saving Hitler and the killing of millions of Jews and others. To me, that does not sound good. &gt; Your \"war on drugs\" have fucked over way more people than this guy saving 94 addicts from death. Good. Fuck drug users. State sanctioned Darwinism. <sekips>: Hitler never OD'd, administrating narcan wouldnt have saved anyone, but keep going, please. [deleted]: &gt; Hitler never OD'd, administrating narcan wouldnt have saved anyone, Yes this is a hypothetical. That is how hypotheticals work. I'll try another hypothetical that might make more sense below. &gt; but keep going, please. Love to. If someone who you know is going to cause a detriment to society, is it 'good' to save them? You indicated that yes, no matter what it is good to save them. With the implication that even if they are mass murderers, rapists, etc., that it is still objectively 'good' to save them. And I find it an interesting viewpoint and would love to hear more of your thoughts on it. Do you still stand with your statement that it is always good to save them? <sekips>: If I know that someone is going to do something bad, I would stop them from doing something bad. I wouldnt stop them from surviving an overdose. [deleted]: &gt; If I know that someone is going to do something bad, I would stop them from doing something bad. Then you end up dying because they are stronger than you and overpower you. They then go on to kill more people because that's what they do. Was saving them a good thing? Is saving somebody who is going to do a bad thing that you cannot stop, a good thing? It's a yes or no question. You seemed so certain of it before when you stated that \"Saving someone that is dying by providing narcan is never bad.\" But now you seem to be back pedalling to the point that you can't even stand by your original statement. Which is fine and my point entirely, that blanket statements like that are pretty dumb. <sekips>: So you know that they are stronger than me? And you know my response? I mean, not like I would call the cops on them, amirite? I would solve it myself. [deleted]: &gt; So you know that they are stronger than me? And you know my response? I mean, not like I would call the cops on them, amirite? I would solve it myself. That's great, in this hypothetical, you cannot. Why are you so afraid of backing up your statement now? Why are you looking for loopholes or work arounds, when \"Saving someone that is dying by providing narcan is never bad.\" If it's never bad, then saving a serial killer isn't bad. No matter what he ends up doing. No matter if you cannot stop him and he does kill more people. Per your original statement. Stand by your statement, or don't. <sekips>: So in this hypothetical world we have no control over population at all? Why are you looking for loopholes to make saving lives looking bad? There is a reason why doctors treat all patients, not just the \"good ones\". How would you know that a guy is a serial killer before you administer narcan? You call the nonexistant cops and ask? This is getting fucking silly dude. :P [deleted]: &gt; This is getting fucking silly dude. :P What's silly is how much back pedalling you are doing. Do you stand by your statement, \"Saving someone that is dying by providing narcan is never bad.\" or not? You seem to disagree with it now. What I hear you say, is that it's never bad, if you can prevent them from doing bad things. Not that it is 'never bad'. &gt; Why are you looking for loopholes to make saving lives looking bad? Because saving lives isn't always good. You yourself seem to agree based on conditions you've set, and the fact you will not stand behind your statement without those conditions being met. Thereby requiring that it is never bad if those conditions are satisfied, but not all encompassing never bad. &gt; There is a reason why doctors treat all patients, not just the \"good ones\". We aren't arguing whether or not doctors should or should not treat all patients, we are arguing whether or not \"Saving someone that is dying by providing narcan is never bad.\" You seem pretty adamant about not supporting that statement, which makes sense, because it was a stupid statement. Let's both agree that it is a stupid statement, and just move on. <sekips>: It becomes silly when you make up shit that could never happen. \"you have to stop him yourself, you cant use the police!\" Like wtf? How is that a \"real thing\" ? You base your shit on retarded rules. :) If I saw someone dying on the street I would try to save that person. I wouldnt check his ID and do a background check before I start. See where I am coming from yet? [deleted]: &gt; It becomes silly when you make up shit that could never happen. But it could happen. And you stated: \"Saving someone that is dying by providing narcan is never bad.\" To include this exact situation. Never means all situations does it not? &gt; If I saw someone dying on the street I would try to save that person. So it's never bad as long as they're somebody you don't know and they're dying on the street? That doesn't sound like NEVER BAD\" to me. That sounds like it is rarely sometimes good for this specific situation. &gt; See where I am coming from yet? I see that you are backing down and are actively disagreeing with that statement you made. Because it was a silly statement. Staunchly defending a viewpoint you actually disagree with because of your pride is about the silliest thing of all of this. <sekips>: No, I am not backing down. If I had narcan on me and saw someone overdose on opiods I would help them, I wouldnt ask if the person was a serial killer first. But you sound like you would have done a 3 month background check before you even considering it. You sound like the kind of human I wouldnt want helping me, even if I was dying of an overdose. :P [deleted]: &gt; If I had narcan on me and saw someone overdose on opiods I would help them, I wouldnt ask if the person was a serial killer first. That's great, but it's still disagreeing with your previous statement. Your previous statement was not, would you save someone that you saw overdose, it was: \"Saving someone that is dying by providing narcan is never bad.\" This includes any hypothetical situation where you know they are a serial killer, rapist, and will go on to do those things, yet choose to save them anyways. You yourself are disagreeing with that statement, continually lol. &gt; But you sound like you would have done a 3 month background check before you even considering it. Of course not, but if I knew somebody was a serial killer and was going to kill more people, I would definitely not save them. I would also never say that \"Saving someone that is dying by providing narcan is never bad,\" because that's stupid. &gt; You sound like the kind of human I wouldnt want helping me, even if I was dying of an overdose. :P Based on the limited information I have, of course I would save you. But that does not mean I would save you if I found out that you were a serial killer and would kill people and was dying of an overdose. Blanket statements are dumb. <sekips>: And misrepresenting what I wrote ON PURPOSE to make a big argument out of it is also dumb. Kinda like your hypothetical scenarios where I am supposed to stop someone from doing something but you set all the rules for it. You dont know if I am the Hulk irl. :P [deleted]: &gt; And misrepresenting what I wrote ON PURPOSE to make a big argument out of it is also dumb. Using statements like NEVER implies for all situations. There is no misrepresentation here. Words have meaning. All you had to do was say that you misspoke but for some reason you continued to defend an argument that you disagreed with because you're too prideful. &gt; You dont know if I am the Hulk irl. :P Well if your instagram is the same as your reddit profile then you're some skater loser with a pierced nipple and bad hair<sekips>: Awh, thanks for the views. Calling someone a loser on the internet make you so so cool. :) [deleted]: &gt; Calling someone a loser on the internet make you so so cool. :) Thanks. I'm sure you thought dying your hair or that weird mohawk would make you cool too. You'll get there little buddy. <sekips>: Your username clearly checks out btw. [deleted]: Thanks. Your pottery is interesting lmao<sekips>: You digging four years into an inactive instagram account just proves you are a shitty troll. :P [deleted]: &gt; You digging four years into an inactive instagram account just proves you are a shitty troll. :P Your last pots were in 2017. I can tell English isn't your first language because you really don't understand the meaning of a lot of words.", "num_messages": 30, "avg_score": 973.6}
{"start_date": "1542293237", "end_date": "1543856588", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 36, "text": "<ariban900>: Mesh drains in Australia preventing water bodies pollution retained 815 pounds of garbage for recycling in the first 6 months of use. <Drunkspartan1170>: http://imgur.com/gallery/qJ5pULT<ariban900>: Haha. Exactly!", "num_messages": 3, "avg_score": 12.0}
{"start_date": "1543857989", "end_date": "1543936649", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 50, "text": "<progress18>: Homeless man turns in $17,000 cash he found outside local food bank <filla_dilla>: I sense a Go Gund Me getting started. <Solkre>: Who would keep $17k when turning it in will get you $100k+ after it hits the media.", "num_messages": 3, "avg_score": 16.6666666667}
{"start_date": "1543864830", "end_date": "1543865601", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 14, "text": "[deleted]: Man planned to assassinate Trump with a forklift: authorities [deleted]<lcampau>: This looks like \"uplifting\" news...<Black__Cat>: It took me much longer than it should have to get the joke.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1543856940", "end_date": "1543896913", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 186, "text": "<Balkan4>: India to achieve key Paris climate goals 10 years before deadline <i_watch_loli_hentai>: It seems like a lot of climate goals are always met before early<conklyyn>: The first line of the article says based on predictions and past performance that it’s “likely” they will meet their goals, not that they have.<mchadwick7524>: I don’t know their goals but in my trips to India It sure didn’t seem like things were environmental", "num_messages": 4, "avg_score": 46.5}
{"start_date": "1543868234", "end_date": "1543886578", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 91, "text": "<speckz>: Cigarette use among American adults is at the lowest it's been since the Centers for Disease Control and Prevention started collecting data on the issue in 1965, according to a report. <2K_Argo>: I can’t stand cigarette smoke. Every time I see some old fart smoking i think it won’t be long before that person dies and there’ll be one less smoker polluting the air. <conklyyn>: Addiction is a nasty disease, but clearly dickheaditis has gotten the better of you. No cure for that one.", "num_messages": 3, "avg_score": 30.3333333333}
{"start_date": "1537620007", "end_date": "1539187304", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 25037, "text": "<Sariel007>: ‘You gotta take care of home’: Michael Jordan donates $2 million to Florence recovery efforts <madubs14>: Man y’all are negative as fuck. Someone contributing 2 million dollars to help people is awesome. Maybe if we appreciated shit like this more, instead of whining about how much it is compared to how much he had, the world would be a better place <Shermarki>: I think the negative comments are mainly to do with mj’s character as a person I.e he is actually an asshole and there is a ton of evidence to back this up. He never said a word about the killings surrounding his Jordan shoes and is just a bad person overall. I’m in the Lebron will never be Jordan camp but man could you imagine if he was as into public problems as Lebron. At his peak he was basically god and could of done so much for “people like him” but no he doesn’t care because even “republicans buy sneakers too”<Jl4233>: And why would he be responsible to speak on the killings that come from stealing shoes? He's not responsible for a cultural problem in certain areas that teaches people it's ok to murder people for their expensive possessions... What's he going to say - murder is bad? Anything he could say about the issue would be pointless and obvious, and again - he (or his shoes) didn't create this problem... Had air Jordan's never existed there would be some other trendy expensive product that people would be getting killed over. This is a cultural problem that no one wants to honestly speak about or try to address... <stillcallinoutbigots>: Right and the blood Diamond crisis wasn’t Debeers fault.<Jl4233>: If you think these are even remotely conparable situations, then congratulations you are too stupid to do anything meaningful in life. <stillcallinoutbigots>: Translation: I cant Make an argument because I’m slow so I’m *just* gonna call you stupid. Come on man, at least I go out of my way to tell you how/why you’re wrong.<ramal_kcirdnek>: Bruh, you are sad af. <stillcallinoutbigots>: You had to come at me with an alt because i hurt your feelings.<ramal_kcirdnek>: Not op, just noticed how pathetic you are behaving. I hope you feel good about yourself, because nobody on here agrees with you or respects you. If this is what you need to do in order to feel like you're not a moron or a loser, then do it, but it won't fix your soul. I feel bad for you. <stillcallinoutbigots>: I’m just thinking its sad that you’re so upset about me hurting your feelings that you went out of your way to log into an alt to use some bullshit middle school psychology. Seriously why the fuck would i care if a few celebrity sucking assholes on the internet respect me or not. Nigga grow up and insult like an adult.<ramal_kcirdnek>: Lol, I am not op you chump. It's hilarious that your whole Reddit presence is getting into dumb arguments and you're telling people to grow up. You're pathetic. <stillcallinoutbigots>: &gt;Lol, I am not op you chump. Of course you’re not OP. Op is the one that’s posted this article. OP means Original Poster. You’re just some butthurt dude that got his feelings hurt by me and logged into an alt to make it seem like he has real world back up in an attempt to cover up the fact that he’s simple celebrity worshiper, that can’t backup his arguments as to why people should be showering a shitty person like Jordan with praise. &gt;It's hilarious that your whole Reddit presence is getting into dumb arguments and you're telling people to grow up. Nuh uh, i commented on someone dress Just the other day. &gt;You’re pathetic. And seriously, why are you so obsessed with me that you know about my “Whole reddit presence”. Stalky Mcstalkerface. Go find a girl to kiss. I’m not into you. . <ramal_kcirdnek>: Haha you dumb bastard, op is also a reference point to people posting in threads. Thought a brain genius like you would know that. Yes, you're sad and pathetic. You seriously make me feel bad for you. Every sad attempt you make to try and figure out what's happening here makes me respect you less because you're wrong. <stillcallinoutbigots>: &gt;Haha you dumb bastard, op is also a reference point to people posting in threads. Loud and wrong, I bet you’re a trump supporter. The only poster it can refer to in a thread is the *original poster* in the thread. How is a comment in the middle of a thread original? The alt you’re covering for isn’t the original poster in the thread, you’re still wrong lil boy. &gt;Thought a brain genius like you would know that. ..... &gt;Yes, you're sad and pathetic. You seriously make me feel bad for you. Says the celebrity worshiper. &gt;Every sad attempt you make to try and figure out what's happening here makes me respect you less because you're wrong. You don’t matter, why would I care if you respect me?<ramal_kcirdnek>: Haha that's not even wrong you dumbfuck, people do that in threads all the time. Fuck Trump and fuck celebrities. You care and you know it, sad boi. <stillcallinoutbigots>: 🤔.....😂😂😂....😉..😘.😎<ramal_kcirdnek>: 8====D<stillcallinoutbigots>: Why are you so focused on dicks? If you're not riding them then you're drawing them. You may need to talk to someone about this obsession of yours.<ramal_kcirdnek>: I'm gay, is that a problem with you, Mr. Still Calling Out Bigots?<stillcallinoutbigots>: &gt;I'm gay, .... congratulations??? &gt;is that a problem with you, Mr. Still Calling Out Bigots? No why would it? Are you implying that gay dudes are all infatuated with dick? I mean having a sexual preference is one thing but being obsessed with the human phallus seems to me to be a completely different subject. <ramal_kcirdnek>: Lol, now you're trying to cover your tracks. You're one of those losers who only cares about societal issues when they help your shallow political motives. You're a bigot and a troll. Shame on you. <stillcallinoutbigots>: I feel like your infatuation with me may be just a bit unhealthy. Would you like some goat milk?<ramal_kcirdnek>: Looks like it's mutual, bigot. <stillcallinoutbigots>: 💋🖖🏿🙋🏿‍♂️<ramal_kcirdnek>: Guess you know even less about bigotry than I already thought. <stillcallinoutbigots>: Lol, go get laid dude.<ramal_kcirdnek>: No u<stillcallinoutbigots>: Ok then i will, bye. <ramal_kcirdnek>: Bye Felicia<stillcallinoutbigots>: Hodor<ramal_kcirdnek>: You know that's Hodor speak for \"faggot\" right?<stillcallinoutbigots>: Hodor<ramal_kcirdnek>: Thought you were leaving<stillcallinoutbigots>: *Hodor*<ramal_kcirdnek>: Bigot<stillcallinoutbigots>: **Hodor!**<ramal_kcirdnek>: Bigot<stillcallinoutbigots>: Hodoooooor?<ramal_kcirdnek>: Bigooooooot!<stillcallinoutbigots>: HODOR.<ramal_kcirdnek>: Bi-go-t", "num_messages": 42, "avg_score": 596.119047619}
{"start_date": "1543871114", "end_date": "1543876678", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 5, "text": "<Lancs_wrighty>: 7yr old is Youtube top earner at $22m <fl55>: Unpopular opinion: I cannot stand this kids channel, my son used to watch it until I refused to let him. Anyone can film their kid playing with toys, it’s his parents channel really, he’s not doing anything special. <TrueFriendsHelpMoveB>: That's... Pretty fucked up. You banned kids content from a kid. You aren't meant to like it. <fl55>: It’s mundane crap, watching a kid play with toys. To me it’s exploitation. Would rather have him watch something else. Hell Peppa Pig is better than this crap.", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1543878417", "end_date": "1543878833", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 14, "text": "[deleted]: China Plans to Deliver Free WiFi Internet Service All Over The World [deleted]<throwaway1084567>: Worldwide free internet surveillance. Sounds like a good idea. <Ack_Nak>: With bonus china censorship and propaganda.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1543865056", "end_date": "1543878851", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 60, "text": "<Sariel007>: Ordinarily, it takes coral reefs between 25 to 75 years to reach sexual maturity. This means that it can take up to 6 years just to plant 600 coral – but Vaughan’s process of breaking up corals for reproduction helps them to grow 40 times faster than they do in the wild. <SilverNicktail>: This is a pretty hilarious method of finding something so beneficial<Sariel007>: D'oh! I messed up, wait a minute...", "num_messages": 3, "avg_score": 20.0}
{"start_date": "1543881673", "end_date": "1543935354", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 71, "text": "<The_Autismo>: Popular Youtuber Pewdiepie has been receiving tons of attention from the internet community on his subscriber battle with Indian production company T-Series. He is now using this attention to get people to donate to a charity to help children in poverty in India. <beemccouch>: Let's be honest. That doesn't mean he HAS to donate. He can just say he is and still get more subs and look like the good guy.<TakeyaSaito>: He will though", "num_messages": 3, "avg_score": 23.6666666667}
{"start_date": "1543885086", "end_date": "1543967953", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 77, "text": "<history777>: The American abortion rate is at an all-time low <_VisualEffects_>: That's not necessarily an uplifting fact. There are a lot less official abortions happening because the right has closed or severely limited access to clinics. Many more abortions are still happening. They are just happening underground. With lots of women being severely harmed and killed. Women having access to Heath care is uplifting. Women being driven underground into harm and death isn't worthy of celebration. <MillenialSage>: Source? I'm still making up my mind about abortion rights since leaving the Catholic Church and theism altogether a year ago and a source would really help make up my mind.<AnEnemyStando>: Why would a source help? It’s a matter of ethics. Do you believe women should have freedom over their own bodies or not.<MillenialSage>: I think the responsible thing to do with a claim like this is to ask for the source of the information.<AnEnemyStando>: That’s true, but it still shouldn’t change your opinion. Either you believe women have full freedom over their bodies or they don’t.<MillenialSage>: I absolutely believe women should have full freedom over their bodies. But I also don't think it's right to terminate a pregnancy without cause. So I'm stuck.<AnEnemyStando>: Well if they have freedom over their bodies, they don’t need cause. If they need cause, they don’t have freedom. In the end you need to decide if you’re willing to tell another person that she has to give birth.<diogocp27>: Thing is, you'd be killing a potential baby is the process depending on how late the abortion is, they do have full liberty but that doesn't include murder.<AnEnemyStando>: But abortion that late is illegal even if you're pro-choice. In those cases you choose to have the child adopted. Besides that we eat animals for food and those have more cognitive functions than newborn babies (cows, pigs), so why isn't that considered murder?<diogocp27>: 1- i wasn't speaking about a week until birth cases, even...idk 4 month? I think? The fetus already has many human characteristics( il search this tomorrow, its pretty late, as fkr your second point, wr don't count killing animals as murder because.....idk, i guess because it's nature, but by going by that logic, it wouldn't be murder if you killed someone in a coma,their cognitive functions are basicaly gone too.", "num_messages": 11, "avg_score": 7.0}
{"start_date": "1543893454", "end_date": "1543894685", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 14, "text": "<flyntlarry>: Woman passes gas in store, then pulls knife on an offended customer, cops say <infinit187K>: r/lostredditors<PickledMustard>: Quite uplifting i must say, good to see women standing up for themselves. also screenshot me too pls.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1543863831", "end_date": "1543928649", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 915, "text": "<420Rebzzz>: 8 year old boy beats stage 4 brain cancer <TD746>: I came here for a story about a boy quitting reddit. Dissatisfied <Reese117>: I am totally satisfied that a little child beat stage 4 cancer.", "num_messages": 3, "avg_score": 305.0}
{"start_date": "1544834752", "end_date": "1544835011", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 32, "text": "<flyntlarry>: Heart Left On Southwest Flight Makes It To Destination In Time To Save Lives <nadalcameron>: How does one heart save miltiples? Valves?<namelessuser>: Article says valve tissue. You got it. <nadalcameron>: I don't know why I didn't read since I was curious, but thank you for humoring my laziness.", "num_messages": 4, "avg_score": 8.0}
{"start_date": "1543898239", "end_date": "1544200205", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 257, "text": "<dufosho>: Metallica donating to local food banks on every stop of their current tour <mrjameshines>: The normalisation of food bank usage isn't uplifting in the least<fiirvoen>: Can you elaborate?<mrjameshines>: What aspect of a family, community, or society dependent on food banks could possibly be seen as uplifting? Even worse if these food banks are dependent themselves on the donations of rock stars <fiirvoen>: Sure, it’s not great that there are people who at some time or another need a helping hand. But when people are in that place where they don’t know how they are going to feed their family until they get paid again due to some unforeseen issue, a food bank can be a viable alternative to going hungry. As a charity that directly benefits the immediate physical needs of those who are without, food banks clearly succeed at their mission of feeding the hungry. There are many elderly who rely on food banks because they no longer are able to work and have no other family. There are those who have had terrible accidents that prevent them from practicing their trade who use food banks to survive until they can learn a new skill or how to adapt enough to practice their old skill. Food banks do good work. Do they solve the root issue? No of course not. But it’s not give a man a fish or teach to fish. It’s give fish while you teach to fish so he and his family don’t starve and die before he can learn well enough to be effective. Is it bad that people are in need? Sure. But that doesn’t mean helping people is bad. “You will always find people who are helping,” Fred Rogers wrote in the Mister Rogers Parenting Book. He continued: “To this day, especially in times of 'disaster,' I remember my mother's words and I am always comforted by realizing that there are still so many helpers — so many caring people in this world.” That is uplifting. Often literally. <mrjameshines>: I'm not debating whether they serve an incredible service or not, because they obviously do. But literally every circumstance in which they are needed is a bad one, and you've just listed a bunch on them. These situations are certainly not uplifting, and the use of food banks shouldn't be normalised especially when it's occuring in some of the wealthiest countries in the world", "num_messages": 6, "avg_score": 42.8333333333}
{"start_date": "1543875132", "end_date": "1544028282", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 95, "text": "<guanaco55>: Prohibited From Speaking Quechua as Child, Peruvian Woman Now Professor of Quechua at Stanford University <Nessie>: Quechua...uh...finds a way.<Slobofnik>: I’m dead<rogueAIbergdahl>: I didn't get it :(<Slobofnik>: Jurassic park reference. <rogueAIbergdahl>: Thank you good Samaritan", "num_messages": 6, "avg_score": 15.8333333333}
{"start_date": "1542978150", "end_date": "1543186530", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 48035, "text": "<Redzit69>: Couple finds $1.8 million lottery ticket while cleaning before Thanksgiving <Yeahbabs>: I wish these stories where people get rich as a result of cleaning were as motivating to me as they should be.<Ramza_Claus>: They motivated me to buy a lottery ticket today.<Shapitizer>: And you almost certainly won't win anything<hexparrot>: True only for all those people who aren’t playing!<Dibbys>: When you lose and i still have my $2 im the winner arent i? <DanConnersGarage>: No, because $2 is almost worthless and is worth the trade off for the possibility of winning millions. Spending thousands on lottery tickets, now that's losing.<drprivate>: You do know how people with a large net with get there right? Not spending $2 on an attitude of. “ it’s just $2, so it’s worth the trade” attitude. If someone did that once a day for 50 years at 4-5% interest, that comes up to about $125,000. So all those idiots buying lottery tickets and 1 bottle of water a day are throwing away $250,000 over a lifetime Nice investment bottled water and lotto tickets are Now I bet you were paying attention more in math class<TiltWasRobbed>: 125k over half a century is pocket change. <drprivate>: That’s why 80%of the population has less than 30k put away by the time they are 50<TiltWasRobbed>: I'm sorry bud but if you're saving your pocket change without regard to your quality of life, you're not saving right.If you can afford it, savings come out first, or you'll never meaningfully save anything. Anything after your goal is met is for improving your quality of life, including games like the lottery and other luxuries. But by all means, put that $2 in a low interest savings account. If it makes you happy. Just don't try to act like your some sort of financial genius because you think the lottery is a waste.<drprivate>: Actually a chimpanzee can put 2 a day into a mutual fund and do really well. What I was saying is simple, let’s say 8th grade math. Not really genius level but....if it offended your sensibility..... can’t help u with that<TiltWasRobbed>: You must not have much investing experience. Show me a fund with no minimum investment and I'll show you a fund with fees that will eat your earnings.<drprivate>: I was showing simple math. Quit trying to make this about something it isn’t. Good lord what you are commenting on has nothing to do with anything. Putting the money in a can and burying it in back yard is better than buying a lottery ticket<TiltWasRobbed>: Simple math that didn't prove your point. Robbing a gas station will get you more money than a lottery ticket too. Does that mean it is better? The point of the ticket is the high you get while playing. The game itself has inherent value and it's sad that you can't comprehend that.", "num_messages": 15, "avg_score": 3202.3333333333}
{"start_date": "1543928979", "end_date": "1543932027", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 2, "text": "[deleted]: A seven-year-old boy who reviews toys has been revealed as YouTube's highest-earning star, raking in $22m (£17.3m). Asked why kids liked watching his videos, Ryan replied: \"Because I'm entertaining and I'm funny.\" [deleted]<shogi_x>: Good for him. Seems like way too much money, but whatever, at least he's not a turd.<-guci00->: Hmmm. How many tech reviewers from you tube do you know? How many unboxers do you know? How many car reviewers do you know? There is lots because they saw a place for themselves on the market. Now how many toy reviewers do you know? Not that many right? Even less of age of the actual target group for toys. This kid found a major whole on the market and decided to fill it up. He has little to none competition on that platform so all the viewers go to him. If he delivers quality stuff and remains as the best reviewer his monopoly will last and money will be flowing his way. Now I only wish him to properly invest that stuff and remain humble. He should be good. Also imagine his CV as a future marketing guy. Yeah when I was a kid I was one of the biggest names on you tube. I hope it counts as an experience...", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1543934396", "end_date": "1544025660", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 33469, "text": "<Sariel007>: Dog sniffs out owner’s cancer, not once, but three times <MGsubbie>: I can understand that dogs can smell cancer, but how exactly do they know what they smell is so bad? It's not like dogs understand the concept of cancer, is it?<PointNegotiator>: Dogs and cats both get accustomed to your smell. It's how they can recognize you even after years apart. One theory is: when you live with an animal that is used to sensing you in this way, cancer is a rogue protein sequence that can wreak havoc with other cells. Sometimes this changes the way you smell and can smell necrotic or like part of you is a stranger. <hexiron>: Cancer is incredibly metabolically active causing build ups of toxins as well as the necrosis of surrounding tissue or the cancer itself. When it's sized up enough people can smell it and it isn't very pleasant. <TikkiTakiTomtom>: Toxins and necrosis?<hexiron>: Junk chemicals and dead tissue? Cell poop and skeletons? Lactic acid and lysed membrain chunks? I'm not sure what nouns you're looking for... <TikkiTakiTomtom>: Dead tissue = cell “poop”/[cyto]skeletons = lysed membrane chunks. All of these closely mean the same thing. Lactic acid is not waste. It is a byproduct that can be recycled. I think the point I’m trying to make here is that cancers do not simply cause other cells to die in fact they make the cells *live forever*. Nor do they create toxins or induce necrosis. <Edit>: I’ll leave the mistake I made as is but I meant to say in my last sentence is that cancers do not create toxins and therefore induce necrosis (by said toxins). The fact that I commented “toxins and necrosis” above was solely for this clarification.<CactusCustard>: &gt; All of these closely mean the same thing. Isnt that you were asking for? He gave the words he wanted to say. you acted like they werent good enough, so he gave you synonyms. And cancer can and does induce necrosis. <https>://www.sciencedaily.com/terms/necrosis.htm You're trying to be all smart and \"lol toxins dont exist\" but its not working.<TikkiTakiTomtom>: Yes I apologize, my wording was off. What I meant to say was that cancers dont produce toxins and therefore does not induce necrosis (via toxins). It personally bothers me however when people shares misinformation and people eat it up.<hexiron>: See, but cancer does release toxins that do in fact cause serious problems. They have a hard time accessing the nutrients and oxygen required to sustain their metabolic growth so their metabolism shifts to accommodate. However, for the same reasons they can't receive proper nutrients the body has a hard time eliminating the byproducts produced. You seem to be stuck on toxins, but that's what they are in those concentrations. Lactic acid, for example, can be recycled as you say HOWEVER the increase in pH caused by this concentration of lactic acid both inhibits t-cells from being able to fight cancer as well as skewing the tissue associated macrophages to a tumor promoting state, where those macrophages begin to turn that lactic acid into proteins the cancer cells can then utilize as more efficient energy. With that rapid growth you can get dead zones where tissue begins to become necrotic because such sustained high pH, a hypoxic environment, and M2 macrophage polarization triggers apoptosis of other cells. I know this, because I ran a cancer research lab and helped write the damn paper on the topic. <TikkiTakiTomtom>: I apologize for sounding harsh and cynical but for personal selfish reasons I don’t tolerate a spreading of misinformation. I’m afraid I don’t believe what you claim to be. It’s great that you have the passion for this field but this is incorrect.<hexiron>: Personal selfish reasons that you yourself are being ignorant to any of the information people are trying to give you? Here's an infographic to help you out. <http>://jcs.biologists.org/content/125/23/5591<TikkiTakiTomtom>: I guess this entire dispute was over the conceptual use of toxin. Maybe I’m being a bit pedantic but in terms of medicine we don’t usually refer to exacerbating effects as a toxin. When I think of a toxin, I think of something that is non-self that can directly affect cells in a destructive manner. Inflammation caused by lactate may *decrease* pH but inflammation is inflammation. We produce a lot of lactate via exercise but we can’t call it a toxin just because it decreases function of proteins. If that’s the case we can call many things as toxins. Call me ignorant but in your argument you claim cancer release toxins but your support only provides signaling proteins/genes as the crux of the article (to which these proteins btw are naturally occurring but only accumulated, detected and associated with tumor growth). Based on this I can’t say that I agree that this is a toxin any more or less than it is just the usual proteins.<hexiron>: Extremely pedantic. \"The car crash didn't kill him it was exsanguination\", \"Heart attacks are completely safe, it's the hypoxic ischemic encephalopathy you have to worry about\"... This is a pic forum and any scientist or clinitians duty is to translate this technical knowledge into colloquial understanding for the masses. <TikkiTakiTomtom>: But the thing is... calling something a toxin when it is truly not is wrong. The proteins in question are not toxic. Im calling myself pedantic only because you’re calling a dog, a cat. And FYI In the field people dont die simply because of heart attack, they die of secondary complications days or weeks after the fact. Pedantic-ness in this field is a necessity.", "num_messages": 15, "avg_score": 2231.2666666667}
{"start_date": "1544395743", "end_date": "1544842787", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 39, "text": "<krispybills>: Pat Manuel becomes The First Male Transgender Boxer to fight professionally in the United States, winning in his Historic Professional Debut <chlorofarm>: Not to take away from this victory, but I don’t think there should be a division of gender in sports at all. Let all of the most skilled compete together <domlessdesperatebrat>: That would be awesome. <KeavesSharpi>: It would mean that basically women would be excluded from champion level sports. That makes sense to you? It's a physical fact that men perform on the average higher across the board than women in athletic activities. That's the entire reason we have gender separation in sport.<bpaddnme>: If woman want equality, this would be an effective strategy for showing how serious they are. Non discriminatory sports. <KeavesSharpi>: That's just being spiteful and you know it. Men have different physical attributes than women. Forcing them to compete against men accomplishes nothing, since the best women will still be rated as the best women. The rest of the time, the women would be getting beat up by men. That's not sport.<bpaddnme>: Who is forcing anyone? They don't have to compete. &amp;#x200B; I think you misunderstand me anyway. I'm an advocate for the obliteration of discrimination. I'm not saying anything should be changed from the way they are except for the following way: Turn the existing category of men vs men into human vs human; the existing category of female vs female can stay. This would only be embarrassing for some men, as the lowest ranked men would inevitably be beaten by the higher ranked woman; but because the category of woman vs woman would still exist as it is, there would still be female champions: and imagine the glory for that first female who wins this competition!<KeavesSharpi>: So instead of removing men's and women's leagues, you add a unisex league. <bpaddnme>: yep", "num_messages": 9, "avg_score": 4.3333333333}
{"start_date": "1544486270", "end_date": "1544546872", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 8931, "text": "<ZWass777>: Hollywood Actor Gary Sinise Pays to Send Almost 2,000 Children of Gold-Star Families on Trip to Disney World <Butterfly_Queef>: Fuck Dailywire<Top_Goat>: Where did the DailyWire hurt you?<Butterfly_Queef>: It's a shitty source for mouthbreathers who like Tucker Carlson. <Top_Goat>: Do you want to talk about it?<Butterfly_Queef>: Are you mad at me or the girls who won't talk to you?<Top_Goat>: Neither, just trying to help out a fellow redditor. Hope you have an amazing day!<Butterfly_Queef>: So you're upset that I know the Daily Wire is a shit source? Do you need to talk about it?<Top_Goat>: I'm not upset at anything :) Just making conversation!<Butterfly_Queef>: Neat. <Top_Goat>: I hope you have a wonderful holiday and a merry Christmas!<Butterfly_Queef>: https://media.giphy.com/media/lF5li31f8WdKo/giphy.gif<Top_Goat>: It's unhealthy to be so angry all the time. <Butterfly_Queef>: I agree. That's why he looks like silly putty stretched across an orange peel and why his supporters love him so much. <Top_Goat>: He's not the best looking man for sure. But God bless him!<Butterfly_Queef>: That's because you're as shitty as he is :D<Top_Goat>: Possibly. Although, your judgemental comments seem to place you in the same boat.", "num_messages": 17, "avg_score": 525.3529411765}
{"start_date": "1544413587", "end_date": "1544454757", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 25, "text": "<krispybills>: Weight loss breakthrough -- Scientists 'Cure' obesity in mice through removing Gene known as RCAN1 <zachagawea33>: OR just don’t sit on your ass all day and shove large portions of food down your throat. <EndlessPotatoes>: No.<zachagawea33>: Solid rebuttal <Gulyasarni66>: Dude why do it the natural way if we can do better with technology? Besides, for some people it's not as simple as \"just don't eat lol\"<zachagawea33>: I think you’re being sarcastic but, just in case.... those “some people” are the VAST minority of obese people. I’m slightly over the ideal BMI for my height. I’ve put in 50 miles the last few months. I have a lot of work to do but I’m not sitting on the couch feeling sorry for myself. Most obese people like to play the blame game. For the very small percentage who have no control over their weight gain, hopefully this scientific breakthrough is helpful! <Gulyasarni66>: I never said they were the majority, so I agree with you completely.", "num_messages": 7, "avg_score": 3.5714285714}
{"start_date": "1544847751", "end_date": "1544866573", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 96, "text": "<BedouinTraveller>: 90,000 mosques in Turkey raise money for Yemenis <openeda>: Those blessed mosquitos. <ReadylikeSpaghetti>: I'm so glad I wasn't the only one", "num_messages": 3, "avg_score": 32.0}
{"start_date": "1544873335", "end_date": "1544917238", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 5666, "text": "<Me_you_who>: ISIS has lost its last stronghold. US backed and Kurdish led Syrian Democratic forces have finally seized the town of Hajin after more than three months of fighting. <shortyafter>: If only this actually meant something in the grand scheme. (It means nothing.)<silverhawk253>: How so?<shortyafter>: War has been going on for millennia. This means literally nothing. This changes nothing.<sunday_cum>: You sound unstable<shortyafter>: I am.<theguy2108>: Wars have been generally getting lesser and lesser. Things have been improving. It's hard to see because the media keeps talking about the worst wars, but generally situations are improving. Consider the 20th century, 2 world wars, one cold war where both sides had huge nukes, middle East still in crisis, Korean war, Vietnam war and so many more. And while it is too early in the 21st century, the only big war is happening in middle East. Terrorism has been decreasing ever since and poverty is also lowering. <shortyafter>: This is a huge misconception. You know why wars have been getting lesser? Because if we had another full-scale conflict the size of WW2, it would involve nukes, and mutually assured destruction. It's not because of the benevolence of humanity, it's a selfish bet for survival. The same bullshit. People thought the same thing after the Napoleonic Wars... there would be ever-lasting peace, the wars were too terrible. 100 years later WW1. Then WW2. We're due for another one soon... maybe we'll forget Hiroshima. Terrorism arose because we no longer have this \"open\" channel for hatred, division, unconsciousness. It's smaller-scale. Same thing with school shootings and all of that. You really think the world is getting better?<AWellDressedChicken>: I would rather live in a world of peace dictated by MAD than continue to have grueling, violent, and taxing (economically, financially, and emotionally) smaller arms warfare. <shortyafter>: I would prefer to live in a world that involves neither. But I'm the crazy one.<AWellDressedChicken>: Everybody else has accepted that utopia doesn't exist. Sometimes you have to make hard decisions that don't have a blatant right or wrong answer. In this case, there isn't a good option. Not a reasonable one at least. You just have to choose the option that has the greater potential outcome And when you say \"world getting better\"... What is \"better\"? Extremely subjective don't you think? If \"better\" means an overall decrease in violent crime and death, then yes. It is getting better. <shortyafter>: In some respects, I appreciate your rationality. Everyone else seems to be getting quite heated with me, but you have remained cool, collected. You must be a great thinker, I can tell you have a very intelligent mind. But I think you have one flaw: you're being TOO rational. You're conforming with something that we don't even know. Who said utopia doesn't exist? Yes, there will always be problems. But who knows how far up we can go? You are setting a limit, your mind is setting a limit. But in reality we have no idea what the limit is. I imagine I'm not the first person to point this quality (your rationality) out to you, for better or for worse. It's not a judgement. As I said, you must be very intelligent. That's beautiful. But I wonder if you can open yourself up to something broader.<AWellDressedChicken>: Hey I appreciate that. Sincerely. Can you elaborate on your second paragraph? How do you mean \"too rational?\" Do you believe a utopia does exist in our physical reality at this time, or lare you just saying that we haven't proven it to be impossible? For example, communism, in theory, is a very successful and efficient way to run a country. However humans have shown over and over that such a system appears to be incompatible with humanity and would be unsustainable if put into practice. I gotta head out to work. But you seem like somebody I'd enjoy having a conversation with. Feel free to continue this through pm if you'd like. <shortyafter>: All I'm saying is that we don't know. I understand your question, but I am going to dismiss your question. We don't know where the limit is. The mind always wants to know, but through the mind, it is impossible to know. Yes, we can know things like that water boils at 100 degrees Celsius. But we cannot know what our possibilities are as individuals or even as humanity as a whole... that is completely uncharted territory. I believe communism didn't fail because of communism... communism failed because of people. For millennia we have killed each other over petty political games, and of course, when something like communism comes along, even if it seems like a good idea, it will be used to the same malignant ends. Look at a person like Jesus. I am not a Christian, but I believe that Jesus had a good message (remove all hocus-pocus humbug from it). And then look at what the Christians did. They completely bastardized a good message and used it for the same old games - crusades, Inquisition, murder, genocide. Such is humanity. I am only saying - we don't know the limit, BECAUSE WE HAVEN'T EVEN TRIED. We keep playing the same old games, under different names, -isms, and ideologies. But at heart we have not taken a step into the unknown. Individuals have, yes. Jesus was one of them. Buddha was one of them. I am one of them. But the society is still reluctant... Jesus was killed over it... change was too scary. Better to shut him up quick than face the truth. They did the same to Socrates. These people wanted to overturn the whole order, people were going to lose power. So they killed them. Yes, I appreciate that. You are the first who has responded positively to what I'm saying. To be honest, I'm not trolling. I'm feeling things out. I've slowly but surely been walking away from my societal conditioning, but it's only been the last few days that I've really taken a big leap. I feel I have reached a turning point. Tomorrow, who knows? That is the mind looking for an answer again. But I don't know how far this goes, or where it goes, or anything like that. It is completely uncharted for me. So today I am enjoying feeling this stuff out. I am sharing my truth and I am getting very negative responses from just about everyone. I am sharing my truth with my girlfriend and she is about ready to leave me - NOBODY understands me. And I look at them, like Jesus on the cross, and know that I WILL NOT RENOUNCE. Why? Because, it is the right thing to do. It is the right thing for ME, and it is the right thing for humanity. I am slightly surprised at how negative people are being. Why are they negative? It's a defense mechanism. Plus, they only listen to the surface of my message - they completely miss the essence. And then again, knowing what I know now, this sort of reaction is not surprising at all. The most surprising reaction has been yours. Thanks for listening and chatting, have a good day at work and feel free to send me a message or respond to me here. :)<AWellDressedChicken>: I agree entirely with you on your views of communism. In an ideal world, it's the perfect plan. Unfortunately it's not an ideal world. Evil exists and will always exist. From a psychology perspective, some of the most common traits among those in power is a need to be in control, unstoppable ambition, and a lack of empathy. What sociologists consider ideal traits include modesty and humility. Obviously the ideal world is very different from reality. So, I agree with you, it's not the idea, it's the people who put it into motion. And if I may offer my sincere opinion, perhaps the reason you are met with such negativity is because your opinion is one which is clearly very passionate and that can come across as impeding and elitist. That's just the sort of vibe I got from reading it. Of course, it's not nearly as easy to interpret the voice behind words when all you see is the characters on a screen. So my advice? Maintain your views and don't let other's opinions of you change that. However, it might be a good idea to only bring up said views in appropriate situations. I hope that sort of makes sense and doesn't come across as condescending. <shortyafter>: Hi mate, you might be totally right. I don't know. I appreciate it. Take care. :D", "num_messages": 16, "avg_score": 354.125}
{"start_date": "1544879339", "end_date": "1544880837", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 23, "text": "<SktDTwo-->: 1,750 Gold Star family members get holiday trip to Disney World from Gary Sinise Foundation <Bottomsup99>: He’ll always be lieutenant Dan to me<the_original_Retro>: Reading this, I have to say nah, he's more than that. He's a god damned real life superhero. &amp;#x200B;<TiGeRtHiRtYfOuR>: Word", "num_messages": 4, "avg_score": 5.75}
{"start_date": "1544880764", "end_date": "1544925465", "thread_id": null, "subreddit": "UpliftingNews", "subreddit_id": "t5_2u3ta", "total_score": 64, "text": "[deleted]: 'Animals are not entertainment': Sea World has been forced to cancel two of its performing dolphin shows in a dramatic day on the Gold Coast, where protesters invaded the pools as part of a co-ordinated sting, leading to several arrests. [deleted]<Jjjiped1989>: Good. I think the main reason these type of parks haven’t gone away is because it’s a nightmare to move the animals. They can’t just release them out into the wild. There was a great planet money piece on this<juanmlm>: Which episode? I can't believe I missed this!<Jjjiped1989>: I can’t remember but it’s from a couple of years ago<juanmlm>: Is it the one about the Zoo Economy?<Jjjiped1989>: I think so", "num_messages": 6, "avg_score": 10.6666666667}
