{"start_date": "1543571249", "end_date": "1543604994", "thread_id": "t3_a1pdrd", "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 26, "text": "<Eredea>: And if I view the fetus as a human? And if that fetus is a woman? And I respect its choice to grow up into a person? I understand you will never agree because we are arguing under different premises. I aknowledge your view point as valid under the premise that the fetus is not life. Do you not see how you would come to the opposite conclusion if your premise were different? I don't hate women man lol<throwaway4myfeelss>: You respect the tiny piece of tissue more than the grown woman who now has to host it... ....so what you *think the fetus might want* is more important than what a grown woman wants, even though she is able to voice her thoughts to your face and the tissue mass cant? tissues can’t form thoughts, feelings, or have aspirations.... the woman who’s forced to host the tissue however, does have thoughts feelings and aspirations but fuck her right? <Eredea>: I'm done having this conversation with you. And you can telepathically communicate with the newborn, right? If it's life, yes. I absolutely care more about that person's ability to live than I care about a person's ability to live comfortably. I would hope that is understandable. No. Not fuck her. I think we should do more to take care of women who are born with children they are incapable of taking care of. But since I believe that fetus is a human life, no I don't think that she should just be allowed to 'terminate' it, even if it would make her life 1,000,000 easier. It's an unfortunate situation all around, no doubt. I would never make a woman feel wrong for getting an abortion, anyone who does is not being true to the religious ideals they portray. Once again, we're working on different premises. Everything you say makes since given off the facts your starting with. But, if you start with the fact that it's a child, can we kill it because of this woman's \"thoughts, feelings and aspirations\"? Of course not. Ironically your point on the flubber (and how you answered the question you asked me) is the exact point we disagree on. Would you kill the newborn for this woman's thoughts feelings and aspirations? Now, if you believe they are effectively the same, and realize that given nothing but time this \"flubber\" would turn into this newborn, you would of course not kill either. Good bye. I am open to having a conversation in good faith but you're being ridiculous.<secretlives>: So do you think we should force people to donate organs if they would save a life? <Eredea>: No. Not necessarily.<secretlives>: That's weird, I thought you cared more about a person's ability to live than you cared about another person's ability to live comfortably.<Eredea>: Oh, you got me. I realize now how much I hate women. Nice man.<secretlives>: So I guess that offer of conversation in good faith isn't applicable after you've been shown your own hypocrisy.<Eredea>: You really think this is in good faith? You're joking. And no, no hypocrisy. Even in the slightest. You can't force someone to give up there organs. You can PREVENT someone from taking another life (if you see it as such). That's the distinction. One is protecting the rights of the child. The other is violating someone's rights not to have their organs stolen. I mean the distinction is obvious. Besides, I said not necessarily. Frankly yes everyone SHOULD, but you can't force them to do something like that.<secretlives>: Got it - you can force someone to do something with their body that they don't want to, because it's saving a life. But you _can't_ force someone to do something with their body that they don't want to just because it would save a life. Wait...<Eredea>: Its not her own body. That's the point. I put the fetus on the exact same level as the newborn. Would you kill the newborn to make your life easier? I'm assuming your answer is no. I view it in the exact same way. Now, if you want to say that based off of the fact that you wouldn't kill the newborn, you should force organ transplants, maybe we can have that discussion. But it is wholly separate than that of abortion. <secretlives>: It's okay to force a woman to carry a pregnancy to term because not doing so would result in a person dying. It's not okay to force anyone to donate an organ because not doing so would result in a person dying. <Eredea>: You're not listening. I know you're not going to. Is it okay to \"force a mother to care for her newborn\"? It's the same thing if you start with the premise that the fetus is life. You're being intentionally obtuse. I can admit that your side makes sense if I start with a different set of facts. You're incapable of doing the same. The analog you're actually looking for is more similar to killing off someone with good organs, to give them to someone else so that they may not have to go to dialysis. And no, I don't think that would be right either. Do you maybe see how that is a bit more similar? Forcing her to carry it to term? No. I'm preventing her from killing what I see to be life. I'm not forcing her to do anything at all besides not terminating what I believe to be life. There is no action required. Contrast this to forcibly stealing someone's organs.<secretlives>: &gt;Forcing her to carry it to term? No. I'm preventing her from killing what I see to be life. I'm not forcing her to do anything at all besides not terminating what I believe to be life. There is no action required. Contrast this to forcibly stealing someone's organs. You are forcing her to give birth - you are forcing her to remain in a state which she does not want to be in. That is violating her bodily autonomy. <Eredea>: Yeah. I'm very sorry for that for her. Unfortunately, I don't think she can go killing off the child because she doesn't want it. <secretlives>: &gt; It's okay to force a woman to carry a pregnancy to term because not doing so would result in a person dying. &gt; &gt; It's not okay to force anyone to donate an organ because not doing so would result in a person dying. <Eredea>: I told you, that's an entirely separate conversation we can have, if you wish. However: The analog you're actually looking for is more similar to killing off someone with good organs, to give them to someone else so that they may not have to go to dialysis. And no, I don't think that would be right either. Do you maybe see how that is a bit more similar? To me, it's blatantly clear how my scenario is more similar to an abortion than is yours. Abortion (and this scenario) involve the active choice to terminate a life in order to ease the life of another. We can have a philosophical \"trolley problem\" regarding inaction and how it may lead to more deaths. But it's not as closely parallel as the scenario of making the choice to kill one.<secretlives>: No - it's not. You're forcing someone to do something with their body that they do not want to do. Something that involves a degree of risk of injury or death. Your justification for forcing them to do this is that by not doing it, someone will die. If you believe that life is sacred and should come before the bodily autonomy of an individual - then you should support the idea of forcing someone to donate an organ to save a life. I'm not arguing with you on whether or not a fetus is equal to a newborn, we will always disagree on that and that's fine. But even if it were a newborn, forcing the mother to give up her bodily autonomy to save a newborn is not okay. The same as forcing anyone to give up their bodily autonomy to save another is not okay. You and you alone get to choose what you do with your body, above all else. Giving birth is an excruciatingly painful process for all women and a potentially dangerous one for some. Forcing them to do that against their will because otherwise a child would die is a violation of her bodily autonomy. The question is simple - do you support violating the bodily autonomy of an individual so another can live?<Eredea>: \"You and you alone get to choose what you do with your body, above all else. \". I agree. And as I've stated many times, I see the fetus as a child. As a body. The woman can't decide what to do with the child's body. It cannot speak up for itself yet. I would not kill it. Good bye. This is clearly fruitless. Have a good one. <secretlives>: But she can decide what to do with hers. And if that means not giving birth, so be it. Maybe the fetus can walk it off after it gets taken out. <Eredea>: \" But even if it were a newborn, forcing the mother to give up her bodily autonomy to save a newborn is not okay. \" This is insane. Totally insane.<secretlives>: Just as insane as saying \"forcing an individual to give up their bodily autonomy to save another person is not okay\", which you have no problem doing in regards to organ transplants.<Eredea>: Nah fam. You're not even listening. I began with \"not necessarily\" and continued with \"it's a separate issue we can discuss\". My alternative analogy with organ donation is so obviously more close to the situation you're describing. There's a difference between inaction. Can you kill someone to harvest their organs so that another may live a life without dialysis? Can you kill someone to prevent taking a pregnancy to term to save a little pain and inconvenience? Or whatever the reasoning may be? You're taking away the \"bodily autonomy\" (which is evidently much more important than life itself) of THE CHILD. But you literally said even if it was a child and alive, it's still okay to kill. I can't relate there bud. I am personally glad that I wasn't aborted, and despite the annoyance you're causing me now, I'm glad you weren't killed as a fetus either. Good luck bud<secretlives>: &gt; My alternative analogy with organ donation is so obviously more close to the situation you're describing. There's a difference between inaction. No - it isn't. You're forcing an individual to undergo a procedure which they do not want to undergo because not doing so will result in someone dying. If you don't donate a kidney, someone dies. It's an exact analogy. You just don't like it because it highlights the illogical base you're standing on. I'll ask the question again - do you support violating the bodily autonomy of an individual so another can live? Should `an individual` be forced to undergo `an invasive procedure or surgery` because not doing so will result in `another person` dying? You don't get to change your answer just because one time it's a woman being forced to give birth and the next time is a man being forced to give up a kidney.<Eredea>: Yes it is. Look, I understand where you're coming from and why you think the way you do. I don't see why it is so hard for you to see it my way. I don't like it because nowhere does it involve actively killing someone. Which the other scenario does. That's a pretty big difference to me. If you don't see it as such, okay.<secretlives>: &gt; Should `an individual` be forced to undergo `an invasive procedure or surgery` because not doing so will result in `another person` dying? &gt; &gt; You don't get to change your answer just because one time it's a woman being forced to give birth and the next time is a man being forced to give up a kidney. <Eredea>: Should \"a life be taken\" to \"ease the suffering\" of another? <secretlives>: Should someone die because someone doesn't want to be uncomfortable during/after surgery removing their kidney?<Eredea>: Hey man. Your opinion is valid and I understand it. I would hope you can consider mine and come to the same thing<secretlives>: I understand your opinion on things which there can be differences of opinion on. For example - I disagree that a fetus is a life, but I understand that you do and there will always be a difference of opinion on that so I don't address it. I speak and phrase all of my questions from your perspective - one in which the fetus is equal to a child. You at no point have considered anything other than your own opinion. When faced with a logical inconsistency in your own reasoning you ran away from it, simply refusing to answer a question I've posed now 3 separate times. &gt; Should `an individual` be forced to undergo `an invasive procedure or surgery` because not doing so will result in `another person` dying?<Eredea>: I think it's very straightforward to go from \"fetus is life\" to \"don't kill it\". We can go in circles all day. But that's pretty much my whole argument, and it seems to flow obviously and easily from the premise.<secretlives>: Last time - simple question you won't answer: &gt; Should `an individual` be forced to undergo `an invasive procedure or surgery` because not doing so will result in `another person` dying? <Eredea>: I told you already I understand where you're coming from. You're a sad, pitiful person. You realize I asked you a similarly pointed question you refuse to answer? Should an individual be forced to die because not doing so will result in bad circumstances for another?<secretlives>: &gt; Should an individual be forced to die because not doing so will result in bad circumstances for another? If the \"bad circumstances\" involve violating their bodily autonomy by forcing them to under a procedure or surgery then yes. I don't think anyone should be forced to go through the bad circumstances (having a kidney removed) to allow another person to live. Similarly, I don't think anyone should be forced to go through the bad circumstances (giving birth/carrying a pregnancy to term) to allow another person to live. Now explain to me why you agree with one of those statements and disagree with the other.<Eredea>: I just don't think you can kill of an unborn fetus because you don't want to give birth to it. I don't think you can forcibly cut someone open and steal there organs either. It's not difficult to understand, and you're being intentionally obtuse. If preserving \"bodily autonomy\" is more valuable to you than preserving life itself, this will never come to an end. I just cannot relate. I have told you the organ thing is a separate issue. I literally said not necessarily. Maybe they should have their organs removed, what the hell do I know? I just know that you can't kill anything that inconveniences you, lol. I'm sorry you feel differently. It seems from the difference of death by inaction vs death by direct action. I don't see it as \"forcing the woman to have a baby\". I view it as protecting the child's right to live. Once again, your analogy is just not the same. The most accurate analogy stems from killing a healthy person so that a sick (and not dying) person can live a more convenient life.", "num_messages": 35, "avg_score": 0.7428571429}
{"start_date": "1544728335", "end_date": "1544904046", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3596, "text": "<healthsherpa>: YSK that midnight Saturday is the deadline to get health insurance for next year in most states This Saturday, December 15th is the deadline to get health insurance for next year in most states, so if you live in the US and don’t get insurance through your job, parents, or something like the VA or Tricare, now would be a very good time to sign up. Saturday's deadline applies to: AL, AK, AZ, AR, CT, DE, FL, GA, HI, ID, IL, IN, IA, KS, KY, LA, ME, MD, MI, MS, MO, MT, NE, NV, NH, NJ, NM, NC, ND, OH, OK, OR, PA, SC, SD, TN, TX, UT, VT, VA, WA, WV, WI, WY. These states have later deadlines: CA, CO, MA, MN, NY, RI, DC. Healthcare in this country is insanely expensive but you may qualify for government subsidies that cover some or all of the cost of the insurance and then you'll actually be able to go to the doctor if you get sick or have an accident. If you make less than $20k a year there's a good chance you can get a plan that costs $0-$20 a month and covers a lot. Go to [healthcare.gov](https://healthcare.gov) to see if you qualify before midnight Saturday. You can also call them at (800) 318-2596 but wait times are getting long. If you talk to a broker or go elsewhere online, watch out for scams like: short-term insurance (doesn't cover prescriptions or pre-existing, banned by some states) healthcare sharing ministries (unregulated, lots of loopholes, not actually legally required to cover anything) critical illness (nicknamed \"cash cancer\" for a reason - but only obscure cancers you'll never get) hospital indemnity (cash when you go to the hospital, this is NOT health insurance) etc. <CrazybutSolid>: Frenchman here: does this mean you just can't get insurance at any moment? If you miss the deadline there's nothing you can do to get health insurance next year in those states???<Ikantbeliveit>: American here. Yep, and the deadline was shortened by the current presidential administration so he could effectively kill it. Y’all got some yellow jackets we can borrow? <LovableContrarian>: Well, yes and no. There is an open-enrollment period and a deadline to buy insurance through the government-run \"marketplace.\" But, you can just call up an insurance company and buy insurance whenever you want, anytime of year. And since Trump gutted the marketplace, there is no real benefit to purchasing on the marketplace (unless you are low income and qualify for tax credits). I am self-employed, and the best plan offered to me was $500/mo for a crappy plan with an $12,000 deductible. I make too much to qualify for any helpful assistance, but I don't make enough to buy one of these plans. I can't swing $500/mo and still be able to pay for rent/bills/food/etc, especially when that $500/mo really only buys my catastrophe insurance (and won't help me pay for doctors, medication, etc). Looks like I'll be uninsured next year. Which isn't shocking, as I've been uninsured for about 7 of the past 10 years. I'm a college grad, making respectable money (though not rich), and I if I get in a car accident next year, I'll be in debt for the rest of my life. Gotta love America.<Butt_fairies>: This is my situation, too. I don't make a crazy amount, but I don't make great money, either. I only got \"qualified\" to get decently priced insurance a couple years ago because I had a part time job at 16hours/week, minimum wage. It's retarded. I can't get my inhaler to breathe every day (the steroid one), or a fast-acting one in case I go to a friend's place who has a cat. I can't get sick because I can't afford to miss work, and I can't afford to see a doctor. I have a weird mole I'm worried about and I can't see a doctor. I have a severely impacted wisdom tooth that's hurting three teeth in front of it that I can't see anyone for. Hell I haven't had a cleaning in well over five years. The only thing I save up enough to do anything for are my awful eyes that I end up paying *at least* $500 out of pocket for, because without my glasses I'm totally fucked. 🤷‍♀️<damnisuckatreddit>: Bro buy your glasses off the internet. I've been using zenni for the last five years, cost about $25 per pair and I couldn't be happier with them. Optometrists will try to convince you they're shit quality or whatever but none of my optometrists have ever been able to tell my glasses were bought online, even when they use them to get my baseline rx. For the inhaler stuff, if you haven't tried yet you should contact the manufacturer. My stepdad needs a truly absurd amount of inhalers every month and he gets some kind of discount through the company that makes them. I think a lot of places have programs to get their meds to folks who can't afford them because they know if they get you on their brand you'll keep buying from when when you have insurance again. Tooth stuff, look for dental schools in your area. Cheap or sometimes free care. Dunno what to do about the mole though. I guess just try to keep tabs on it? Make sure it doesn't grow or change shape or color or whatever.<yodamy>: THANK YOU &lt;3 Did not know of this. Need new glasses and sunglasses. My prescription is good but I’d recently relied on Hubble (ew) contacts and my old glasses are scratched to hell. Thanks so much. If I had the money to gild, I would.<stfucupcake>: Also: Mexico is the lowest priced option I found for dental work. They were qualified, skilled dentists too. I know, it's a weird world we're living in.<1st_Gen_Charizard>: Mexico is great for cheap strong medecine, denstistry, and vacationing.. i actually save money by staying with family in mexico and eating out nearly everyday than I would if i were to sit my ass at home here in the states<stfucupcake>: Nice. I wish I had family there to stay with!!", "num_messages": 10, "avg_score": 359.6}
{"start_date": "1543105175", "end_date": "1543427011", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3749, "text": "<LatrodectusGeometric>: YSK that you can buy the opioid overdose reversal drug over the counter 46 states. YSK that in most/all US states you can buy the opioid overdose drug (naloxone) without a prescription [for about $20.](https://www.goodrx.com/naloxone) You can save a life by having it on hand. If you know anyone taking pain medication, using opioids, or any illicit drugs that might have fentanyl or opioids mixed in, you should get some naloxone, learn how to use it, and keep it around. You need a prescription in only a few states: Delaware, Hawaii, Maine, Michigan, Nebraska, Oklahoma, and Wyoming. In general you may be able to get a prescription from the pharmacist in these states, depending on whether the pharmacy/pharmacist is participating. [To use naloxone check out these instructions.](https://harmreduction.org/issues/overdose-prevention/overview/overdose-basics/responding-to-opioid-overdose/administer-naloxone/) REMEMBER THAT EVEN IF YOU USE NARCAN/NALOXONE YOU NEED TO CALL AN AMBULANCE OR GET MEDICAL ATTENTION. The dose doesn't last long, and you can OD again when it wears off if you don't get help. If you can't call 911 for whatever reason, call Poison Control (800) 222-1222 Another edit: Also ice or ice water will not reverse overdoses, although they can wake someone up who is having a very intense high and is on the border of ODing.<themoistinator>: It's truly wonderful that drug addicts get life-saving medications for free but, diabetics got to pay or they die. What a wonderful world we live in<coquihalla>: They're both valid diseases with life-ending risks. I'm a diabetes peer educator and happen to also carry narcan in case of emergency. I just don't really see a moral values difference in the two diseases to begrudge either getting treated. But things should definitely be fixed when it comes to the costs of diabetes medicines, you're right. My household spends in the high thousands yearly on diabetes supplies and meds, and I have clients who frequently go without because of costs.<themoistinator>: So... Maybe you can tell me. Why does a drug addict get free drugs and a diabetic has to pay for their drugs? Or a cancer patient? What makes a f****** drug user so f****** special?<LatrodectusGeometric>: What gives you the impression that drug users are getting free meds?<themoistinator>: https://www.metrohealth.org/emergency-room/opioid-education-project-dawn<LatrodectusGeometric>: http://www.diabetes.org/living-with-diabetes/health-insurance/prescription-assistance.html We have similar public health projects for many diseases. Here is one for diabetes.<themoistinator>: That's great. I'll have to let my sister-in-law know. But that doesn't explain the price disparity. Drug addicts get very low-cost or free life-saving drugs. Diabetics must pay through the nose. I just don't get it<LatrodectusGeometric>: One kills you much faster than the other. Unfortunately public health is trying to stop hemorrhaging where opioid overdoses are involved. The big funding for diabetes is going into pushing healthier lifestyles, better diets, and more exercise, as well as ensuring that diabetics have access to disease-mitigating care like regular retinal and foot exams. Metformin isn’t bad, thank goodness, and cheap regular insulin is available in a pinch, but the really good stuff is likely going to be expensive for a long time.<themoistinator>: Good things. But one is a choice and one is not. That's probably my biggest problem. Ex opioid user. Heavy user. One day I was just done with it. And I quit. It was prescribed to me 120 pills per month that was a 10 300 prescription of Oxycodone. I didn't like what it was doing to me and so I quit. Anybody can quit. But nobody forced me to take opioids. I took them voluntarily albeit at the behest of my doctor who prescribe them. But I did make a choice. My sister-in-law did not make a choice. I just don't understand the disparity<LatrodectusGeometric>: Unless you have type 1 diabetes, diabetes is mostly a disease of lifestyle. Many people will argue that it is a choice. It's perhaps not the best example here. <themoistinator>: So what you're saying is that junkies are just like people with diabetes? Good to know<LatrodectusGeometric>: In that they are people who deserve medical treatment for their illnesses, whether or not they are self-imposed? Yes.<themoistinator>: Drug addiction is not an illness or disease<LatrodectusGeometric>: I’m a doctor. I’ve studied it. I’ve treated it. Drug addiction is absolutely a disease.<themoistinator>: How do you get it?<LatrodectusGeometric>: Same way you get a lot of diseases, social circumstances, family predisposition, poor lifestyle choices. Just like diabetes, heart failure, alcoholism, obesity, COPD, and half the conditions I see in my clinic on a regular basis.<themoistinator>: If I have never taken drugs, how would I know I am a drug addict?<LatrodectusGeometric>: About one quarter of heroin users become addicted after being prescribed opioids for pain by a doctor or dentist. Say you break your leg, you get prescribed an opioid for the intense pain by your doctor. After a month your doctor stops prescribing the opioids. If you’re an addict, now is when you’d discover it. <themoistinator>: How about cocaine? Or pot? Or the other 75% of heroin addicts?", "num_messages": 20, "avg_score": 187.45}
{"start_date": "1544756214", "end_date": "1544774741", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 57, "text": "<etteirrah>: YSK that Google has a service called My Maps that enables users to create custom maps for personal use or sharing. It has been very useful for planning an upcoming trip especially with seeing the vicinity of and distance between the sites we want to see, the things we want to do, and the places we want to eat at. Of course this is one of the only many uses for it. It was first launched in 2007 and has since been updated with much sleeker icons (which are customisable, should you decide to put a distinction between sites, e.g. hotels vs. restaurants vs. sites to see). You can create multiple layers which you can toggle on and off depending on what you want to see on your map. It also syncs with your Google Map app if you are signed into an account.<Im_a_nice_horse>: Just started using this recently and have found so many uses! <etteirrah>: I wish I had learned about it sooner! I only found out about it today. If you don’t mind me asking, how else has it helped you?<Im_a_nice_horse>: I use it for keeping track of clients at work. I previously used an excel spreadsheet, but I found that I can import my excel data to google maps. You just need a column to have the location in it, and then all the other info pops up when you hover over the associated icon. You can even select the icon type and colour based on the data in one of your spreadsheet columns, so I can colour code based on what services I have provided to a certain client. My colleagues think I'm a wizard, but it's actually really easy to do!", "num_messages": 4, "avg_score": 14.25}
{"start_date": "1544584597", "end_date": "1544924555", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 161, "text": "<iAmAddicted2R_ddit>: YSK the easy way to choose between \"who\" and \"whom\" for formal writing Take the sentence you've written containing \"who/whom\" and simply answer it. For example, if you write \"the person who was responsible for the crash,\" think if you would say that **he** was responsible for the crash or **him** was responsible for the crash. If \"he\" sounds right, use \"who.\" If \"him\" sounds right, use \"whom.\" On whom was the responsibility for the crash laid? The responsibility for the crash was laid on **him**, so use \"whom.\"<UndescriptiveCaribou>: I disagree with <under_design>: Whom do you disagree with?<UndescriptiveCaribou>: It’s a made up word <GrandMasterBen>: So is every word, you bumblastickesh", "num_messages": 5, "avg_score": 32.2}
{"start_date": "1544300479", "end_date": "1544384764", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3584, "text": "<Jinxwinks>: YSK that “DD” breasts aren’t as big as you think they are, and without the band size you could be referencing anything from kiwis to cantaloupes. You often see people referencing breasts on a scale of A-DD from smallest to largest. In reality though, D-DD is at the relatively small-average end of the scale. While many big box stores only go up to D-DD (the source of confusion I believe), stores that specialize in bras have a scale like this- <US>: A, B, C, D, E (DD), F (DDD), G, H, I, J, K+... <UK>: A, B, C, D, DD, E (DDD), F, FF, G, GG... **The importance of band size** Going back to the kiwi and the cantaloupe, I brought that up because you can have two women who wear a size DD, but the actual volume of breast tissue can be wildly different. For example- 28C vs 34C These are two different band sizes with the same cup size. *Proportional to their bodies*, it’s the same size, however the 28C is going to be a smaller breast than the 34C. This is where it gets a bit confusing. Bras have a concept called “sister sizing” where if you go down a band, you go up a cup size. So if you were to take those 34Cs and reduce them to a 28 band equivalent, you’d convert roughly to a 28DDD. That girl with the 28DDD sounds like she has huge boobs, but they are the “same” size as a 34C which doesn’t sound quite so big. Proportionally the 28DDD has more breast tissue compared to chest than the 34C, but someone still may not think that they look very “big”. You simply can’t have a blanket image for what a “DD” breast should look like, because it depends on who’s body it’s on. [I find these infographics to be helpful ](https://imgur.com/a/Bm4024C) I am sharing this information because I think that understanding these sizes can be very beneficial. It helped me to find my proper fit and be more comfortable, but even so, someone may scoff at me for sharing my size because it “doesn’t look *that* big”. I think that if more people were educated on sizing, it would lift a lot of ignorance from the whole subject-for males *and* females who don’t yet know these things. <Edit>: wanted to add [this bra size calculator](https://www.abrathatfits.org/calculator.php) that I found helpful in discovering my proper size! <scru>: Additionally, because most stores only carry Sizes 34A - 38 or 40DD, most women are wearing the wrong bra size! Even if you get fitted by a saleswoman, they will pigeonhole you into one of those sizes in order to sell to you. I thought I wore a 34 or 36B until I was 23 years old. Turns out I wear a 28DD/E! Please check out /r/ABraThatFits, grab a tape measure, and find out your actual size!<AmyVictoria>: Victoria's secret fitter said I was a fucking 36C and I am a 38AA at best. big ol ribcage with barely any tiddy.<Jinxwinks>: I recommend [this calculator ](https://www.abrathatfits.org/calculator.php) if you have a measuring tape. It might surprise you how little breast tissue it takes to be more than an A. However, if that is your true size then I hope you’ve found a comfortable bra! <jeegte12>: Why would As need a bra?<Jinxwinks>: There’s still some breast to cover. Also, nipple coverage. Also, just because they are small, it doesn’t mean that they shouldn’t get to feel sexy wearing a nice bra (if that’s what they wanna do). <jeegte12>: so no practical reasons? i thought that's the whole point of wearing bras but okay<Jinxwinks>: The nipple coverage is a pretty “practical” reason I think. <jeegte12>: why is this different from guys though?<Jinxwinks>: People don’t care about guy nipples? Like.. seriously? Lol <jeegte12>: you're saying As would get more unwanted attention without a bra than if they wore a bra? &gt;Like.. seriously? Lol yes, seriously, i didn't think about it, don't be a jerk<Jinxwinks>: Yes. People think that for some reason female nipples on any size breast are a huge deal if they are showing. <jeegte12>: they're not a huge deal but they are attractive to look at. i didn't think about it, that's why i asked. maybe just answer next time someone asks you an honest question<Jinxwinks>: You were the one that seemed to have attitude with the whole “so no practical reason?”. Seemed like some sort of condescending comment. My mistake if I mistook your tone. <jeegte12>: so you matched what you thought was condescension with condescension? <Jinxwinks>: Yes", "num_messages": 16, "avg_score": 224.0}
{"start_date": "1544664196", "end_date": "1544687615", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 4095, "text": "<tommywaaf>: YSK: You can use one-time credit card numbers to keep your real credit card information safe from data breaches [removed]<d9_m_5>: Anyone know any caveats/catches to doing this? I imagine there'd be some since there are a limited number of valid credit card numbers.<slowmotionrunner>: I’ve been using this service for about two years now. Never had an issue. <EnjoyTheUsernameGIF>: https://i.imgur.com/qbkLiyr.gif<RandomlnternetUser>: That's clever. Now do me...<EnjoyTheUsernameGIF>: https://i.imgur.com/gCUeGSB.gif<RobertLobLaw2>: Oh can I get one? <EnjoyTheUsernameGIF>: https://i.imgur.com/OGz9XYT.gif<ad_museum>: Damn, oddly specific<TheFallenStar>: I will be easy<C-C-X-V-I>: Thats what she said!", "num_messages": 11, "avg_score": 372.2727272727}
{"start_date": "1544618105", "end_date": "1544629103", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 1025, "text": "<Cymdai>: YSK: If you are a Verizon customer, you have likely been getting defrauded by a \"Total Mobile Protection\" charge since July 2018; you can have this refunded and reversed by contacting their support team [removed]<bwave1>: Total Mobile Protection provides same-day/next-day repair/replacement of your mobile device. $13 for first phone (or $10 for tablet) and $9 for each additional phone on your plan. Just clarifying what it is, as some people may have signed up for this service, not every person with the charge is fraudulent. <sweetbunsmcgee>: They don’t tell you the replacement costs upfront though. Last time I used it, the copay for an iPhone 6+ was $250. I was better off with AppleCare. Something like $100 sign up fee, and the replacement phone was free. <SleekFilet>: &gt; copay for an iPhone 6+ was $250 Umm, what? deductibles are $19, $89, $149, and $199 depending on the MSRP of the device insured. <sweetbunsmcgee>: I dunno, this was a few years ago when the 6+ was the flagship model. I remember going through Asurion and paying $250 for a replacement. <Cymdai>: Can confirm this too.<maryhadalittlefist>: The deductible has never been higher than $199. Downvote all you want. I've been in the store for 10 years. The deductible has always been maximum $199.<idontlikerootbeer>: Except for when it has", "num_messages": 8, "avg_score": 128.125}
{"start_date": "1544730598", "end_date": "1544890920", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 28, "text": "<asteriskspace>: YSK that people return an astonishing amount of goods to retailers. Retailers don't find it financially viable to handle all the returned goods, so they sell much off at little to no cost. Dealers buy these goods and resell it back on Amazon and other sites at a premium. [removed]<TWFM>: Okay. Why “should” we know this? <ForgottenMajesty>: Because you may be paying a premium online for what amounts to reject retail merchandise. Ew.<SaintDane01>: One, that's not gross. Why are you \"eww\"ing? Second, the point of online shopping is to *avoid* paying extra, so why do you say we're paying a premium?<ForgottenMajesty>: Some weapons grade autism in that reply, talk about socially inept. Wow.<Emotris>: Damn you struggle to say anything nice. <ForgottenMajesty>: Struggle implies effort, eat shit.", "num_messages": 7, "avg_score": 4.0}
{"start_date": "1543604374", "end_date": "1543729125", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 121, "text": "<Jexlan>: YSK: Near-sighted? You can wear CRT lenses which are simply contacts only worn while sleeping. You take them off during the day. I personally call these \"night contacts\" I'm pretty sure but you want to confirm these with your eye doctor. The lenses freely let air pass thru into your eyes unlike soft contacts and if you're still a young child (age doesn't matter for using/starting) it can slow down or even stop your myopia's progression. Only downside is each lens costs at least a couple hundred USD and you cannot lose them. You wear same lens pair for like 3 years before changing <Edit>: forgot to say why. Wearing these give you 20-20 vision throughout the day so I think more convenient than soft contacts. You'll feel like there's something on your eyes the first month (forgot how long exactly, I started when I was 13. 23 now) but after you don't feel a thing when wearing. I'll be sticking to this and have no plans to ever undergo Lasik Edit #2: After some research, technology is called Orthokeratology (ortho-k) and and contacts are called Paragon CRT lenses. I've never worn soft contacts so forget anything I said about those. Forgot to mention there's options to get different colored lens for your left and right eyes so you don't mix those up. I use yellow for left and red (R for Red) for right. Your eyes have different prescriptions so really don't want to mix those up Edit #3: straight from [ortho-k Wikipedia](https://en.wikipedia.org/wiki/Orthokeratology): \"Orthokeratology is most often used for candidates with up to -6.00 diopters of myopia, though exceptions may be made if the prescription is only slightly lower (e.g. -6.25).\" I wonder if that means this is only for those whose eye degree is less than 6 (or 6.25)<i_right_good>: I've had these for years and I love them. I've never heard them called \"CRT lenses\" before -- I know them as ortho-k lenses. It cost me $1,200.00 which included a pair of lenses and all the visits to the eye doctor for a year, because it required an appointment for a consultation and careful eye tests and measurements, and a return visit to pick up and test the lenses after they arrived at the doctor's office, and a follow-up visit). I think you might not be right about soft lenses though, I believe they do allow oxygen to pass through. <lordnecro>: 1200? Do you need a new pair every year?<Jexlan>: no, more like at least every few years. It's flexible, depends on your personal comfort. My current pair are from 2012<i_right_good>: Mine are from 2013. I'm not sure but I don't think you have to pay the full price ($1,200 in my case) for new prescriptions. New lenses are still pricey though, I want to say $150 per lens?", "num_messages": 5, "avg_score": 24.2}
{"start_date": "1544546943", "end_date": "1544609912", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 2946, "text": "<NotJimIrsay>: YSK that you can enable digital receipts in the CVS app so you don’t get those 2 feet receipts. Once you enable [Digital Receipts](https://i.imgur.com/OnXJ9NJ.jpg) in the app, they will no longer give you a paper receipt in-store, but will instead tell you that your receipt will be emailed to you. <high_side>: Yeah but each digital receipt is over a gigabyte.<bigvahe33>: That's bad.<j6sh>: But it comes with a free frogurt.<bigvahe33>: Thats good!<j6sh>: The frogurt is also cursed.<okiujh>: That's bad.<PM_MEE_YOUR_BOOOBS>: But it comes with a genie which will fulfill your wish<dannytech357>: That's good!<thebryguy23>: The genie is one of those \"douchebag genies\" <olsoni18>: That’s bad. <silkboy77>: But it comes with a free beanbag chair!", "num_messages": 12, "avg_score": 245.5}
{"start_date": "1543438995", "end_date": "1543813363", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 60, "text": "<yunyezz>: YSK that you can use a digital copy to show proof of auto insurance in 47 states You can use your insurance companies app to provide the documents via phone. <https>://www.allstate.com/tr/car-insurance/electronic-insurance-card.aspx<joeverdrive>: YSK that if your phone is stolen with your car, destroyed in an accident, has a dead battery, or if you are in an area with no coverage and have not saved the PDF to your phone, then you will not be able to provide proof of insurance and the park ranger will be very mad.<-TheGatesOfHell->: Personal experience?", "num_messages": 3, "avg_score": 20.0}
{"start_date": "1532487578", "end_date": "1544841049", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 52, "text": "<TacticalHog>: YSK you can disable Steam's new friend list UI -nofriendsui in shortcut \"C:\\Program Files (x86)\\Steam\\Steam.exe\" -nofriendsui <example>: https://i.imgur.com/SF4VWgT.png credits to @xPaw - https://www.reddit.com/r/Steam/comments/91l6eb/revert_to_old_ui/e2yukfk/ you need to restart Steam, and run it from this shortcut (with -nofriendsui) [Full disclosure I copied and pasted this](https://www.reddit.com/r/Steam/comments/91lwgb/psa_how_to_disable_new_friends_ui/) straight from /r/steam, thanks /u/oklaski the fuck were you thinking Valve lol<Caffeinated_DaVinic>: This doesn't work anymore. There is a new command though. Instead of using -nofriendsui, you can now use -steamos<TacticalHog>: doesnt that disable stuff like the browser and store though? or is this different?<Caffeinated_DaVinic>: Using the store at the moment, so that one's a no. Steam's in-game overlay might be affected. It bugs out for me constantly anyway, so I'll have to test if it was just not working or if the command disabled it. As far as I can tell currently, the only thing it disables is the ability to send photos directly through chat. This isn't a huge deal for me because half the time the image upload feature fails anyway. <EDIT>: It does seem to disable the overlay. Use this command at your own risk. As I stated above, the overlay crashes and shuts down with excessive memory usage anyway, so this is still a feature I can live without to have the old, working chat again.<TacticalHog>: ohcool ty man", "num_messages": 5, "avg_score": 10.4}
{"start_date": "1544796150", "end_date": "1544901281", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 1904, "text": "[deleted]: YSK that you shouldn't give aspirin to children and teens during and after a viral infection like the flu. It can cause [Reye's Syndrome](https://www.mayoclinic.org/diseases-conditions/reyes-syndrome/symptoms-causes/syc-20377255) which can really be a lot more dangerous. <1leggeddog>: tldr: give Tylenol instead<Gman325>: tldr: give ~~Tylenol~~ Ibuprofen instead. Ftfy.<strikeuhpose>: Definitely use ibuprofen over Tylenol. <Tramd>: But they do different things no? I don't no about aspirin. Actually, I have no idea wtf that is. It's not a thing here. It's a name brand right?<Jerl>: No, aspirin is not a name brand. The name was originally owned by Bayer, but since they never enforced their trademark, they lost it and it is a generic trademark. It was one of the first commercially-sold NSAID medications. It most likely *is* a thing where you live, since it's also used during heart attacks. Chewing on one when you suspect you're having a heart attack drastically improves your survival chances, and many people above a certain age carry a single dose on them at all times for this purpose.<Tramd>: I'm sure it is but not really a house hold name. There's ibuprofen and tylenol but you never really hear about aspirin.<Jerl>: Tylenol, on the other hand, *is* a name brand.", "num_messages": 8, "avg_score": 238.0}
{"start_date": "1544571453", "end_date": "1544917603", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 43, "text": "<AesSedai99>: YSK that in some elevators, if you pressed the button for the wrong floor, you can cancel it by pressing it again once or twice depending on the elevator model Once you press the button once or twice again, the lamp for the button will then go off<YaBoiRocroi>: In my elevator, if I press the wrong one and I'm lucky that the floor I missed is lower that the one I pressed, I can press the correct one and it will first stop in that one. <sunny9911>: That's how normally elevators work. <YaBoiRocroi>: Not in mine until 3 years ago lmao. <fuckthemodlice>: What? Your elevator would stop at a higher floor first?<YaBoiRocroi>: Nope, it wouldn't even accept another input until it reached the selected floor.", "num_messages": 6, "avg_score": 7.1666666667}
{"start_date": "1544862439", "end_date": "1544901769", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 2972, "text": "<ABadLocalCommercial>: YSK that Tylenol/ acetaminophen can cause liver failure and should not be taken long term or outside the recommended dose unless instructed by a doctor I've seen Tylenol/ acetaminophen popping up pretty frequently over the last few days and a lot of people are unaware that it can cause liver failure in adults and children if too much is taken. The recommended dose of acetaminophen in adults is 650 to 1,000 mg every 4 to 6 hours, not to exceed 4,000 mg in a 24-hour period; in children, the recommended dose is 10 to 15 mg/kg every 4 to 6 hours, not to exceed 50 to 70 mg/kg in 24 hours. Single doses of more than 150 mg/kg or 7.5 g in adults have been considered potentially toxic. Once ingested, there is only a 30-60 minute window to either pump the person's stomach or administer activated charcoal. A medication called Acetylcysteine can also be used, but it is most effective within only the first 8 hours. Acetaminophen is in Actifed, Alka-Seltzer Plus, Benadryl, Co-Gesic, Contac, Excedrin, Fioricet, Lortab, Midrin, Norco, Percocet, Robitussin, Sedapap, Sinutab, Sudafed, TheraFlu, Tylenol, Unisom PM Pain, Vick's Nyquil and DayQuil, Vicodin, and Zydone. Being in so many medications that can be used in unison for colds, flu, sleep, and pain make accidental overdose extremely easy so please read the drug facts on the bottles/ box to make sure you don't do more harm than good! Also note that intentional overdose makes a person ineligible for organ transplants. This means a slow and extremely painful death with no escape as your liver fails. You'll have to go to the hospital anyway, so please skip this step and get the help you need! [For](https://www.webmd.com/a-to-z-guides/tylenol-acetaminophen-poisoning) [further](https://emedicine.medscape.com/article/820200-treatment) [reading](https://www.uspharmacist.com/article/acetaminophen-toxicity-what-pharmacists-need-to-know) [check](https://www.ncbi.nlm.nih.gov/books/NBK441917/) [these](https://www.nytimes.com/1994/10/21/us/liver-patient-wins-suit-against-maker-of-tylenol.html) [out](https://en.m.wikipedia.org/wiki/Paracetamol_poisoning)<zombiebeaver772>: Good to know especially after a night of drinking. Maybe aspirin or ibuprofen?<Jerl>: Aspirin after drinking is also a very bad idea, since both alcohol and aspirin can cause stomach bleeding, and taking them together significantly increases the risk. That risk is much smaller with other NSAID's (such as ibuprofen), but still there.<wintervenom123>: What is the risk exactly, everybody in this thread is mentioning possible side effects but no statistics on how common they actually are, without this context this thread is a pointless exercise in listing words we remember. <Edit>: There is no proof that mild to moderate alcohol use significantly increases the risk of upper gastrointestinal bleeding in patients taking aspirin, especially if the aspirin is taken only as needed. However, people who consumed at least 3-5 drinks daily and who regularly took more than 325 mg of aspirin did have a high risk of bleeding. <https>://www.nps.org.au/australian-prescriber/articles/should-consumers-be-warned-about-aspirin-alcohol-and-gastric-bleeding <https>://www.nature.com/articles/ajg1999733 Compared with those who drank less than one drink/wk, the relative risk of acute UGIB increased with increasing alcohol consumption, rising to 2.8 among those who drank ≥21 drinks/wk. Among current drinkers, the relative risk of acute UGIB due to the use of aspirin was raised at all levels of alcohol consumption; the estimate for aspirin taken at least every other day (regular use) at doses of &gt;325 mg among all current drinkers combined was 7.0; for regular use at lower doses, the corresponding estimate was 2.8, and for any occasional use, it was 2.4. All estimates were statistically significant. Data for ibuprofen were more limited, but the relative risk estimates did not appear to vary consistently with level of alcohol consumption. For regular use (all doses combined), the estimate among all drinkers combined was significantly elevated, at 2.7; occasional ibuprofen use was not associated with UGIB (1.2). There were insufficient data to evaluate other NSAIDs according to alcohol consumption. So the risk is minuscule unless you like combining alcoholism with daily aspirin. For occasional alcohol and occasional use of aspirin, what most people do. It is relatively harmless. An interesting thing I found in the study was that never drinkers, with no aspirin or ibuprofen, had a relative risk of 1.5, which is larger than 1 per week drinkers. That's weird and they don't seem to think it's worthy of discussion, lol. Drinking initially has a lowering risk effect then goes to have the opposite. Never drinkers who occasionally took aspirin, had a 1.4,which is lower than the non drinking, non aspirin taking group. Weird again. Edit 2: forgot to finish a sentence. <lgspeck>: Imho taking aspirin for pain doesn't make sense pharmacologically. Its worse than basically all other NSAIDs for pain control and it binds irreversibly to thrombocytes. So some people, and I have had one case similar to this this year, get a really bad headache, and take some aspirin for it. Turns out that headache was an aneurysm that popped. That aspirin just killed that person. So nevermind ulcers... I just watched die hard 3 today and cringed at how many aspirin pills McClane takes, even after multiple head injuries... <wintervenom123>: https://www.rcoa.ac.uk/faculty-of-pain-medicine/opioids-aware/oxford-league-table Well not necessarily worse for pain relief according to the oxford table,which is recommended source of information from this study on NSAIDs effectiveness. <https>://www.ncbi.nlm.nih.gov/pmc/articles/PMC1855338/ 1200mg can be as effective for pain relief as a the dose of morphine they set as control. Just saying. The most effective drugs would have a low NNT of approximately 2. This means that for every two patients who receive the drug, one patient will get at least 50% relief due to the treatment (the other patient may or may not obtain relief but it does not reach the 50% level). A NNT of 2, which is the best, means that 50 out of 100 patients will get at least 50% relief specifically due to the treatment. Another 20 may have a placebo response giving them at least 50% relief. As an example, ibuprofen 400 mg has a NNT of 2.4 on the league table, therefore approximately 62 (42+20) of 100 patients in total will have effective pain relief. For comparison, 10 mg intramuscular morphine with a NNT of 2.9 will provide approximately 54 (34+20) of 100 patients with effective pain relief. Ibuprofen seems more effective for pain relief but not.by much and it's very dose dependent. The most effective is ibuprofen plus paracetamol. I've read papers on pain relief for kids post surgery and it seems to be more effective while having less risks than 5 to 10 mg doses of morphine. <https>://www.ncbi.nlm.nih.gov/pmc/articles/PMC4463911/ Even though a direct comparison of efficacy between different drugs is, in principle, a valuable guide to clinical application, creating an average value with a wide margin of error that lacks applicability to particular clinical scenarios may be problematic. For example, a drug that is well-suited to one pain setting may have a different effect or no effect at all in another. Hence, the information provided in the Oxford League Table should be interpreted in light of the specific pain symptoms, which need to be treated, and used as an approximate guide concerning the relative efficacy of analgesics. <lgspeck>: I'm sceptical about using this table. Notice how 1200 aspirin is disproportionatelly more potent than 1000?<wintervenom123>: I don't share this view. Look at the spread and confidence interval. Aspirin 1000 is slightly bellow 4. While 1200 ranges from 2 to 4, meaning that only fewer data point's were gathered, likely because at that point more potent drugs would be given. So the table is consistent with itself if that was your problem. The Cochrane Collaboration (www.the-cochranelibrary.com) has now published an overview of systematicreviews of single-dose oral analgesics in acute pain. . The overview included 35 separate Cochrane reviews of single-dose oral analgesics tested at different doses in acute postoperative pain models;the reviews included about 350 individual studies with about45,000 patients. It updates and extends the Oxford league table of analgesics in acute pain. The oxford table was made in 2007, this in 2012. I have not been able to find an even newer table but since the studies pretty much agree completly I find it would be of a little use. If you notice here: <https>://www.ncbi.nlm.nih.gov/core/lw/2.0/html/tileshop_pmc/tileshop_pmc_inline.html?title=Click%20on%20image%20to%20zoom&amp;p=PMC3&amp;id=4160790_emss-58356-f0001.jpg Aspirin 1000 has a NNT between 3 and 5, while 1200 between 2 and 3. In neither table is it extremely more.", "num_messages": 8, "avg_score": 371.5}
{"start_date": "1543353306", "end_date": "1543903650", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 70, "text": "<Greenmasters>: YSK Reddit only allows 1000 you to have saved posts at any one time If you save a post when you have 1000 saved Reddit unsaves the first one.<anxious-and-defeated>: Late to the party but does this count comments and posts separately or as part of the whole 1000?<smokeycheesedip>: Whole. Deleted stuff counts too, even though you can't get that stuff back. So it's a 1000 maximum but may well be less.", "num_messages": 3, "avg_score": 23.3333333333}
{"start_date": "1543524874", "end_date": "1543621729", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 9, "text": "<KinnerNevada>: YSK that the US dollar symbol is properly placed in front of the dollar amount, not behind. For example, when writing twenty US dollars, this is right: $20, and this is wrong: 20$ [removed]<WunTewThwee>: It seems sort of counter-intuitive that “United States Dollars” is written as “$20USD” when it’s spoken as “20 United States Dollars”. One of those things I will never get to really know... <Giovanni_Bertuccio>: Just posted this same thing yesterday... Currency is always written with the symbol at the beginning and a period with the required decimals after to prevent alteration of written numbers. If you wrote a check for 1,000.00$ it could easily be altered to something like 11,000.00$. By placing the $ closely followed by the largest digit that can't be done. If you simply wrote $1,000 it could be altered to $1,000,000. If you simply wrote $1,000. it could be altered to $1,000.99. $1,000.00 cannot be altered by simply adding numbers.<guera08>: According to the bank, it doesnt really matter the number in the box, it's the words that matter. I once got a check that had the correct amount in the box, but the wrong written number and the bank said it goes by the written number. (I think it was like the written number was one thousand and ten and the correct number was $1210.00) that was fun, had to get a new check. <WunTewThwee>: Yeah, I’ve seen that the worded variant is the one that matters and that the number variant is there “for convenience” (I’m not sure if it’s for convenience, but it may be for other things which I’m not sure about). My bank says that the payor is legally liable for the amount in words, but I don’t know why... so even if someone stuffs up on writing the numbers, the payor is still liable for the worded variant of the cheque.", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1544905980", "end_date": "1544947576", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3792, "text": "<kaidenmcgreat>: YSK that if you’re unsure what medications do and don’t work together, you can always call Poison Control and ask them what is safe to take or avoid. Never feel bad about this, as their stated purpose is to be a proactive measure as much as a reactive aid This time of year we’re all getting a bit sick and if you’re not sure if you can cross a painkiller with cold medicine or allergy pills it never hurts to ask. Of course, you can always call or visit your pharmacy, but if there isn’t one nearby poison control will always pick up the phone. The American National Poison Control hotline is 1-800-222-1222, but if you live outside the states they will still take your call, and it’s toll free! You can also text ‘POISON’ to 797979, but standard message rates apply [Link for further reading/listening](https://www.wnycstudios.org/story/poison-control) <Edit>: Wow people keep saying you can go to the pharmacy which is funny because I have that written right above this since I posted this. But anyways, here’s why I’d choose poison control: there’s less of a chance you’ll be put on hold, they’re open 24/7 which many pharmacies are not, and if you live rurally or are in the wilderness for whatever reason (nature excursion, camping, skiing, hiking, etc) you have a toll free hotline for when you don’t have access to the internet <wickedplayer494>: &gt;You can also text ‘POISON’ to 797979, but standard message rates apply Not like they exist anymore after all the US carriers realized a war against Apple's iMessage was futile and threw in unlimited SMS, even on the dirt-cheap and prepaid plans.<toddthefrog>: Wut<wickedplayer494>: SMS and MMS used to cost money on US carriers (Canadian carriers too, for that matter). Because Apple's iMessage is the same thing, except it uses the internet instead, carriers realized that there wasn't much sense in waging a war against Apple that they were going to lose anyway, so they decided not to bother giving people a certain number of messages a month and stopped charging for extras or MMS.<toddthefrog>: But what does that have have to do with 'they not existing anymore' and who is they?<bampotkolob>: \"They\" is referring to the standard message rates. <toddthefrog>: Oh OK. Sorry about that", "num_messages": 7, "avg_score": 541.7142857143}
{"start_date": "1544409347", "end_date": "1544482564", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 7241, "text": "<breeogie>: YSK there’s a really good reason to obey 25mph speed limits in neighborhoods: a person is about 70 percent more likely to be killed if they’re struck by a vehicle traveling at 30 mph versus 25 mph. There’s a lot of research out there about this, and the risks definitely change a bit depending on the person’s age and physical condition. But on average, you have a near-100% chance of surviving a vehicle striking you at 25 mph, and only about a 20% chance of walking away ok as the car nears 40 mph. <https>://www.propublica.org/article/unsafe-at-many-speeds <9inety9ine>: Thing is, when you slow cars down, more people walk in the roads, leading to more people getting hit by cars. So it balances out to almost no effect, and in some places, more injuries. <https>://www.telegraph.co.uk/news/2017/12/17/20mph-limit-dangerous-costly-reverse-council-admits/ That's just the first one I found, there's plenty more if you care to look. <spacegirl3>: I would love to walk down my beautiful, tree-lined RESIDENTIAL street and enjoy the turning leaves and holiday decorations, but people decide they want to blast down the street at 40 mph while the limit is 25. <Jennbrin>: As someone who walks through my neighborhood quite often...and as a 40 mph driver through the same streets... We have eyes and ears. We can move. We also can walk on the opposite side of the road so we see oncoming traffic.<thebigeazy>: What about kids? <IrregardlessOfFeels>: If I pull up to a 4 way stop sign in Iowa where I can see 5 miles in every direction am I a piece of shit for blowing through it when no one is there? If you can see everything then you can see everything. If there's cars or houses that can conceal a kid, then, yeah, go slow as something might surprise you. But I'm with the other dude in that my eyes and ears work great and with my knowledge of existence there is no such thing as teleportation. On a different point, I haven't seen a fuckin kid play outside unless mandated by a school for damn near a decade. Those fat fucks don't even go outside anymore let alone run in front of your car because they were playing a sport. In my neigborhood these little cunts come blasting through intersections on the Lime or Bird scooters. They don't give a fuck lmao. <paintvulgarpicture>: &gt;If I pull up to a 4 way stop sign in Iowa where I can see 5 miles in every direction am I a piece of shit for blowing through it when no one is there? Yes. Because no one has ever gotten into an accident thinking they can see what they end up colliding with.<IrregardlessOfFeels>: Sorry for the loss of your eyesight but mine is fine. <tspike>: This is the kind of argument where you're right until you're wrong and then it doesn't matter.<IrregardlessOfFeels>: So you're saying when teleportation exists my argument will be wrong? Thanks for the resounding support buddy. <tspike>: No I'm referring to your insistence that you're incapable of making mistakes. I hope when you realize that not all of your assumptions are correct that you don't hurt anyone (including yourself!)<IrregardlessOfFeels>: I'm so confused. Are you saying my eyes are making assumptions every time I do or do not see something?<tspike>: Absolutely. Vision is fundamentally built on assumptions to enable us to process information more quickly. A great example is the phenomenon of \"change blindness,\" which even people with perfect vision experience. More fundamentally though, I'm talking about making an assumption that you are correct so strongly that you're willing to put other people's lives and health on the line to prove it. Maybe you are right. Great. I hope you are. But what if you're not?", "num_messages": 13, "avg_score": 557.0}
{"start_date": "1543627312", "end_date": "1543824411", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 10883, "text": "<PrioriIncantatem>: YSK That Chiropractic upper spine manipulation is associated with serious injury and stroke. [Here is a link to a literature review that concludes significant risk.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1905885/) &gt;Spinal manipulation, particularly when performed on the upper spine, is frequently associated with mild to moderate adverse effects. It can also result in serious complications such as vertebral artery dissection followed by stroke. Currently, the incidence of such events is not known. In the interest of patient safety we should reconsider our policy towards the routine use of spinal manipulation. I know a lot of people love going to the chiropractor. A close friend of mine just spent Thanksgiving in the ICU with her husband; he had a vascular dissection that the doctor thinks is likely from neck manipulations, that led to a series of strokes. He's now in long term rehab. He is *uninsured.* It's super fucked up that this isn't common knowledge, regardless of how \"rare\" it might be. &amp;#x200B; They think he should be able to make a full recovery, but it's going to take a good long while. <micahhorner>: Chiropractic just gets more fascinating and absurd the more you look into it. A profession-wide survey, [How Chiropractors Think and Practice (2003)](https://www.sciencedirect.com/science/article/pii/S1543115004000377), published by the Institute for Social Research at Ohio Northern University, confirmed that the MAJORITY of chiropractors still hold views of \"Innate\" as the cause and cure of ALL disease (not just back pain), consistent with the beliefs of the founder of chiropractic, D.D. Palmer. In case you're confused, and wondering what \"Innate\" is: \"In 1895, a magnetic healer named D. D. Palmer adjusted a deaf man’s back and allegedly restored his hearing. He decided that when a bone was out of place, it pressed on a nerve and impaired the flow of \"Innate\" (always capitalized), his word for a **mythical vitalistic force** that allowed the body to heal itself. At one point he talked of establishing chiropractic as a religion\". [https://sciencebasedmedicine.org/science-and-chiropractic/](https://sciencebasedmedicine.org/science-and-chiropractic/) <EDIT>: I forgot the most bizarre part. D.D. Palmer claims he got his knowledge of \"Innate\" from a ghost: <https>://www.latimes.com/business/lazarus/la-fi-lazarus-chiropractic-quackery-20170630-story.html D.D. and his son B.J. also became bitter rivals. B.J. ran D.D. over and killed him. He then took over his dad's business and became mega rich. No idea why a good biopic or mini-series hasn't been made. It's such a wacky and fascinating story. Tarantino would have a field day.<orange_fuckin_peel>: as ridiculous as it sounds, is that not IMPOSSIBLE ?<micahhorner>: Anything is *possible*. The question is, what evidence is there that it's *true*? So far, the field of chiropractic can provide none.<orange_fuckin_peel>: Got to delete comment, the replies are getting insanely off topic even after explaining that they're arguing something different lol<d9_m_5>: That's not how the burden of proof works. Modern medicine makes provable predictions, so if it shouldn't work given how we know the body works, we shouldn't just assume it could be true. That is, the null hypothesis should be that any given unscientific claim in this area is false.<bigbigpure1>: devils advocate here so science is a theory right, a lot of what we claim to know is based on assumptions that cant be proved so by your logic why should we trust science and by extension modern medicine we dont look at things and know this does long list of effects goes here its more like we we observe the effects so we know what the effects tend to be, it does not mean we understand those effects or even why it is like it is or does what it does, we often just know it does e.g a hell of a lot of meds dealing with the brain so we can observe that a chiropractor can do good work, we dont know why but we can make that observation, so why is it better to trust observations of people who have a stake in it (people fund studies get the results they want all of the time) over people who have been helped by it we can take it further and look at certain practices in Chinese medicine and see a similar belief in a flow of the bodies energy, so its not like this belief is a one off, it has came to be popular across multiple countries &gt;. Modern medicine makes provable predictions, so if it shouldn't work given how we know the body works i think you may want to do some digging on that here is a good start https://ideas.ted.com/the-hidden-truth-about-our-prescription-medications/ <edit>: https://en.wikipedia.org/wiki/Replication_crisis try to remember im playing the devils advocate, i am not anti science or modern medicine but its important to look at it sceptically given the current crisis we are facing as to not lose credibility<TheSecondHuman>: I didn’t read your argument because I got annoyed right at the start. Science isn’t a theory, it’s a body of knowledge capable of self-correction through a standard method (i.e. the scientific method). Please refrain from arguing points of view about topics you obviously know nothing about. <bigbigpure1>: im putting this at the top not the bottom since you dont seem to read very far Darwin's theory of evolution collision theory, kinetic theory of gases, Lewis theory, molecular theory, molecular orbital theory, transition state theory, valence bond theory.Biology: cell theory, theory of evolution, germ theory, particulate inheritance theory, dual inheritance theory. noticing a pattern here bud? the people who know about these fields are calling it a theory maybe you should tell them Science isn’t a theory <https>://en.wikipedia.org/wiki/Scientific_theory &gt; it’s a body of knowledge capable of self-correction through a standard method definition of theory \"a supposition or a system of ideas intended to explain something, especially one based on general principles independent of the thing to be explained.\" its a theory &gt; Please refrain from arguing points of view about topics you obviously know nothing about. said the person who did not read the argument but at the end of the day, its a theory, all science is theory its often the best one we have but pretending its not a theory is just silly &gt;Please refrain from arguing points of view about topics you obviously know nothing about. i have no problem with you arguing about something you dont seem to know anything about bud, how else will you improve, but at least read the damn post before responding. <TheSecondHuman>: Cute, but you obviously still have no idea what you're talking about. All you've done is list theories within the scientific disciplines. Did you bother reading the link that you just posted? Here, let me help you. A scientific theory is not a science, it is an accumulation of data-supported hypotheses that attempt to explain phenomena in the natural world. The definition from your link: &gt;A scientific theory is an explanation of an aspect of the natural world that can be repeatedly tested and verified in accordance with the scientific method, using accepted protocols of observation, measurement, and evaluation of results. Lookie there, pretty much the same except my definition is simpler. Now, if we look through that wikipedia page you linked, we can skim through and we see a link in the form of \"disciplines of science.\" The \"disciplines\" of course being chemistry, physics, biology, etc. Now, on THAT page, we see a link called the \"sciences.\" If we click here we get--whaddya know, pal!--the wikipedia article for SCIENCE. WHICH IS DEFINED AS SUCH: &gt;Science (from Latin scientia, meaning \"knowledge\")[1] is a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe. Which is, basically, a much more thorough and complete definition than mine, but similar nonetheless. So thanks for helping me prove my point.<bigbigpure1>: so a theory is a system of ideas intended to explain something Science (from Latin scientia, meaning \"knowledge\")[1] is a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe. so how is it not a theory a \"is a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions\" is a \"system of ideas intended to explain something\" &gt;All you've done is list theories within the scientific disciplines. what else is there? a discipline is how we group the theories together, its simply a specific branch of knowledge so you are not disproving what im saying, i think you missed the point of it too &gt;So thanks for helping me prove my point same to you i guess <imVINCE>: Bro you have literally no clue how science works.<bigbigpure1>: well if that is true then the university of Berkeley also has no clue how science works... <https>://undsci.berkeley.edu/article/howscienceworks_19 you cant have science with out theory, all of science is based on one theory or another even down to how we measure things which i go in to with another person if you are interested <Sloppy1sts>: You are saying that science itself is a theory. No, science is a methodology to learn and apply new information. Science is how you create sound theories. Science itself is not a testable hypothesis supported by evidence. Science is not a theory. And Berkley is not saying that science is a theory. &gt;you cant have science with out theory, all of science is based on one theory or another even down to how we measure things which i go in to with another person if you are interested This is all true, but what you seem to be saying is that, because you can't have science without theories (true) that science *is* a theory (false). No. Science is used to create theories but that does not mean science itself is a theory.<bigbigpure1>: this is the simplest explanation i can find <https>://www.forbes.com/sites/startswithabang/2017/11/22/scientific-proof-is-a-myth/ &gt;Science itself is not a testable hypothesis so how do you know science works? &gt; supported by evidence do you really think science is not supported by evidence? so we know that science works because it has been tested so it checks off your first point, we have lots of evidence supporting the usefulness of science so theres your second again you misunderstand the meaning of the words used, a hypothesis is not a theory, its guess based on little information<Sloppy1sts>: No, *you're* not understanding what I mean when I say \"science\". Your link talking about scientific theories in the same way I am. You're equating \"science\" with \"scientific theories\". When I say \"science\" I mean doing the things required to create and test a scientific theory. &gt;so how do you know science works? Logic? \"If we test this and it works, it works\". No duh? &gt;do you really think science is not supported by evidence? I mean, I guess you could test how well the scientific method works. That's a phrase I should have used earlier, and it's what I'm getting at. Science is the scientific method of testing hypotheses and creating theories from the results. &gt;again you misunderstand the meaning of the words used, a hypothesis is not a theory, its guess based on little information That is an insignificant and frankly irrelevant part of my comment that you've latched on to in an attempt to prove me wrong. Hypotheses become or are turned into theories as their supporting evidence grows or manipulates our understanding of the situation.<bigbigpure1>: &gt;you've latched on to in an attempt to prove me wrong. now that is some projection right there, of my comment you desided to talk about if science is technically a theory or not &gt;. That's a phrase I should have used earlier, and it's what I'm getting at. Science is the scientific method of testing hypotheses and creating theories from the results. \"Science is the scientific method of testing hypotheses \" \"A scientific theory is an explanation of an aspect of the natural world that can be repeatedly tested and verified in accordance with the scientific method\" so its a theory, science is the theory of how we do science", "num_messages": 17, "avg_score": 640.1764705882}
{"start_date": "1543599828", "end_date": "1543684581", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 123, "text": "<Gorillaz_RWBY>: YSK that when censoring usernames for a post you should never use the marker, because even if its see-through at first glance, it never fully covers the text below (example in description) WHY should you know this? I keep seeing this and I want people to know that it's not a safe way of censoring a name, example in comments<deepfield67>: I feel like the data is probably still there regardless, if someone were *really* bored they could probably recover it from the file somehow maybe? Might be better to select and cut the name right off the image. Not sure if even that would be entirely effective tho. I'm really curious now. This requires more research... Good post tho, OP! Got me thinking!<RedditTab>: The file formats that are uploaded to sites like imgur dont support layers, so this isn't a concern. What you see is what you get; the only concern here is when people dont understand the tools they're using.<deepfield67>: This is one of the main differences between the .jpg and .png file formats, correct? Preserved layers?<RedditTab>: Not in this context. Png has an alpha layer (transparent \"color\"), jpg does not. .psd (photoshop) files preserve the work environment of the artist. This includes all of the layers (think pieces of paper that overlap to create art). Sometimes artists will apply effects to individual layers, or use layers as a mask and apply to all of the other layers and save the results as a jpg or png for sharing. For this reason, if anyone contracts digital artists for their work you should negotiate up front based on which file(s) you receive. (Will you edit it later or not?) <Source>: I'm a game dev hobbyist that uses these programs to support that. Additionally, I'm a business analyst/project manager that works with professional artists. As a side note:if you take pictures with your phone disable GPS meta data before sharing your pictures. Unrelated to the original post but related to the concept of what's shared with files. Facebook used to be a gold mine of creepy stalking before they started filtering the data for users.<deepfield67>: Awesome answer! Thank you for taking the time to explain. If I can trouble you for just a bit more info. What is the purpose of the alpha layer in .PNG files?<RedditTab>: An alpha layer tells the computer where not to draw anything. Imagine a logo, like Ford's, where it is oval shaped. If you dont have a logo with a transparent layer the \"not oval\" part will end up having to be white (or maybe black). This means if you put the logo on top of another image or different color background you'll clearly see the white rectangle around the logo. With a transparent layer the artist can erase or delete the white background and save it for use so that only the logo is visible. The end result is, when you're stacking it on other images, you'll only see the logo and not the \"white space\" around it. This I'd especially vital for website and game design, because all image files are rectangular, but not all images fill the canvas. (So, whitespace or deadspace). The downside is that pngs are usually larger to compensate. (They have more data to store). However, this size is typically negligible. (Especially if you use a service like tinypng which does some magic to shrink the file size tremendously).<deepfield67>: Thank you! That all makes perfect sense.", "num_messages": 8, "avg_score": 15.375}
{"start_date": "1543628131", "end_date": "1543650153", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 50, "text": "[deleted]: YSK that if you do not want your family knowing about your abortion, AidAccess.org will mail you the abortion pills for a donation amount of your choice. [removed]<KJoRN81>: They can legally mail the pills to states where abortion isn’t allowed??<cand86>: [It was reported last month](https://www.thedailybeast.com/us-abortion-pill-website-aid-access-under-investigation-by-the-fda) that they were under investigation by the FDA, but as far as I know, they are still operating. Women on Web (a service that does the same for countries worldwide the restrict abortion) states the following on its website regarding Aid Access: &gt;\"For information about possible legal issues concerning doing a medical abortion at home using the Aid Access service, please see the SIA Legal Team for more information or contact them through SIALegalTeam@protonmail.org or https://www.sialegalteam.org/secure or call the legal helpline at 1.844.868.2812. A summary of legal issues relevant to those considering self-managed abortion is also available from Plan C (include link to https://plan-c.squarespace.com/faq).\" [This article](https://www.theatlantic.com/health/archive/2018/10/women-on-web-safe-abortion-mail/573322/) is also very illuminating- it explains how the pills are shipped from a trusted Indian pharmacy, under the presumption that \"the FDA allows people to import medicines for their personal use.\"<KJoRN81>: Hey thanks for the info!!", "num_messages": 4, "avg_score": 12.5}
{"start_date": "1544934233", "end_date": "1544936625", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 4, "text": "[deleted]: YSK that, if a professional has a rolling chair or stool in their office or work area, they probably need it for sitting on and you shouldn't put your coat on it. [removed]<MikeOxbigger>: Did you seriously just give a public service announcement that states if someone has a chair, they probably need it for sitting on?<5RabbitsInALongCoat>: Someone else put their stuff on my chair today and I'm tired of it. It happens like once a week. My co-worker used to deliberately place a single folded towel onto theirs to keep people from doing it, and occasionally someone would move the towel to make room for their coat. So, yeah. Spread the word. <FanRose>: Put up a sign at your workplace then. Problem solved", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1544061919", "end_date": "1544940172", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 17, "text": "<deacon_of_fire>: YSK: Siri can fast forward a song or podcast any amount of time if you ask. Driving around and want to get to the favorite part of a song just tell Siri to fast forward one minute. Keep going until you get to the part wanted. Saves looking at your phone and accidents. \"Siri fast forward thirty seconds.\"<duffmannn>: Can Alexa? <Ourius>: Yes", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1544632289", "end_date": "1545116444", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 41, "text": "<JaththeGod>: YSK that you can change your iPhone video quality Go to Settings&gt;Camera&gt;Record Video. Noticed from another post that people did not know that you can change not only the definition but also the fps. The only downside is that it takes more memory, but your videos will look a lot nicer.<heroin_father>: I told my friends about how smooth my camera is by “downgrading” my resolution to 1080p, giving me a 60Hz refresh rate. Those little shits think that they can see some true 4K on their flagship iPhones.<JaththeGod>: Are you telling me 1080p 60 fps is better than 4K 60 FPS?<heroin_father>: I’m pretty sure all iPhones (6s and up) can record 2160p resolution at maximum refresh rate of 30FPS.<Plain_cool>: Nope, the iPhone X and above can record 4k@60fps", "num_messages": 5, "avg_score": 8.2}
{"start_date": "1543888025", "end_date": "1543968217", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 18750, "text": "<SSSS_car_go>: YSK that the US Post Office has a program called Informed Delivery. Sign up and every morning they will send you an email with scanned images of all the mail they will deliver later that same day. [Here](https://informeddelivery.usps.com/box/pages/intro/start.action) is the link.<oEMPYREo>: This YSK saves my butt awhile back. My HOA sent me a written warning letter (about my dog’s tags) that I never received. They showed that they mailed it weeks prior and then later sent the $250 fine letter for not complying with the earlier warning. I tried to explain to them that I never received the warning, only the fine. They had in their notes that they sent it correctly (which they did). For whatever reason the first warning took weeks to deliver with the post office. I log on here and was able to show the delivery date of the warning letter as weeks later by matching the numbers on the envelope and they reversed the fine. <Only1Javi>: Screw your shitty hoa. Who has time for that kind of crap? <deedoedee>: HOA. HOA has time for that. You pay them to harass you and write you tickets, basically.<durbblurb>: You pay them to harass others. You're supposed to be better than the rest, right?<PublicFigureX>: You pay them to help manage the neighborhood. Shitty people take it too far. There are always going to be people who love bureaucracy and they weasel their way in to every organization and fuck up a good system. Then there will be people who fucking love enforcing rules, regardless of how ridiculous or inconsequential, and they'll work their claws wherever they can. They'll fucking demand consequences for not following the rules, just so they can have a reason to enact some small amount of force. That's how you end up with stupid ass fines for having your trashcans in the wrong place, and someone doing actual jail time because his grass won't grow.<redditortoo>: &gt; You pay them to help manage the neighborhood. No. That's why you pay taxes. If you have an HOA, you willfully added another bureaucracy to your life for no reason.<Brettuss>: I will disagree with that. I live in a neighborhood with an HOA. They negotiate neighborhood trash contracts, deal with the logistics of renting the clubhouse, organize the pool opening/closing every year, throw neighborhood parties on major holidays, arrange repair and maintenance of all neighborhood property (installation of pathways, mowing, basketball court stuff) they’ve helped arrange funds for neighbors in need, organize neighborhood garage sales, etc etc etc etc. Given what we receive in services, the fee is completely acceptable to me. I live in a nice neighborhood, and that is in no small part because of the efforts of the HOA to maintain and improve.<jasmineearlgrey>: It's so fucked up that Americans are OK with being forced to pay for this stuff, but they absolutely shit themselves when someone suggests that healthcare should be available to everyone.<anonredditor0810>: People don't mind paying for this stuff because they are choosing to. In regard to free Healthcare for everyone, I think everyone agrees that that would be nice if it was possible. It's too expensive to provide free Healthcare to this whole country. <anderander>: I thought membership into HOA is pretty much required if you buy a house in its \"jurisdictions\".<SuperFLEB>: Yes, but you don't *have* to buy in a subdivision or condo community. <anderander>: But I really like that house. Why are you forcing me to pay nosy people to tell me what I do with my property just because I like the aesthetics of this particular house in my price range that's a convenient commute to my job? I mean the US isn't barring you from moving to another country with lower taxes are they?<SuperFLEB>: Strictly speaking, because it's my house and I'm not going to give it to you unless you agree to my terms of transfer. Or because someone who used to own it before me said so and put it in a deed restriction. You could just as well say \"I really like that house, why do I have to pay for it?\"<anderander>: Nope. I paid for the goods I don't want to pay for those services. Last guy had internet, TV and phone by Verizon. I want internet from Verizon, Do the, and no phone service. You're getting forced into this service like you say taxes for universal healthcare would be.", "num_messages": 15, "avg_score": 1250.0}
{"start_date": "1544946057", "end_date": "1544956705", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 30, "text": "[deleted]: YSK that if you use internet over a free VPN, you risk getting shadowbanned from your favorite websites due to sharing an IP with bad people. Instead, find a way to pay for a dedicated IP that's not shared with anybody. [deleted]<djalijacobs>: In case you don't know- Reddit secretly does this thing I call the \"Snowball effect\" where if you use reddit long enough, eventually the algorithm relaxes its spam filters and allows your posts to go get more eyes on them than say a 5 day old account would. More eyes means more people up/downvoting your comment, so as long as your posts remain civil and helpful- then it becomes easy to get anywhere between 10 to 60 upvotes every other post, so long as you're not a spammer or a shitposter. <caseyrobinson2>: do you know why in some subedit i have high karma but yet i can only post every 7 minutes", "num_messages": 3, "avg_score": 10.0}
{"start_date": "1544950220", "end_date": "1544988147", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 203, "text": "<Castaneda4>: YSK That If You Don't Boil Water and Let It Cool Before Using a Neti Pot, You Might Die From Bacteria Eating Your Brain Bacteria can go from your sinuses to your brain. It's rare, but it happens. Probably more than we know, because it could just look like a sudden but natural death. Boiling appears to be sufficient. [https://www.supplementdb.org/news/brain-eating-amoeba-from-neti-pot-kills-seattle-woman/](https://www.supplementdb.org/news/brain-eating-amoeba-from-neti-pot-kills-seattle-woman/) Journal article/source: [https://www.ijidonline.com/article/S1201-9712(18)34525-9/pdf](https://www.ijidonline.com/article/S1201-9712(18)34525-9/pdf)<54338042094230895435>: 41 years of life and I have never needed a Neti Pot. This post makes me not want to start. Random question though, what about getting \"water up your nose\" that full sinus' feeling you get when swimming etc. Am I in the same danger?<Lung_doc>: Potentially, mostly only if you are a child though. On average there are about two cases per year, almost always in kids. The amoeba is found in fresh water lakes and slow moving rivers, especially at warmer temps. Kids are thought to be at risk because their skull isn't fully developed, and there are small gaps where the amoeba can travel through the holes where nerves for smell go from your nose to your brain. But even in kids it's very rare, as millions of kids swim in areas where the amoeba lives every year. (Meaning we are all better off worrying about our diets, exercise, not smoking etc)<54338042094230895435>: Thanks, I only question it because I roll my kayak all the time and always fill my sinus' with water.", "num_messages": 4, "avg_score": 50.75}
{"start_date": "1543851145", "end_date": "1544055533", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 58, "text": "<Jessie_James>: YSK: If you have gift cards with a small, \"unusable\" balance, just buy an Amazon eGift card for that exact amount - as little as $1. Now you can use the full amount of your gift cards! Recently, I had less than $10 on a handful of **Visa** (credit card type, not STORE) gift cards, but there's no way to use multiple cards to checkout online, and it's virtually impossible to buy something for that exact amount anyway. Just head over to Amazon and you can buy **eGift** (note - not the regular cards) for any amount. Now you can use every penny of gift cards you may have or receive! <xaphans>: Sidenote: there' s also a site called CardSwap that will switch out any gift card for real cash.<AnomalousAvocado>: What's their cut %?<xaphans>: Depends on the amount, gift card, etc. Max is 8%, however.<AnomalousAvocado>: Got excited but it looks like the site is just for Canada? I used another site like this years ago but I remember the cut was bigger.", "num_messages": 5, "avg_score": 11.6}
{"start_date": "1544145635", "end_date": "1544978554", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 127, "text": "<karmatic89>: YSK: The age old advice to \"drink 8 glasses of water a day\" is false. Drink when you're thirsty. This is your reminder to take a drink if you are. Link in comments!<acidyen>: This is poor advice. If you feel thirsty, you're already on the way to being dehydrated. I'm not saying to over drink water, but don't 'wait till you're thirsty'.<Malthetalthe>: I'd love to see your sources. Do you think our ancestors all died of thirst because they didn't have ads from beverage companies telling them to drink all the time? No, we developed thirst so we know when to drink. Saying you're on the way to being dehydrated when you're thirsty is like saying when you're hungry, you're on your way to starve to death.<acidyen>: It's something that was always told to us in the military, but that doesn't make it the absolute truth. Neither does this interview with Dr Scott Youngquist, but at least it's a Dr giving his opinion on dehydration: <https>://healthcare.utah.edu/the-scope/shows.php?shows=0_rry1htrr", "num_messages": 4, "avg_score": 31.75}
{"start_date": "1544985028", "end_date": "1545008670", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 611, "text": "<cquindara>: YSK that in the US, you can buy books of stamps at most grocery stores. [removed]<sk8rcrash>: And what would you do with said stamps?<ThreeLeggedTranny>: My last car had a $20 “convenience” fee PER PAYMENT to pay online. Guess who got 36 checks in the mail?<sk8rcrash>: According to Google, stamps are 50¢ a piece. You paid an additional $18? <ThreeLeggedTranny>: $18 to mail them or $720 to pay online. Pretty much a no brainer. <sk8rcrash>: Ohh. I misread. Sounds like a real shitty tactic.", "num_messages": 6, "avg_score": 101.8333333333}
{"start_date": "1543556874", "end_date": "1543687103", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 179, "text": "<protegehype>: YSK: The United States Post Office sells your change of address information to more than 500 companies. [How The Post Office Sells Your Address Update To Anyone Who Pays (And The Little-Known Loophole To Opt Out)](https://www.forbes.com/sites/adamtanner/2013/07/08/how-the-post-office-sells-your-new-address-with-anyone-who-pays-and-the-little-known-loophole-to-opt-out/#2cb4f2eb39f3) USPS's own Inspector General has [questioned](https://www.washingtonpost.com/news/federal-eye/wp/2014/10/06/millions-of-change-of-address-records-at-security-risk-watchdog-says/?utm_term=.0cc79e44f478) the data handling practices of the agency. <Shake_Nn_Bake>: Well this is horse shit<gonads6969>: It's actually quite useful. Got letters only from services that I had business with asking me to change my address with them officially.", "num_messages": 3, "avg_score": 59.6666666667}
{"start_date": "1543209831", "end_date": "1543614534", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 49, "text": "<Simpuhl>: YSK Immunization Schedule (Vaccinations) Birth <HepB>: Hepatitis B vaccine. Ideally, the first dose is given within 24 hours of birth, but kids not previously immunized can get it at any age. Some low birth weight infants will get it at 1 month or when they're discharged from the hospital. 1–2 months <HepB>: Second dose should be given 1 to 2 months after the first dose. 2 months <DTaP>: Diphtheria, tetanus, and acellular pertussis vaccine <Hib>: Haemophilus influenzae type b vaccine <IPV>: Inactivated poliovirus vaccine <PCV>: Pneumococcal conjugate vaccine <RV>: Rotavirus vaccine 4 months DTaP Hib IPV PCV RV 6 months DTaP <Hib>: This third dose may be needed, depending on the brand of vaccine used in previous Hib immunizations. PCV <RV>: This third dose may be needed, depending on the brand of vaccine used in previous RV immunizations. 6 months and annually Influenza (Flu): The flu vaccine is recommended every year for children 6 months and older: Kids younger than 9 who get the flu vaccine for the first time (or who have only had one dose before July 2017) will get it in two separate doses at least a month apart. Those younger than 9 who have had at least two doses of flu vaccine previously (in the same or different seasons) will only need one dose. Kids older than 9 only need one dose. The vaccine is given by injection with a needle (the flu shot) or by nasal spray. The flu shot is preferred for children of all ages because it has been shown to be safe and effective. Although the nasal spray was not used in recent years, a changed version of it is now recommended (for the 2018–2019 flu season) for kids who may otherwise not get a flu shot. The nasal spray is only for healthy people ages 2 through 49. People with weakened immune systems or some health conditions (such as asthma) and pregnant women should not get the nasal spray vaccine. 6–18 months HepB IPV 12–15 months Hib <MMR>: Measles, mumps, and rubella (German measles) vaccine PCV Chickenpox (varicella) 12–23 months <HepA>: Hepatitis A vaccine; given as two shots at least 6 months apart 15–18 months DTaP 4–6 years DTaP MMR IPV Varicella 11–12 years <HPV>: Human papillomavirus vaccine, given in two shots over a 6- to 12-month period. It can be given as early as age 9. For teens and young adults ages 15–26, it is given in three shots over 6 months. It's recommended for both girls and boys to prevent genital warts and some types of cancer. <Tdap>: Tetanus, diphtheria, and pertussis booster. Also recommended during each pregnancy a woman has. Meningococcal conjugate vaccine:And a booster dose is recommended at age 16. 16–18 years Meningococcal B vaccine (MenB): The MenB vaccine may be given to kids and teens in two or three doses, depending on the brand. Unlike the meningococcal conjugate vaccine, which is recommended, the MenB vaccine is given at the discretion of the doctor. Special circumstances HepA is also recommended for kids 2 years and older and adults who are at high risk for the disease. This includes people who live in, travel to, or adopt children from areas with high rates of hepatitis A; people with clotting disorders; and people with chronic liver disease. The vaccine also can be given to anyone who desires immunity to the disease, and is useful for staff at childcare facilities or schools where they may be at risk of exposure. The MMR vaccine can be given to babies as young as 6 months old if they will be traveling internationally. These children should still get the recommended routine doses at 12–15 months and 4–6 years of age, but can get the second dose as early as 4 weeks after the first if they will still be traveling and at risk. During a mumps outbreak, children older than 1 year of age who are in close contact with infected people should get another dose of the vaccine, no matter how many doses they have already had. The flu vaccine is especially important for kids who are at risk for health problems from the flu. High-risk groups include, but aren't limited to, kids younger than 5 years old and those with chronic medical conditions, such as asthma, heart problems, sickle cell disease, diabetes, or HIV. The meningococcal vaccines can be given to kids as young as 8 weeks old (depending on the brand of vaccine) who are at risk for a meningococcal infection, such as meningitis. This includes children with certain immune disorders. Kids who live in (or will be traveling to) countries where meningitis is common, or where there is an outbreak, should also get the vaccine. Pneumococcal vaccines also can be given to older kids (age 2 and up) who have conditions that affect their immune systems, such as asplenia or HIV infection, or other conditions, like a cochlear implant, chronic heart disease, or chronic lung disease. <Source>: https://kidshealth.org/en/parents/immunization-chart.html<justalilblowby>: YSalsoK, all vaccines have formaldehyde, tolulene, aborted human fetal cells, DNA/other growth mediums from other species such as bovine, porcine, mokey, chicken cells., aluminium and mercury as adjuvants (which are know to be Neuro and cardio toxic.<agentMICHAELscarnTLM>: Jesus Christ man. Get a fucking grip and actually research the shit you’re saying instead of just regurgitating idiotic anti-vax talking points.<K0KA42>: Now, now... Let the man speak. I'm very interested in hearing about the mokey cells.<agentMICHAELscarnTLM>: I looked at their post history. In another thread they said that “no disease is preventable”<Snakefangox>: They should tell that to smallpox.", "num_messages": 6, "avg_score": 8.1666666667}
{"start_date": "1544497480", "end_date": "1544569062", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 1868, "text": "[deleted]: YSK that you can opt out of ad customisation [deleted]<saltysupreme>: If I have to see ads, I expect them to be molded off the things I search for as well as the conversations I thought I was having in private.<jvnane>: Well if you're going to see ads regardless, wouldn't you prefer them to be relevant? And they certainly aren't basing ads off your private conversations. <capndipshit>: Certain apps are 100% basing ads off your private conversations.<jvnane>: Got some examples? And this post is in the context of Google. That's who I meant by \"they.\"<icahart>: Instagram<jvnane>: [The idea that instagram/facebook is listening to conversations is a myth.](https://www.theverge.com/2018/4/13/17229912/facebook-microphone-listening-instagram-conspiracy) First of all, it's not technologically feasible to move around that much audio data. Second of all, this would be easily verifiable and noticeable in terms of data usage and battery consumption. Facebook doesn't need to listen to conversations to have creepily targeted ads. Their whole platform is a massive neural network of information. A friend of a friend could like something you recently talked about, and it would seem as if it showed up only because you talked about it. This leads to the growing myths due to confirmation bias.<tspike>: It's definitely feasible, but I doubt they do it. Phones are powerful these days. You don't have to upload raw audio data, you can just do limited on-device analysis and upload the results. <jvnane>: That on device processing would still drain the battery very quickly. It's not feasible unless you don't mind everyone who uses your app to uninstall it.<tspike>: Not necessarily (with enough engineering effort).", "num_messages": 10, "avg_score": 186.8}
{"start_date": "1543305399", "end_date": "1543336065", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 733, "text": "<SiliconLemming>: YSK about Neovascularisation if you wear contact lenses for extended periods of time. Continuous use without allowing time for your eyes to recover can result in the tissue feeling starved of oxygen, even in high oxygen transmission lenses. This results in the eye growing new blood vessels to supply the tissue. This presents as red rings around the iris. Providing relief to the eye can alleviate the redness, but carves \"trenches\" into the tissue that allows the regrowth to occur much faster if you return to the same habits.<Nobodyville>: I wear AirOptix by CibaVision for this exact reason, they allow much more air through than a regular set of contacts. I'm sure there are similar brands out there. I have never slept in my contacts save a few nights here or there, but I've worn contacts for upwards of 25 years. I was getting neovascularization around my cornea and so I switched lenses. It literally felt like an air conditioner blowing in my eyes for about a week until I acclimated, but since then my eye doc informs me the little veins have emptied and shrunk. So if this is a concern know you can ask your optometrist/ ophthalmologist about different lens options. Also know, if you're a long term diabetic or uncontrolled diabetic you can get neovascularization on the back of your eye which can cause bleeding and damage, even blindness. There are laser treatments and injections to control it (yes, injections into your eyeball) . . . But it's best not to have this problem to begin with. If you think it's an issue get to an ophthalmologist and get checked. (Source: family member has this problem, gets injections every 6 weeks) <Edit>: words Edit 2: correcting the contact lens brand.<atreyal>: Yes, injections to the eyeball dont sound like a good time. <lmike215>: It's a VEGF (forgot what that stands for) inhibitor injection. Basically this medication prevents the growth of new vasculature, preventing neovascularization in the eye. Now that I think of it, VEGF might stand for vascular endothelial growth factor. So if you inhibit the growth factor, then you won't get vascular growth. <Source>: med student not applying into ophthalmology bc I am deathly afraid of eyes.<atreyal>: Interesting. Though that seems like a window washer who is afraid if heights. <lmike215>: Hopefully they're ground level windows.<atreyal>: Lol. Good luck to you with your eye stuff. <lmike215>: Oh I'm not applying into eye stuff, my original post must have been confusing. I find eyes scary so I avoid them at all costs.<atreyal>: Oh okay. I thought you had an eye phobia and were making a career out if it. Well this makes a bit more sense.", "num_messages": 9, "avg_score": 81.4444444444}
{"start_date": "1545004373", "end_date": "1545208065", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3023, "text": "<autumngirl11>: YSK that synthetic weed (spice or K2) can cause something worse than death when you use it, especially the first time, and it can ruin your children and loved ones' lives. This is a PSA due to higher-than-normal levels of stress and drug use at this time of the year. Synthetic drugs cause you to live in your own tortured existence - a fate worse than death. &amp;#x200B; My ex-husband was a high-level IT Engineer/Exec. After doing synthetic weed with a new girlfriend, he went into permanent psychosis due to actual brain damage from Spice/K2/etc. (She did too, but I don't know whatever happened to her). Over the course of a year he'd attacked the police, stolen his children and told them bad people were trying to hurt them, ruined the computer hardware and networks of an employer (he thought FBI was after him), tried to kidnap his oldest daughter from her mom, and woke up with a head wound 4 states away with no idea how he got there but tried to blame it on me and the government. He destroyed our kids' lives financially and emotionally - between therapy costs to deal with the trauma, complete lack of child support from him, lack of health benefits, and one day he just left the country and is now overseas in a mental hospital... I work but live in a high-cost area. I make too much to qualify for any benefits of any kind. The state can't help because he's overseas. Disability can't help because he's too paranoid to apply for benefits. &amp;#x200B; All because he was stressed out and wanted to get high without it showing up on a drug test. Please don't do it. If one person reading this is helped, then I'm grateful. Happy holidays, all. Make good choices. www.forbes.com/sites/melaniehaiken/2013/06/29/spice-or-synthetic-marijuana-may-cause-psychosis-brain-and-kidney-damage/amp/ Edit to add 2nd article due to doubters: https://www.scientificamerican.com/article/the-spice-of-death-the-science-behind-tainted-synthetic-marijuana/ &amp;#x200B; &amp;#x200B;<_hanginround>: 100% agree spice is bad. However it sounds like your husband may have had some underlying psychological issues. This sounds like schizophrenia.<autumngirl11>: In a brain scan, parts of his brain had died.....<eVPlays>: Look, I don’t mean to be a dick, nor am I advocating for drug use, but I’m calling bullshit on that. [No where on the government site for drug abuse, does it list that severe brain damage is a symptom or side effect of K2/Spice](https://www.drugabuse.gov/publications/drugfacts/synthetic-cannabinoids-k2spice). While the Kidney damage and other side effects still stand, I’m calling bullshit on it causing that kind of brain damage. More than likely, whatever he took triggered an early onset of schizophrenia<AntLib>: These chemicals change constantly to get past the laws and remain sellable so it is impossible to say what you're actually ingesting and what problems it will cause. The chemicals in spice are different than when it had first come out<eVPlays>: I understand that, but the article OP linked to was authored in 2013, the government site was last revised February 2018. So it’s fairly up to date<autumngirl11>: Every type of this drug can be chemically unique. I have heard from doctors involved in his care that they have seen many cases of this type of brain damage, but to satisfy your question - search around and see that if absolutely nothing else, this drug can start seizures in people that never had them before, which can absolutely lead to brain damage and oxygen loss. <frogdoubler>: Not sure why that genius keeps down-voting you. This isn't regular cannabis, it's synthetic. Like others kept on saying, the chemicals are unique and constantly changing. They've barely been identified, let alone had conclusive studies done on them.<Erastotle>: &gt; the chemicals are unique and constantly changing. They've barely been identified, let alone had conclusive studies done on them. If we assume you're right for the sake of argument, then how is it possible for anyone to reason that it's the cause of OP's troubles? Wouldn't one need to both identify the chemical he had taken as well as have a conclusive study linking it to his diagnosis? This all sounds like a load of *post hoc ergo propter hoc*.<mammalian>: Man is fine. Man ingests unknown chemical substance and suddenly, for the first time, develops symptoms of severe mental illness. Testing shows he has brain damage. While this isn't proof positive that the chemicals caused the damage, or that the damage caused the symptoms, it's a reasonable assumption. If I fell on my head and forgot how to talk, and brain scans showed damage, that wouldn't be absolute proof that one thing led to the other either. It could have been a coincidence, it might be psychosomatic, it could be the result of some previously undiagnosed and unknown disease process. Probably the blow to the head though.<Erastotle>: Would you agree that falling on your head has been conclusively linked to brain injury? Because the person to whom I replied ( /u/frogdoubler ) said that synthetic cannabis is decidedly not linked to brain injury. Therefore there isn't any connection between your first case – which is a textbook example of the post hoc fallacy – and your second case which seems a perfectly reasonable assumption. /u/frogdoubler seemed to be offering support to the OP. But their post and OPs post cannot both be true at the same time. I just hoped they might be elucidated by that irony. <mammalian>: I think the issue is that there is no common agreement on what constitutes \"synthetic pot\". That's what brings in the \"unknown chemical\" factor. Since we have no way of knowing exactly what this guy smoked, and the change in cognition immediately followed, I think it's reasonable to assume the chemical was the causative factor. There aren't any definitive studies on what he smoked, because we don't even know what it was.<Erastotle>: First of all, nearly every single person that has a medical issue of any kind has consumed an \"unknown chemical\" shortly before the issue was discovered. I personally know at least half a dozen people who claim they had \"food poisoning\" after eating at some restaurant. And yet none of them were told that by a doctor or interviewed by the government agency concerned with the safety of the food supply. And because I know food poisoning is *deadly* serious for not just the individual, but society as a whole, then I'd bet every single one of them just got something like the flu and then blamed it on the last place that they ate before they got sick. And what's more, food poisoning can probably go unnoticed for days before it presents itself. Why do so many people assume it's the last place they ate, then? Because the post hoc fallacy is a temptress. Second of all, I have no clue where you get the idea that \"the change in cognition immediately followed\" if you're referring to OP. Because in their post they said \"[o]ver the course of a year.\" Third of all, I don't know what your point is anymore. If you agree that we don't know what he smoked. If you agree that even if we did know, it isn't studied. Then all we can say is that we should dig deeper to find out if the two are linked. What we can't do however, is assign *any* probability to how likely it was to cause his symptoms.<mammalian>: I'm not that interested in this argument, but I thought you should know that food poisoning is considered extremely common. While it's true that people can die from it, that's relatively rare. Most people just get diarrhea and vomiting that lasts a few hours. Also, while it can take as long as weeks to show symptoms, that's also relatively rare. Usually the symptoms show up within a few hours. <Source>: Google it<Erastotle>: [\"5-20% of U.S. residents get the flu each year\"](http://infomory.com/numbers/number-of-flu-cases-per-year/). Taking the median value of 12.5% multiplied by [327,829,439](http://www.worldometers.info/world-population/us-population/) is 40,978,679.875. [\"In the United States, foodborne diseases have been estimated to cause 6 million to 81 million illnesses… each year\"](https://wwwnc.cdc.gov/eid/article/5/5/99-0502_article) that median number is 43.5 million. Therefore, the flu can be about as common as food poisoning. We know people get sick from the flu. We know people have eaten shortly before they got sick from the flu. My point is that it's dumb to assume food poisoning when it could just as easily have been the flu.<mammalian>: It's also dumb to assume it's never food poisoning. <Erastotle>: You're right. Perhaps you're finally coming to understand the post hoc fallacy.", "num_messages": 17, "avg_score": 177.8235294118}
{"start_date": "1544012607", "end_date": "1544067610", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 9128, "text": "<ZestyRanch1219>: YSK that you can find the direct download link to almost any movie by pasting this into your search bar [removed]<Njuuh>: I'm stupid. How does this work? And why?<IAmAHat_AMAA>: It's a filter to google search people's media servers or seedboxes that they've left open to the world /r/opendirectories <pluggemr>: So if you have plex would you essentially have an open media server? <Roseysdaddy>: Nope, but get Plex. It's fantastic. <WildNight00>: What is plex<Scase15>: http://lmgtfy.com/?q=what+is+plex<chicknfly>: Don't be a dick, dude. To /u/WildNight00, Plex Server is set up on a computer you own (typically a PC, Mac Mini, etc., but can be as simple as a Raspberry Pi) that hosts your media files (music, video, pictures, etc.). A device with Plex installed (either another computer, your cell phone, game console, Amazon Fire TV, etc.) grabs the hosted files from the machine running Plex Server and plays it locally. It's really easy to set up, too!<Scase15>: It's not being a dick, the time it took at ask what a plex server is, is enough time to google something.<chicknfly>: And the time it took for you to create that was enough time to answer his question. The fact that you chose to tell the poster to Google it as opposed to offering anything productive/beneficial in order to get the person started is douche and purely arrogant. If you don't want to help, then the best thing to do is not say anything at all. Internet Etiquette 101.<Scase15>: Internet etiquette 101 would include using google. Stop enabling lazy shit, this isn't /r/explainlikeimfive<chicknfly>: I checked out the Wikipedia page for Plex. It's sort of complex; at least it's not easily understand for someone who might not be well-versed in home media. From Plex's own site, it is \"one window into all your personal media. No matter where you are.\" That tells the reader nothing about what the product actually is; that's marketing. By these two things alone, the poster might have actually tried to Google search an answer and ended up not understanding. You don't know. So either help the guy out as I did, or say nothing at all. It's that simple.<Scase15>: Googling `what is plex` the _first_ thing you are greeted with are 3 videos titled : * Plex 101 - What is Plex? Plex Media Server Explained in Plain English - NAS and PC * What is Plex and How do I use it - in 4 Minutes * PLEX Media Server Review - What is Plex? Wiki is not required. You're making excuses for laziness.<chicknfly>: Let's play this out. 1. Poster asks, you don't say anything. Dude doesn't get an answer. 2. Poster asks, you waste time and go out of your way to tell the guy to Google it. Poster still gets no answer, and now you also look like an ass. 3. Spend that same amount of time helping the person (which you won't do because it perpetuates laziness) The primary argument I'm making is to say something useful or say nothing at all. How is that making an excuse for his laziness? You literally contributed *nothing* with your initial post and went out of your way to be arrogant. And that, my friend, is called being a dick.<Scase15>: Teaching someone to think and perform things themselves is not useless. Enabling people to take the laziest route and have other people do simple and menial tasks for them, is arguably more harmful. There is nothing arrogant about posting a link, there was no text, no tone, no comment. Just simply a link to a google search. Just because _you_ got your panties in a bunch doesn't indicate me being a dick. It's showing someone how to find answers without relying on random people to do the work for them. Stop acting altruistically because you answered a simple question.<chicknfly>: You're not teaching them anything with that link other than you're trying to tell them to Google it. You could have offered the link directly to the search query, but instead you chose an animation that arrogantly portrays your thoughts. I'm not even annoyed with you. I'm annoyed at the propogation of this stupid animation because it literally does nothing in any context it's used. It's a tired joke, and nobody laughs at it. Nobody ever thinks \"oh, yeah, what a great idea.\" It's about as worthless and douchey as people clapping when a waiter/waitress accidentally drops dishes.<Scase15>: It's not supposed to be a joke. It's supposed to shame people into doing something for themselves. I chose not to offer a direct link to anything because they might be someone who prefers to read, or watch videos etc. They can choose their method of learning by simply searching for the info and then choosing from the options available. It's just irritating to see people take more time to make a reddit post asking what something is, when you can not only find your answer but, fully read/watch/digest the answer well before anyone could feasibly answer the question in a reply.<chicknfly>: True. The same could be said about the entire ELI5 subreddit, though. Sometimes it's as easy as skimming through a few of Google's top links and compiling your own understanding. That is completely the case with this Plex question. In some instances, however, it's extraordinarily difficult to find a straight forward answer (or one that makes sense). Just this past week, I went through three academic textbooks and dozens of text- and video tutorials on how to use the Hungarian algorithm for finding matching sets of a directed graph. There's plenty of material on it, none of which makes enough sense. Honestly, if Plex Man above us actually cared enough to know, he would have searched for it and got the answer he wanted. I posted knowing that there's probably someone (maybe several people!) out there who doesn't know what Plex is, and I just spared them that effort. A little time spent on my part saved lots of time overall. I'm cool with that.<Scase15>: I agree with you for the most part about ELI5 but, it does have it's uses for complicated things that you can't find a simple explanation for.", "num_messages": 19, "avg_score": 480.4210526316}
{"start_date": "1545009749", "end_date": "1545146215", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 112, "text": "<capralpina>: YSK that SSRI's can cause persistent sexual dysfunction after stopping treatment SSRI's can cause persistent sexual dysfunction after stopping treatment. The condition is called PSSD. In some cases it is permanent. There is no known cure. Severity varies from just having lower libido to being unable to have sexual activity at all. Some people have committed suicide due to this condition. It is life-altering. Unfortunately this condition is often labeled as a conspiracy theory which has been made up by people who simply have depression. This is incorrect. There are various scientific studies that suggest that SSRI's have permanent effects, including epigenetic ones. [https://www.omicsonline.org/proceedings/epigenetic-changes-in-human-cells-in-response-to-chronic-citalopram-treatment-19539.html](https://www.omicsonline.org/proceedings/epigenetic-changes-in-human-cells-in-response-to-chronic-citalopram-treatment-19539.html) [https://www.sciencedirect.com/science/article/pii/S0924977X05000994?via%3Dihub](https://www.sciencedirect.com/science/article/pii/S0924977X05000994?via%3Dihub) [https://www.nature.com/articles/1300823](https://www.nature.com/articles/1300823) [https://www.mind.org.uk/information-support/drugs-and-treatments/antidepressants/side-effects-of-antidepressants/#.XBb3nZnMA0M](https://www.mind.org.uk/information-support/drugs-and-treatments/antidepressants/side-effects-of-antidepressants/#.XBb3nZnMA0M) \"Sometimes these side effects persist after you've come off the drug, and might continue indefinitely.\"<AuxiliaryVexes>: Well shit..... That might explain a few things. <Edit>: This is really upsetting to learn... <capralpina>: I wonder how many people have PSSD without knowing. All doctors will deny its existence despite there being numerous studies confirming it.<bslankster7583>: Anti depressants are evil shit in my opinion. <ChimTheCappy>: Necessary evil, if that. They're clumsy and still not well understood, but it's better than what we used to have.<cispanda>: It's actually much much worse. If you don't consider cocaine as an antidepressant then you don't consider the drugs labelled as antidepressants as one either. \"Antidepressants\" including SRIs, SNRIs, NRIs and NDRIs. Cocaine is an SNDRI. Serotonin–Norepinephrine–Dopamine reuptake inhibitor. The only reason that these SSRIs are available (By far the most prescribed today) is because the drug companies behind them hid the increased suicidal ideation/attempted suicides and completed suicides that occurred in the clinical trials from the regulators to get them on the market. Prozac, Paxil etc. For example the biggest difference between the SSRIS is the half lifes. Prozac being the longest and Paxil being the shortest. Eli lilly and GSK hid the increased suicides that occurred in their clinical trials from the regulators. GSK had evidence paroxetine increases the risk of suicide by older users by as much as 670 percent, yet failed to include that on the warning label.\" (if you wondering why it's 670 percent its because they only looked at his age group. if you actaully look at all the suicides in the clinical trials there were I believe 22 and 0 in the placebo.) That doesn't include increase in unsuccessful suicide attempts and increase in wanting to commit suicide. In trials where suicidal people are filtered out and not participating... <https>://www.reuters.com/article/us-gsk-lawsuit/gsk-must-pay-3-million-in-generic-paxil-suicide-lawsuit-u-s-jury-idUSKBN17M2SH \"a July 1985 in-house analysis by Eli Lilly in which the company found a large statistically significant increase in suicide attempts for patients taking Prozac during their placebo controlled clinical trials\" prozac. 12 - 0. that doesn't include increase in attempted non completed suicides or increase in wanting to commit suicide. <http>://breggin.com/studies/EliLillyWithheldProzacDocuments.pdf Here's the lead investigator at a congressional testimony <https>://www.youtube.com/watch?v=SBJfZtB_3cc Michael moore on eli lilly https://www.youtube.com/watch?v=DpinCRaAQOk and GSK also hid the increased risk of suicides in children in part and were sued 3 billion for it. <https>://www.nytimes.com/2012/07/03/business/glaxosmithkline-agrees-to-pay-3-billion-in-fraud-settlement.html \"Antidepressants\" including SRIs, SNRIs, NRIs and NDRIs. Cocaine is an SNDRI. Serotonin–Norepinephrine–Dopamine reuptake inhibitor. They cause extrapyramidal symptoms such as Parkinsonism (characteristic symptoms such as rigidity)dystonia (continuous spasms and muscle contractions), AKATHISIA (motor restlessness), bradykinesia (slowness of movement), tremor, and tardive dyskinesia (irregular, jerky movements). <https>://rxisk.org/akathisia/ <https>://www.youtube.com/watch?v=x86aCDtvbT0&amp;t=2s<Ciels_Thigh_High>: Well shit. I take seroquel so I don't feel like shit. It calms down my mood swings but doesn't fix me all the way. Is it breaking me, too?<cispanda>: antipsychotics? chronic use causes the brain to shrink not to mention takes decades off a humans life. Obesity, diabetes heart attacks, strokes, seizures. neurotoxic tranquillisers <https>://www.madinamerica.com/2013/06/antipsychotics-and-brain-shrinkage-an-update/ Serious psychiatric patients are living 15 to 25 years less than the general population due in part to the drugs they are exposed to. Just as an example heavy smokers live an average of 8 years less. everytime you are exposing your body to this drug you are making it less healthy. \"so I don't feel like shit\" Was this your first exposure to a drug used in psychiatry?<Ciels_Thigh_High>: I don't do recreational drugs. I was out of control autistic, bipolar, depressed, add, with suicidal ideation. I'm still not ok but I do better and haven't ended up on a 72 hr thing in a couple of years. I sleep better. I was on a different drug every 60 to 90 days because of not working or side effects for about 2 years I think. Then I found this one and I'm so much better (still not where I need to be though) I really don't see any alternative to medication :(", "num_messages": 9, "avg_score": 12.4444444444}
{"start_date": "1543167045", "end_date": "1543634360", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 31, "text": "<supersnaps>: YSK Using a staple gun is, by far, the easiest way to put up Christmas lights. [removed]<swatlord>: Also by far the easiest way to put small holes in your exterior that allow for water to get in and cause damage. If you’re going to do that, take the extra time to seal up the holes when you pull the staples out. <kyle5521>: Water to get in? Lol<swatlord>: Yeah dude. Small holes in vinyl or metal fascia invite long term mold issues when a little moisture gets in and prospers. Just take a little dab of silicone when you pull the staples out. Too easy. Personally I'm against this idea as there way better methods of hanging lights, but I get some people do this. At least finish the job right.", "num_messages": 4, "avg_score": 7.75}
{"start_date": "1530660148", "end_date": "1530876148", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 64, "text": "<rnords>: YSK: if you want to get on the Bone Marrow registry in the UK you need to do it before you are 31. I procrastinated for years getting myself (a regular blood donor) on the bone marrow registry, which is managed through the Anthony Nolan Trust in the UK. By the time I got the info I had just turned 32 and was no longer eligible to sign up. Don’t wait. Sign up now!<watermelonhappiness>: Why is it that you have to be under 31? Don't we regenerate bone marrow throughout our lives?<rnords>: Yeah I was surprised at that as well. They seem to say something about once you get older you are less likely to be able to actually donate. <watermelonhappiness>: I'm thinking they can't flash freeze bone marrow donations for future use either. Or else everyone who wants to donate could donate before 31 when they still can. but good on you donating!<rnords>: Oh the register doesn’t work like that. You just take a small cheek swab (dna sample) to be on the register, and if you match then they take your bone marrow. Which is actually quite an operation. Means drilling into your hip bone I think.", "num_messages": 5, "avg_score": 12.8}
{"start_date": "1545050628", "end_date": "1545060368", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 1348, "text": "<Bobthedude56>: YSK that ribs regularly break during proper CPR and that you should not stop if you hear cracking or popping sounds [removed]<yehiko>: Quick question, are cpr classes free? And where do they offer them?<aviateurde>: Not usually free, but it’s worth the knowledge. <yehiko>: Oh crap, i thought they would be tax funded, you know, to save more lives. I'm generally interested but im tight on $ rn<chrizbreck>: CPR started out in the field has an abysmal recovery rate https://cpr.heart.org/AHAECC/CPRAndECC/ResuscitationScience/UCM_477263_AHA-Cardiac-Arrest-Statistics.jsp%5BR=301,L,NC%5D That being said some chance is better than no chance <yehiko>: jeesus, reddit really loves throwing this fact around. literally every comment\\thread about CPR, boom, someone saying CPR ISN'T A MAGIC TRICK LIKE IN THE MOVIES. yes, we get it, we can still try to learn it and maybe some day try and save someone even if it was ~5% chance of surviving or less.<chrizbreck>: I think it’s important to set expectations to an appropriate level. The general public seems to think that CPR will save 90+ yr old granny and bring her back to her former glory years. <yehiko>: I know, but this fact is thrown around everywhere that now everyone and their mother probably knows that that's a lie", "num_messages": 8, "avg_score": 168.5}
{"start_date": "1543422166", "end_date": "1543965626", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 98, "text": "<A_Bruised_Reed>: YSK: If you accidentally send a text and want to stop it. If you can react fast enough, immediately put the phone in airplane mode. Then delete the text.<xarzilla>: Damn, you must have the fastest hands on the web to pull that off!<chopstyks>: Speaking of having fast hands to pull something off...", "num_messages": 3, "avg_score": 32.6666666667}
{"start_date": "1543113502", "end_date": "1543966543", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 28, "text": "<lalalameowmeow>: YSK How to Save $$ When Ordering From Papa Johns Pizza I wanted a large Spinach Alfredo specialty pizza, so was going to order it online. They had any large pizza for $13.99. I decided to go with the medium size instead, using the any medium for $10.00 deal. Papa Size for $2 more? Why not. Got the original pizza I wanted for $12.00 instead of $13.99. <BicycleWizard>: WORST. PIZZA. EVER.<Ministeroflust>: That's Dominos<HaVeN197>: The majority of the UK would like to know your location.", "num_messages": 4, "avg_score": 7.0}
{"start_date": "1542837557", "end_date": "1542904751", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 2904, "text": "<nddragoon>: YSK how to react if you get an e-mail from yourself saying your account has been hacked So two days ago I got this e-mail from seemingly my own account and it had one of the actual passwords I use. https://i.imgur.com/Cs1adou.png I majorly freaked out, but started having my doubts when i realized that by the date that the e-mail said I already had my webcam covered and had had a different e-mail password for years. I asked a few people and someone found an article about it and here's the gist of it; to understand this (admittedly well done) scam you need to know two things: 1.- How is it that it looks like I sent it myself? \"From: spoofing\" is hard to explain but essentially it means that, if you know what you're doing, you can make the receiver of your email think that it was sent from a different address, even their own. 2.- How did they get my password? There are basically two options; - You got caught in some kind of phishing and accidentally gave you password away to someone with malicious intent. - One or more of the websites you use was hacked and your e-mail address and password you use for that site got posted somewhere on the internet for all to see. Now, how do you fix it? First we need to be sure that it actually wasn't sent from your account, so go to your \"sent\" folder and check whether or not you actually sent it; If not, then go to the next step. ~~If it WAS sent from your account, get help from someone that knows more about this than me because it means your e-mail account has indeed been broken into and that's a WAAAAY bigger problem.~~ Edit: I'm not completely sure how legit this is but according to this article https://www.tomsguide.com/us/spam-gmail-sent-folder,news-27042.html it's possible for spam to actually appear in your \"sent\" folder. I'd still be cautious though. Now, about the password: There's basically NOTHING you can do about it except changing your password, but don't just change it to another easy one, so listen: there's this program I just found out about called KeePass, it's free and open source, which means it's not a \"trade your privacy in return of it being free\", but a project people contribute to to help others out. The program lets you store your passwords in an encrypted file that's only accessible by a master password. Having this program, there's no excuse to have an \"easy to remember\" password to use everywhere. It generates random passwords for you to use and you can just store them in your file. To create a very secure master password, ~~this xkcd is pretty useful https://www.xkcd.com/936/~~ (Edit: yeah, after quite a lot of people commented about it, I realize that the xkcd doesn't really show the full picture. There are more things that go into it. This article is much more useful: https://crambler.com/password-security-why-secure-passwords-need-length-over-complexity/ ) but I'd also recommend to NEVER. GIVE. YOUR. MASTER. PASSWORD. AWAY. don't make ANY accounts with it, no matter how much you trust the site. And for the love of god, when creating a password file READ THE INSTRUCTIONS CAREFULLY. Frequently Back up the password file to a secure cloud server like google drive and, if you can, print the file that it gives you so you can recover your passwords if somehow the whole file gets lost or you forget the master password. I really hope I helped someone to not have such a bad time as me if an e-mail like this reaches you. If I made a dangerous mistake in anything that I said here, feel free to correct me and I'll edit it. <Edit>: someone pointed out something that I wanted to add but forgot. If you want to know if a password associated to your email address has been leaked, check out https://haveibeenpwned.com <Edit>: this one's kinda common sense but yes, if you can get 2-factor authentication, do it. Not all sited have the option but this way, even if your password gets leaked, no one can get into your account without your phone.<Scrambles720>: Getting a spoofed email does not signify that they know your password. You can spoof an email without knowing the password<pitchbend>: You didn't understand. They not only spoof your email the also include your password in plain text in the email to show that they know it. They know it because it was part of a hacked database.<Jasong222>: Current password? I had this happen but it was a very old password that I gave up using 4 maybe 5 years or more ago.<pitchbend>: Yeah this depends on how often you change passwords, for some people that rarely change it might be a current password, for others like you it might not, also it dependes of when the hack where your password was dumped occurred.<Jasong222>: Oop. Yeah I guess I thought you were op. I meant to ask him if the password in the email was his current. I know password techniques vary with people but I guess I kinda assumed that changing your password at least occasionally (every couple years?) had become more widely practised. <nddragoon>: The password I got on the email wasn't for any important account. It was mostly for social media and other accounts that don't matter to me too much. Still scared the fuck out of me and I changed ALL my passwords.", "num_messages": 7, "avg_score": 414.8571428571}
{"start_date": "1543677022", "end_date": "1544298908", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 25, "text": "[deleted]: YSK that it’s Castilian, not spanish [deleted]<lmiartegtra>: Maybe it makes a difference in countries other than Spain (except the Catalan region) but Spanish is Spanish. No real point using the version no one knows. Even if just for ease of use just call it Spanish.<Mark-Wahlberg1929>: Nope, that’s uncultured trash<lmiartegtra>: So you're saying that the entire governing body for the teaching of Spanish in the UK is just wrong. Every single teacher in my Spanish department just casually left this little fact out. Maybe the variant of Spanish where you live is (name of thing because I forgot it and can't be bothered to go back and check) but Spanish is Spanish. Long and short of it, don't go around calling people uncultured for using the term that literally everybody has used (around me at least) since I was born. Also just on a side note calling people uncultured trash tends to make you seem like a bit of a posh dick head. Just a tip. <Edit>: on the list you gave the order of specificity is •Indo-European •Italic•Romance •Western•Ibero-Romance •West-Iberian •Castilian •languages:Spanish meaning that it's like saying you have to call foxes wolves dogs because they're both canines. You can call all hornets wasps not all wasps are hornets type of deal. In fact all references I can find say Castilian is the classification of Spanish. Not Spanish= Castilian. <Mark-Wahlberg1929>: Dafuq? Okay, so the language spoken in Mexico is the same as that of the Basque Country and Asturias?<lmiartegtra>: I don't think you're picking up what I'm putting down. Castilian is the branch from which these languages branch off of. Mexican and whatever language is spoken in Asturias are both classified as Castilian in the same way as both cats and lions are felines. Feline is the classification then lion/ house cat is the specific species. You can technically call Spanish Castilian in the same way you can call it Latin. It is but if you wanna be more specific than all of southern Europe you're gonna have to be a bit more specific than that. On the whole you're technically right but you're just a bit backwards. Castilian isn't Spanish Castilian is the classification of languages within Spain. I'm not saying that all people that speak a Castilian language would be speaking the same language the same way as I'm not saying that you're speaking Italian because you're speaking a Latin language (well bit of Germanic and a hint of Norman as well, we (the UK) got invaded a LOT over the years. I don't get it tho. All we have is chalk. Who the fuck wants chalk) Spanish, however, is Spanish. The language spoken in Asturias isn't Spanish if they're not speaking Spanish. It might be Castilian but it's not the more specific language of Spanish. Do you understand.<Mark-Wahlberg1929>: Are you aware that “spanish” and asturian are completely different? Castillian is the language of castille, someone from Castilla La Mancha can communicate with someone from panama, because they both have the same language. On the other hand, if you had a Mexican or a Peruvian come up to someone who only knew asturian the conversation would go like this: <Asturian>: Va munchu tiempu que nun mos veíemos <Mexican>: che loco no te entiendo <Asturian>: nun entiendo <Mexican>: habla castellano por favor <Asturian>: ¿pue repetir? <rosso_dixit>: Hey, Peruvan here. This is minor, but since you seem to live and breath on technicalities, Mexicans don't ever say \"che loco\", that would be Argentineans. As a native speaker of (Peruvian) Spanish, and as a university professor of Spanish and Literature, I see your point, but it's extremely negligible among my fellow scholars. Perhaps linguists of prescriptivist leanings may join you in your quest to educate the world, but there aren't many of them. Buena suerte.<Mark-Wahlberg1929>: Uy sorry que no se muy bien el slang Peruano, mi argumento debe estar completamente incorrecto porque quería usar múltiples países hispanoparlantes <rosso_dixit>: You mean Mexican slang. That’s where your mistake was, not Peruvian. Also, it’s not slang. It’s modism. Dialects, that’s what the whole thing is about. The Argentinian dialect uses “che, loco”, the Mexican says”órale, mi cuate”, the Peruvian says “habla, causa” or something like it. The Castilian’s dialect became the standard one after the Reyes católicos unified the Iberian kingdoms after they kicked out the Moors. That was quite a while ago. In practical terms, Castellano and Español are used indistinctly.", "num_messages": 10, "avg_score": 2.5}
{"start_date": "1544450570", "end_date": "1544456990", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 114, "text": "<GoodAdvosor>: YSK If you receive a package you did not order, you do not have to return it to the seller or even let them know that you received it. People often post asking what to do if they accidentally receive an item they did not order. Federal law allows you to keep the item for free. [https://www.consumer.ftc.gov/articles/0181-unordered-merchandise](https://www.consumer.ftc.gov/articles/0181-unordered-merchandise)<caesar_bezoar>: Unless it is addressed to someone other than yourself. Then it’s still a federal crime. <Silverlight42>: Which is most often is, in the case of you getting a wrong delivery. It happened to me once. It had my number on the house but someone else's name. I suspected it might be my neighbor across the street, so I googled the name, found a facebook page to confirm it, and went and gave them the package.<caesar_bezoar>: r/humansbeingbros", "num_messages": 4, "avg_score": 28.5}
{"start_date": "1545103269", "end_date": "1545113688", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 84, "text": "[deleted]: YSK: Leaving hot food covered in the refrigerator is dangerous. The food will stay in the \"danger\" temperature zone for too long causing foodbourne bacteria to build up. If you put hot food in the fridge, cover it with plastic wrap and poke a hole through it. [removed]<YAHGOOF>: As opposed to leaving it on the counter ? This is silly <elfknits>: The idea is to let it cool a bit and then put it in the fridge. Hot food straight to the fridge is bad. This has been part of my training for any job I’ve done where we store prepared foods. Not silly. <OvaltineShill>: Except the food is going to cool down ten times faster in the fridge than out on the counter. \"Letting it cool a bit\" outside the fridge is not somehow magically going to get it out of the danger zone faster.<elfknits>: The outer parts cool faster but the middle remains warm. Think about throwing a frozen steak on the skillet. The outside burns and the middle stays cooler and usually doesn’t cook through. Not exactly the same but it’s how it was explained to me. I’ve also been sick enough from soup that wasn’t properly stored by coworkers the night before at a place I worked. Call it bullshit if you want. I’d rather be safe. <NinjaChemist>: Please explain how a room temperature environment would cool down a dish faster than a cold environment?<elfknits>: That’s actually why people would put things in the fridge before letting them sit. They wanted out faster so they went against company policy for handling food and myself and several customers ended up sick. Manager watched the nightly cameras and never saw the girl turn off the soup warmers before they removed them and stored them. She got fired.<OvaltineShill>: [The Washington State Department of Health](https://www.doh.wa.gov/YouandYourFamily/FoodSafety/Myths) says otherwise. \"Myth: You shouldn't put hot foods in the refrigerator.<FACT>: Hot food can be placed in the refrigerator. Large amounts of food should be divided into small portions and put in shallow containers for quicker cooling in the refrigerator. Perishable foods should be put in a refrigerator that is 40 degrees or below within 2 hours of preparation. If you leave food out to cool and forget about it after 2 hours, throw it away. Bacteria can grow rapidly on food left out at room temperature for more than 2 hours. If food is left out in a room our outdoors where the temperature is 90 degrees F or hotter, food should be refrigerated or discarded within just 1 hour.\" It seems that the most relevant step for storing large pots of soup safely is to divide it into smaller containers. Perhaps that was a step the fired worker skipped as well? <elfknits>: Typically we didn’t have enough left at the end of the day to have to split up but I didn’t close that night so it is very possible. The only reason that the manager even told me anything is because I was directly involved. It blows my mind that this information was not represented correctly in our training.", "num_messages": 9, "avg_score": 9.3333333333}
{"start_date": "1544922326", "end_date": "1545108516", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 50, "text": "<Kiwispam84>: YSK the important reason there are marked No Parking zones next to some disabled parking spaces. They’re for loading and unloading wheelchairs and other mobility devices. Parking there means someone might not be able to get in or out of their vehicle.<rlhilburn>: Oh no, don’t you know that’s the shopping cart dumping ground???<Kiwispam84>: 😂 😠 🤣", "num_messages": 3, "avg_score": 16.6666666667}
{"start_date": "1541134533", "end_date": "1541261624", "thread_id": "t3_9th150", "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 188, "text": "<DeadliestSin>: Buy more Starbucks<MoreGoodLessBad>: Pretty much. Starbucks sells small coffees for $2.11. After the ten cent discount it goes down to $2.00, assuming you work five days a week and you go to Starbucks every time you work, you will save enough to buy an extra coffee every month.<PunctuationsOptional>: 2.11 Minus 0.10 Equals 2.10 😟<MoreGoodLessBad>: ...No....<womm>: You're both wrong. $2.11 minus 10¢ equals $2.01. Not sure how you ended up with $2.00. <MoreGoodLessBad>: Sorry, the ten cent discount is applied before tax. Which ends up knocking another penny off the total. Should have said that earlier.<PunctuationsOptional>: This is what my original comment is about. I was just pointing out how 11-10 = 0 in your first comment. Obvi cuz of tax, but I thought it was funny <womm>: From you original comment: &gt;Equals 2.10 That's why he said \"no\"<PunctuationsOptional>: That's why I replied... And that's why you replied... And that's why I replied again... And so on and so forth <womm>: No you said it equals $2.10, as in two dollars and ten cents. It was a typo on your part. What you meant to write was $2.01, as in two dollars and one cent, unless you were making some joke. <PunctuationsOptional>: Wasn't a joke joke. Wasn't a typo either. I was just saying what the dude said first. <womm>: Dude please explain to me what you were trying to say because I feel like I'm losing my mind. Here's how I saw this all go down: <OP>: 2.11 minus .10 equals 2.00 <YOU>: 2.11 minus .10 equals 2.10 <ME>: YOU ARE BOTH WRONG<PunctuationsOptional>: Oh..... I'm so sorry, bby. I didn't know autocorrect changed that to 2.10. Now it makes sense why people keep replying. I meant to say how is 2.11 - 10 = 2.00 when it should be 2.01 Autocorrect ruined that. Dude then explained it was cuz of taxes. Which is what I figured from the start. Now you're trying to sort this for yourself, and I just now realize that the number was wrong from the very start. My bad.", "num_messages": 13, "avg_score": 14.4615384615}
{"start_date": "1543669881", "end_date": "1544023228", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 38, "text": "<LivingDeadInside>: YSK about coercive control, a form of abuse which is not necessarily violent, and how to recognize it. [http://www.opdv.ny.gov/professionals/abusers/coercivecontrol.html](http://www.opdv.ny.gov/professionals/abusers/coercivecontrol.html) &gt;**Coercive Control** &gt; &gt;Domestic violence comprises a range of behaviors beyond physical and emotional abuse. Abusers often use violence, intimidation, degradation and isolation to deprive victims of their rights to physical security, dignity and respect. Evan Stark has been encouraging the use of “coercive control” to describe a course of oppressive behavior grounded in gender-based privilege. While all forms of abuse are about power and control, coercive control is a strategic form of ongoing oppression and terrorism that invades all arenas of women’s activity by limiting access to money and other basic resources. In addition, few elements of coercive control are currently considered criminal, or are only crimes when committed against strangers, which further complicates this issue within the context of domestic violence. &gt; &gt;This Q and A was conducted with Evan Stark, Ph.D. MSW, a forensic social worker and Professor Emeritus at Rutgers University. &gt; &gt;**Q: What is Coercive Control?** &gt; &gt;**A:** Coercive control is a strategic course of oppressive behavior designed to secure and expand gender-based privilege by depriving women of their rights and liberties and establishing a regime of domination in personal life. This definition reminds us that women are often targets of violence. I wrote Coercive Control (Oxford, 2007) to examine the oppressive tactics some males used to dominate women. &gt; &gt;Coercive control refers to abuse as a “strategic course of oppressive behavior,” meaning that battering is: &gt; &gt;rational, instrumental behavior and not a loss of control &gt; &gt;“ongoing” rather than episodic &gt; &gt;based on multiple tactics like violence, intimidation, degradation, isolation and control. &gt; &gt;Sixty to 80% of abused women experience coercive control beyond physical and emotional abuse. &gt; &gt;Men possess “gender-based privilege” because they are male. While all forms of abuse are about “power and control,” women are vulnerable to coercive control because of unequal political status and because men can take advantage of pervasive sexual inequalities in ways women cannot. While control involves everything from survival resources like money, to what television shows women watch, male abusers exploit and regulate women’s sexuality (e.g., how they dress, wear their hair, make love, etc.) and how they perform traditional gender roles as housewives and mothers. &gt; &gt;Coercive control is a violation of “rights and liberties” protected by the US Constitution and international human rights conventions, including right to physical security (violence); to live without fear (intimidation); to dignity and respect (degradation); to social intercourse (isolation) and to autonomy, liberty and personhood (control). Over time, victimization and dependence are replaced by domination/subordination, agency and resistance. Emphasis shifts from what men do to women to what they keep women from doing. &gt; &gt;**Q: What should advocates know?** &gt; &gt;**A:** Advocates must “look beyond violence,” develop a proactive and ongoing response to the persistent nature of coercive control, emphasize the level of entrapment and control in assessing future risk, document and respond to the coercion and control in each case, adapt the political language of rights and liberties, and balance the restoration of freedom, autonomy and dignity with the provision of safety. &gt; &gt;Nonviolent tactics used in coercive control invade all arenas of women’s activity. In response, advocacy must help restore autonomy wherever it is denied, by negotiating safe spaces at work, school or Church, identifying ‘safe stops’ where women can call for help, and organizing protective support networks. &gt; &gt;Although coercive control is more extensive than domestic violence, advocates can partner with women from a strengths perspective – what I term “control in the context of no control.” Using the language of rights and liberties is key to helping women. It is also essential in getting police, courts and other providers to acknowledge how forcefully they would respond to someone who held a stranger hostage, or who tightly regulated how they dressed, walked, talked, spent their time or money, or how they made love under the threat of an “or else” proviso. &gt; &gt;**Q: How might the legal system better serve victims and hold abusers accountable?** &gt; &gt;**A:** When they confront the courts and ACS/CPS, victims feel they are on different planets. The criminal “perpetrator” is the “good enough father” in Family Court cases or invisible to ACS/CPS. The same woman rewarded for pressing charges is punished for doing so in Family Court. ACS/CPS may prohibit her from contacting her partner while Family Court punishes her for denying him access. Advocates can help women and the courts understand how systems collude with the batterer and support his control and/or use of the children. &gt; &gt;Domestic violence laws focus on and respond to individual incidents according to the level of physical harm. Consequently, coercive control, where frequent low-level violence is accompanied by the other tactics, has no legal standing. Few elements of coercive control are currently considered criminal, or are only crimes when committed against strangers. &gt; &gt;Coercive control is rooted in the battered women’s movement; the abuse of individual women harms and impacts women’s standing in society. However often women may abuse male or female partners, women are rarely able to deprive men of basic resources, or to rape or degrade them sexually, regulate their enactment of gender roles, or systemically isolate them from the supports needed for autonomy. &gt; &gt;This Q&amp;A is taken from the [NYS Office for the Prevention of Domestic Violence, OPDV Bulletin, Spring 2013.](http://www.opdv.ny.gov/public_awareness/bulletins/spring2013/spring2013_bulletin.pdf) &amp;#x200B;<wubstep_cat>: Coercive control sounds interesting. At the same time however I’m a little disturbed by how pro women anti man the article sounds. It almost completely disregards female abusers for some reason and a lot of the focus seems to be on women only despite how the abuse could be inflicted on and inflicted by either party.<hopingforabetterpast>: This is just another example of purposefully biased work supporting the same old agenda everyone is now increasingly aware of. Fortunately, the general public's filter to this king of BS has matured enough that the first comment on an article like this is denouncing it. Unfortunately, it makes me and many others completely discard a priori the validity of studies about otherwise serious and meritorious issues.<LivingDeadInside>: &gt;Men possess “gender-based privilege” because they are male. While all forms of abuse are about “power and control,” women are vulnerable to coercive control because of unequal political status and because men can take advantage of pervasive sexual inequalities in ways women cannot. While control involves everything from survival resources like money, to what television shows women watch, male abusers exploit and regulate women’s sexuality (e.g., how they dress, wear their hair, make love, etc.) and how they perform traditional gender roles as housewives and mothers. Did you even read it, or... ?<hopingforabetterpast>: What's your point?", "num_messages": 5, "avg_score": 7.6}
{"start_date": "1545154146", "end_date": "1545179948", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 2135, "text": "[deleted]: YSK pretty much every metal is recyable, such as tin foil, wire hangers, and pretty much every metal you see on a daily basis. [deleted]<ThatGuyFromDaBoot>: This is incorrect. Our local recycling / waste management group specifically asks you not recycle foils as they get stuck and gum up machines, same with wire hangers. They also ask you to not recycle food containers with food residue stuck, like pizza boxes as it contaminates the recycled product <tomoldbury>: Our local council asks us to ball up foil and food containers where possible, makes it easier for the magnetic and eddy current system to pick it up.<Green-man-group>: Alum. Is non ferrous <jbourne0129>: you can make it temporarily magnetic though and thats how they sort it out. They charge the metal with electromagnets &gt;9) Eddy current separator A magnetic field induces electrons in aluminum to create a magnetic field of their own, known as an eddy field. By interacting with the machine's magnetic field, the eddy field pushes aluminum off the main conveyor onto another one. <https>://www.popsci.com/technology/article/2013-07/how-it-works-recycling-machines-separate-junk-type#page-2<Not_so_ghetto>: That's awesome, I always wondered how they sorted these sorts of things out. Thanks<thedoze>: They used to use naked pigeons<big_duo3674>: It was a great day in history when they finally won the right to wear clothes at work", "num_messages": 8, "avg_score": 266.875}
{"start_date": "1544056773", "end_date": "1545156497", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 309, "text": "<CyberneticPanda>: YSK Doordash reduces the amount they pay the driver if you tip through the app, so tip with cash instead Doordash guarantees drivers a minimum amount per delivery that varies by area. If the minimum is $5 and the customer doesn't tip, Doordash pays the driver $5. If the customer tips $2, Doordash pays the driver $3, so they still only make $5. The minimum Doordash will pay is $1, so you have to tip more than $4 (in this example, the guaranteed minimum does vary) for the driver to actually make any extra money.<JimmyAttano>: This goes for other jobs that include tips like waiters/waitresses, they get taxed more in their paycheck if you leave the tip on your credit card. Cash is always the better option if you can. I would know I use to deliver pizza. <whatsabuttfore>: They get taxed more because they owe taxes on their tips. I always tip on my CC because I have to pay taxes on my wages so I see no reason they shouldn’t. <mightyqueef>: what difference does it make to you whether their tip is taxed or not? Going out of your way to make sure that they get to enjoy a lesser percentage of your tip accomplishes what exactly? <RareKazDewMelon>: Because that's tax evasion. You know, a crime?<mightyqueef>: Thank goodness this guy is purposefully avoiding paying in cash. Wouldn't want his servers to get arrested by the IRS. True altruism.<RareKazDewMelon>: Look, I know it's not that big of a deal, but it's pretty hard (not nearly impossible, just hard) to claim a moral high ground while helping someone break a law<mightyqueef>: It isn't about any moral high ground. I just don't see the principle of it. When giving someone a tip, I cannot comprehend why you would be adamant that the government take a slice. You may as well lower the tip in cash, and give the difference to charity. Either way, the tip you are giving to your server is diminished. It just seems like a fuck you to the server for no reason (assuming that the server hadn't been planning to declare the tip in the first place). So who walks around with that attitude? Where does that sense of obligation come from to make sure that someone with a base pay of 8$ an hour isn't trying to enjoy a fuller percentage of the tip you gave them? The whole idea drips with resentment. <RareKazDewMelon>: Because taxation is the backbone of the economy. They are supposed to be reporting tips and paying taxes like everyone else, so that everyone gets taxed more fairly. If there's just a huge portion of workers not paying income taxes on the majority of their income, it fucks up the numbers. Maybe you think tax money is wasted so you want to stick it to the US gov, but that's a completely different argument.<mightyqueef>: So this guy is doing it for the good of the country..... Sorry, but I just don't believe that.<RareKazDewMelon>: I mean that's the fundamental argument, but I didn't know we were at a point where we got into arguments about whether or not we should commit petty tax evasion. People should stop at stop signs, avoid smoking in enclosed public spaces, and pay taxes. Shit just works better if people follow a set of common rules. Why should waiters get a tax exemption just because they get paid a bit differently?<mightyqueef>: So should I flag officers down when I see a Jay walker?<Tehsymbolpi>: If you tip, regardless of in cash or on a credit card, the person you're tipping *should* report the income. This means that for any law abiding person receiving the tips it doesn't matter because they still report the tip and pay taxes on the tip. They'll make the same amount of money either way.<mightyqueef>: I've said my piece, and of course I understand how taxation works. Tell me you don't understand the point I'm making. Tell me the purpose of making sure you never tip in cash.", "num_messages": 14, "avg_score": 22.0714285714}
{"start_date": "1544060345", "end_date": "1544238217", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 96, "text": "<IAmEbola_AMA>: YSK The IRS will not call you to collect money. If you receive a call from someone claiming to be the IRS, it's probably a scam Source and how to prevent falling victim: https://www.irs.gov/newsroom/irs-urges-public-to-stay-alert-for-scam-phone-calls Other IRS scams to watch out for: https://www.irs.gov/newsroom/tax-scams-consumer-alerts<m540nightowl>: Not probably, it IS A SCAM!<IAmEbola_AMA>: From the article: \" The IRS will not call you if you owe taxes without first sending you a bill in the mail. \" It sounds like they may try to contact someone by phone to confirm they're aware they owe money and might advise on how to pay legitimately after they confirmed the taxpayer received the bill. They won't pressure you to pay immediately or using weird payment methods like prepaid cards or gift cards.<fullheap>: People believing that the IRS wants gift cards honestly deserve to be scammed. I can’t comprehend how one could be so gullible.", "num_messages": 4, "avg_score": 24.0}
{"start_date": "1545177788", "end_date": "1545222420", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 13276, "text": "<Danel322>: YSK: If you find a wallet or a purse, you can drop it off at any U.S. post office box and they'll return it to the driver's license address free of charge You don't always have to return it to the police station, you can easily walk to a near by post office box.<swatlord>: A police station can look up the owner and call them to confirm what they actually want done with it (eg: keep at the station and pick it up). I had this happen to me some time ago. I lost my wallet on the side of the road and got a call from the police some months later to tell me some road workers found it and turned it in. <joshecf>: I am dealing with this right now. I found a wallet on the road but it is from a person from another country. I will just take it to the station but what about all the money in it? What if he never comes to get it from the police station? There is a decent amount of money in it.<swatlord>: That is a tough one. Do you know what country? There might be an embassy you could drop it to. <joshecf>: That’s something I hadn’t considered! I still feel like the police would be best though. No passport in the wallet. <swatlord>: Not a bad start. Please keep me in mind; I’d like to know the outcome. <joshecf>: Copying from another reply So I took the wallet to the police station but I took the cash out since it was a lot of cash and I didn't necessarily trust the cops (call me jaded). I did however leave a note in the wallet basically saying \"I found your wallet and if the cops find you then call me and I will give you your cash\". When I dropped it off the cops didn't let me give them my info in case the guy turned up so I am glad I left the note. 10min later I get a call from the police station saying that they had seen my note and that I needed to drop off the money as soon as possible (I found it funny they wouldn't take my info down but as soon as they knew that there was money, they were quick to get involved). I told them I was at work but I would do it as soon as I got the chance. After that conversation, I kid you not, I got THREE missed calls from the cops in the span of an hour until I was able to get back to them and they were like \"when are you going to drop off the money\"? after I had already told them I would do it as soon as I could. I asked if the guy had shown up and they said no but it was improper for me to hold on to the cash in case he showed up. I said that I was at work and would take the money as soon as I could. Finally I got another call about an hour later from the police station but this time it was the guy that had lost his wallet. We arranged a time for me to give him his money back but the cop got on the phone was like \"if you would have left the money then you would have made everything a lot easier for everyone\". I know that it might have not been the right thing to keep the money but I was just putting it in the only place I fully trust, with me. The cops were treating me like a criminal even though I BROUGHT the wallet to them in the first place. If I would have just dropped off the wallet with all the money then the guy would have picked it up and never been able to know who did it and I would have never known that the guy finally got his wallet back. If it would have happened to me then I would have wanted to have the persons info in order to at least say thank you. Anyways, I just needed to vent for the way I was treated for trying to do the right thing. The guy ended up giving me $50 which was really nice of him.<memphoyles>: You did the right thing, but I don't blame the cops for this if that was the note you wrote haha, you sounded shady there and they probably thought you were going to keep it or even try something with the tourist, hence the many calls. I'm no way saying what you did is wrong, quite the contrary actually because we know the full story you are telling, but try looking through the cops perspective.<joshecf>: I know, I don't necessary blame them but I could have just taken the cash and they would have had no idea. Instead I got in trouble for leaving a note for the guy to get in touch with me. I get I could have theoretically posed a threat to the tourist but damn, that would make me one dumb criminal. It was mostly the incessant calls that bothered me.", "num_messages": 9, "avg_score": 1475.1111111111}
{"start_date": "1545183447", "end_date": "1545228164", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 31, "text": "<Anduu1>: YSK: If you live in Canada your rights just got stomped on. [removed]<Powder_keg_hunter>: Why would you refuse if you weren't drunk.<Anduu1>: Are you serious? It's the principle. Next, they will want to search without due cause. I suppose you think someone is guilty when they ask for a lawyer?<Powder_keg_hunter>: No, because there's a difference between breathing into a tube and searching your car.<Anduu1>: What if they demanded a blood test?Are you going to let them force a needle into your arm?<Powder_keg_hunter>: No, once again, there's a difference between breathing into a tube and taking a blood test. <Anduu1>: Fine...let the police do whatever they want to you...I will stand up for my rights.<cck5000>: Which are bound by the laws of the land. Not every country is the same.", "num_messages": 8, "avg_score": 3.875}
{"start_date": "1544641364", "end_date": "1544725050", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 914, "text": "<unexpectedflinglobbr>: YSK pharmaceutical companies in the US are not the only ones to blame for high-priced drugs. Pharmacy Benefit Managers (PBMs) work on behalf of insurance providers and earn money based on how much they are able to reduce the price of a drug for the consumer... Pharmaceutical companies have earned plenty of blame and anger because of the way they have come to treat good health as not a right, but a reward for wealth. It should be known that they are not the only ones to blame. In the process of how drug prices are determined, the pharmaceutical company individually determines what the price of a drug should be. This is, obviously, where the initial stage of greed comes from. PBMs, which are behemoth third-party companies around the US, are employed by different health plans (insurance providers, Medicare, etc). Their job is to make deals with the drug companies to push certain medications or generic brands, negotiate large contracts to only buy one type of medicine from that one drug company, and manage distribution of the drugs amongst pharmacies. They also determine which drugs are covered by different insurance plans, process claims from consumers and pharmacies, offer rebates for consumers and pharmacies, and make sure the drugs are properly taken by patients. Additionally, many of them run drug delivery companies, (think about those companies who offer to deliver your medication via mail for a discounted price). These companies gain revenue based on how much of a discount they are able to offer the insurance companies and health plan providers. It would seem, this would encourage them to keep prices low for the consumers, but it actually creates an economy for extremely overpriced drugs that can be sold in bulk for a huge discount. For example, a name brand medication might cost $100 per pill. The same drug company may offer a generic at $10 a pill. If the PBM can encourage the insurance company to only cover the $10 generic, they can get a contract with the drug company to only provide their one kind of generic, thus forcing demand for that product. On top of all this, PBMs do not release how much they save the consumer on drug prices because it is considered an \"***industry secret***.\" All in all, this information may not be helpful in your day-to-day life, but I think it’s at least important to know. Here’s some information on the whole thing: &amp;#x200B; 1. [https://www.insidesources.com/pharmacy-benefit-managers-pad-their-profits-at-your-expense/](https://www.insidesources.com/pharmacy-benefit-managers-pad-their-profits-at-your-expense/) 2. [https://www.pharmacytimes.com/news/the-role-of-pharmacy-benefit-mangers-in-american-health-care-pharmacy-concerns-and-perspectives-part-1](https://www.pharmacytimes.com/news/the-role-of-pharmacy-benefit-mangers-in-american-health-care-pharmacy-concerns-and-perspectives-part-1) 3. General wikipedia article: [https://en.wikipedia.org/wiki/Pharmacy\\_benefit\\_management](https://en.wikipedia.org/wiki/Pharmacy_benefit_management) 4. [https://www.thebalancesmb.com/largest-pharmacy-benefit-managers-2663840](https://www.thebalancesmb.com/largest-pharmacy-benefit-managers-2663840) &amp;#x200B; &amp;#x200B;<-Economist->: Step 1 to a solution: campaign finance reform. Until that happens, what motivation does Congress have? Look at net neutrality. Congress was paid off despite a huge push back from voters. Drug companies also have pretty big development costs to cover. I believe I read somewhere that America is also the place that subsidies drug company profits due to price controls from other countries. Either way, nothing will happen until we take the money out of politicians pockets. <https>://en.wikipedia.org/wiki/Cost_of_drug_development<Hell_Camino>: 9 of the 10 largest pharmaceutical manufacturers spend more money on advertising and marketing than they do on R&amp;D. They are feeding you BS. <-Economist->: Marketing generates revenue. With R&amp;D there is no guarantee of revenue. Either way, they have to price to cover these costs. <Hell_Camino>: Growing up in NJ in the 70’s and 80’s, lots of our family friends and neighbors worked for manufacturers. I felt they were going to work each day to save the world. Total “white coat” or “halo” effect with those folks. Now, PhRMA companies just look like new version of Proctor &amp; Gamble. Build a brand and sell a bunch of unnecessary utilization to make sure they hit their quarterly numbers for Wall Street.", "num_messages": 5, "avg_score": 182.8}
{"start_date": "1543799011", "end_date": "1544055374", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 60, "text": "<WindowsRX>: YSK About NewsGuard, a browser extension that will inform you if the website your on is trustworthy or not<https>://www.newsguardtech.com/ The extension is maintained by journalist and will give 4 badges next to links to tell you how trustworty a site is with an extension. Green - the source you're reading is trustworty and rarely if ever shares anything that is false or not based on proof Blue - the source you're reading might not be accurate Red - the source your reading is not trustworty and regularly spreads fake or incorrect information and news Yellow - source is user generated and may not be accurate<wolfsettler>: Sorry it's garbage, tried it for a day and it's obviously bogus.<WindowsRX>: Your Post History: /r/The_Donald /r/Socialism What you do: call people commies, fight with anyone who identifies anything other than conservative. Your opinion shouldn't be taken seriously, ever. <Edit>: oh boy he downvoted me lol <Gabenism>: Don't have to go through your post history to know you're a trigger finger dipshit lmao<WindowsRX>: Oh. Is this little boy so upset he blocked me?<Gabenism>: what", "num_messages": 6, "avg_score": 10.0}
{"start_date": "1545197834", "end_date": "1545574485", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 48, "text": "<The_Russian_Empire>: YSK: there are many services that lower their price in order to keep you as a customer. This may seem obvious but in some parts that you may not expect for example on SoundCloud or Spotify if you cancel your subscription they’ll offer you the subscription at a lower price in order to keep you. <LiveTheTruth321>: The same for SiriusXM radio. Every time I renewed they wanted something like $220 but I mentioned the first time it was $180 and that's what I paid for each renewal.<afi44>: Sorry to bring this up, but you can get 5 months of service for around $25~ if you keep saying it's too expensive. . They (Sirius XM) have a crazy customer retention system. We were cutting cost to save money and I believe they initially offered 180 for a year and I told her no thanks. She then offered around 120. I said really I need to cancel to cut costs. Finally I was getting annoyed and she was like \"ok sir our last offer we can do all channels for 5 months for $27.88) I caved and did it. <D_Winds>: Just watch out for that Auto-Renew.<afi44>: Yeah! I always say a google calendar reminder and cancel it and they offer me the same deal again.", "num_messages": 5, "avg_score": 9.6}
{"start_date": "1545223722", "end_date": "1545272928", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3861, "text": "<Ihaveanotheridentity>: YSK: If you’re going to visit someone in the hospital, bring them an extension cord and earplugs. The former lets them use their devices in bed while plugged in, and their visitors can juice up as they hang out. The latter helps drown out hospital noises and helps them sleep.<Source>: I had two spine surgeries back to back (pun intended) and these were a lifesaver. <Edit>: To clarify, this is in leu of or in addition to flowers. The cord should be brand new in the packaging as should the earplugs. Don't give anyone used earplugs. That's gross.<kiwitathegreat>: Please verify that the person is allowed to have these items! Some units have policies on what items are allowed and it’s not always intuitive. Source: work on a unit that wouldn’t allow either of these items. <racloves>: Do you mind me asking why these items wouldn’t be allowed? No to sound stupid but I couldn’t see why headphones wouldn’t be allowed in?<SaladBurner>: Psych units don't allow things that can be used as weapons or for self harm. Cords can be used to choke people. <racloves>: Ah sorry that makes sense I hadn’t thought of a psych ward, I have heard about how everything is banned in case it’s used to kill themselves.<kiwitathegreat>: Exactly this. We don’t allow any potentially harmful items. Definitely worth verifying with unit staff before bringing something in! <saxlife>: Why earplugs though? I actually spent a week in a psych ward and I think I could have those? No earbuds, shoelaces, string from my hoodie, razors, sharpened objects like pencils, mouthwash (alcohol).... the list goes on <kiwitathegreat>: We go a little overboard imo but earplugs are allowed and provided by the unit if the pt doesn’t have their own. Although in the case of my initial comment, I transposed earplugs with another comment where OP referenced headphones.", "num_messages": 8, "avg_score": 482.625}
{"start_date": "1541703259", "end_date": "1543674291", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 58, "text": "<grandlewis>: YSK The inventor of the PSA test, taken by over 30 million American men yearly to detect prostate cancer, called it a \"profit-driven public health disaster\". He also stated that the test is \"hardly more effective than a coin toss.\" [This NY Times Op Ed](https://www.nytimes.com/2010/03/10/opinion/10Ablin.html), written by the inventor of the PSA test, sums up why the PSA test is a poor indicator of survival. \"American men have a 16 percent lifetime chance of receiving a diagnosis of prostate cancer, but only a 3 percent chance of dying from it\". It's an eye-opening comment on the American healthcare system.<auberus>: My grandfather had a PSA test done. It caught his prostate cancer so early that surgery was sufficient; there was no need for chemo or radiation, and it never came back. That was over 20 years ago, and he just turned 83 last month. I realize that's only one person, but it's not as if the PSA test never helped anyone. It saved his life.<iJeff>: The criticism isn't that it isn't actually identifying cancer - it is. The concern is that the cancer rarely progresses to a point where it's a problem. The procedures to remove the cancerous growths can sometimes be more harmful or risky than the cancer itself.", "num_messages": 3, "avg_score": 19.3333333333}
{"start_date": "1545233722", "end_date": "1545273521", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 78, "text": "<Sizzmo>: YSK: You can sign for packages online before the package gets to your house (if you're using UPS). You can create a UPS MyChoice account online (It's free). You'll get an email telling you you have a package that requires a signature. You can sign for it online, and give instructions to the driver on where to leave the package! &amp;#x200B; [https://www.ups.com/us/en/services/tracking/mychoice.page](https://www.ups.com/us/en/services/tracking/mychoice.page)<mitchcoin>: What if you order alcohol?<cyazwy>: Doesnt apply to alcohol deliveries", "num_messages": 3, "avg_score": 26.0}
{"start_date": "1545249036", "end_date": "1545255478", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 18, "text": "<Slim_Python>: YSK: You can use Cookie Auto Delete addon just to keep cookies of sites you care about. [removed]<Nicksil>: You can do this w/in the settings of your web browser. You disable saving of cookies all together, then white list the websites from which you want to continuing saving cookies.<Slim_Python>: yes but I prefer it to be convenient and the addon also inform me if I want to whitelist this site else it will delete its cookie.", "num_messages": 3, "avg_score": 6.0}
{"start_date": "1538738898", "end_date": "1538776708", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 3289, "text": "<barkooka1>: YSK that you can check to see if your email password has been breached. Within the past 2 years, there have been many breaches on websites where you entered an email and password for a login, and your passwords could be online somewhere for scammers to access. You can check to see if your email has been breached at https://haveibeenpwned.com and see the exact sites and dates that your account was hacked.<texit_>: Please enter your email and password to find out.<barkooka1>: Also pm your credit card number, 3 digits on the back and the expiration date. This way I can ensure that you never get hacked again. <mjy6478>: Did you know that if you type your reddit password, Reddit will automatically recognize it and blurt it out for you. My password is ********, see it works! /s<mangarooboo>: hunter2 Haha! Wow, it totally works! <barkooka1>: When you type hunter2 it’s shows up to us as *******<mangarooboo>: Haha cool. Wait how did u know my password<asafum>: But **** I *** ** just **** fucking ****. ** ****** make *** sense...<Mrmastermax>: NotanotherPassword007 It does not work", "num_messages": 9, "avg_score": 365.4444444444}
{"start_date": "1545267606", "end_date": "1545272724", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 6, "text": "[deleted]: YSK : If you are holding off buying hardcover books because they're expensive, buy used books from Amazon. They can start anywhere from $1. [deleted]<AnomalousAvocado>: You can also get most books from a public library for free.<sangytheWinner>: Yeah but you've to return it back<AnomalousAvocado>: After you've read it, what use is it? And having a book collection is heavy as shit to move.<sangytheWinner>: Not everyone is going to read books with in 30 days or whatever the time frame is. At least, I can't do that with my current schedule.", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1545177237", "end_date": "1545318858", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 42, "text": "<Infinitewizdumb>: YSK that you can recycle assorted plastics by bringing them back to your local grocery store, Wal-Mart or Target. I know you all try to use as little plastic as possible but it's everywhere and so hard to avoid. Please do not throw your plastics in the garbage at home. Instead bring them back to the grocery store either for a second use or for recycling. Here is some info on what can and can't be recycled. Thank you so much... Some plastics that can go into the bin are: plastic shopping bags (from any store — remove receipts, etc.), food packaging (Ziploc-type bags), bread bags, plastic liners from cereal boxes (do not include if they tear like paper), produce bags, dry cleaning bags (remove staples, receipts, hangars), plastic newspaper wrapping, product wrapping (such as covers a case of water bottles, etc.), bubble wrap and air pillows (popped), plastic shipping envelopes (remove labeling). ALL MATERIALS SHOULD BE CLEAN AND DRY. Not just a quick rinse — if your bags are not completely clean of food residue, they will contaminate the entire batch. Other plastics need to go into the trash. These include: frozen food bags, cereal box liners that tear like paper, biodegradable bags, pre-washed salad bags, candy bar wrappers, chip bags,and six-pack rings. PLEASE HELP OUT<karben14>: I am not sure the local market will appreciate you doing your recycling at the store. <Infinitewizdumb>: What are you talking about? They offer the recycling since curbside doesn't take most plastics", "num_messages": 3, "avg_score": 14.0}
{"start_date": "1545310131", "end_date": "1545419801", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 7650, "text": "<Grifter56>: YSK: Socks are the most demanded item at homeless shelters. Please spare a few dollars for a pack of socks and donate them. I know this might have been said already but a good reminder during the winter never hurts anyone. <bisnicks>: I wonder if it’d be better to purchase a pack of Hanes that may wear out quick-ish for less or if it’d be better to buy something more durable like a pair of Darn Tough for more? The Hanes could be used by more people, but the Darn Tough should hold up for longer and may not require the individual to have to go back for more so soon? <EDIT>: also wondering... is this a scenario similar to soup kitchens where it’s better to just donate money since they’re able to work with companies to purchase in bulk/overstock at a discount or does something like this not really apply to things like socks?<zandrexia>: Either way would be great. At one point in time I was super excited to get a 5 pack of socks from dollar tree. Now that I can afford good socks, I buy them, but a broke person will appreciate any sock that doesn't have holes, honestly. I know I sure did. Either way, if you donate ANYTHING, thank you. If everybody in America with a couple dollars to spare donated one pair of socks the homeless would be set for life. <MSU_Spartans>: If every American donated socks wouldn't that mean the homeless are buying their own socks?<ruppert92>: &gt; If everybody in America with a couple dollars to spare <ickolas>: Also, even if who he was replying to didn't put \"with a couple dollars to spare\", it's super super obvious what they meant. This is one of those shitty \"WeLl aCksUaLlY\" remarks that an edgy high schooler would try to make because of some semantic detail, totally ignoring context or intent.<mrmindful>: I heard the smug voice in your quotation. Well done!<ickolas>: Thanks, I'm really going for the \"I'm so genuinely uninteresting that I make my username my college sports team's name\" voice. I hope that was adequately conveyed. SPORTS.<EvilAsshole>: MSU sucks", "num_messages": 9, "avg_score": 850.0}
{"start_date": "1545320720", "end_date": "1545321599", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 10, "text": "<mrcoolguy1_1>: YSK: it’s okay to celebrate Christmas without celebrating the religious side of it. [removed]<abcriminal>: It’s a Pagan holiday and we are all free to celebrate.<mrcoolguy1_1>: Tell that to my neighbors who threw a fit when my other neighbor didn’t have any religious decorations and continued to harass them since last year. Not everyone has to have a Baby Jesus in their decorations. It disgusts me. They didn’t get gifts from us this year. (They claimed the “War on Christmas” is real because they didn’t have Baby Jesus.)<abcriminal>: Oh, good grief. The whole “war on Xmas” crap is so misguided and unnecessary. Seems like nothing more than a new way for them to scream “persecution”. <mrcoolguy1_1>: Absolutely. It’s ironic because persecution is their strong suit... <abcriminal>: Indeed. It’s beyond gross.", "num_messages": 6, "avg_score": 1.6666666667}
{"start_date": "1541692726", "end_date": "1541910810", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 16736, "text": "<ancient_scroll>: YSK that eating chicken or pork instead of beef saves about 80% as much in carbon emissions as going vegetarian. Beef is probably the most delicious of meats. I really like beef. I cook a mean steak. I've made beef wellington, red wine braised short ribs, korean BBQ beef, dry-aged steaks, 1/2lb pub burgers, (perfectly medium rare in the middle), surf &amp; turf, 24-hour slow-smoked brisket (sweet jesus it was good)... you name it. Beef was always my go-to. Beef is the best meat. But I recently had to face up to the fact that it's the worst meat for the environment. Cows create the most climate-change-causing emissions of any common farm animal. [https://www.washingtonpost.com/lifestyle/food/heres-how-much-giving-up-beef-helps--or-doesnt-help--the-planet/2017/07/20/03bb5ba2-6d60-11e7-b9e2-2056e768a7e5\\_story.html?utm\\_term=.ad62ffade048](https://www.washingtonpost.com/lifestyle/food/heres-how-much-giving-up-beef-helps--or-doesnt-help--the-planet/2017/07/20/03bb5ba2-6d60-11e7-b9e2-2056e768a7e5_story.html?utm_term=.ad62ffade048) According to this study, if you ate rice instead of beef once a week for a year, you would save 326 kilos of carbon. Chicken / Pork save 266 and 270 respectively - a large fraction of that 320. This is also taking into account methane for its effect on climate change and counting it as an equivalent amount of carbon. Cows release a lot of methane (lol yes farts) and it's enough to severely impact the climate. You don't need to radically change your life to start steering in the right direction. Make chicken or pork your default option when picking out your protein, or get the veggie option once in a while. Yes, there are bigger and better changes we could (and will probably need to) make to save the planet. But all you need to do to get started is ask for chicken instead of steak at Chipotle. I for one can live with that. From now on beef is only for special occasions, and I'll try and get beef that was raised by grazing.<4077>: I would like to point out that intensive pork farms are terrible for the local environment. However, an intensive chicken farm is no where near as destructive to it's local environment and their waste is used for fertilizer. Pig waste is pumped into ponds and left to fester and leach into local watersheds. The smell is often equally as pollutive.<ancient_scroll>: Yeah pig waste is no joke and raising pigs for slaughter is arguably more cruel. But if you are primarily concerned with climate change, either one is an improvement. <4077>: I'm against any intensive farming, but it is not a reality. So I just want to promote something more attainable and see where that leads. <iamsexybutt>: Lentils, peanuts, beans, peas, etc etc<4077>: A reality for some, but the general public isn't going to eliminate meats.<e-flex>: At the current price levels, no.<throwaway164579>: What do you mean? Vegetarian diet is way cheaper. Unless you mean meat is still artificially affordable enough for people to eat <wibblett>: I think he means that at the current prices people would still choose meat over vegetarian alternatives. I bought a pack of pork chops for $12 at Costco the other day. <buddha_punk>: For that same $12 you could buy a couple pounds of rice, and beans and still have money for some veggies and fruits. <wibblett>: I also buy rice and beans though and veggies. I love sticky rice with broccoli and asparagus. I also eat BBQ beans from time to time. <buddha_punk>: My point is that it is more affordable to eat without causing harm to others and also better for your own health as well as the environment. The pork chops are 100% unnecessary. <wibblett>: They are necessary to me though and clearly it's affordable. My wife made chicken teriyaki last night with white rice and vegetables. When you buy at bulk from places like Costco it becomes very affordable. Chicken is healthy too. I'm actually trying a low carb diet right now and have already lost 10lbs. Also drinking water only helped my health a lot. With the occasional coffee of course. <buddha_punk>: In what way is it necessary? Also a serving of chicken contains just as much cholesterol as a serving of red meat. Chicken, fish, and eggs being \"healthy\" is just a myth perpetuated and shoved down our throats by the industries that profit off of us thinking that. It may be affordable for you, but eating whole foods, plant based is still the most affordable option, healthier, and causes the least amount of harm. <wibblett>: They are necessary to **me** because I enjoy them. I've tried the imitations and they don't cut it for me. <buddha_punk>: You enjoying something does not make it necessary. There are people who enjoy smoking crack, but it isn't a human necessity. Is pleasing your taste buds worth more than a life? <wibblett>: Yes <buddha_punk>: Okay, let's apply that same logic elsewhere. Do you think people who abuse dogs or cats are justified in doing so if they get some sort of enjoyment from it? <wibblett>: No <buddha_punk>: Okay, so then why is it not okay to harm a cat or dog, but it is completely okay to harm a pig?<wibblett>: I don't eat cats or dogs<buddha_punk>: So if the only justification you have for killing a pig is the taste, then morally it is no different than someone beating a dog because they enjoy whatever pleasure they get from it. Both are completely unnecesssary, and both are completely cruel. You said abusing a dog or cat is not justified, yet your actions say something completely different. Eating animals directly supports animal cruelty on a massive scale due to a sensory pleasure and nothing more. A pig is no less deserving of a good life than a dog, cat, or we are.<wibblett>: I don't think eating pork supports animal cruelty. I'm not in favor of animal cruelty of any kind. <buddha_punk>: If you are against animal cruelty then I encourage you to look into where our food comes from. Factory farms and slaughterhouses are nothing but cruel. There are even documentaries on the subject, like Earthlings, Dominion, Land of Hope and Glory. If you don\"t want to watch a full doc, a quick search for \"slaughterhouse footage\" or \"factory farm footage\" will show you plenty of examples. If reading is more your thing, check out \"Slaughterhouse\" by Gail Eisnitz and also \"Eating Animals\" by Jonathan Safran Foer. There is a ton of information and documentation out there, widely available, showing how this is nothing less than extreme animal cruelty. And the majority of us support it, at least three times a day. The animals are treated horribly, then killed at an insanely young age. Just like a dog, a cat, you, and me these animals want to live. They don't deserve to be treated like objects then killed because we think they taste good. Purchasing these products directly supports the cruelty.<wibblett>: Thank you I'll give it a look. I can't promise anything though. <buddha_punk>: Thank you for being open minded enough to hear me out and look into it. No promises needed, I just think everybody deserves to know about this, because a lot of us don't. I didn't until Feb. Started dong tons of research and now here I am. Before then I ate bacon cheese burgers damn near daily. If you ever have any questions, or want more resources feel free to message me. If you do decide to try out a different way of eating check out challenge22.com for help with proper nutrition and recipes and overall support. Thanks again for the conversation and I hope you have a good night.", "num_messages": 26, "avg_score": 643.6923076923}
{"start_date": "1539049592", "end_date": "1539817555", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 44, "text": "<Photographer_Rob>: YSK: If your phone has a flashlight widget in the notification bar and your flashlight seems dim, tap the word \"Flashlight\" and you should be able to adjust the brightness. I would like other's input because my Note 9 flashlight was at the lowest level by default.<cmi_rollin20>: Works for the iPhone too; tap and hold the flashlight icon in the swipe-up menu<long_offensive_name>: You have to use 3D Touch on it. Just holding it doesn’t do anything different as far as I know.", "num_messages": 3, "avg_score": 14.6666666667}
{"start_date": "1545323125", "end_date": "1545370798", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 11, "text": "[deleted]: YSK: Jackets from Canada Goose are made with real fur and buying one of their jackets is supporting the trapping and killing of wild animals [deleted]<owlmob>: PETA supports the killing of tamed animals<ethanwc>: The Pen and Teller BS episode on PETA is amazing.", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1541535766", "end_date": "1543701477", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 25, "text": "<mclumber1>: YSK that giving or accepting free things because you voted is illegal If you happen to run across a pizza place promising you a free slice of pizza if you show proof that you voted, that is illegal. <https>://www.nytimes.com/2018/11/06/us/voting-free-stuff.html<derpfitness>: Illegal, but virtually never enforced... it's enforced as much as jay walking is enforced most likely lol. Not really a \"YSK\".<mrmabry>: Regarding jaywalking enforcement: you have never been to Austin, TX<derpfitness>: Austin Texas isn't anywhere on my list of places to visit. Grew up in the DFW area, left in 2006, fuck Texas lol.<mrmabry>: Agreed and similar situation: grew up in Houston, left 4 years ago", "num_messages": 5, "avg_score": 5.0}
{"start_date": "1545325832", "end_date": "1545335609", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 128, "text": "<flamants>: YSK that if you find someone's iPhone, you can hold down the home button and ask Siri \"whose phone is this\" to pull up the phone owner's contact info. Can save a lot of grief if the person is nearby or if you know them. This is a repost but the last one I saw was from 3 years ago, so I figured this could reach some new people.<NobodyLikesaWyvern>: She just told me she doesn’t know who this iPhone belongs to lol<flamants>: You gotta put your own info in your contacts. There should be a card that says “me” or something.", "num_messages": 3, "avg_score": 42.6666666667}
{"start_date": "1543682778", "end_date": "1543779558", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 18215, "text": "<jakebirder1>: YSK: Khan Academy has a section on Personal Finance that teaches you things such as how to do your taxes, pay for college, and save for retirement This is very useful for becoming independent and getting a job. You can access their Personal Finance section [Here](https://www.khanacademy.org/college-careers-more/personal-finance)<i_spill_things>: If you didn’t know already, Khan Academy never has any ads, and they earn pretty much all of their money through donations. If you like Khan Academy and want to support their totally free educational content, you should consider donating.<reaper21x>: If you use smile.amazon.com, you can set it to donate a portion to Khan Academy every time you place an order, without costing you anything. And use smile always chrome extension to always get redirected.<thatthat00>: Out of curiosity, is that donation coming out of Amazon's profit margin or does the price of the order increase to make the donation? <Apklax>: It comes out of amazons profit margin <grissomza>: And is made up by you buying more stuff through them then you would normally <Apklax>: Donating doesn’t give me an incentive to buy anything. It is just bonus to purchases I already planned on making. <ginsunuva>: It pushes some people on the border of adding some extra items over the edge because they think of the charity. You are not all of Amazon's customers, unfortunately<theg00dfight>: Who cares, though? Would you rather they NOT offer the option to donate a portion of profit to a charity of your choice? <ginsunuva>: Never said it's bad. Just that what the other guy said is a true fact", "num_messages": 10, "avg_score": 1821.5}
{"start_date": "1543416054", "end_date": "1543512471", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 5038, "text": "<xarzilla>: YSK That if you have a hard time seeing your lane when driving on dark roads because you're getting blinded by oncoming cars, you can just focus on the outside white line to stay within your lane. I learned this 12 years ago from my driving instructor, who was also a cop. This works especially well on country roads that have bad or no street lighting as oncoming cars completely blind you to your lane but if you just focus on that outside white line, you can see it really easily and can stay on course. <Edit>: Thanks for the info! TIL: That white line is called the \"fog line\" - https://en.wiktionary.org/wiki/fog_line<homemadestoner>: I have tested road paint in the past (retroreflectivity) and I can confirm that the white has much higher requirements for reflectivity than the yellow. In Pennsylvania, at least. Fun fact: the lines are shiny because there are small glass beads deposited on the fresh paint while it is still wet<xarzilla>: Exactly. The white lines stay illuminated even when those ultra bright high-beams brutalize your cornea and you lose all sight of where you are.<RelevanttUsername>: Can confirm, drive a new car with the slick headlights and now there is simply no other way to drive. My wife has the exact same car without the LEDs and it is noticeably different. <Drakenking>: Cars with properly mounted LEDs aren't an issue, it's the schmucks that buy it off Amazon and install a 15k lumens bulb aimed directly at your cornea where it becomes an issue<sigharewedoneyet>: I like to direct the light reflection back to the car behind me when I get blinded from behind. I've watched them switch out of the lane only to watch them than speed up just to get in front of me. <AshTheGoblin>: How? <sigharewedoneyet>: Wait till your at a stop light and practice your light reflecting skills when you have a bright lighted douchebag behind you blinding you. You can even notice the light reflection move around as you angle the mirror. And if you know anything about light reflection and predicting the angle you need to force the blinding light back at the culprit you got a recipe for some passive aggression. <AshTheGoblin>: Oh you mean with the rearview mirror. Good idea, I'll have to try that. <sigharewedoneyet>: Actually all three. Nice to have all your angles covered.", "num_messages": 10, "avg_score": 503.8}
{"start_date": "1543481904", "end_date": "1543687208", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 60, "text": "<bff124>: YSK You don’t need to separate whites and colors in the washer if you aren’t washing new clothes [removed]<Petrazole>: This is definitely not true and is a shitty YSK. My jeans still ruin my white tshirts, even though i had the same jeans for two years.<gonads6969>: I know just read the tags.", "num_messages": 3, "avg_score": 20.0}
{"start_date": "1543275245", "end_date": "1546452114", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 48, "text": "<a2thenthony>: YSK that if you plan to fly on Spirit Airlines, you can purchase your ticket at the airport to save up to $40 on your round-trip ticket cost This fee is called a Passenger Usage Fee and it is waived if you buy your ticket at a Spirit counter at any airport Spirit operates in. This also applies if you are purchasing a one-way ticket for a savings of $20. If a trip to the airport is worth the savings for you, then this is a great way to save some money on your trip! Spirit hides this information from plain sight on their website but it is clearly stated in their [terms and conditions](https://www.spirit.com/content/documents/en-us/General_Terms_and_Conditions.pdf) on pages 2 and 3.<jjsibs>: Does this only apply to spirit airlines? <a2thenthony>: AFAIK this only works on Spirit. There may be other US-based airlines out there that include a fee for online bookings but I can't confirm.", "num_messages": 3, "avg_score": 16.0}
{"start_date": "1545339659", "end_date": "1545693218", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 40, "text": "<the3dtom>: YSK: Google's voice search feature also has a built-in music identifier similar to Shazam. It instantly searches Google for the music and is available on any device that has Google. Simply press on the voice search button and then on the note symbol in the bottom right to start searching. For those of you who want a good alternative to Shazam. <Scadden>: Siri does it as well if you say “hey siri, shazam that song”<RS6MrROBOT>: Or “hey siri, what is this song?”", "num_messages": 3, "avg_score": 13.3333333333}
{"start_date": "1545394640", "end_date": "1545430798", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 19179, "text": "<SaySomethingDesign>: YSK that one can of tuna contains more mercury than a kid might receive if they got a full round of vaccinations. Why you need to know this? So you can turn anti-vaxers efforts on tuna instead and save countless vulnerable lives in the process. EDIT So this turned into a really great discussion. Thank you guys so much for the great info and many, many laughs. Suffice to say it's been a good day. I was asked for a bit of a summary for the latecomers so I'll give it my best shot based on the questions and answers given here. First and foremost: eating tuna with moderation is A-OK! Tuna salad does not cause autism just like mercury doesn't cause autism. There are, however, recommendations regarding intake that everyone should be aware of. If you are pregnant, are nursing, have young children (under 5) or have a compromised immune system, talk to your doctor. <https>://www.fda.gov/food/foodborneillnesscontaminants/metals/ucm351781.htm There are different types of mercury with different properties. Ethylmercury a byproduct of vaccine componant thimerosal. It can be toxic if inhaled in, you guessed it, toxic amounts. Methylmercury is highly toxic when ingested too often, is absorbed in the digestive tract and is found in fish like Albacore tuna and many other species of fish and shellfish. Your weight has an impact on how toxic a dose can be.<https>://www.cdc.gov/biomonitoring/Mercury_FactSheet.html Thimerosal is a component of vaccines that breaks down into ethylmercury (eg non-toxic) that is barely used today. Overall, mercury is not used in vaccines. Thimerosal is mainly used as an anti-bacterial and anti-fungal agent.<https>://www.cdc.gov/vaccines/hcp/patient-ed/conversations/downloads/vacsafe-thimerosal-color-office.pdf The claim that mercury in thimerosal caused autism is false and came from Andrew Wakefield. His paper was retracted due to faulty methodology and he was disbarred as a doctor (and yes, that is apparently the right way to describe a doctor getting stripped of his medical licence).<https>://www.ncbi.nlm.nih.gov/pmc/articles/PMC3136032/ For the real nerds, here is the original paper:<https>://www.thelancet.com/journals/lancet/article/PIIS0140673697110960/fulltext Some people here played with the mercury from thermometers as children and now seem to collectively be waiting to die. If you are/were one of those children, you can breathe easy. It doesn't really go through your skin.<https>://www.ncbi.nlm.nih.gov/pmc/articles/PMC3514464/ Toxic methylmercury accumulated in food chains and is not supposed to be at such high levels in porpoises, fish and shellfish. We've made a mess of the place.<https>://journals.plos.org/plosone/article?id=10.1371/journal.pone.0197220 Also, randomly, here's a link to the brainchild of a 16 year old now spending his days cleaning up the oceans.<https>://www.theoceancleanup.com/ The main point I was trying to make is that you need to follow the logic. I don't hate tuna, I don't want you to hate it either. It's really amazing how many of you dove in and started researching for yourself. We need more of you in the world. And to all of you claiming I need to cite my sources, you are entirely correct. The burden of evidence lies with the claimant. I hope this appeases you. (source: me) Also Jim Halpert is a smug bastard.<https>://www.reddit.com And all of you artistically inspired me to do this...<https>://www.redbubble.com/people/say-something/works/35843731-save-tuna?asc=u&amp;ref=recent-owner <netramz>: Does this mean eating a lot of tuna is potentially dangerous and I should avoid it, or is the risk negligible but greater than that of vaccines and it would be cool to focus on the ocean instead of letting kids die?<FIR3W0RKS>: Interesting question, I actually had to research an answer for this one. You would have to consume a considerable amount of tuna in order to accumulate the required dosage of mercury. The way mercury works is that it is biomagnified through the food chain, so animals lower on the food chain will have small amounts, but ones higher (ie sharks etc) will have much higher levels of methylmercury, maybe 10/20 times as much. Therefore the currently recommended amounts to eat of each fish are: for fish lower on the food chain (krill, Pollock, oysters, salmon) you can eat as much as you like due to their very low mercury content. Canned tuna or trout should be eaten up to a few times a week, and bigger fish such as shark, pike or halibut should only be eaten a few times a month. Excessive eating of bigger fish will result in minamata disease, which is essentially severe mercury poisoning of the brain. <MisterOkay>: Since human considered to be top of a food chain. Is it safe to eat human?<FIR3W0RKS>: Technically speaking no, for multiple reasons. However from a mercury poisoning perspective, unless you're eating their brains or kidneys, then you should be totally fine since that's where it builds up in humans<Sabnitron>: You've piqued my curiosity. What isn't safe about eating human flesh?<CatastropheWife>: Prions.<bro_before_ho>: i don't eat the brains will i be ok?<doomshrooms>: Nope, it can happen spontaneously!<bro_before_ho>: What's a source of vegan meat i can switch to?<doomshrooms>: Na man, i mean it can happen spontaneously inside you, for no reason, totally independent of your diet<bro_before_ho>: Oh thank goodness i thought i'd have to give it up.<doomshrooms>: Nope, carry on", "num_messages": 13, "avg_score": 1475.3076923077}
{"start_date": "1545372936", "end_date": "1545454045", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 40, "text": "<Holeinmysock>: YSK: \"Hell's Itch\" affects some people after sunburns. The pain of a hot shower on the itchy areas can provide relief. Use sunscreen.<NRTS_it>: As a person that has been affected by this, yes. I was completely unable to sleep one night due to hells itch on my back.<Surisuule>: I collapsed screaming in a gas station during a particularly bad bout.", "num_messages": 3, "avg_score": 13.3333333333}
{"start_date": "1545398324", "end_date": "1545399656", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 12, "text": "[deleted]: YSK: If you are in traffic and all lanes are stopped or slow, you should not move to the \"open lane.\" [deleted]<Asylumstrength>: If everyone merges in turn it makes the greatest use of available road, minimises disruption and prevents blocking of earlier junctions or intersections. Not letting someone in, due to a pathological dislike of what is wrongly perceived as “que jumping” slows down traffic more than anything else. If a lanes closed, it will slow traffic in Itself, blocking people to a standstill is moronic and has been proven time and again to be counterproductive, while zipper merging, or merging in turn and using all of the available road reduces traffic, stoppages and shortens everyone’s journey time <Bang0Skank0>: It just seems logical, yet I see this every week--people actively blocking people from merging. But none of us are getting anywhere fast.", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1545393034", "end_date": "1545882713", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 121, "text": "<Catnapo>: YSK: Never arrive at the secondary location If you ever should get kidnapped you should rather die trying to fight them than get brought to the secondary location . Because in 99% of the cases you will die there after they have done things to you beyond imagination. Just do everything possible to never arrive there. <chadthemiller>: STREET SMARTS!<starlord97>: Street smarts with J. J. Bittenbinder!!", "num_messages": 3, "avg_score": 40.3333333333}
{"start_date": "1543692159", "end_date": "1543709179", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 23, "text": "<DannyBoy7783>: YSK that Amazon does not offer price-drop refunds on items you've purchased. I've recently dealt with this on two occasions with Amazon. The only way to take advantage of a price drop is to cancel items that haven't yet shipped and buy them again at the lower price OR return already-shipped merchandise and repurchase it at the lower price. This seems silly to me but that's their policy. From looking online it appears they used to be more flexible about this but have tightened their policies which I have just confirmed with Amazon Chat. I'm sharing this to save others from wasting their time with Amazon's customer service. I didn't push the issue with Amazon but has anyone actually managed to get a straight up price-difference refund from them recently? It doesn't appear possible from what they are telling me. <probablymystory>: If you buy a chocolate bar for £2 and then eat it do you get 60p when the price changes to £1.40<DannyBoy7783>: If it hasn't shipped yet then yes, you should.", "num_messages": 3, "avg_score": 7.6666666667}
{"start_date": "1543460347", "end_date": "1543462132", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 130, "text": "<darknep>: YSK about Historical Aerials, a website where you can view old satellite images of places dating back to the 1930s, or maps of places dating back to the 1890s [https://www.historicaerials.com/viewer](https://www.historicaerials.com/viewer) (LINK). \\*\\*EDIT\\*\\* Not satellite images for really old images (pre-1960), they compile aerial images for popular places &amp;#x200B; It's a site where you can see a collection of old satellite images and see how your house looked like 30-40-etc. years ago.. if it was there. I find it interesting visually seeing how places look like, have changed, etc. So, I found that site and would like to share it to you!<ricorico123>: Soooo.....how are we going to view satellite images from these time periods when the first images of Earth from satellites didn't exist until 1959. <Edit>: [Wikipedia article](https://en.wikipedia.org/wiki/Satellite_imagery?wprov=sfla1) Edit #2: Happy Cake Day<darknep>: aerial images\\* my bad. They compile aerial images of popular places like New York.<ricorico123>: I gotcha. Guess I was a little worried it might be a scary link to something crazy. But again, Happy 🍰 Day! I just checked it out now, pretty awesome site!<darknep>: Thanks! Yeah its cool!", "num_messages": 5, "avg_score": 26.0}
{"start_date": "1539893056", "end_date": "1540316584", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 60, "text": "<Jtizzzle>: YSK the proper way to smoke/inhale weed. (Especially if you're Canadian) For all my Canadain bros and girls who will be popping their weed cherry this weekend. Draw the smoke into your mouth first, then inhale sharply all at once. Dont straight inhale. There, just saved you a coughing fit and looking like a bitch. :)<sideways_blow_bang>: My girlfriend wants to blow tokes up my ass Saturday when she gets off work and comes over. She wants me to do the same to her. Will I get high from this if I hold it in? Will my rectum get scorched? Is this a bad idea for us? Has anybody done this before?<atworkworking>: Please let us know what the outcome of this is. I am also interested in getting tokes blown up my asshole.<sideways_blow_bang>: I'll provide an update on Sunday if Saturday night goes as planned.<Senekoa>: Well?<sideways_blow_bang>: We got a great body stone. Crept up slowly then into the mind. Used potent wheelchair kush for the super butt tokes. Cleaned up prior with enema bag in the bath. Good clean fun. Had some wine and lots of laughs. Spent two hours rolling around doing various sexual things. Smoked more weed. Ate lasagna, drank more wine and then Netflix. Highly recommended but the preparation in the shower/tub/toilet takes a little time and effort. Laughed our asses off big time. Think about it? <thinthickthin>: boi", "num_messages": 7, "avg_score": 8.5714285714}
{"start_date": "1542744548", "end_date": "1542767173", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 10256, "text": "<americancowboy>: YSK that if you are in the US, you should throw away any type of romaine lettuce in your home, restaurant, etc. The CDC released a warning today:<https>://www.cdc.gov/ecoli/2018/o157h7-11-18/index.html From the article: - This advice includes all types or uses of romaine lettuce, such as whole heads of romaine, hearts of romaine, and bags and boxes of precut lettuce and salad mixes that contain romaine, including baby romaine, spring mix, and Caesar salad. - If you do not know if the lettuce is romaine or whether a salad mix contains romaine, do not eat it and throw it away. - Wash and sanitize drawers or shelves in refrigerators where romaine was stored. Edit 1: Here's a map of who got ill where (Credit to u/gt24): https://www.cdc.gov/ecoli/2018/o157h7-11-18/map.html Edit 2: Canada too (Credit to /u/ashkestar): https://www.canada.ca/en/public-health/services/public-health-notices/2018/outbreak-ecoli-infections-linked-romaine-lettuce.html<Stormshooter>: This sounds crazy to me. romaine is the most popular I think? What kind of contamination would have you clean the storage area as well? sounds serious.<H3rlittl3t0y>: E coli or salmonella most likely, both of which can be sanitized with bleach. <americancowboy>: The warning says E.coli. Don't know how they plan on solving the problem<ob_gyn_kenobi3412>: Soak our romaine supply in bleach. Boom, problem solved.<seekret>: If I just use bleach as the dressing can I still eat the salad?<yipyipyoo>: Yes<Big_Metal_Unit>: **DO NOT LISTEN TO THIS PERSON. YOU CANNOT USE BLEACH AS SALAD DRESSING** It would taste *awful*. First you mix the bleach with some olive oil, white wine, and little salt and pepper. Makes a nice vinaigrette that also disinfects. <ICUCorpsman>: Found my next cleanse!", "num_messages": 9, "avg_score": 1139.5555555556}
{"start_date": "1543502513", "end_date": "1543538027", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 104, "text": "<BetaChorale>: YSK Dumdum candies now have wrapper codes you can use to accrue points for free merch, instead of sending them in. ...Got any sour apple ones? Link [here](https://www.savewraps.com/how-it-works/). The shipping is free on all merchandise, too. I wonder if Toostie pops is doing anything like this with their stars.<LeftLegCemetary>: Weirdest post in this sub ever. <BetaChorale>: I'm just hoping to bank on that nostalgia karma my g<LeftLegCemetary>: I gave you one, b<BetaChorale>: Thank you thank you my good dude", "num_messages": 5, "avg_score": 20.8}
{"start_date": "1536344338", "end_date": "1536505054", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 118, "text": "<DuckTheFuck10>: YSK: If you really want to support animal rescuing DONT support PETA, support Animal aid unlimited instead Peta doesnt believe in pets and that having pets is cruel, they kill all injured dogs or cats that people give or they find, peta’s goal isnt to end animal cruelty, its to end having pets, animal aid unlimited instead is much better to support, they have many many videos of them rescuing all kinds of animals in india, saving them and then having people adopt them. Peta is a horrible organization and i am surprised people still give them money without realizing what they do with it.<lancehol>: donating or supporting PETA is the worst thing you can do for the welfare of animals. They've had their members stealing peoples pets from their property and euthanizing them in the past. In my opinion PETA are as evil as puppy mills.<DuckTheFuck10>: I know its insane, i dont even think they were tried for those **crimes**<lancehol>: No, I don't think anything was ever done about it.<DuckTheFuck10>: Theyre basically genociding all pets<lancehol>: That is their objective. They apparently believe that having a companion animal is tantamount to slavery and evil. Personally, I think they are just basically evil people.", "num_messages": 6, "avg_score": 19.6666666667}
{"start_date": "1544138080", "end_date": "1544190678", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 47, "text": "<kisamoto>: YSK if your bluetooth speaker or headphones just has a play/pause and volume controls you can double press play to skip forward a track; triple press play to go back a track Save getting your phone out of your pocket or finding it if you're walking around wireless - a quick double press will skip to the next track<Kalsiddon1>: Mine calls the most recent number I called if I press it twice.<milksss>: Same with mine. &amp;#x200B;", "num_messages": 3, "avg_score": 15.6666666667}
{"start_date": "1545407805", "end_date": "1545415482", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 32, "text": "<rulerdude>: YSK that UPS and FedEx will hold your package at the dispatch facility or a store if you go online to request it UPS and FedEx both have free delivery management tools that, once you confirm your address, will allow you to choose how packages are shipped to you. So if you know you're not going to be home and are worried about porch pirates you can either request for free the package be held at the dispatch facility or a store for you to come pick up. There's also a paid option that allows you to deliver the package to another location (like a neighbor's house), schedule delivery on another day, or select a 2-hour confirmed delivery window<TheCheshireCody>: I have been told repeatedly by both UPS and FedEx reps that they will not under any circumstances allow a package's destination to be changed by anyone but the shipper. They will sometimes allow a change of delivery schedule (say, to an evening delivery) and my personal experience with several attempts is that getting them to hold a package at their dispatch is an iffy prospect at best. Most recently I had success with having a package held for pickup because I was not informed by the shipper that it would be sent with a signature required.<rulerdude>: For UPS, According to their [website](https://www.ups.com/mychoice/features/) they allow the recipient to deliver to another address for a $5 fee", "num_messages": 3, "avg_score": 10.6666666667}
{"start_date": "1542337056", "end_date": "1542396394", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 4302, "text": "<AwesomeAni>: YSK That there are 7+ albums of GOOD Christmas music that they won’t play on the radio. There are actually more Christmas music than the same 12 songs that come on the radio. It’s on Spotify, the albums are called “a very special Christmas.” There’s pop, rock, jazz, and even rap covers of classics AND brand new Christmas songs. My favorite is “Oi to the world” by no doubt and Santa Baby by Madonna. Check it out guys, happy holidays. <Edit>: There’s also twisted Christmas by twister sister, and August burns red does a cover of carol of the bells. I’ll post more if I think of more. <Prevette1990>: Why don't they switch it up on the radio? Licensing or something? Serious question. Even non holiday it's the same freaking songs every few hours every day. There are literally thousands of other songs. Sorry for rant/off topic<pmjm>: Radio guy here! They do extensive testing and focus groups year after year. Generally they are what's called Auditorium Tests, where they play the choruses of particular songs and the audience shares their reaction to them. In short, the songs that get the best reactions make it on the radio. Better reactions lead to the song getting played more often. In the last few years radio has also been tapping into streaming data, predominantly through the iHeartRadio app but they also buy data from Spotify, etc. The songs that get streamed the most get played on the radio the most. Those who complain about it are the vocal minority. Everybody else is content with the same songs over and over again. Especially for the holidays, where familiarity brings comfort.<Funkula>: Who selects what songs play in the Auditorium Tests? It's all payola bullshit that caters to the lowest common denominator. I wouldn't for a second believe these tests are unbiased in anyway. They just need their preferred record labels to put out music just bland and inoffensive enough to prevent people from switching off. If the this minority was so inconsquential then platforms like Spotify and SoundCloud wouldn't be so popular.<pmjm>: The auditorium test songs are generally selected by the program director and music director. These days that position tends to be held by the same person. You test primarily recurrents (songs that are ~6 months old) and golds (older songs) to determine how you prioritize their playback, or if you should even play them at all. Occasionally you test currents (if you're in a current-based format - for example an oldies station would never test a current), but those you basically are testing a black-or-white play-or-don't status on those. Spotify and SoundCloud are popular because you instantly hear what you want, when you want, and there are no commercials (assuming you pay for it). It's instant gratification, something that radio can not compete with. The days of payola are gone. Radio has been under such scrutiny by the federal government and the FCC over the last few decades that they couldn't get away with that anymore. Where they do make compromises is things like artist access. By playing an artist that is friendly to the radio station or corporation, they help make that artist a star while ensuring that artist will happily perform at the station's summer concert, where the radio station makes a huge amount of revenue. As for Christmas music, there's a station here in Los Angeles that's known for flipping to all Christmas called KOST 103.5. They usually flip to Christmas around the second week of November, and they are the prime example of Christmas radio in the country. Yes, they play the same stale 100-song Christmas playlist year after year, but what's staggering is that they DOMINATE in the ratings for the winter book. I mean, it's not even close. The second place station is generally 30-40% below KOST in the ratings when they flip to Christmas (for the rest of the year the margins are usually around 5% between 1st and 2nd). It's seriously mindblowing how well they do playing the same old songs. So we can question the methodology all we want, but at the end of the day it's highly effective and makes them the market leader for the Christmas season.<ancepsinfans>: Thanks for the detailed response! I’m not OP, but I have a question. Wouldn’t it make sense that KOST kills it in the ratings because stores and fast-/semifast-food places switch to them blindly because it’s the holiday season? I ask because I used to work at one such place (a deli) and the GM insisted that people liked it. What he didn’t know was that on Saturdays when he was off work, we would change the station back to something else equally inoffensive, and the customers actually *thanked* us for providing them with a quiet island of peace away from the Christmas songs. Point being that ratings don’t necessarily equal desire.<pmjm>: These days that is true, because exposure to a station automatically counts towards ratings. Today we use a method called People Meter to measure what stations are being listened to. Randomly selected people carry around a device that basically works like the Shazam app in that it tells you what stations you're listening to by measuring an inaudible signal encoded into the station. In the past, however, ratings were diary based. Meaning when you were selected to participate in the survey you were required to write down what you listened to when, and for how long. This method was wildly inaccurate in terms of recording, and radio stations tended to do better when they made themselves memorable. That's why you had station jingles and slogans like \"KISS FM is my vacation station!\" and \"MEGA brings you the Phrase That Pays\" in order to win stuff. With BOTH of these ratings methods the Christmas format is insanely successful. As I mentioned in another comment though, the format has a quick burnout factor if you're exposed to it too long (as retail employees often are, and those of us who actually WORK at these stations just want to shoot ourselves by late December). But the average consumer only gets it in 30-60 minute blocks at a time.", "num_messages": 7, "avg_score": 614.5714285714}
{"start_date": "1543351177", "end_date": "1543781337", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 39, "text": "<justwendii>: YSK Mink Lashes Are Animal Cruelty Many people don't know that mink eyelash extensions come from animals. Please stop animal cruelty and don't use mink lashes. &amp;#x200B; [https://beautface.wordpress.com/2018/09/10/the-journey-begins/](https://beautface.wordpress.com/2018/09/10/the-journey-begins/)<Xx_dead-cats_xX>: You know what gets me about this? The rest of the mink is gonna be thrown away. With other farmed animals almost everything is used and for some animals everything IS used.<justwendii>: Completely agree, I am not vegan but at least farm animals are used for food and nothing is wasted. What gets me sad is that this is just for vanity. Smh :(", "num_messages": 3, "avg_score": 13.0}
{"start_date": "1543769975", "end_date": "1543972294", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 13682, "text": "<Arboria_Institute>: YSK you can analyze the rating of an Amazon product on reviewmeta.com, which will check the reviews for suspicious patterns/behavior. It's free, and they also have a browser extension that will do it automatically. Came across it when I was trying to figure out why a well-reviewed product I bought was garbage. Sure enough, almost all of that company's products were red-flagged. Don't make the same mistake I did. Could've saved myself a decent amount of money if I'd known about it earlier.<Canis_Familiaris>: Can we get this for Reddit accounts too?<Dixiklo9000>: r/masstagger https://masstagger.com/<Spaceguy5>: Masstagger doesn't target spam accounts. It doesn't have any algorithms to target spam/suspicious accounts. It just tags Reddit accounts from subs the developers disagree with politically, by scanning those subs for a list of users. It's garbage software.<TistedLogic>: It tags users who are a part of openly racist/homophobic/etc subs. Not just \"subs op disagrees with\"<Spaceguy5>: Yes because obviously all conservative leaning people are racist homophobes. Even the POC/gay ones. 😏 It targets conservative subs. Yeah there's some actual bigoted subs on their list. But there's a lot more included just because they lean conservative. Whereas the developers of it are actual communists. And don't include violent communist subs. Even rightwinglgbt is included on their list. I'm sure that sub is fullllll of homophobes.<PM_ME_WEIRD_SMILES>: Not to argue that all conservatives are racist/bigoted/whatever but being a thing doesn't stop you from hating that thing. Black people can hate black people. Gay people can hate gay people. Or hell they can even hate cross ways like black people hating gay people or gay people hating black people. <TistedLogic>: Yes, it's true than not ***all*** conservatives are racist/bigoted, but there is a far larger portion of them who *are* than on the liberal side.<garfield-1-2323>: That's a completely baseless assertion.<TistedLogic>: No. No, its not. Get your head out of your own ass.<garfield-1-2323>: Yes. Yes it is. Get your own head out of your own ass.<TistedLogic>: Good to know conservatives are as full of themselves as they racist. You've made that much clear.<garfield-1-2323>: Way to use \"b-but you're racist\" two times in a row without any sort of facts or basis in reality. It must be nice living in fantasyland where anyone who disagrees with you is a \"racist.\" You're such a joke.<TistedLogic>: Oh, like that? I never once said you were racist. I said &gt;there is a larger percentage of racists who are conservative than liberal. I shouldn't have to source that information. It's pretty common knowledge. The fact you're trying to twist what I've said is patently amusing. And ***I'm*** the joke? NelsonLaugh.jpg<garfield-1-2323>: It's not \"pretty common knowledge,\" and the fact you can't back up your claim after being called out twice is pathetic. But yeah, ok pal. Keep quoting cartoons at me.<TistedLogic>: The fact you haven't done any research showing that *conservatives* are openly racist is amusing and hilarious. Just look at the attack ads conservatives put out. Always about fear and hate of \"the other\". Liberals, on the other hand, have simply used the words and actions of conservatives against them. So, for example, Conservatives FOUGHT AGAINST: Independence Slavery Women's Suffrage Civil Rights It was *conservatives* who tried to repeal every good thing this country has tried to do. Most recently, the ACA/\"ObamaCare\" (which was just a modified version of Mitt Romney's plan. So, please, continue living in a fantasy of idiocy. I can do this for days. <Edit>: seems Reddit agrees with my position and not yours, so... NelsonLaugh.jpg (again)<garfield-1-2323>: Yeah the first place I'd look at is political propaganda. You have no clue of actual historical facts, don't you? DEMOCRATS fought against: preserving the union, ending slavery, women's suffrage, and civil rights. CONSERVATIVES fought for: preserving the unoin, ending slavery, women's suffrage, civil rights, ending the disaster called \"Obamacare\". Live your own fantasy land. Do it for days, I don't really care at all. Fool.<TistedLogic>: &gt;DEMOCRATS fought against: preserving the union, ending slavery, women's suffrage, and civil rights. This ignores the political shit in the 60s. It's also why I used \"***conservative/liberal***\". Democrats, for the longest time, were the party of conservatives. That changed during the Civil Rights Movement. And no, conservatives fought AGAINST all of that. REPUBLICANS (who, at the time we're the party of liberals) fought for the end of slavery. Saying anything else is just patently untrue. But please, continue this narrative. It just shows how fucking ignorant you actually are..<garfield-1-2323>: There it is, the old \"muh parties switched\" line. Go read a book. And you STILL haven't backed up your original claim. If you're going to continue baldly asserting stuff this idiotic, you need to back it up, otherwise you're just blowing hot air for no reason.<TistedLogic>: &gt;There it is, the old \"muh parties switched\" line. Yup, because it's true. Historical record in fact. Why don't ***you*** go do some actually historical research before you start with me on this. But since you've obviously given up on reality I am done dealing with your insanity. Please, before you respond, do some research into history. Preferably before you hurt yourself. I'll point out not once have I used the term Democrat. I have consistently used liberal/conservative because those are the ideologies. Democrat/Republican are party titles, not ideologies. So, for you to claim \"Democrat\" as a ideology is patently absurd. Lastly, sice you have given up on reality, no proof will ever convince you of anything, which is why I haven't bothered. You'd just claim fake news or just generally disbelieve reality.<garfield-1-2323>: Sorry, but you can't just create \"alternative facts\" by baldly declaring them. I see you still haven't read a book. Maybe you can catch a historical cartoon on PBS kids instead, since that might be more your level. Your party/ideology dichotomy is idiotic, and you clearly haven't considered that the definition of \"liberal\" and \"conservative\" have changed just as much as \"democrat\" and \"republican\" over the centuries, meaning that you can't just retreat into the safe space of those terms. So, not only have you shown a fundamental misunderestimation of history, you've done the same for language itself. Good job. Now, because I know your ego needs it, I'll let you get the last word.<TistedLogic>: I see you've still given up on reality. I don't have a misunderstanding of anything. I don't claim \"alternative facts\" which simply tells me that you won't accept any source I would give you so.. what's the point? You're not debating in good faith. You haven't from the start. I'm sorry the public school system failed you so badly you argue against reality.", "num_messages": 22, "avg_score": 621.9090909091}
{"start_date": "1543694696", "end_date": "1544028850", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 72, "text": "<theWinterDojer>: YSK: You can download offline versions of maps in Google Maps. This will allow you to search things and get directions even if you don't have signal. This is a great tip if you are traveling somewhere new and are worried about your signal. You can also go into airplane mode to save battery and still be able to get directions places! Screenshots and instructions for those curious: 1. Search your destination in Google Maps 2. [Hit the hamburger at the top left](https://i.imgur.com/ZcnwvZX.jpg) 3. [Tap \"Offline Maps\"](https://i.imgur.com/oIG3lXe.jpg) 4. [Tap \"Select your own map\"](https://i.imgur.com/mY6JAUK.jpg) 5. The window will show the area you are downloading. [Hit Download](https://i.imgur.com/kTczPz7.jpg) 6. Once it's finished go back into \"Offline Maps\" and [select the map you downloaded](https://i.imgur.com/c1XB6ZY.jpg) 7. [Tap your map at the top](https://i.imgur.com/rANtHRs.jpg) 8. [You can now search this area and get directions offline or in airplane mode](https://i.imgur.com/rANtHRs.jpg) Here's the [whole gallery](https://imgur.com/a/qJhsIG9).<raymondpeople>: Hi I'm just here to test some formatting. Great information though. ^^test ^^one ^^(test two) ^(test three) T^e^s^t^f^o^u^r<hirmuolio>: YSK: With [Reddit Enhancement Suite](https://redditenhancementsuite.com/) you get a live preview with formatting applied of the message you are wriging.<raymondpeople>: Oh, thanks!", "num_messages": 4, "avg_score": 18.0}
{"start_date": "1541448921", "end_date": "1543790271", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 9, "text": "<Renegade_Meister>: YSK severe vaccine side effects may entitle you to a settlement from [USA] Vaccine Court [removed]<RockYourWorld31>: I would like to remind everyone that you should still absolutely vaccinate for things like measles or DTAP or rubella, rabies, lockjaw etc.<Renegade_Meister>: I absolutely agree as I am not against many childhood vaccines, I am just skeptical of flu vaccine based on wide swings in year to year effectiveness - Hence my post. Rabies may be a much tougher sell for people given that I am not aware of any insurance that covers it, and it is not cheap compared to other more common vaccines.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1543246048", "end_date": "1543277152", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 2529, "text": "<Japjer>: YSK You can re-record a voicemail you're leaving on almost any phone by pressing # at any time This helps me a lot at work. If you record a voicemail for someone that you messed up, just hit the # button. You'll immediately get the option to send your voicemail, listen to the message you recorded, or re-record it. It helps a lot when I'm leaving a voicemail for someone important and stumble over my words.<houndi>: YSK voicemail as a technology became obsolete around twenty years ago...<dembroxj>: If you're applying to jobs it's used a lot unless if you're somebody who is always available to talk on the phone<houndi>: How? That's not how it works where I'm from, so I'm genuinely interested.<dembroxj>: When you apply, the employer will call you trying to get more info and set up an interview, but most of the time I can't answer my phone at that time so it goes to voicemail. Some have emailed but most have called in my experience. <houndi>: Can't you just call back? That's what I'd do. If an employer called me, they'd probably send a text and email as well if I couldn't answer. I'd much rather get stuff in writing rather than having to listen to a voice message over and over anyway. I haven't left a voicemail since the 90s, and I can't even remember when I heard someone have one. It's been dead here for a while.<Japjer>: What? What employer is texting you? Voicemails are solid methods for communicating in a business environment, especially if you have a number but no email. Texting a client is wildly unprofessional. Not trying to be a dick here, but it sounds like you've never really had a professional job. <houndi>: &gt;What? What employer is texting you? Any, since 90s when people got cellphones. Even oldschool conservative ones have done that since like 2000 at latest. &gt;Voicemails are solid methods for communicating in a business environment, especially if you have a number but no email. Over here they're a crappy method, since most of the time people or businesses don't have voicemails anymore. &gt;Texting a client is wildly unprofessional Why? I can't understand why a communication method itself is considered unprofessional somewhere, that sounds absurd to me. If you write a text in a professional manner, how is it different from any other written communication? Then again, downvoting all the responses to your comments is pretty unprofessional...<Japjer>: I've applied for dozens, if not over 100, jobs and I've never once had a potential employer text me. My current boss does, but I've been working with him for years and I don't mind. Where do you live that no one has a voice mail? I work at an MSP and contact clients, literally, from Manhattan to China. I've left voicemails across the globe, and my clients have responded to each and every one to some effect. Because you're limited to a small character count and broken message chains. You also don't have a guarantee that the recipient has a text plan or wants to text. Professional courtesy is a call or an email. That's just how it is, like someone somewhen decided that collars are required for men. Downvoting what? <houndi>: &gt;I've applied for dozens, if not over 100, jobs and I've never once had a potential employer text me. You've applied to a hundred jobs in Finland? See, I don't understand how your experiences in the States are relevant. We already established that apparently in the States the employers don't text, and that in here they do. Unless your job hunt happened over here, your anecdote is completely irrelevant as a rebuttal to my earlier comment. &gt;I've left voicemails across the globe, and my clients have responded to each and every one to some effect. I bet they have. Because the ones you've left voicemails have obviously had voicemails, so they obviously check their voicemail. Over here many people or companies don't use voicemails. That's literally what I've been trying to say throughout this conversation. &gt;Because you're limited to a small character count and broken message chains. Do you live in the past? You can send as long a text as you like. SMSs are automatically broken into 160 character chunks and stitched back together in the other end. That has been standard since 1990s. I've literally never experienced a broken message chain either. If that possibility is a serious reason to avoid that technology, you definitely shouldn't touch email or any other digital technology either. &gt;You also don't have a guarantee that the recipient has a text plan or wants to text. So you guys can't receive texts to your cellphones at all? That's absurd. As for their willingness to text, you don't need to know that. They're obviously going to call you back, you just text them your reason for calling and possible other necessary details. &gt;Professional courtesy is a call or an email. That's what you start with, yes. If they don't answer the call and you don't have an email, you send a text. As there probably isn't a voicemail. This is really an impossible concept for you to understand, isn't it? &gt;Downvoting what? My replies to you. Suddenly they all go down a point when you reply back to me. I'm sorry I commented on the thread you made.", "num_messages": 10, "avg_score": 252.9}
{"start_date": "1541806315", "end_date": "1541953238", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 5366, "text": "<bobblyflat>: YSK: You can get naloxone (Narcan), the drug of choice for opioid overdose, at CVS without a written prescription and it’s usually covered by insurance. With so many deaths from opioids in the US, I think it’s important for people to know, especially those who know someone who struggles with opioid addictions, that you can get a lifesaving drug without a prescription. Most states have laws protecting you from getting in trouble with police for owning/possessing Narcan, which is a really safe drug with few side effects, so it’s essentially risk free and it could potentially save somebody’s life. <source>: https://www.cvs.com/content/prescription-drug-abuse/save-a-life <edit>: i saw some people asking about signs and symptoms of an opioid overdose, so here’s some good info from the CDC about it. <https>://www.cdc.gov/drugoverdose/pdf/patients/Preventing-an-Opioid-Overdose-Tip-Card-a.pdf <edit2>: this drug is for helping overdoses, not causing them<profanitymanatee>: Free in Canada (Ontario) No prescription needed! Don’t even have to give your information if you don’t want to<Fluffatron_UK>: Because Canada has a decent health service which has the people in mind. US health service is frankly a disgrace for such a developed country.<blackbutters>: They also pay too much in taxes.<profanitymanatee>: When I was in a car accident. And I had to go to the hospital and get x-rays and stitches. It cost me $50 for the ambulance ride.. Thanks to “too much” in taxes<blackbutters>: I go to the VA and I pay $0. Fuck Canada.<profanitymanatee>: Everyone here goes to any hospital, walk-in clinic or family doctor and pays 0$ Whats your point?<blackbutters>: So do I. I never have to pay for medical here in the USA.<profanitymanatee>: Is that the case for most Americans?<blackbutters>: They are individuals. Their health is their own responsibility.<profanitymanatee>: Yeah I guess we just don’t really feel like making children responsible for their own chemotherapy treatment. Go fig <blackbutters>: Maybe people should take better care of their own children.", "num_messages": 12, "avg_score": 447.1666666667}
{"start_date": "1543812232", "end_date": "1543850322", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 131, "text": "<OmitsWordsByAccident>: YSK saunas aren't supposed to feel good. In fact, the best ones are borderline torturous. The reason you sauna is to feel better after you come out, than before you went in. [https://www.lifehack.org/articles/lifestyle/8-unexpected-benefits-sauna-that-will-impress-you.html](https://www.lifehack.org/articles/lifestyle/8-unexpected-benefits-sauna-that-will-impress-you.html)<hirmuolio>: &gt;saunas aren't supposed to feel good. Well this is just wrong. Source: Am Finnish.<IdiotOnInternet>: A second Finn chiming in, OP is completely and unequivocally wrong.<angelomike>: The coldest European countries enjoy saunas the most, but isn't it counterproductive? You don't want to have your body building a tollerance to heat every day, rather the opposite.<IdiotOnInternet>: That's not at all how temperature works, it's not a drug.<angelomike>: So you're body can't get used to a temperature range? <IdiotOnInternet>: Your body does get used to different climates over the course of a few weeks, but not through daily short-term exposure. We also expose ourselves to the cold after sauna.", "num_messages": 7, "avg_score": 18.7142857143}
{"start_date": "1545440957", "end_date": "1545447940", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 43, "text": "<maxmike0101>: YSK if you filled your taxes on turbo tax, your taxes might not have been filled. Working for I client I realized the IRS had no record of his taxes for 2017. He told me he did them on turbo tax for sure. So working this out at the local IRS office I found out that a lot of people said they filled on turbo tax, and they never actually got to the IRS. So I decided to check mine. I was getting such a small return I didnt really pay attention. This was the first year I tried turbo tax. I had a confirmation email saying they were completed, but the IRS had no record of mine either. So last minute I filled mine, and my clients taxes. Anyways, if you didnt pay close attention, and used turbo tax you should double check to make sure they were actually filled.<masahawk>: How would I check it. I got the checks from State and federal<maxmike0101>: If you know you got both checks then your good. But for anyone who isnt sure you can just go to an IRS office, and ask.", "num_messages": 3, "avg_score": 14.3333333333}
{"start_date": "1543171374", "end_date": "1543186367", "thread_id": null, "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o", "total_score": 51, "text": "<d_frost>: YSK: 1800-VISA-911, if your Visa credit card is lost or stolen while overseas, call the number and visa can send you a temporary card wherever you are if your bank doesn't provide that service...ask me how I know lol As the title explains, call 1800-visa-911 for emergency temporary card replacement, I'm guessing other credit card companies also provide this service, if you know their numbers, post them below!<koreanoreo>: This *is* good to know! How long did it take you to get your replacement?<dnlbrwn94>: we recommended this at our call centre for a bank I work for in Canada. 24-48 hours", "num_messages": 3, "avg_score": 17.0}
