{"start_date": "1543544699", "end_date": "1543628691", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 14, "text": "<SpiceCake68>: Preamp with dynamic mics? I'm thinking I'm going to need a preamp as we switch over from our condensers to some dynamic mics. I don't have a whole lot to spend. Anyone have any wisdom or recommendations on how to properly do this? <StargatePioneer>: What sort of dynamic microphones are you going to be using and what sort of mixer or audio interface or recorder will you be attaching them to?<SpiceCake68>: Shure WH20XLR headsets. Into old Zoom R16 recorder. <StargatePioneer>: I don’t think you’ll need a dedicated preamp. I think the R16 should be able to provide enough gain for those headsets. BTW - now I want one to try. <SpiceCake68>: For our podcast, we had been using two condensers (Studio Project B) microphones. Those two are still in play on the table. I was speaking too softly to be picked up by those microphones, and I didn’t want to yell across the table. So getting the headset mic seems to have helped greatly, but my input still seems a bit dwarfed by the others coming in through the condensers. <StargatePioneer>: Have you increased the gain on your channel?<SpiceCake68>: I turned it to eleven.<StargatePioneer>: Some pre-amps that get recommended often are the Fethead, the Cloudlifter and the SS1. <SpiceCake68>: Thank you. I'll check those out.", "num_messages": 9, "avg_score": 1.5555555556}
{"start_date": "1544755837", "end_date": "1544774101", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<HelloItsMeUrLookin4>: Any good unbiased news podcast that are entertaining to listen to on Spotify? <DJKMoney>: Unbiased...news? In all seriousness check out the BBC. I’m not sure if their on Spotify but they tend to have pretty high factual reporting with little opinion.<HelloItsMeUrLookin4>: Yeah I know that’s probably hard to come by, I’ll check them out. <XFreedomIsAMust>: It hard to find a news station without a bias but I would stay far far away from any corporate controlled media including the BBC! Try and finding some Independent journalism and ultimately formulate your own opinion on things of off the information you get.", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1543590896", "end_date": "1543650344", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 453, "text": "<SolarBaron>: Which podcast took you on the journey of being mildly interested and almost completely ignorant of a subject to being well informed and passionate about it? Please tell me of any podcast that guided and taught you knowledge that you now value or enjoy. Some podcasts are great for passing the time but a few I've found have dragged me in and infected me with their enthusiasm teaching me for hundreds of episodes on a subject that has become a valuable part of how I see and know the world. <drhodes17>: Reply All for internet security. I’m now very aware of what WiFi I’m using and I use a password manager to have a different password for everything. There’s crazy stuff people do to learn all about you and can ruin you. It sucks. <nemineminy>: The Snapchat Thief was absolutely terrifying. I still feel completely vulnerable. <ddeevv>: I changed all my passwords to everything after that episode. My heart sank when the security guy was telling him all the steps he has to take to protect his information. 99% of us are completely screwed if anybody tried to get our info.<cyberjellyfish>: Use a password manager.<ddeevv>: I'm looking into that next for sure. Any specific ones you recommend?<gamesfreak26>: Last pass is good. It's what I use. Keypads is another one people use.<cjl2441>: Honest question...how do these work? I’ve been recommended them in various aspects of my life but I’ve never looked into how they actually operate. <gamesfreak26>: Password managers don't store your passwords as plain text. There's a thing called [Password Salting](https://en.wikipedia.org/wiki/Salt_(cryptography)). Lastpass stores your passwords encrypted and store your login password salted and hashed. It essentially protects anyone from getting your passwords if their servers are hacked into. They also let you generate passwords so you're not using the same password or variations of that same password all the time. So, makes it easier to use strong passwords everywhere. It's also good for keeping track of your passwords.", "num_messages": 9, "avg_score": 50.3333333333}
{"start_date": "1544379143", "end_date": "1544415371", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 143, "text": "[deleted]: Niche podcasts you love? [deleted]<Muxika>: Not sure if these are niche enough, but here it goes: EOS 10: it's like \"Scrubs in Space.\" Kakos Industries: Pacing similar to Welcome to Night Vale, but it's about an evil corporation. The Bridge: A transcontinental bridge. Some weird, supernatural, Lovecraftian things pursue.<kittymctacoyo>: Oh man EOS 10 starts at episode 108?<Muxika>: It shouldn't. I see it starting at 101: season 1, episode 1. What app are you using?<kittymctacoyo>: Apple podcast app<Muxika>: I have an Android, but I can see it's available from 101 on the iTunes website. Not sure what's up there.<kittymctacoyo>: Weird. This has happened before, though so I’m not surprised.", "num_messages": 7, "avg_score": 20.4285714286}
{"start_date": "1544664490", "end_date": "1545440797", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 130, "text": "<sweatystartup>: Send me a link to your podcast and I will listen, rate and review! I'm excited to listen to some new things in the next few ~~days~~ weeks! <Edit>: Looking at the massive diversity in peoples interests makes me realize podcasting is such a beautiful way for people to express themselves. What a world we live in! I'm inspired! Edit #2: It might take me a while but I do plan to listen, rate and write an honest review on all of these podcasts! Keep them coming!<doubelle>: Just posted a messy first episode today. Its focused on random topics of media and joining the real world post college. [https://soundcloud.com/user-462049287-198184934/ep-1-school-taking-breaks-and-being-a-young-professional](https://soundcloud.com/user-462049287-198184934/ep-1-school-taking-breaks-and-being-a-young-professional)<sweatystartup>: Awesome! Submit to itunes and send me a link when its on :)<doubelle>: Hey! I was waiting for iTunes to approve it before but it just came through!<https>://itunes.apple.com/us/podcast/fictional-not-fantasy/id1447611348?mt=2 Thanks so much!<sweatystartup>: Awesome podcast! Well spoken and sounds super crisp. No ums no ahs. I'm excited about the content you produce along your journey. Go Gabriella!<sweatystartup>: I gave you a 5 star review and a rating :)<doubelle>: Hey thanks so much I appreciate the feedback and the review!", "num_messages": 7, "avg_score": 18.5714285714}
{"start_date": "1544747929", "end_date": "1544772992", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 15, "text": "<TMKTanner>: Are there any good podcasts that are not ARGs themselves, but do research and explain famous ARGs? Like a true crime show, but instead of explaining crimes they talk about an ARG. ARGs are super cool and I'd love to learn about some older ones.<ProFriendZoner>: So ... you're looking for a podcast about Pirates?<alexjonespornstar>: *slowclap*", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1544740075", "end_date": "1544822129", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 21, "text": "<robwills88>: Why you listen to podcasts So I follow this sub pretty religiously and love to hear about new recommendations about the content people like. But I wanted to know. Why do you listen you podcasts? And where? What is it that makes podcasts such a great source of entertainment/hub of information. I’m fascinated by it. <Purplespacelumps>: I have no friends and it fills the silence that would be there.<stalwart_hipster>: \\[NODS IN SILENCE\\]", "num_messages": 3, "avg_score": 7.0}
{"start_date": "1544710189", "end_date": "1544762957", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 174, "text": "<DTownForever>: Do you also listen to audiobooks? Just wondering - since we're all consumers of narrated media, I was wondering if anybody also listens to audiobooks. Personally, I used to, a lot, I really get my money's worth out of my audible subscription, but I guess it's just a big commitment to spend money on a book that you don't know whether or not you'll like, as opposed to downloading 20 episodes of a podcast for free, lol. Also, I guess maybe my attention span has decreased. Anybody else?<ManderleyDreamTeam>: I definitely listen to audiobooks. If you have a library card, you can get the free Libby and Hoopla apps to “borrow” them from your library. The selection of books varies from library to library but in general they’re pretty good. <radiantxdreams>: Just joined them!! Best thing. I’m listening to park and Eleanor.<DTownForever>: Eleanor &amp; Park was *such* an amazing book. One of my faves of the last 5 or so years. I can't listen to fiction on audio though. <radiantxdreams>: It has been ok so far. I like their voices.. haha.<DTownForever>: See that's why I can't listen to fiction on audiobook. I have to form the character's voices in my own head based on my own interpretation of their words. Non-fiction isn't the same. <radiantxdreams>: That's kinda how it is for me. But I haven't been able to focus on reading, so I've been listening to audiobooks.", "num_messages": 7, "avg_score": 24.8571428571}
{"start_date": "1543316926", "end_date": "1543535301", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 15, "text": "<AutoModerator>: Weekly No Stupid Questions / Ask A Podcast Veteran Thread (2018-11-27) Hi all, please feel free to submit your podcast related questions as a comment. - Be as specific as possible, \"how do I get more listeners\" is a bit broad. - This isn't a feedback thread, don't ask for feedback for your podcast link. If someone needs more info about something specific, you may provide an example. - If you are helping / answering a question, be polite and not condescending, people are here to learn. - Please report any posts or replies that don't follow these rules ---------------------------------------------- <GrannyPottyMouth>: Phew - no stupid questions - the most encouraging reddit headline EVER! I'm an internet personality, dipping my toes into the guesting-on-podcasts waters. I'm also BRAND NEW to reddit. Scared AF, in truth. Want to be respectful and not boastful. Want to be assertive but not a PITA about seeking appropriate pods on which I can guest, chat, enjoy, entertain, educate, etc. Gobs of frazzled peeps need my new cookbook and my advice on how to make meals under-budget and on-time and yummy. Did I do this right?<huntor27>: If this is the real Granny Potty Mouth, then WELCOME! Honestly, you’re a good personality, so I would recommend being your profane self, but just abide by the guest/hosts guidelines if they keep a clean or explicit podcast. Podcasting isn’t relatively hard, in and of itself. If it’s conversational, you should do just fine. If it’s research based, just make sure all of your t’s are crossed, and i’s are dotted. Don’t stress, because it would be great to have you on any number of shows. Welcome to Reddit! <GrannyPottyMouth>: The other thing is that I'm not at all hooked into the pod world and not sure how to reach out to podders to hang on their shows.<huntor27>: Oh my lord. I’m so happy you’re here. As a podcaster, I can tell you for sure that you’re in a very niche market, but a thriving one. I’ve followed you for quite some time, but I can most definitely assure you that podcasting is NOT the hardest thing in the world. In the genre I’m in, times, dates, and info is CRUCIAL, but if you’re having a conversational podcast (shooting the shit, making jokes, sharing recipes) I’m sure you’ll do just fine. It’s the same as sitting with a friend and talking to them about their day. Trust me when I say you have a following, and the more content you can be featured in, the better. Just be yourself. That’s the biggest thing I can stress. Anyone who has seen your content would love to see even more of you. I wish you the best of luck with your ventures into this growing medium. :) <GrannyPottyMouth>: I'm not looking to start a podcast, I'm trying to find ones to guest on - and I haven't a clue how to go about it. I know I have a following - it's reaching them across multiple media that takes the figuring out. If you know anyone who is dying to chat w/ me - send 'em my way via any of my socials or here. :-) Thanks tons.", "num_messages": 6, "avg_score": 2.5}
{"start_date": "1539362711", "end_date": "1539673872", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 21, "text": "<dirkprimbs>: Do you need feedback for your show? x-post from /r/podcasting ***tl,dr: I'm offering to give constructive feedback for your show. I've been a podcaster for 5 years now with over 800 episodes in 4 shows (3 German, 1 English)*** More details: My English podcast is over 2 years old and I hit a glass ceiling. My hunt for feedback also made me post a message to the weekly episode thread. The community rules say that you should answer at least one request for feedback there before posting your own but... well... no one actually asks for feedback there :-/ And no one is answering my request either :-( This confirms an observation of mine: Most of these threads are mostly self-promotion and when checked with tracked links it looks like only a tiny fraction of readers bothers following the links there at all. It is all for self-promotion. (nothing wrong with that - as long as you don't hope for real feedback like I do ;-) ) **Hence this thread: I'm game for feedback requests!** Yes, I hope that eventually my own podcast receives some constructive feedback too but instead of asking for that I decided that I start by offering my own to everyone who cares to ask. So I will wait with posting my own request here until at few others added theirs to the thread and I promise to make time for each and answer your questions. Please include a link to the specific episode you want me to listen to and 2-3 questions you have. In order to make this thread useful to others you might want to add the usual (e.g. a short description of your show, genre, (N)SFW), so everyone knows what they'll get into by clicking ;-) **edit:** oh, and please also indicate if you're fine with a public feedback. If not I'll dm you but I do think it would maybe help others too to read some of the feedbacks and compare... Cheers! //D<thewidewindow>: Hi! I would definitely love some feedback, and would be happy to check out your show as well! I'm just going to go ahead and copy/paste our description from the weekly episode thread: *\\[TV &amp; Film/LGBTQ+\\]* ***What The Het?!*** *NSFW* [*iTunes*](https://itunes.apple.com/us/podcast/what-the-het/id1408661263) *//* [*Google Play*](https://play.google.com/music/m/Idvdnrbsrklz5ibshi66lgbmpse?t=What_The_Het) *//* [*Stitcher*](https://www.stitcher.com/podcast/what-the-het?refid=stpr) *//* [*Podbean*](http://whatthehet.podbean.com/) *What The Het?! is a podcast starring two queer friends, Niko Rufino and Alex Keswick, dedicated to examing the worst heteronormative romances in cinema. Join us each episode as we dissect our and your favorite films, while daring to ask: could it be better? Could it be gayer?* [*Twitter*](https://twitter.com/whatthehetpod) *//* [*Facebook*](https://facebook.com/whatthehetpod/) *//* [*Tumblr*](https://whatthehetpod.tumblr.com/) We just yesterday released our [newest episode](https://whatthehet.podbean.com/e/ep-6-stick-it/), which I'm super proud of but also had some audio issues I did my best to mitigate in post but still left some noticeable artifacts. One that's much more indicative of what I would consider our standard quality level as well as a generally accessible jumping on point would be [our episode on Raiders of the Lost Ark](https://whatthehet.podbean.com/e/ep-5-raiders-of-the-lost-ark-aka-indiana-jones-disaster-bisexual/). It's also almost right on the money for what I would consider the average length of one of our episodes, which is one of my own personal anxieties regarding the show. Questions, I suppose, would be: \\-What is your impression of the content of the episode? Do we move too fast/too slow? Are we too unfocused, to the point of detraction from the listener's enjoyment? \\-How do you feel about the length of the episode? I worry about the episodes running too long (our shortest numbered release, which was our most recent ep, is 70 minutes; our longest so far was just under two hours), however all the feedback I've received through [surveying listeners](https://www.surveymonkey.com/r/375R8DH) (which at this point, while anonymous, is still almost definitely coming from family and close friends) hasn't emphasized the episode length as being an issue, so maybe I'm just too hung up personally as the editor? \\-Anything else immediately jump out to you as an issue or stumbling block? Public critique is also most definitely fine!!<dirkprimbs>: I listened to your latest episode today. First thing I noticed is that your Google Play link does not work for me (nor does your show appear on Google Podcasts which is a different place than Google Play). You might want to look into that and I am not sure if that is just a geo thing (I am in Germany) or if it is a more general problem. I used pocket casts then and found your show, so your registration in itunes seem to have worked fine. **Audio** A mixed bag. Alex's audio is initially very good (even though some humming sound starts off somewhere around minute 10 or so, air conditioning?) but Niko's audio could use some work. Sounds to me like a skype connection + less then ideal mic situation + an echoey room. It did not put me off because you were fun to listen to and I understood Niko fine. Yet there is room for improvement. Things you can do (from easy to hard): * record in a different room (more textiles, more books, smaller room). It may sound weird but walk in closets tend to be natural recording booths ;-) * Look at your recording technique. Usually being closer to the mic and dialing down the gain helps to pick up a little less room sound. * What mic are you using? There are microphones that pick up less room and more voice. * Skype (or similar services) usually lowers the sound quality as well. A way around that is to record locally while doing the video chat and to send the recording to the person editing the show. * Some of light audio processing might help against some of the room sound and the hum/fan noise. Your audio software might have a gate effect you can use or you might consider using a service like auphonic. **Content/Structure** The cockroach-apocalypse in the beginning made me laugh. In general, I had plenty of moments where I laughed. You two have a great conversation and I grinned a lot. &amp;#x200B; **Your questions** &gt;What is your impression of the content of the episode? Do we move too fast/too slow? Are we too unfocused, to the point of detraction from the listener's enjoyment? You do a fine job moving through the plot. The listeners enjoyment comes from listening to your conversation, so I don't think you were too unfocused. That said - for a podcast that is more than 30 minutes I do think a bit of segmentation helps a lot that will give listeners a sense of where they are in the podcast and it makes it easer to come back to it if you need to hit pause. Maybe doing a fun game, introducing running gags (like watching out for cinema clichés or something like that), maybe playing some music in the middle or having a \"new in gay cinema\" segment etc. &amp;#x200B; &gt;How do you feel about the length of the episode? I worry about the episodes running too long (our shortest numbered release, which was our most recent ep, is 70 minutes; our longest so far was just under two hours), however all the feedback I've received through [surveying listeners](https://www.surveymonkey.com/r/375R8DH) (which at this point, while anonymous, is still almost definitely coming from family and close friends) hasn't emphasized the episode length as being an issue, so maybe I'm just too hung up personally as the editor? There are two schools of thought and one advice I can offer. \\#1: You'll find plenty of articles and opinions out there that suggest 30 minutes as the ideal length because that supposedly is the average length of commuting and that is the time where the most listening happens. Some say you could do 60 minutes for the same reason because that allows you to listen to half on your way to work and the other half on your way back... \\#2: The second line of thinking is that the show could be as long as you want as long as the content warrants it. There are successful podcasts with up to 9hours length(!) and some as short as 30 seconds. In general the beauty of podcasting is that you're free to find your own balance. \\#my take: 1-2 hours are fine but try to find a natural way to add structure to it. Your listeners can pause and resume, so I would not restrict myself if I were you. The only thing that I would add: try to be consistent. If normally your show is about 1.5hrs people will be surprised if you switch to a 15 minute format or put in 3 hours. It may be fine once in a while but in general the audience comes to expect a certain type of content and you risk loosing listeners if you throw them off balance too often. &amp;#x200B; &gt;Anything else immediately jump out to you as an issue or stumbling block? Nothing severe. I would focus on getting the audio more even first and then introduce some gentle structural elements (segments, a sound board, running gags...) but in general I found your show engaging, entertaining and definitely good use of my time! &amp;#x200B; Hope this feedback was useful! //D<thewidewindow>: Wow! Thank you for such detailed feedback! It's interesting that you were unable to find the show through the means you mentioned, the Google Play link works for me and I actually am subscribed to the show myself through Google Podcasts so I know that one works as well. It being a geography thing makes sense (I'm in the US), I'm not sure how I'd go about fixing that but thanks a lot for letting me know! I'll definitely look into it. The audio issues you mentioned were exactly what I was referring to; the buzz/hum on my (Alex's) part came from my roommate turning the air conditioning back on while I was recording (the room I record in is more or less a walk-in supply closet in my basement, which works great but unfortunately has a large pipe leading in through the ceiling which means water/air running is very audible). I may just have to find a new location to record in, which is unfortunate because otherwise it makes for a perfect studio. As for Niko, I think they just... forgot to talk into the mic for a while? They also live in a very small one room apartment, with a dog, so getting clean audio from them is always a little bit of a challenge but usually not too bad. We actually do use Skype for our sessions and record remotely, then I combine the audio tracks and do all the relevant editing and clean up in Audacity. Thanks again! If you'd like to link your show, I'd be happy to check it out as well :)<dirkprimbs>: Thank you! The name of the show is 2debate. [itunes](https://2debate.eu/itunes)| [Google Podcast](https://2debate.eu/googlepodcast) | [RSS](https://2debate.eu/feed/mp3) The web page is at [https://2debate.eu](https://2debate.eu/) and the archive is at [https://2debate.eu/archive](https://2debate.eu/archive) <Questions>: * One of the reasons we created this project is because we hoped to promote real discussion with actual arguments online. Do you think we succeed in that? If not, what where do we fall short? * What do you think about the general format? Any thoughts what we could improve in terms of structure/content? * Can you think about a fun motion to debate? E.g. would something like \"Marvel is better than DC\" be a motion you'd find interesting? * Neither Sebastian nor I are native speakers. Is that a problem in any way? How hard are our accents on your ears? //D<thewidewindow>: I listened to the most recent episode of your show! First off, I like your debate format a lot; it's a style of show I'm surprised I haven't seen more of. I would say, having listened to just the one episode and scrolled through the topics of all your previously released debates, I do appreciate that you seem to do a good job of finding topics relevant to current events, while also finding ways to approach the topic from a different angle than simply talking about the already sensationalized aspects of the event itself. I would have been turned off had the debate topic been \"Should Brett Kavanaugh have been confirmed to the Supreme Court?\" or \"Should victims of sexual assault be required to provide greater proof when making public accusations?\", but I found the approach you chose instead, discussing an aspect of why the Supreme Court itself is the way it is, interesting and informative. This strikes me as a good way of not only staying relevant to current events, but also providing greater education than simply rehashing what people are already seeing every day in the news (I myself am a native United States citizen, and found myself learning a lot about the composition of the Supreme Court from your debate... and it's one of the branches of my own country's government!) As for the structure of your show, I have no complaints. You moved at a good pace through your introductions, establishing the parameters of the debate, and then each of your arguments, rebuttals, and closing statements. I also thought your \"third host\" in the announcer style introductions to each segment of the debate was a good touch and sort of funny, almost like the debate was a wrestling match. I will say I was surprised when the closing music started playing, you each said your goodbyes, it was silent for a period of time... and then you suddenly came back and started talking about the topic again for another five or six minutes while the music continued to play in the background. Not that I minded! The two of you have good chemistry and I enjoyed listening to your conversation, and it was also sort of funny, like the two of you had settled the debate and then just couldn't help but pick it up again and continue to argue for several more minutes. I was just surprised when I thought the episode was over, and then... it wasn't. I think your current approach of finding your debate topics in current events is a smart way to stay both relevant and informative. In a way, this makes your show not only about arguments people are having online, but also in itself a source of current information. Not the news itself, but more like the editorial section of the newspaper. I do think finding time for lighter debates could be a smart move and a good way to keep your audience entertained/balance out the heaver debate topics you often seem to choose; I think a broad topic like \"Marvel or DC?\" might be a little less engaging, not to mention harder to build strong arguments around, but something in that style could still be fun, like \"Were the Jedi from Star Wars good or corrupt?\" or \"Was Thanos right to want to kill half the universe in order to save the other half?\" (Okay, that second one might be a LITTLE heavy...) I had no problem whatsoever in understanding either one of you! Your accents were not distracting to me in any way; in fact, I actually found you both very charming! As I said, you two have great chemistry and your conversation flowed very smoothly and naturally. I was entertained through the whole episode. I am curious: as neither of you are native English speakers, and you both live outside of the US, what was it that made you want to do an English language podcast that deals largely in US-centric events? (not that you don't also talk about other countries' current events; I did see you had an episode focused on Brexit, and I'm sure there were others as well that I simply haven't listened to yet. I Just find it interesting and wanted to ask!) EDIT: Looking back at your original post, I do see now that you mentioned having done three other podcasts previously in German, with this being your first English-language show. That answers my question in part, I suppose! Although I am still curious what it was that made you want to do an English-language podcast in that case; simply to reach a different audience? Overall, I can't say I have too many complaints! Again, the episode ending and then... not ending caught me off guard, but as I said, I did not mind the extra few minutes \"as the credits rolled\", so to speak. I'm actually going to stay subscribed to you so I can catch up on some of your older episodes! All in all, great work and keep it up!<dirkprimbs>: Wow, that was an amazong piece of feedback! Thank you so much for taking the time to write this! &amp;#x200B; &gt;I will say I was surprised when the closing music started playing, you each said your goodbyes, it was silent for a period of time... and then you suddenly came back and started talking about the topic again for another five or six minutes while the music continued to play in the background. Not that I minded! The two of you have good chemistry and I enjoyed listening to your conversation, and it was also sort of funny, like the two of you had settled the debate and then just couldn't help but pick it up again and continue to argue for several more minutes. I was just surprised when I thought the episode was over, and then... it wasn't. Yes, that is something I will keep in mind. The reason for the setup is that I originally played outtakes and things I found funny from our after-debate conversations in short snippets. These were naturally part of the \"after show\" if you will. But sometimes we actually have a broader conversation and when I add that, then I see why it gets confusing to hear us saying good bye but then coming back with more content. I will definitely change that since that seem to surprise people. &amp;#x200B; &gt;I do think finding time for lighter debates could be a smart move and a good way to keep your audience entertained/balance out the heaver debate topics you often seem to choose; I think a broad topic like \"Marvel or DC?\" might be a little less engaging, not to mention harder to build strong arguments around, but something in that style could still be fun, like \"Were the Jedi from Star Wars good or corrupt?\" or \"Was Thanos right to want to kill half the universe in order to save the other half?\" (Okay, that second one might be a LITTLE heavy...) We tend to gravitate to serious motions, true. We had a debate \"Star Wars is overrated\" or \"Underground tunnels, not flying cars are the future\" but I agree, we should have one of these more often. Regarding Thanos or Marvel vs. DC - I would need to find another debating partner for these. Unfortunately Sebastian is completely ignorant about superheroes ;-) &amp;#x200B; &gt;I am curious: as neither of you are native English speakers, and you both live outside of the US, what was it that made you want to do an English language podcast that deals largely in US-centric events? (not that you don't also talk about other countries' current events; I did see you had an episode focused on Brexit, and I'm sure there were others as well that I simply haven't listened to yet. I Just find it interesting and wanted to ask!) Let me answer in two parts. First, why English: One - I have a passion for podcasts and after knowing the German scene very well I honestly wanted to see how it is to launch a podcast that addresses a global audience. Second - Sebastian is a Frenchman and we both work in a US company. Hence, when we do a podcast together it has to be English since I don't speak French very well and Sebastian's German isn't good enough either. The second part - why US centric: That is not intentional. Probably it shows a cultural bias we have. Since we work for an US company with many US colleagues I suppose your events are more present to us than many others. Besides, there are plenty of events that make the news globally or at least are relevant to all of us. We do try to have a broader balance though with topics out of science or general culture as well but we definitely can do better in that department. &amp;#x200B; &gt;Although I am still curious what it was that made you want to do an English-language podcast in that case; simply to reach a different audience? So many reasons ;-) * I was curious if it is different to address an English and global audience. * Since English is not my native tounge a podcast in that language is an amazing opportunity to improve my language skills. * English is the only language Sebastian and I share. * Debating like this is an anglosaxon thing and very common in your culture. In Germany it would be harder to establish a format like this. &amp;#x200B; &gt;Overall, I can't say I have too many complaints! Again, the episode ending and then... not ending caught me off guard, but as I said, I did not mind the extra few minutes \"as the credits rolled\", so to speak. I'm actually going to stay subscribed to you so I can catch up on some of your older episodes! All in all, great work and keep it up! Thank you so much for your kind words, it means a lot to us! If you ever have an idea for a motion (or even want to debate it yourself), feel free to drop one here: r/https://2debate.eu/suggest <thewidewindow>: That's really interesting! I never realized debate was such a specifically American thing, although I guess I shouldn't be surprised, haha. Thanks for the response! If I come up with any ideas for topics I'll be sure to send them your way :)<dirkprimbs>: I suppose it is actually something you inherited from the Brits who have an even richer debating tradition (hence the name: Oxford style debating) ;-)", "num_messages": 9, "avg_score": 2.3333333333}
{"start_date": "1544662669", "end_date": "1544713993", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 17, "text": "<TheMadeline>: Looking for funny podcasts with a unique premise? Looking for something hilarious with a really interesting/unique premise. For example, something along the lines of My Dad Wrote A Porno (which I never finished listening to because I kind of felt weird listening to it at work despite the headphones, lol) where it has a weirdly specific premise but is funny. Basically looking for something more specific than “funny people talking about various funny things”. Other podcasts I like are Sickboy, How Did This Get Made, and The Mortified Podcast. Any suggestions? <EDIT>: ooh forgot to mention that I’d prefer a mix of male and female hosts if possible!<shakayolo>: The Onion’s A Very Fatal Murder. It’s a true crime/serial parody. It’s really funny.<DonutDonutDonut>: That sounds like the most Onion premise ever. Will have to check it out.", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1543607502", "end_date": "1543676694", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 374, "text": "<lenky0>: Earlonne Woods from Ear Hustle if officially out today!<https>://www.instagram.com/p/Bq0LfhLAuvo/?utm_source=ig_share_sheet&amp;igshid=9eqm0casi968<lime-link>: I love how podcasting changed E's life. Radiotopia had a \"pitch us a new idea for a podcast\" contest. Got something like 1400 pitches. The execs at Radiotopia narrowed it down to like 50 and Ear Hustle was not on the top of their list. It almost didn't make the cut. Then they opened up the voting to listeners and supporters to pick the one best idea and they picked Ear Hustle as the best idea for a new podcast. So Ear Hustle was born. And in 25 episodes we've learned to appreciate and love not just E but so many other characters in that prison. To the point where now when E gets out, there are hundreds of people if not thousands all so excited and happy for him. If they didn't make the podcast he would be getting out and maybe nobody would congratulate him. It's just crazy how powerful podcasting can be.<endless_thread>: I was on the committee that went through those (many, many) submissions back in the day and can confirm. Radiotopia supporters were passionate and nearly unanimous in their support for the idea of Ear Hustle. Pretty cool to see<lime-link>: I once volunteered to review 10 podcasts here on Reddit. It took me 3 days to go through 10. I can't imagine going through 1400 podcasts and check them all out. That process must have been monstrous. But I've heard Julie explain this process and it was a nightmare. But then you have Gimlet's The Cut, and they magically narrowed their hundreds of entries down to 3. Without explaining how they did it at all. I was very skeptical that they actually listened to all of the pitches... <endless_thread>: Luckily it was a good-sized group going through everything so work was divided but...yeah...I think that's when it really dawned on me how big podcasts were getting. Do you mean Gimlet's Casting Call? I haven't listened to that yet...but did you like it aside from the lack of transparency? &amp;#x200B; &amp;#x200B;<lime-link>: Yeah casting call sorry. I only listened because I love Jonathan Goldstein. I found it lacking all around though. It was fine but nothing worth mentioning ya know", "num_messages": 6, "avg_score": 62.3333333333}
{"start_date": "1544748438", "end_date": "1544829667", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 13, "text": "<SleepyKittyGirl>: Trivia Podcasts or Podcasts with Trivia Looking for some good Trivia Podcasts or podcasts that have trivia episodes. One of my favorite podcasts, The NerdSync Podcast, had an episode dedicated to trivia about every 5 episodes. Sadly they canceled the podcast over a year ago. Their trivia was mostly comics, nerd, and geek topics but I like other trivia too. I watch Jeopardy and will proudly admit I usually feel dumb watching it but enjoy getting the questions right that I do. I like trivia for when I have to be driving for a long time because after a while I start to get tired and even my favorite podcasts don't help me but Trivia makes my mind work and wakes me up. Thanks for any recommendations!!!<Antouziast>: You definitely want to check out \"Trivial Warfare\", it takes the trivia out of the pub and into your ears !<ktown726>: Seconded!!<SleepyKittyGirl>: Sounds like a lot of fun, I will definitely give it a listen", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1543212527", "end_date": "1543601313", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 36, "text": "<AutoModerator>: Weekly podcast post (submit your links here!) (2018-11-26) Hi all, please feel free to submit your podcasts as a comment with the following info: - **MANDATORY** Top line should be the podcast genre first in brackets: [comedy, movies, talk, general, tech, etc.], and then the title, (all bolded if possible). Then the episode number and title. Put everything else below that line. - Mark it NSFW or SFW on the next line, as a courtesy to others - A link to your latest episode on the third line, and other related links. These should be hotlinked to save room. You can also hotlink in the top title line for the episode instead. - A BRIEF description of the specific episode content, including notable guests (and / or why they are notable), try and keep it to a bullet point list or 4-5 sentence paragraph. - A brief description of your general week to week show content (cut and paste from past weeks is fine) - Social links hotlinked at the bottom of the post ---------------------------------------------- This is the format everyone should try to follow to keep it neater: [COMEDY] The Podcast Podcast | Episode 120 - The Second Coming NSFW (or SFW) Link 1 // Link 2 // Link 3 // Link 4 This week we talk to the President, and discuss his recent favorite comic book based movies. The Podcast Podcast is a podcast by podcasters about podcasts. Twitter // Facebook // Etc. ---------------------------------------------- - Please try and follow this format as much as possible to save people time when skimming for content. - Please encourage others to follow the format - All users are now required to meet the minimum karma requirement to post in this thread. If your post does not appear, try and get your karma count up and try again. ---------------------------------------------- <LunarEclipse137>: \\[Comedy/True Crime/Paranormal/Cooking\\] Blood Sausage | Episode 2 - The Green River Curry (NSFW) [iTunes](https://itunes.apple.com/us/podcast/blood-sausage/id1442728615?mt=2&amp;ls=1) // [Android](https://subscribeonandroid.com/bloodsausagepodcast.com/feed/podcast/) // [Stitcher](https://www.stitcher.com/podcast/blood-sausage?refid=stpr) // [Spotify](https://open.spotify.com/show/433Tlw8lpeMaFDTYExIsjU) // [Blubrry](https://www.blubrry.com/bloodsausagepodcast/) It’s the second episode and we survived Thanksgiving! We’re talking about our favorite subject: maggots. Just kidding it’s curry and serial killing. Katie goes into disgusting detail about the Green River Killer, Gary Ridgway, while Tom make Thai Green Curry Chicken. Both are edible, but only one fits in our fridge. Thanks for listening! &amp;#x200B; Blood Sausage combines true crime, paranormal and cooking all into one podcast. Each week, a husband and wife duo tries to recreate a themed recipe while discussing stories that focus on the darker nature of human behavior and beliefs. New episodes will be released every **Monday** along with an accompanying blog post and recipe. [Facebook](https://facebook.com/BloodSausagePod) // [Instagram](https://www.instagram.com/bloodsausagepod/) // [Twitter](https://twitter.com/BloodSausagePod?ref_src=twsrc%5Etfw%7Ctwcamp%5Eembeddedtimeline%7Ctwterm%5Eprofile%3ABloodSausagePod&amp;ref_url=https%3A%2F%2Fbloodsausagepodcast.com%2F) // [Website](https://bloodsausagepodcast.com)<GetAGripStudios>: Please share this in the [https://www.reddit.com/r/NewPodcasts/](https://www.reddit.com/r/NewPodcasts/) subreddit as well!<LunarEclipse137>: Thank you! <GetAGripStudios>: 100%!", "num_messages": 5, "avg_score": 7.2}
{"start_date": "1544422128", "end_date": "1544598006", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 32, "text": "<AutoModerator>: Weekly podcast post (submit your links here!) (2018-12-10) Hi all, please feel free to submit your podcasts as a comment with the following info: - **MANDATORY** Top line should be the podcast genre first in brackets: [comedy, movies, talk, general, tech, etc.], and then the title, (all bolded if possible). Then the episode number and title. Put everything else below that line. - Mark it NSFW or SFW on the next line, as a courtesy to others - A link to your latest episode on the third line, and other related links. These should be hotlinked to save room. You can also hotlink in the top title line for the episode instead. - A BRIEF description of the specific episode content, including notable guests (and / or why they are notable), try and keep it to a bullet point list or 4-5 sentence paragraph. - A brief description of your general week to week show content (cut and paste from past weeks is fine) - Social links hotlinked at the bottom of the post ---------------------------------------------- This is the format everyone should try to follow to keep it neater: [COMEDY] The Podcast Podcast | Episode 120 - The Second Coming NSFW (or SFW) Link 1 // Link 2 // Link 3 // Link 4 This week we talk to the President, and discuss his recent favorite comic book based movies. The Podcast Podcast is a podcast by podcasters about podcasts. Twitter // Facebook // Etc. ---------------------------------------------- - Please try and follow this format as much as possible to save people time when skimming for content. - Please encourage others to follow the format - All users are now required to meet the minimum karma requirement to post in this thread. If your post does not appear, try and get your karma count up and try again. ---------------------------------------------- <Whattheriff>: (Rock Music with Commentary) ***What the Riff*** : Podcast Episode 26 – June 1978 : The Cars Debut Album SFW [https://itunes.apple.com/us/podcast/what-the-riff/id1393901187?mt=2](https://itunes.apple.com/us/podcast/what-the-riff/id1393901187?mt=2) This week on \"***What the Riff\",*** we are in June 1978 with a spotlight on the album \"**The Cars”** by **The Cars** with staff picks of **Rainbow, Nick Gilder, Eddie Money and Atlanta Rhythm Section**. “***What the Riff”*** is a new weekly podcast journey through the golden age of Rock and Roll. Where four friends discuss music from a specific month/year between 1965 to 1994. Members rotate picking 4 songs off an album to riff on, and then all of us have a staff pick, along with TV/Movie themes, pop references of that time, and whatever else comes to mind. [https://www.facebook.com/whattheriffpodcast/](https://www.facebook.com/whattheriffpodcast/) ; [http://whattheriff.com/](http://whattheriff.com/) &amp;#x200B; &amp;#x200B;<BotPaperScissors>: Paper! ✋ I win", "num_messages": 3, "avg_score": 10.6666666667}
{"start_date": "1543623576", "end_date": "1543632186", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<jordankayall>: Critique my podcast. I have a podcast called Kayallscope which is about various topics (like a kaleidoscope, if you will) with a variety of co hosts and special guests. We currently have about 1200 listeners, half of which we have gained in the past two months. I just want an honest critique from you. Listeners tell me they like it and love it, but I want to improve in every way, whilst keeping it real. Our sound has improved dramatically and sounds like an actual studio now, and I've just ordered new microphones and an interface so in January we will sound even better. We did our first live show in front of a sold out theatre last month which is how we got a lot of local press. I'm just curious to know why people like the show and why people hate the show. I'm working on improving my speech, content and timing, without coming off as pretentious or ingenuine. Pick an episode title that gets your attention and give me your honest and brutal feedback please. I'm about to invest in a set so we can do video podcasts for YouTube in January, so I'd like as much advise as possible. Thank you in advance. Kayallscope can be found in every podcast app that I'm aware of. <emslo>: Do you think you could pitch it a little more specifically? \"Various topics and various hosts\" isn't enough to help us know if it might be our taste. Thanks!<jordankayall>: Yes, thank you. So I originally wanted to cater to my severe adult ADHD and not have a one topic show since my interests are everything and everything, and I made it so people can end up finding that one episode that they like and then maybe if they like it, explore another podcast and possibly subscribe. For example here are some episode numbers with the topics: 1. Phobias 2. Martin Luther King 3. Nollywood 4. Artificial Intelligence 5. Valentine's Day 6. Interview with a firefighter sharing stories 7. Birth, midwives, and hospitals compared between multiple countries. 8. Animal behaviour 9. Interviewing a transgender American 10. Interviewing a transgender Australian 11. Blackface and cultural appropriation 12. The Roswell Incident 13. Fashion trends 14. Street Epistemology (live) 15. Social media advertising 16. Food and interviews with a chef (released tomorrow) 17. Interviewing a personal trainer/ gym owner (releases next Saturday night) Et cetera. <DTownForever>: Hmm, that sounds super interesting and eclectic! I will check it out and let you know what I think! <jordankayall>: Thanks.", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1543328539", "end_date": "1543344742", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 191, "text": "<vvash>: Small milestone, but a big one to us I started a bi-weekly podcast with a friend of mine about gaming 6 months ago, finally after pushing out the last episode yesterday (#10) we hit that 1000 downloads per month milestone. Pretty excited about that as well as continuing on with making this podcast. Will post the link below. <vvash>: [https://www.beanoverachiever.com/](https://www.beanoverachiever.com/)<DefiantInformation>: I always wanted a podcast about overachieving beans.<mynamesnothank>: What can you over achieve with beans? Do you grow a lot of them and what type? Very interesting idea to look into the bean world. I know nothing.<DefiantInformation>: Some dude grew a beanstalk into the clouds and met a giant.<mynamesnothank>: Oh yeah. My mate Jack. He was a bit of an overachiever isn't he?<DefiantInformation>: His beans certainly were.", "num_messages": 7, "avg_score": 27.2857142857}
{"start_date": "1530625151", "end_date": "1530645255", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 24, "text": "<safespacecast>: Anybody else listen to Whatever Happened to Pizza at McDonald's? It's so freaking funny.<stephenmcqueen>: Just started and it is hilarious. Such dry humor but so well done.<safespacecast>: Absolutely. I love how consistent it is.", "num_messages": 3, "avg_score": 8.0}
{"start_date": "1543501598", "end_date": "1543549311", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 113, "text": "<HellhoundCDN>: Hardcore history Recently got into podcasts and just loved Dan Carlin’s hardcore history, especially the WW1 Series. I’m almost done the Carlin series, does anyone have any suggestions for something similar? <iSkulk_YT>: Haven’t got the time to make sure this hasn’t been suggested already, but I HIGHLY recommend Malcolm Gladwell’s “Revisionist History.” Gladwell has a way of approaching pretty much any subject that leaves you inspired and he takes on historical topics that you wouldn’t hear on other shows. The episodes are very digestible and well-produced. Perfect podcast. If you’ve already binged the series, you have to listen to his books on Audible narrated by Gladwell himself, starting with Outliers. Absolutely incredible work coming from him. <chickenofthesquee>: I couldn't possibly disagree more. Dan Carlin has deeply thought out original ideas and does tons of research, while Gladwell is a shit shoveler, he peddles a mix of half truths and utter bullshit like an upmarket Dr Phil.<iSkulk_YT>: Dan Carlin is definitely a god, I’ll give ya that. Can you give me an example or two of Gladwell “shoveling shit?” <chickenofthesquee>: Here is a pretty nice critique but it barely scratches the surface of the deep well of scientists who hate Gladwell <http>://blog.chabris.com/2013/10/why-malcolm-gladwell-matters-and-why.html?m=1<iSkulk_YT>: Very intriguing read. Thanks for the link. I don’t think this changes much about my opinion of Gladwell. I don’t read/listen to him expecting some sort of divine scientific whatever. His thought process and ability to analyze things I never considered are very intriguing and thought provoking. I think I understand the critique, but to say he’s shoveling shit is a bit of an exaggeration in my opinion. From my perspective it’s all harmless.", "num_messages": 6, "avg_score": 18.8333333333}
{"start_date": "1543552509", "end_date": "1543595227", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 63, "text": "<macnsleaze>: Redirecting thought patterns? What are some good podcasts for changing the way you think, your thoughts and the way you approach life? Kind of CBT/DBT type stuff but nothing too textbook-y. I also hate those overzealous women who insist on being a lifestyle blogger type– please nothing like “Zen with Zoe” or “Chill with Chelsea” lolol. I’m in such a icky swampy mind funk. Caught in such a negative mental loop about myself in relation to my existence, mortality, other people and the future. I’ve already listened to A New Earth about 50 times. It’s like I need someone screaming at me, “you idiot, you’re wasting your life thinking about stupid things and not doing things that do!!!” Thanks in advance [deleted]: Joe Rogan Experience is great for the whole \"exploring different ideas\" type of thing. Not a podcast, but Jordan Peterson's biblical lecture series is also amazing(even if you aren't religious, it's still a great, thought provoking series). &amp;#x200B; <EDIT>: Just expanding on JBP. He talks in such a way that he verbally fleshes out ideas and philosophies to the nth degree. He is basically thinking out loud but it's a great way to take a deep, deep dive into an idea or philosophy. Even if you disagree with him, I absolutely love his \"thinking out loud\" style of talking.<TerraceEarful>: Jordan Peterson is lying, reactionary trash. [deleted]: Have you listened to the biblical series or are you just triggered that I suggested a right leaning commenter? <TerraceEarful>: We have someone here who is asking for self-help recommendations. You suggest someone whose contributions to the field amount to \"clean your room and blame feminists for your problems\". I've heard enough of Peterson's self-serving pseudo-deep nonsense to know that I would not be interested in his hot takes on the bible. [deleted]: So basically what you're saying is that you haven't heard his biblical series at all and you're assuming it's just like his debates and interviews (it's not at all). OP literally said he is asking for a podcast that can help him explore different opinions and ideas and that will be a kick in the pants to motivate him in life. I can definitely say that JBP has been that for me. So yeah you answered my question. You haven't heard what I'm actually suggesting, you're just triggered because it's someone who's opinion you disagree with or who's philosophies you don't like. That's entirely your right but don't force bitterness on everybody else. <OP>: It's free. Listen to some of his biblical series and see if it grabs your fancy. It might not, but that's ok. It's not for everyone. At worst you've lost a few hours of your life and developed a first hand opinion of somebody who's gaining popularity these days anyway. I'm not telling you that you have to enjoy it. It's just a suggestion for something you *might* enjoy. <EDIT>: Oh and btw if you think his message is \"blame feminists for your problems\" then you have entirely misunderstood his positions. He's extremely critical of the \"incel\" pity party and constantly says that there is nobody to blame but yourself and that you should pull yourself up from your boot straps. Also, you know that the \"clean your room\" is an allegory for \"take responsibility for yourself\" but you deliberately mischaracterised it to make him seem like a cheesy \"life hacks\" guy.<TerraceEarful>: I've heard him lie about pretty much everything else he has opened his mouth about, but I'm supposed to believe there is value in his biblical analysis. Ok then. Beyond the lies and the politics, here is something that bothers me about Peterson as a self-help guru: The man is clearly deeply miserable and filled with barely contained anger. A pint of cider apparently sends him into a 25-day cycle of sleeplessness and feelings of impending doom. Is this really a man you want to be taking advice from? [deleted]: Please give examples of where he's lied consistently. I've a feeling you've seen mostly snippets and \"gotchas\" instead of watching any of his videos at length. As for sensitivity to alcohol, I don't see how that's relevant to the quality of his ideas. Do you even ad-hominem bro?<TerraceEarful>: This is always the same response from Peterson fans. 'Have you watched all his videos bro? Only then will the depths of his wisdom reveal itself to you.\" I've watched plenty of his videos, I've read his 12 Rules for Life cover to cover. There is nothing there but superficial self-help on top of a layer of reactionary politics. You want lies? How about him claiming to be an evolutionary biologist? How about his misinterpretation of the transgender bill that is shared by exactly zero legal experts? How about claiming he is on an all beef diet, which every doctor and actual expert on nutrition will attest will literally kill you? How about claiming to be all about full speech and sending multiple cease and desist letters to silence those who dare criticize him? How about his repeated spreading of climate change denialism? It is worth noting, that on literally everything he comments on that is outside his actual field of expertise, the people who are actual experts disagree with him. Ask a biologist about his lobster analogy. Ask a legal scholar about his interpretation of the c-16 bill. Ask a nutritionist about his diet. Ask a philosopher about his interpretation on post-modernism. Ask a historian about his views on the history of communism and fascism. All of them will tell you he is wrong, over and over again. But of course, the easy explanation for that is the same as it is for every other kook: there is a conspiracy of \"post-modern neo-marxists\" who have taken over academia and are suppressing the real truth! [deleted]: I didn't say you have to watch all his videos. I said I suspect you've seen snippets instead of full length in-context videos. If you haven't, good for you. I can't comment on him claiming to be an evolutionary biologist other than I doubt he was trying to claim that he was qualified in it but rather that it's something he's done research in. If he was trying to claim credentials then I agree that's dishonest of him. Doesn't mean he doesn't have any other useful insight. He specifically said he was against Bill c-16 **and its surrounding legislation**. That's important. He was worried about the compelled speech and that is in fact a reality in parts of Canada and c-16 is the federal backing for many of the local laws regarding speech. He didn't claim c-16 in itself was that bad. As for the all beef diet, I can say with first hand experience it's possible, as some of my family members have done it. Carnivore diets are well known and fairly popular. I'm not claiming they're healthy or worth it but you can survive on them. Him claiming it works for him isn't a lie. It's an anecdote. Unless you can prove that it didn't actually work **for him**(or they he didn't do it) then you can't call it a lie. And he didn't suggest other people should try it. He's actively said he hates it and wouldn't recommend it but that in his case it worked. As for the cease and desist letters, the only examples I can find of him sending them is in the case of libel such as people claiming he's a white supremacist and such. He is actively against white supremacy or any sort of identity politics so somebody publically misrepresenting him as one is in fact a crime. Besides, from what I can tell from what he says in other cases, he's not a free speech absolutist. He's just against competed speech. I may be mistaken though. I've seen no climate change **denial** from him. At most I've seen skepticism which I think is deserved seeing how inaccurate the models have been historically. He's discussed his opinions on possible climate change solutions so I don't think you can call him a denier in good faith. Even if he was a denier, that doesn't make him a lier. It just means he has a different interpretation/opinion of the current body of evidence. I'm not saying he's right, but that does not make him a lier. As for whether his opinions on his non-expertise are valid, that's irrelevant as you're saying that OP shouldn't even consider his thoughts on his expertise which is psychology. The biblical series is \"the psychological significance of the biblical texts\" and that's what he does. He picks apart the biblical stories and draws analogies to psychological concepts. Anything else?<TerraceEarful>: Surrounding legislation? What are you even babbling about? Please be specific. Here's an example of Peterson sending a cease-and-desist letter to a feminist for the crime of criticizing him: https://www.insidehighered.com/news/2018/09/24/jordan-peterson-dishes-out-what-he-sees-harsh-truths-can-he-take-them-return And no, calling someone a white supremacist is not a crime, it is merely an opinion. If one were to claim 'Peterson has called for the extermination of minorities', that would be libelous because he never said such a thing. There are also people who claim to flourish through strictly consuming air and sunlight. Peterson is free to submit himself to scientific scrutiny in order to disprove all of nutritional science currently known. Zero chance he will do so though, because he is of course lying. On climate change, this is the typical stance from weasels like him. He's skeptical of facts that are inconvenient to his ideology, never on those that support it. [deleted]: Surrounding legislation were his words not mine. I'm just quoting him and pointing out you left out a critical piece of information regarding his view point. I can't say for certain what legislation he was referring to but I know there are compelled speech laws in some localities in Canada which I suspect were what he was talking about. In that case I agree with you. I think it was uncalled for for him to sue over fair criticism. That still has nothing to do with the quality of his commentary on the Bible. My mistake. You're correct. I misunderstood libel. I seriously don't see why you are so extremely doubtful of the carnivore diet. It's a well known fad diet. If people were dying in the masses from it then I'd expect much more News about it. He doesn't have much ideology regarding climate change except that solar and wind are highly inefficient and are not yet viable (this is completely true so far). He's in support of nuclear which is the cleanest form of energy we have. He isn't skeptical that climate change is happening. He's just skeptical of some proposed solutions and of the degree to which it may be a problem.<TerraceEarful>: There are plenty of fad diets that are extremely unhealthy. This is one of them. For Peterson to be recommending this one, as a scientist, without it having undergone rigorous scientific scrutiny is highly irresponsible. He really, really should know better. [deleted]: I explicitly said in my previous comment that I don't think it's healthy. I agree it's likely very unhealthy. But he didn't endorse it. He just said it worked for him.<TerraceEarful>: Yet he promotes his daughter's $150 an hour consultations, who has zero qualifications in nutritional science and relies strictly on her subjective experience. Is that not an endorsement? [deleted]: I've never heard him explicitly endorse her other than saying it was her suggestion but if he does explicitly endorse her then I agree he shouldn't. Still has absolutely nothing to do with the quality of his commentary.<TerraceEarful>: He has absolutely promoted her on his Twitter feed, linking to her consultations for his hundreds of thousands of followers. The entire thing is merely one of many data points pointing out that Peterson isn't to be trusted. So when Peterson offers up his biblical interpretations, it seems more than reasonable to point out that he has a history of being dishonest to support his socially conservative ideological claims. Since interpretations are just that, interpretations, not provable facts, it would be difficult to assume his wouldn't be tainted by his ideology.", "num_messages": 17, "avg_score": 3.7058823529}
{"start_date": "1543623840", "end_date": "1543629525", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<RubbishLog>: Question: I've got my podcast on all platforms via the same RSS, *except* Spotify. Is there any way to link my RSS on one of their distributors without having to pay a premium? For instance, if I were to do Podbean I'd be uploading my show directly there. But through their membership, they offer to simply link my already existing RSS. But it's like, $9.99 a month. The obvious choice is to just upload my show directly to Podbean not unlike how I do for Soundcloud. But this sounds like it could get tedious? Is there a better way about this?<MurdUpPodcast>: I use Squarespace and found this as any option: [https://podcasters.spotify.com/](https://podcasters.spotify.com/) I just added it last week or so, but the process was pretty quick.<RubbishLog>: DOPE!<MurdUpPodcast>: Hope it works for you!", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1544526527", "end_date": "1544550003", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 22, "text": "<AutoModerator>: Weekly No Stupid Questions / Ask A Podcast Veteran Thread (2018-12-11) Hi all, please feel free to submit your podcast related questions as a comment. - Be as specific as possible, \"how do I get more listeners\" is a bit broad. - This isn't a feedback thread, don't ask for feedback for your podcast link. If someone needs more info about something specific, you may provide an example. - If you are helping / answering a question, be polite and not condescending, people are here to learn. - Please report any posts or replies that don't follow these rules ---------------------------------------------- <johnnyjayd>: I have a premise of talking to other strength coaches to learn from great conversation, extend my network, and getting other coaches’ names out there. There are already a bunch of successful podcasts lead my popular coaches, but they’re all very similar in content and format. How would someone change some of the formula to stay within that population of listeners, but have their own identity. I’ve thought about talking to coaches, but focusing more on life, personal interests, etc. I would still touch on the “x’s and O’s” of strength and conditioning, but other shows already cover that very well. <bingewarmer>: What about having some of your athletes that you coach come on the show? It would be cool to hear real discussions between an athlete and a coach who know each other fairly well. I do not know if any of your athletes would be up for something like that, but you two talking with each other and discussing the topics about life, personal interests, etc. would be something different than what I usually hear on strength coach-ran podcasts.<johnnyjayd>: Interesting perspective, I like it! I don’t believe it would be very sustainable from a regular content perspective, but it would give me an opportunity to change the tempo every few episodes. The cool part about my job. Is that I travel with the basketball team to different colleges around the country. I wish I already had this up and running bc I feel like I’m missing out on opportunity every time we hit the road and I have no show to work on. <bingewarmer>: That sounds like a really fun job, I hope to do something similar one day! So when you travel with the team, do you link up with other strength and conditioning coaches? I am assuming you do but I imagine you have other duties as well.<johnnyjayd>: Most definitely have other duties, but I try to get in touch with them at least a week out to set up a brief meeting with them. Sometimes I can spend a couple hours with them, while my team is doing something where they don’t need me. Other times, I can only meet that a couple hours before the game for as little as 30 minutes. Regardless of the time, I make the most of it", "num_messages": 6, "avg_score": 3.6666666667}
{"start_date": "1543606936", "end_date": "1543660792", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 19, "text": "<sunnycurls>: Which, if any, podcast has made you shed a tear or ten? Anyone else ever listen to a podcast that has made you emotional and tear up or full on cry while at work? This is kind of a shit post but this has happened to me one to many times and I just sit at my desk hoping no one walks up to me as I try to gather myself again haha Really awkward when someone does walk up and my nose and eyes are red from trying hard not to cry. The most memorable example was when listening to S-town.. (spoiler warning) when Brian goes on to describe how he felt about John passing, I just lost it.<alexwilliamns>: The end of the Balance Arc of The Adventure Zone! My heart... 😭😭<Destructer23>: I'm almost at the end of that arc. I'm prepared. I think.<dadjokes_bot>: Hi prepared, I'm dad!<Destructer23>: Fucking Christ, that was qui- oh, wait, nevermind, good bot.", "num_messages": 5, "avg_score": 3.8}
{"start_date": "1544725664", "end_date": "1544922190", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 25, "text": "<458cd458>: What’s the best horror or creepy podcast? (Not true crime) <susie_grace>: Limetown freaked me out. I haven't gotten around to the second season yet, but the first season certainly messed with my head.<aidan8et>: The second season will equally screw with you. (Obviously) It takes place some uncertain amount of time after Season 1, but it has the same twists &amp; turns as well as hinting to plenty of backstory for Season 1.<458cd458>: I can’t find season 1! <aidan8et>: Season 1 is only about 6 or 7 episodes. Season 2 was only 5, I think. <https>://www.twoupproductions.com/shows/limetown<458cd458>: Thank you!!", "num_messages": 6, "avg_score": 4.1666666667}
{"start_date": "1544591609", "end_date": "1544675415", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 9, "text": "<thechasesmith>: LIVE Podcast recordings what XLR mics have you found works best in a LIVE recorded noisy environment?<BoojumRadio>: I'd say avoid condensers. Use a dynamic mic, like a SM58 or some such. Make sure the performers are nice and close to their mics.<thechasesmith>: awesome ty!", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1543338030", "end_date": "1543340992", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<DatPrickleyPear>: Preference on podcast intros/theme tunes? What is your preference when listening to podcasts: do you prefer just music as intros, or intros with words, a combo of the 2? Or do you just skip over them entirely ha <alarmalarmalarmalarm>: As a person who is currently revamping the intros for his podcasts; I am very curious about answers on this. <DatPrickleyPear>: That's why I'm asking too! I only have a few episodes out but Im reconsidering my intro and want to know if I should just edit old episodes with new intros <alarmalarmalarmalarm>: Although some others on this sub may disagree; I would not re edit an episode already in the world. When you’ve been podcasting for years those differences will be nice to look back on. As a listener; I enjoy seeing evolutions as a podcast matures. I can also say that the type of intro that fits best really depends on the podcast. In my opinion; the intro sets the tone of the entire experience; so you wanna make sure it’s appropriate to have this or that type and what it brings (or takes away) from your episode and overall feel. Basically I like em all haha. As a caster; we’ve redone and changed things in all three of our shows as time has gone on; and I think it helps evoke a sense of “journey” and whatnot with our listeners. <Edit>: grammar", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1543243292", "end_date": "1543255272", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 44, "text": "<SuddenStop1405>: Top 3 interesting podcasts Hi podcast listeners. I was curious what three podcasts are the most interesting to you. This question isn't necessarily about your favorite podcast but the most interesting ones. The topic doesn't matter as long as you find yourself often thinking \"Now this is interesting\". Last but not least make sure to only name three. Mine are currently: Stuff to Blow Your Mind - Discussion about topics from every corner of science and culture Love + Radio - People telling unusual and fascinating stories from their lives Myths and Legends - Tells myths and Legends from all around the Globe Curious to hear what your top 3 are. <Psilocybology>: 1) Philosophize This! - An educational podcast about philosophy where you don't need to be a graduate-level philosopher to understand it. In chronological order, the thinkers and ideas that forged the world we live in are broken down and explained. 2) Justice in America - Each episode covers a new criminal justice issue. We explain how it works and look at its impact on people, particularly poor people and people of color. 3) Intercepted - Discussions about the crucial issues of our time: national security, civil liberties, foreign policy, and criminal justice. (Descriptions taken from bits of their Spotify descriptions)<DTownForever>: I also really enjoy Intercepted - though I don't always agree with what they say, they always examine things from a big picture, historical perspective and not the type of reactionary politics podcasts like Pod Save America. <ETA>: A little while ago I learned that some people view Intercepted as a \"conspiracy theory\" type publication. I don't see it, but I guess it has a reputation as such. :shrug:<Psilocybology>: Yeah I can't say I always agree with everything either, but it definitely gets me thinking about things in ways that I appreciate. The episode that really did it for me was when they had Noam Chomsky on, that was probably my favorite. I can see how some people might say that; there are some aspects of the show that I've felt that way about. But what's scary is that things like systemic racism and the criminal justice system or the influence of money in politics, they're not conspiracies, even though they can sound like they are. I haven't come across anything when listening though that to me seemed to actually cross into the realm of conspiracy. <DTownForever>: There was a bonus episode a while back where they played this amazing lecture by Nikhil Pal Singh - October 5th is the date it aired. Not gonna give the title b/c it's very political, but check it out, from your post I think it might interest you. <Psilocybology>: That was a fantastic episode, thank you for recommending", "num_messages": 6, "avg_score": 7.3333333333}
{"start_date": "1543628677", "end_date": "1543632272", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 8, "text": "[deleted]: Post A Picture Of Your Recording Rig [deleted]<BangsNaughtyBits>: You can see many in /r/podcastgear !<SpiceCake68>: Ah. Well that simplifies things.", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543594996", "end_date": "1543595806", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<speciosasteven->: Keep me spooked Hey guys, what’s your favorite horror themed podcast? It could be anything horror related. I’m looking for something good to listen to at the end of my shift once it gets dark. I listen to no sleep, shock waves, spirits, and a few more, but I would absolutely love some recommendations. I have Spotify, the iPhone podcast app, and stitcher. If it’s not on either of those just let me know where I can find it and I’ll download that podcatcher. Thank you in advance guys. <TaraDevlin>: I run a podcast called Kowabana where I translate and read out Japanese creepypastas. It's available on Spotify!<speciosasteven->: Thanks, I just followed, look forward to giving it a listen :)", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1543517741", "end_date": "1543632040", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 22, "text": "<pandaperogies>: Teacher's Pet I woke up this morning to the surprise of a new Teacher's Pet episode. I am really glad that this podcast put the fire under the DPP to dig up the property and investigate the high school. Kudos to the Australian for making it. For those listening, do you think Chris will ever be charged?<DTownForever>: Okay, I don't know if he'll be charged, but I have to say, I skipped half of episode 12 and then all of episodes 13-14. I just felt it was getting SO repetitive - and even episode 15, the one that just came out, was repetitive, and I'm not even done with it. I learned a lot of Australian slang though, so that was fun. I have an Australian FB friend and I messaged her a bunch of times asking her what stuff meant. <EllenPond>: THE SOFT SOIL IS SOFT <DTownForever>: LOL - AND, did you know, it's outside the girls' bedroom windows? AND, there are pavers by the pool? And Chris never contacted her friends? And she was devoted to her daughters? And ... (insert a dozen other repetitive things here...)<EllenPond>: A STARH FOOOOTBALLA AND A HIGH SCHOOL GIRL, Chris never once mentioned this to police!! I enjoyed this podcast so much, but resented having to spend 20 hours of my time listening to the same facts over and over again. They got me though, I’ll give them that", "num_messages": 5, "avg_score": 4.4}
{"start_date": "1544659637", "end_date": "1544736074", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<vladadoll>: Creepy fiction podcast recs? Short and simple, I'm looking for podcast recs. These are what I've listened to (I haven't finished all of them yet) and enjoyed: × WTNV (my first!) × Wolf 359 × Limetown × The Black Tapes (ok, I hated how it ended, we all hated how it ended, but until the 3rd season I really loved this one a lot) × Lore × The Bright Sessions (not creepy but I love it so it's on the list) × (A select few eps of) The No Sleep Podcast What I didn't like: × Alice Isn't Dead (juvenile writing, felt too trying-hard-to-be-weird, none of WTNV's charm) Has potential: × Station Blue (I'm mixed on this one) × Archive 81 Thanks guys! <gortmend>: I produce [LampLight Radio Play](https://lamplightmagazine.com/radioplay/), we do adaptations of the short horror fiction published in LampLight Magazine. I personally think ep 6 is our creepiest, but I'm proud of all of them. The Phenomenon is pretty intense. Darkest Night is a mostly-anthology (the book ends are from the same world) that gets pretty gruesome. We're Alive is great zombie action. <MaxAblitzer>: Your production is very good it’s close to what I do in Horror Tales. Enjoyed episode 6 and subscribed! Keep it up, very nice!<gortmend>: Thanks! I'm looking forward to checking out Horror Tales.", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1543518862", "end_date": "1543600492", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 107, "text": "<tward87>: I need more Jonathan Goldstein! Please!! I only have three episodes left of what I consider to be podcast perfection. *I am in love with Heavyweight.* It's captivating, thought-provoking, uplifting, and really really funny. His storytelling is so unique and endearing, that I've binge-listened way too fast. I know I should take my time between each episode to digest and reflect... but I'm addicted. From the podcast (and a little bit of Googling), I found out that he came from This American Life, and before that he worked at the CBC on a show called \"Wiretap\". Would anyone please post some links to that other work? Maybe what you might consider your favourites?<quat1e>: Was this because of my post recently saying that Heavyweight was amazing?<tward87>: It was actually Gimlet's cross-promoting of a sample episode on Reply All that got me hooked. But looking at your history, I see that you recommended \"Believed\" as well. Is it similar production-wise to Serial/Heavyweight?<quat1e>: Oh no Believed is about the Gymnastics coach who molested gymnasts, very interesting.<tward87>: Thanks - I'll have to check it out.<quat1e>: Any others you can recommend?<tward87>: I'm actually new to the whole podcast universe (other than RHAP which feeds my Survivor obsession). I've only really listened to the first season of Serial, and now a pile of Reply All and Heavyweight.<quat1e>: I'm a newbie too, keep with serial it's amazing and then Bear Brook.", "num_messages": 8, "avg_score": 13.375}
{"start_date": "1544468450", "end_date": "1544494158", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 136, "text": "<ArchonReeve>: Soundcloud is cheating creators Hey Podcast Creators, Update on Soundcloud's \"monetization.\" It's a sham! I don't use that phrase lightly. Proof below. My wife and I have spent the last 3 years organically growing our brand to the point where we get over 25k downloads per month on Soundcloud. This is not to brag, but to prove a point... I have tried multiple times to get approval on being a monetized member of soundcloud. We have had a super-pro-$15/mo account for 2+ years, we have over 25k downloads, no copyright strikes, etc. They will not let us sign up because (email from them directly): \"The reason you aren't eligible for Premier might be because plays for some of your tracks seem to be unauthentic. I'm afraid we cannot disclose how we differentiate authentic from unauthentic plays but we do perform filtering when considering creators for eligibility to Premier Monetization.\" I have asked them multiple times if there were any other holdups and their response has been that phrase, word for word, every time. We have no other things that would prevent us from getting paid. It's additionally insulting that they will not outright confirm a problem with their system or, worse, are flat out refusing to pay us after offering the program to paying members. Our works have over 1,000 downloads/month on obscure apps, and well over 50k on mainstream ones. <Either>: A. Over 96% of their listeners are fake/bots aka \"Inauthentic\". B. They are deliberately denying creators who are eligible to monetize. We have never paid money to advertise our Soundcloud, nor have we ever engaged in paid social media boosting, so we shouldn't have any bots. Either outcome from Soundcloud is seriously troublesome and you should all be aware of it.<Pilebsa>: If you are a content creator, why dilute your equity by using an aggregator? If you're responsible for your traffic, fuck SoundCloud. Don't give them your hard-earned traffic if they're not going to pay you. What we're seeing here is the beginning of the Internet becoming a tool mainly for elites. Yea, you can find free hosting of your content IF you let them exploit it. Otherwise it will cost you more and more to make that content available to the masses in ways you have control over. This is what happens without net neutrality. Less outlets to host your content on. Fewer hosting providers. Higher costs for hosting. More stringent terms on what you can and can't do with your content. Welcome to the future. Please vote.<ArchonReeve>: TBH RSS aggregators like Libsyn are pretty great. The price of automation, quality reporting, and actual customer service (plus the occasional advertising lead or push onto a new platform) is worth the $5-$15/month. Soundcloud in particular isn't transparent, and is trying to build their brand by saying they'll pay you if you get big, which I'm calling foul on.<Pilebsa>: Unless they give you access to the server logs, you can't trust any of the metrics they're claiming, good or bad. Ultimately, the only way to know if you have traction is having fans directly interact with you. <ArchonReeve>: We have a high-functioning patreon, 800+ iTunes ratings, and daily fan interaction with different people. Unless 96% of our Soundcloud downloads are bots (per their reporting), we absolutely exceed 1k per month on Soundcloud alone. Their reports are, in theory, what they should be holding creators accountable to.<Pilebsa>: Why would you mess with Soundcloud if you have Patreon working? That's like collecting aluminum cans after you won the lottery. <ArchonReeve>: If you made under $30k/year working 50+ hours a week, and could make an extra $300 a month by clicking 'yes, opt in', you'd understand how big of a game-changer this could have been.<Pilebsa>: $300/mo? That's wishful thinking. You want to make an extra $300/mo? Call one of the mattress companies, job post website, or \"male enhancement\" pill producers and shill for them on your podcast. I have friends who have been producing quality content for 30+ years who wish they could make that kind of residuals from a second tier web site. <ArchonReeve>: And yet that is what soundcloud claimed to attract new people to the platform<Pilebsa>: Imagine that. A corporation that misleads their customers? Did Soundcloud actually say you were going to get $300/mo? <ArchonReeve>: Their new release promises a $0.007 per play if you subscribe to their Pro level ($10-15/mo) and opt into the program, which, for me would equate to about $300/mo.<Pilebsa>: Hmmm, well I guess there are some catches to that.. doh", "num_messages": 12, "avg_score": 11.3333333333}
{"start_date": "1544734056", "end_date": "1636699240", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 10, "text": "<glASS_BALLS>: Overcast help Hi. I’ve been using the Apple podcast app for years but it’s been slowly failing to the point where it crashes all the time. I checked this sub and saw lots of people recommending Overcast. I installed it and really like it! Fun new features and the skip ahead/back works way better. To test it, I only subscribed to my top 5 podcasts and it’s working well. I figured out the complicated “sync subscriptions from Apple podcast” issue (requires a computer and iTunes....who has a computer?), but I have a more stupid question. Some of my pods are 3h long (sporting event radio broadcasts) which would fill up my phone’s memory fast. In Apple, I have it list the new pods but I get the choice whether to download it or not. Often, if the topic is something I’m not interested in....or if it’s like a volleyball game....I opt not to download the pod and delete it. In Overcast, it seems to auto-download new pods I am subscribed to until it fails. Can I prevent this? Related, if my phone filled up with Apple podcasts, I could go into settings-general-iPhone usage-podcasts and see exactly which episodes are taking up all the memory. Sometimes it would be a long one, other times it would be some pod that doesn’t know how to encode their audio with reasonable compression, so it’s like 30min long and 250MB. Is there a way in the app to see the relative sizes of the different downloaded pods? TL;DR how do you manage your podcasts in Overcast so it doesn’t automatically download new podcast episodes as they are updated. <grmdgs>: I think you need to go into the individual podcast settings <pkondo>: This is correct. Go into each show and click on the Settings button. Subscribe to All New Episodes should not be on. Then, in the future, you would look at the All button which lists out all the episodes and then you can manually download only those you want. &amp;#x200B;<carolyc>: Hi there - hijacking this thread. I have done all the above to not auto download episodes but I can’t for the life of me find how to download individual episodes. I can’t find the “download” symbol. Can someone help please?<carolyc>: Adding here that where the download icon should be, I see the trash icon instead.", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1543199925", "end_date": "1543245461", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 237, "text": "<Sophhfb>: Bear Brook is fantastic. I’ve listened to it all in one day. I can’t seem to find the post on here that suggested it but thank you, thank you!! V recommended <mou_mou_le_beau>: What’s the premise?<phoenix927>: Not the OP, but I’d highly recommend the podcast. It’s very well done, and what I like the most about it is that it isn’t drawn out to like 12 or 18 episodes that have a bunch of pointless filler. This one is the perfect length, I believe it’s about 7 episodes. The premise is it’s a true crime podcast about bodies that are found in barrels in the woods, and no one knows who they are, so not only are they trying to find who put them there they also have to find out the victims. I don’t want to give anymore away, but I will also add that this is one of the first cases to use familial DNA to identify someone, so it was kind of the case that started all this. Such a good podcast!!!<Sophhfb>: Perfect summary! I really enjoyed the true crime mystery aspect but also the development of DNA and how it's used in law enforcement and the exploration of the moral implications of what science is now capable of!", "num_messages": 4, "avg_score": 59.25}
{"start_date": "1543487207", "end_date": "1543525357", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 24, "text": "<quat1e>: Bear Brook is so interesting, im only 3 episodes in<https>://www.bearbrookpodcast.com Two barrels, four bodies, and an enigmatic killer. The cold case that changed the way murders will be investigated forever <5footbanana>: Love it. I also loved Dr Death. Does anyone else have recommendations for these types of short podcast series that cover a subject?<quat1e>: I have just been searching for some tonight, these are some similar I have but not listened to all. <https>://lists.pocketcasts.com/e3986ef2-ddb9-4ecf-9645-3526d2bce71b<5footbanana>: Good.man. I appreciate the list!<quat1e>: Your welcome", "num_messages": 5, "avg_score": 4.8}
{"start_date": "1544355508", "end_date": "1544370768", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 93, "text": "<littlepenis>: Podcast addict has over a gig of background data even though it's turned off and both settings... Help!?!<https>://imgur.com/a/o0XsN38<DrinkslikeanAMERICAN>: Are you downloading your podcasts on wifi? I just checked mine from November 17 - December 16 Total 2.49gb Foreground 2.49gb Background 602kb In app Under download, be sure auto download is off. This is just how I do it so many shows I don't listen to every single episode. Under network, be sure streaming on wifi only is on. <littlepenis>: I didn't think about the auto download but it looks like the box isn't checked which means it should be off. and I think the second picture I posted was the network screen which everything is set for wifi-only. I really like this app, but if this is going to happen again I'm going to have to delete it because it's using my entire month of data for no reason.<DrinkslikeanAMERICAN>: Whoops didn't see your second pic. Don't understand how it's using background data when it is clearly turned off. I would write them an email in their FAQ section. As it doesn't address this issue in that section. <littlepenis>: I'm thinking it has something to do with the banner ads, I change the setting for interstitial (think that's what it's called) and I'll see if the problem happens again next month or not. Someone else suggested just paying for the removal of the ads which if it's a one time fee I think I might do it if the problem persists... Hopefully this wasn't done on purpose and it's just a simple mistake.<DrinkslikeanAMERICAN>: That makes sense, I bought it. I use Google rewards. Make like 32$ a year in Google play credit. So gotta spend it somewhere.<littlepenis>: Annnnddddd I just realized I had Google dollars... Those surveys paid off!", "num_messages": 7, "avg_score": 13.2857142857}
{"start_date": "1544772958", "end_date": "1544792275", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 59, "text": "<NecroSyri>: Podcast Addict, auto play in correct order (Solved) Hi, sorry for the noob question, but how can I do when I listen to a podcast episode to be sure that when my episode is over, it will automatically read the next one. Actually it reads the most recent after the one I selected. Which can be quite annoying for audiobooks. Thanks<748point2>: It depends on the podcast player you're using. I use PlayerFM, and for that one you can change the play order, sort order, etc. in the settings for each show<NecroSyri>: Thanks for your answer but someone already gave me a solution. I use podcast addict, I said it in the title only, maybe I should have included it in the message too.<DTownForever>: Did it work? This annoys me - when an episode ends, it starts playing the last episode I listened to that I didn't finish. <NecroSyri>: Yes, that worked perfectly", "num_messages": 5, "avg_score": 11.8}
{"start_date": "1543605980", "end_date": "1543634772", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "[deleted]: I’m starting up my podcast, and have just ordered two blue yeti mics. I want to be able to record a video of the podcasts too, what should I use? [deleted]<moatf>: What I’ve done in the past is record the audio and video separately and use three claps to align them in iMovie. Works pretty well. You can also do this if you have two audio tracks and you want to make one, you can align in Audacity. On a side note I’m not sure you can use two of the same mics with a Mac, I know I’ve struggled in the past. If you going to record on a Mac I thoroughly recommend getting Mixxx which is free and Loopback which is awesome, but not free! Good luck with the podcast!<BangsNaughtyBits>: Loopback 2 was released today, FYI. !", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1544609476", "end_date": "1544629095", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 4, "text": "<realjimmy6>: Podcasts about Bitcoin, cryptocurrencies, and blockchain? Have started getting into cryptocurrencies. Seems like an interesting and innovative topic. Any suggestions regarding podcasts about cryptocurrencies, Bitcoin etc?<AnxiousHairball>: I found this site a few days back [http://cryptoandblockchaintalk.com/](http://cryptoandblockchaintalk.com/) . If you manage to listen beyond the intro, they've actually got some good stuff there.<realjimmy6>: Thanks, will give it a try!", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544754415", "end_date": "1544801505", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 10, "text": "<patcat127>: Does anyone know how Anchor tracks listens? Title, Anchor shows me \"listens\" but I can't find anywhere if that's one second, one minute, one full episode, etc.<Bobby_Wiley77>: It tells you the platform that it was accessed from. The app, will tell you total number, but the website will tell you the number and the platform totals. It will say something similar to: iOS 10 Stitcher 7 Anchor 15 Others 10 Similar to this as a rough example. Hope that helps!<patcat127>: I understood that, i mainly want to know what it means by a \"listen\"<Bobby_Wiley77>: Gotcha. In that case, I’m not sure :(<patcat127>: No worries!", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1544780091", "end_date": "1544787416", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<Rufus2227>: Is there any way to access old BBC podcasts? Hiya, title says it all. I would really like to listen to some old BBC podcasts like Norman Cook - You've Come a Long Way Baby<https>://www.bbc.co.uk/programmes/m0000f82 Is there any way to find them? Many thanks <jdoyle93>: BBC Sounds is where you need to be. &amp;#x200B; [https://www.bbc.co.uk/search?filter=programmes&amp;q=Norman+Cook+](https://www.bbc.co.uk/search?filter=programmes&amp;q=Norman+Cook+)<satanistgoblin>: &gt;Sorry, this episode is not currently available <jdoyle93>: Strange. I guess it’s because they’ve just launched BBC Sounds but going forward they’ll probably keep episodes for longer", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1544781778", "end_date": "1544806967", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 8, "text": "<WarmFirefighter>: Any podcast recommendations with non American/British hosts ? I feel most podcasts i listen to have north American /UK/Aus/ hosts. I wanna branch out no matter the genre. <gryng0>: Casefile is done by an Aussie, and is a pretty solid true crime podcast<Percy024>: It was hard at first to get used to his accent and monotone delivery but it was so worth it!", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1544615262", "end_date": "1544643032", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 62, "text": "<lyssaa3>: Best true crime podcasts and episodes? Besides the obvious Serial/ Dirty John/ Dr.Death <rosepetal19>: My Favorite Murder! <dlmcleo1>: Terrific podcast, terrific hosts- and I could totally see how they would not be to someone's liking. All I can say is when I discovered this podcast I binged it for about two months. And it's one of my same-day listen podcasts now.<rosepetal19>: I can definitely see why some people wouldn’t like them - sometimes it’s a good twenty minutes before any real chat. But I love it for that, their humour is the best. I can listen to them anywhere! <dlmcleo1>: Yeah, and I genuinely like that they share their sordid histories, their amazement at how well they've done, their mental health and therapy thoughts, and as a middle-aged white guy, they have helped me become more sensitive. I really love that Georgia, in particular, it seems to me, has become more confident and comfortable in her speaking. She was always a little more disjointed in her story telling in the beginning, but now she's almost as good as Karen. Karen just has a longer history of public speaking. It's not my favorite podcast, but it *is* my second favorite podcast- The Dollop is my fave.", "num_messages": 5, "avg_score": 12.4}
{"start_date": "1542736650", "end_date": "1542749282", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 562, "text": "<CalifaDaze>: Why do podcast hosts try to up-sell \"live shows\" as a treat when they are worse for the listener? I can't be the only one who likes the studio version of podcasts better than the live audience version. There's a podcast that I listen to called \"How I Built This\" and the host really acts like its so great to have a live show with an audience but honestly they just aren't that great. There's people laughing at the jokes and it just takes me away from what's being discussed. Also the sound isn't as crisp as it would otherwise be in a controlled studio setting. --- For those wondering, I'm referring to the podcast downloading audience not the actual live audience at the event. I'm sure going to the live show is more engaging but if you are just downloading, I feel like the experience is worse for live shows than pre-recorded <ckilgore>: Because sometimes people like to go to live podcast tapings and have fun with other fans of the podcast?<ddeevv>: I think OP's issue is with listening to the live recordings, not the live shows themselves.<PlatosApprentice>: I don't think any podcast actually thinks they will be enjoyable/good quality car listens but in most cases they're better than nothing.<DtEm0bAWmaecNtX4GOWi>: I'd rather have nothing. If one comes up I skip it, giving myself nothing.<heythere30>: I also skip them, I always feel like I'm just an acquaintance hearing old friends talking and not being part of the inside jokes. The hosts are obviously not doing it for the listeners at home (and they shouldn't, they are completely different experiences) so the whole experience is a little off for me. I understand that this is a great way for them to make money and I'm honestly not bothered that they do it, but it's not what I signed up to listen when I subscribed to the podcast.", "num_messages": 6, "avg_score": 93.6666666667}
{"start_date": "1542607721", "end_date": "1542751042", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 30, "text": "<AutoModerator>: Weekly podcast post (submit your links here!) (2018-11-19) Hi all, please feel free to submit your podcasts as a comment with the following info: - **MANDATORY** Top line should be the podcast genre first in brackets: [comedy, movies, talk, general, tech, etc.], and then the title, (all bolded if possible). Then the episode number and title. Put everything else below that line. - Mark it NSFW or SFW on the next line, as a courtesy to others - A link to your latest episode on the third line, and other related links. These should be hotlinked to save room. You can also hotlink in the top title line for the episode instead. - A BRIEF description of the specific episode content, including notable guests (and / or why they are notable), try and keep it to a bullet point list or 4-5 sentence paragraph. - A brief description of your general week to week show content (cut and paste from past weeks is fine) - Social links hotlinked at the bottom of the post ---------------------------------------------- This is the format everyone should try to follow to keep it neater: [COMEDY] The Podcast Podcast | Episode 120 - The Second Coming NSFW (or SFW) Link 1 // Link 2 // Link 3 // Link 4 This week we talk to the President, and discuss his recent favorite comic book based movies. The Podcast Podcast is a podcast by podcasters about podcasts. Twitter // Facebook // Etc. ---------------------------------------------- - Please try and follow this format as much as possible to save people time when skimming for content. - Please encourage others to follow the format - All users are now required to meet the minimum karma requirement to post in this thread. If your post does not appear, try and get your karma count up and try again. ---------------------------------------------- <SpiceCake68>: [Talk / Cars] **The Thing About Cars** | ***There Be Unicorns Here*** SFW [iTunes](https://itunes.apple.com/us/podcast/the-thing-about-cars/id1219713195) // [Stitcher](https://www.stitcher.com/podcast/the-thing-about-cars) // [Google Play](https://play.google.com/music/listen#/ps/Iy7lrle4wux2zkc2gi522i3mrwa) // [Overcast](https://overcast.fm/itunes1219713195/the-thing-about-cars) // [TuneIn](https://tunein.com/radio/The-Thing-About-Cars-p1020912/) // [Player FM](https://player.fm/series/1413264) **This Episode:** Ronny tells us about his shenanigans at the Petite LeMans, and Beka has a visceral reaction to some of his comments. Mickey ponders about wheel direction while turning. Ben Confesses to being an impatient clod. And there's just s smidge of politics thrown in. **The Thing About Cars:** We're just people who really geek out on cars. We like to drive cars, fix them, and admire them. We're here to have as much fun as we legally can with other car enthusiasts. Come along for the ride. [Patreon](https://www.patreon.com/TheThingAboutCars) // [Website](http://thethingaboutcars.com/) // [Facebook](https://www.facebook.com/thethingaboutcars/) // [Twitter](https://twitter.com/thingaboutcars)<GetAGripStudios>: Feel free to share your show in the \"New Podcasts\" subreddit: [https://www.reddit.com/r/NewPodcasts](https://www.reddit.com/r/NewPodcasts) <SpiceCake68>: Thank you. But we’re not exactly new. <GetAGripStudios>: The rules of the New Podcast subreddit are \"8 Weeks &amp; Under, or Under 10 Episodes\" whatever is the latter. I saw you had 10 episodes released, so you'd still fall under the new category. <SpiceCake68>: Thank you. But we've actually got 50 episodes released.", "num_messages": 6, "avg_score": 5.0}
{"start_date": "1543637539", "end_date": "1543641014", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<publicsync>: can I use various inrtro/outro music per episode without getting in \"trouble\"? im in the process of starting a podcast and I am hoping to use a different song for the intro/outro per episode. Im slowly learning about fair use and free music. but there's so much real good music that's protected that I'd like to use. I'm getting so many mixed messages from reddit and the rest of the internet and if anybody can give me any advice I'd be grateful. <ianrbuck>: If the music is copyrighted, you can't use it as your theme song. That almost certainly will take you beyond the bounds of fair use.<publicsync>: it wouldn't be my theme song so to say, it would just be a song that is related to the subject that I'm talking about...or is that the same thing? next ep would have a completely different song. <ianrbuck>: Sorry, I tend to use the terms \"theme song\" and \"intro/outro\" interchangeably. If you are offering commentary or analysis of the song itself, you can play portions of it to illustrate what you're talking about. That's allowed under fair use. But using a song as an intro just because it's related to the topic isn't going to fall under fair use.<publicsync>: no such worries, I had a feeling my current plan for an intro/out wasn't going to fall under fair use...well, back to the idea box. <ianrbuck>: I used to do something similar in my show. Since each episode had a different subject, I would find a song that fit with the vibe for that episode. Try looking around the Free Music Archive, they have lots of stuff released under Creative Commons licenses.", "num_messages": 6, "avg_score": 1.8333333333}
{"start_date": "1544786425", "end_date": "1544789312", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<AusterMcEwan>: Thoughts on new design in Pocket Casts? <stevensajja>: I like it. 🙂<AusterMcEwan>: Same. Thread closed!", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1544677239", "end_date": "1544677759", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 13, "text": "<meganstoocute>: Best series to binge on a long road trip? I've enjoyed Dirty John, Alice Isn't Dead, Dr. Death, Crimetown, Sandra, Blackwood, Last Seen, Homecoming, The Black Tapes, Rabbits. I love true crime series like Dirty John, but also really enjoy fiction like The Black Tapes. I've got 14 hours on the road tomorrow, help a girl out! <DJKMoney>: I don’t know true crime but if it were me I’d go with Twenty Thousand Hertz or How I Built This. I recently listened to a series from vice about el Chapo which was really good, but definitely not 14 hours.<meganstoocute>: Ohh what's that series called? I'm currently watching Queen of the South after finishing Narcos. <DJKMoney>: “Chapo: Kingpin on Trial” was the name. I believe it’s a Spotify exclusive but podcasts are available under Spotify free. Their last episode was on Tuesday so they’re still releasing new episodes.<meganstoocute>: Thank you!", "num_messages": 5, "avg_score": 2.6}
{"start_date": "1543639333", "end_date": "1543912539", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 4, "text": "<Aenimal>: Looking for. A podcast that took real life life stories that had strong parallels to classic rom com movies I feel like it was this American life, or radiolab. Thanks<great-hair>: “This is Love” maybe?<Aenimal>: I found it, thanks", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543640249", "end_date": "1543763565", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<L4merth4nm0st>: Looking For Fictional Narrative Crime Podcast, but can't remember the name On one of the podcasts I listen to (either Behind the Bastards or Slow Burn I think) I am positive I heard about a fictional \"true crime\" podcast. I thought it sounded really cool and wrote it down on a scrap of paper, but have lost the paper. If anyone knows what I am thinking of and can point me in the right direction that would be swell! I might be confusing it with Hell and Gone though.<L4merth4nm0st>: Thanks for thoughts and answers everyone! You have made my day and filled my ears!<rightdeadzed>: If you like Fiction podcasts check out /r/audiodrama<sneakpeekbot>: Here's a sneak peek of /r/audiodrama using the [top posts](https://np.reddit.com/r/audiodrama/top/?sort=top&amp;t=year) of the year! \\#1: [Limetown. Is. Back.](https://np.reddit.com/r/audiodrama/comments/9smr3n/limetown_is_back/) \\#2: [We have reached 10,000 audio drama fans!](https://i.redd.it/g9drtnobe0f11.jpg) | [8 comments](https://np.reddit.com/r/audiodrama/comments/95twrg/we_have_reached_10000_audio_drama_fans/) \\#3: [Why do people like Welcome to Night Vale so much?](https://np.reddit.com/r/audiodrama/comments/8hfdf4/why_do_people_like_welcome_to_night_vale_so_much/) ---- ^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543469577", "end_date": "1543472855", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 9, "text": "<DTownForever>: Cults and fringe groups? So far I've listened to Heaven's Gate, Escaping NXVIUM, the episodes of You Must Remember This about the Manson family, the Teal Swan series (can't remember the name?) and am currently listening to Standoff, about Ruby Ridge. Any other suggestions? I've tried Killers, Cults and Nutjobs, but don't like the format. Oh No Ross and Carrie is an all time favorite, but they've pretty much exhausted most subjects, IMO. Help? TIA! <BuildingUtopiaPod>: Shameless self-plug warning: consider checking out Building Utopia, about the charismatic leader/cult leader Bhagwan Shree Rajneesh (the subject of Wild Wild Country on Netflix). It's presented in a style similar to the You Must Remember This series on Manson.<pupetman64>: I'm going to give this one a try, the story of that cult is pretty fascinating.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1542191837", "end_date": "1544059750", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 13, "text": "<abhinav122>: Podacts similar to Lets not meet : a true horror podcast Hope many of you are fimilar with LNM podcast as the stories which were narrated were picked from the LMN subreddit( it is a quite popular subreddit I suppose) But the creator of LNM will be shutting down this podcast due to his reasons and starting a new one with frictional stories instead. So till that time .... What are some other podcast which share the same theme and have the same type of content ? <jenniviv>: I was also super disappointed that LNM ended but then I found “The Let’s Read Podcast”... the episodes are long and have about 20-30 true horror stories within them. I love the length because I fall asleep to it and can get like 2 weeks out of one episode as a result haha. I’ve really been enjoying it due to its similar vibe so highly recommend. I also think it’s kinda sucky that the host of LNM didn’t give the podcast to someone else to carry on. He also deleted all the episodes “on accident” which is annoying for those of us who want to listen back :(<BertEast>: Is there any way I can listen to the old episodes? I'm recently hooked and can't find any of them archived or available for download<jenniviv>: Yep! He recently posted them on Google Drive. Here you go: [https://drive.google.com/drive/folders/1of-C9U2qOXbHVDg63uFTnvsPyJALjFUf?usp=sharing&amp;fbclid=IwAR2Zhy8CwfTT9X-t8QjZZsshON5Awea9cR3rIDVVPtFjZgTJTOCdPrl5oKs](https://drive.google.com/drive/folders/1of-C9U2qOXbHVDg63uFTnvsPyJALjFUf?usp=sharing&amp;fbclid=IwAR2Zhy8CwfTT9X-t8QjZZsshON5Awea9cR3rIDVVPtFjZgTJTOCdPrl5oKs)", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1544724397", "end_date": "1544820260", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<TryptophanTiger>: Looking for a podcast about police interactions Hi all! I’ve really enjoyed listening to Embedded’s police stories and the few episodes on Serial that have police footage. I guess I’m kind of looking for something in the vein of the TV show COPS, if such a thing exists in podcast format. Thanks!<sparkl3butt>: Did u try in the dark yet?<TryptophanTiger>: I’ve listened to season one, how’s season two?<sparkl3butt>: Well nothing is going to beat season 1 but season 2 is still worth the listen :)", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1543111400", "end_date": "1543168970", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 326, "text": "<Geopatra1>: Why don't more people put their podcasts on the radio? AM radio is a total wasteland now... can it be recolonized by podcasters somehow? Maybe someone who knows more about AM radio can enlighten me why this is a dumb idea. I'm not a radio person nor a podcaster, but had this idea last night. If you flip through all the AM radio channels you quickly find that besides a few Christian gospel channels, Foreign language shows and Alex Jones, there's pretty much nothing but static. The question is- why can't this radio desert be overtaken again by podcasters? It would give young podcasts another venue for their show. Obviously someone would need to buy out a channel to host them, but it can't be too hard can it?? Why not? &amp;#x200B; <Edit>: Some good points / things I didn't know on why this wouldn't be very viable for their own podcast needs. Sound quality is worse (which isn't important for all, but many), the FCC will censor a lot (again, important for many), Listener demos aren't trackable, listeners can't save or rewind/ff, overhead costs of running a station, geographic limitations, etc. However I still feel like it would be cool as a project for someone to 'curate' a station based on a selection of podcasts on interesting topics. Also the demographics of people who listen are quite different than those on their phones for everything (ie old and more rural people) , so for start-up pods it could be a way to penetrate a whole new market of listeners! Just a fun thought\\~<ijustwanttogohome2>: Regulations, cost to run a station, the FCC.<DJKMoney>: The FCC isn’t an issue with things like podcasts. Original work and fair use covers 99% of podcasts.<urutapu>: It is if you want to broadcast a podcast on the radio.<DJKMoney>: Not if it’s your podcast.<imlyingdontbelieveme>: It doesn’t matter if it’s ‘your podcast’, it’s not your radio and that’s where the FCC comes in.<DJKMoney>: Username checks out.", "num_messages": 7, "avg_score": 46.5714285714}
{"start_date": "1543594211", "end_date": "1544461540", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<gabrielmercier>: What apps do you use to listen to your podcast? I use the apple podcast app and I’m really hating it right now. Seems like it’s just been getting worse. What do you guys use? What are some good apps to listen to podcasts with on iPhone or Android?<RollingStoneCPT>: Sticher, highly recommended.<Slick1ru2>: This was my first player on iOS. But it, to me, doesn’t sound as good as Overcast when you speed it up.<RollingStoneCPT>: As a rule of thumb, I listen to podcasts on a speed of 1.5x - The only time I notice is when they play the intro song. I find is super weird to listen to shows on their normal speed now.<Slick1ru2>: Right. Overcast has an auto speed up and auto voice boost that really makes a difference.", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1543612697", "end_date": "1543619995", "thread_id": "t3_a1v47p", "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 4, "text": "<j3rown>: Dude if you're gonna plug your own podcast, at least be upfront about it.<amanda-11>: How do you know it's their own?<j3rown>: Comment history", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543649993", "end_date": "1543659546", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 3, "text": "<stha_ashesh>: Why can't I see all podcasts on itunes or via rss when I can play on website. I am trying to listen to theengineeringcommons.com's podcast. And all list with file is there. But the rss shows only from 40 and same is case with itunes(never used itunes before). So am I missing something as music bee as well as vlc can't download all podcast (1-39).<neshcom>: Sounds like the creator does not have their RSS feed set up correctly. Contact them and ask them to adjust their feed to list most previous posts<stha_ashesh>: idk itunes is also showinf just that amount and that is 100 items only.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1544773444", "end_date": "1544823511", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 4, "text": "<privatexradio>: Having trouble with ITunes Podcast Connect, can’t access it with my login? So I don’t know if anyone else is having trouble, but I am attempting to submit my podcast for review and it keeps directing me to the Podcast Providers login page. It’s the link that’s provided on iTunes that says “Submit a Podcast.” However, it just sends me back to that same page. Can anyone help? <richofthehour>: I'm also having the same issue, hopefully apple can fix this soon.<privatexradio>: This is annoying. I made an announcement about the launch of my podcast saying it will be approved soon. I’m so annoyed.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543658891", "end_date": "1544042298", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<AnimeSavage>: What Do I need improve in my podcast Ive been try to get some critique on my podcast. If there is anybody who's willing to give some feedback ; I want to know what's going on as far as sound quality the quality of the podcast Should i add music (Also keep in mind I use a app called anchor FM which allows you to record episodes on your phone) I really appreciate your feedback thank you<VI6XII12VI6>: Add an intro to it. Invest in a mic for your phone, it's hard to understand you at certain times. Maybe if possible make more content to each episode.<AnimeSavage>: Sry for late reply thank you for your imput", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1537950289", "end_date": "1545243980", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<Heiser_>: Which podcast app is comparatively better? Podcast addict or pocketcasts Thinking about purchasing one of them<aartist111>: I like Castbox. It has tags. It may be similar as categories. Or better. <trashpix>: I just left Castbox. Liked it too but was going to upgrade and found the recurring $1/mo subscription an annoyance so I went back to PodcastAddict. I'm willing to pay $5 for an app but recurring was a bridge too far when there's a wealth of other options. I agree PAs dark theme is off-putting, wish they had white. Tags and Categories are effectively the same. <aartist111>: What is the benefits of premium castbox?. I do not have premium one <trashpix>: https://castbox.fm/help.html?qatag=Castbox+Premium", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1532139588", "end_date": "1532150564", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 9, "text": "<cjl2441>: Looking for podcasts on architecture I’ve always liked learning about the architecture of buildings, bridges, parks, etc. I’ve come across a couple pods here or there but they were more aimed at architectural theory and design. I’m looking for more of a ‘Here’s a bridge/building you’ve heard of and here’s the fascinating backstory behind its design and construction...’ Thanks!<vinethatatethesouth>: 99% Invisible has a few episodes about this. You might enjoy these until you can find a specific podcast about this topic. Some architecture episodes include: 110 Structural Integrity, 132 Castle on the Park, 147 Penn Station Sucks, and more that I can’t remember <ohsosuperfluous>: Also came here to recommend 99% Invisible.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1530621626", "end_date": "1530761392", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 305, "text": "<an0therFate>: Best new podcasts of 2018? What are your top picks? <b_r_e_a_k_f_a_s_t>: **Caliphate** by the NYT is about ISIS. The reporter interviews several members of the group to find out more about what they believe and the horrors they’ve committed. She tries to corroborate their stories. <anxious_anatomist>: I loved it from beginning to end. Saw the strangest comment on a bother post. Someone called it stupid because the title confused them into thinking that it was about the actual caliphate. This normalized the bastardized meaning ISIS atreibuted to the term, and the podcast was therefore stupid and offensive. People are strange. People also thought is was pro ISIS. <sust8>: “Beginning to end”? Is it over? I didn’t get that from the last episode. Man I hope not. It’s a great podcast. <anxious_anatomist>: I think it might be. The last episode ended with a reading of the credits, and I took that to mean that it had wrapped up. Could be another season (or whatever), but I'm not sure. I hope there's more. It was SO we'll done!<sust8>: Dang I think you’re right. I went back to relisten and it does seem that way. Bummer.", "num_messages": 6, "avg_score": 50.8333333333}
{"start_date": "1544796562", "end_date": "1544857050", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 9, "text": "<lordeo1717>: Tryna start listening to podcasts. Any suggestions out there? I’ve never listened to any podcast with series so this is all very new for me and I want to start that. Which apps should I start listening to podcasts on iPhone? And what are the best ones out there? I’d like to listen to horror, psychological horror types as well the philosophical one that talk about various different aspects of life and any other in general for learning new stuff oh and any funny ones. It’s a long list but if u can share whatever u would like to. Thanks! <stuartsydenham>: I like ReplyAll - internet folklore etc<lordeo1717>: Okies. Thanks.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1543627682", "end_date": "1543693185", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 24, "text": "<TVsNoah>: Best of Last Week: The Bargain Bin Welcome to the weekly post where I dive into the weekly episode thread, pick my favorite and you all agree not to kill each other. This week I was listening to podcast with the tag [video games] This week's pick: [The Bargain Bin](https://soundcloud.com/acrossthelake/the-bargain-bin-1-duke-nukem-forever) New to the podcasting game, I enjoyed this gaming podcast with a twist. A look at bad games. A game you would find with a 5 dollar price tag. It is a great idea to have a look at the forgotten games and see if their worth matches their price. Good laughs, good analysis and good old fashioned geekiness. While it is a new podcast, it is not the first podcast for these guys and it shows. This week I also listened to: * Salt City GameCAST * Navi Tales Podcast * TADPOG * Hypercast Hit me up if you want feed back, and see you next week.<MuchoFrickinOro>: They have comic sans in part of their cover art. I cannot get behind this podcast.<TVsNoah>: Um actually, Comic Sans is the easiest font for dyslexics to read. And as a dyslexic person I have to agree that it is a garbage font. <MuchoFrickinOro>: I have friends who are dyslexic - fabulous people, truly the best. And if you asked them, they would tell you what a tremendous person I am, in fact you wouldn’t have to ask them, they would just tell you. But, this country has suffered enough for too long as a result of bad fonts. Fonts that quite simply are terrible - some of the worst. In fact, people come up to me everyday with stories of how they’ve suffered at the hands of bad fonts. Rest, assured that I have made tremendous progress against some hostile people - some of the worst people - and will be making fonts great again.", "num_messages": 4, "avg_score": 6.0}
{"start_date": "1544723530", "end_date": "1545145254", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 16, "text": "<Air_Puffed_Sugar>: Starting up a podcast and frustrated with partner Hey, so a couple friends and I are starting up a podcast. We are musicians already and so we have a bunch of recording gear, including: * Focusrite 2i2 * AKG Perception 200 Condenser Mic * Audio Technica 2035 mic * Shure SM58 mic * One shock mount * Reaper DAW/Presonus Studio One (one that comes with the Presonus interfaces) Now my partner wants to be buying Hindenburg Journalist for $100 for editing, more shock mounts, a $20/month libsyn subscription etc., and it's all adding up. I personally think we've got way more than enough decent quality gear to start recording podcasts and dont need to be paying subscription fees or anything. As well, how necessary is a paid hosting service? I'd imagine fairly important from my understanding but looking to see if my knowledge is correct. <icrouch>: Not sure why you need Hindenburg if you have Reaper. I tried it once and wasn't impressed. You'll want the libsyn subscription though not only to host the podcast feed and files but for the stats. Have you thought about a website? You can get a squarespace that is relatively simple, comes with a podcast feed, and more basic stats than libsyn. Helps to have the site for marketing as well.<Air_Puffed_Sugar>: Wait can we use squarespace as a hosting service instead of libsyn and get a website with it?<icrouch>: Yes the squarespace \"blog\" is an RSS feed. You post each episode to the blog and use the blog URL to upload your podcast to iTunes. We used it for a while before switching to Libsyn<brutolitics>: What was your reasoning for switching to Libsyn?<icrouch>: We mainly wanted to have more flexibility and build a more robust website via Wordpress. Squarespace is nice but has it's limitations. I had a friend that set us up with free hosting so all we had to pay for was libsyn and the yearly domain fee which was a plus. Libsyn offers more robust stats as well, although I've found that hasn't made much of a difference to us.", "num_messages": 6, "avg_score": 2.6666666667}
{"start_date": "1543666135", "end_date": "1545754247", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 10, "text": "<AutoModerator>: Daily Recommendation Thread: What are some podcasts that are like 'X'? (2018-12-01) Looking for more podcasts that are similar to your favorites? Use this thread to get recommendations based on podcasts you like. ---------------------------------------------- <Kettch144>: Looking for some recommendations in the radio drama area. I've tried a few and they are very hit and miss. I enjoyed the Magnus Archive for its great storytelling and great (restrained) use of music and sound effects. I didn't like the Grey Rooms due to sounding more overproduced, like a prime time radio slot with sfx and music everywhere. Also tried a space journal log one, it was a little boring. While I'm at it if anyone wants an easy listening comedy podcast I love Uhh Yea Dude. It feels like we are friends hanging out. <wavyface>: If you enjoy The Magnus Archives then you'll probably like our audio drama series, [The Darkroom](http://thedarkroompodcast.libsyn.com/). The Darkroom is a single narrator weird fiction audio drama podcast series. Every episode features a unique score. The show is episodic, though each episode makes references to others. An amateur photographer stumbles upon strange photographs he finds in old film cameras, showing him another world, just as real as our own, that exists in the shadows. The shadows of... the darkroom. We currently have two episodes available: [The Starving One](http://traffic.libsyn.com/thedarkroompodcast/DarkRoom_Episode0_v2.0.mp3): A man finds a strange roll of film in an old camera that leads to the discovery of a forgotten god. [The Abandoned Salts' Place](http://thedarkroompodcast.libsyn.com/episode-2): A box of kodachrome slides documents an isolated New England home before the mysterious disappearance of its inhabitants. [Website](http://thedarkroompodcast.libsyn.com/)// [iTunes](https://itunes.apple.com/us/podcast/the-darkroom/id1437958794?mt=2)// [Spotify](https://open.spotify.com/show/65rlPht4ICoTdqehazGEh2?si=msey0d5PRYKhxRf_w2fAFg)// [GooglePlay](https://play.google.com/music/m/lrgg2ybjlcqwsainpdaiatfw2wy?t=The_Darkroom) [Twitter](https://twitter.com/PodcastDarkroom)// [Facebook](https://www.facebook.com/podcastthedarkroom)// [Instagram](https://www.instagram.com/podcastthedarkroom/) &amp;#x200B;<Kettch144>: Thanks for the recommendation, I'll check it out!<wavyface>: Great! Enjoy!", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1544800172", "end_date": "1544824190", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 17, "text": "[deleted]: Your favorite super niche podcasts? [deleted]<rupinger>: Containers. 8-part series about global container shipping and everything that goes into it. <Edit>: link - https://m.soundcloud.com/containersfmg<AdmThrace>: I read an article ages ago that said the invention of container ships changed the world more than the telephone. I'm so excited now that I'll be able to assess that statement. <rupinger>: Awesome! Have fun listening to it. It enjoyed it a lot!", "num_messages": 4, "avg_score": 4.25}
{"start_date": "1543662087", "end_date": "1543679206", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<fpn97>: Need some critical feedback [**News Munch ** ] (https://itunes.apple.com/gb/podcast/news-munch/id1440552890?mt=2&amp;i=1000424481438) We've been really trying to work on the show over the past year and while we won a local student award we'd really love to try and take things to the next level. We're a topical comedy news show that pitch the weirdest stories we've come across mixed with sketches in between All feedback is hugely appreciated <MyMoviesBetterPod>: will give it a listen later, I love the idea of the show<fpn97>: Fantastic, whenever you get the time it's a massive help", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544801606", "end_date": "1544912518", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 111, "text": "<Trancespire>: Looking for a political history podcast that explains how we ended up with our current political landscape Not sure if such a podcast exists, but if it does I trust you guys will be able to find it! Thanks in advance! <Pilebsa>: If you really want to understand cause and effect, I would recommend watching two key documentaries that basically set the stage for what's going on politically in America (both free and available online): 1. [The Corporation](https://youtu.be/xHrhqtY2khc) - traces the history of the entity, the \"corporation\" and how it works and how it has evolved to have so much political power. 2. [Manufacturing Consent](https://youtu.be/AnrBQEAM3rE) - Noam Chomsky's highly-regarded analysis of how private interests are able to manipulate people and public opinion and appropriate government. <jmnugent>: My big problem with these kinds of \"documentaries\" (I put that in quotes for a reason).. is that they use a lot of really hyperbolic fast-edit / jump-cut type of dramatization clips.. that are kind of \"rapid fire\" and loosely strung together \"facts\". Presented in a way that doesn't let you (or allow for) you to slow down and think-for-yourself. Even if there are some kernels of truth underlying it.. it's presented in a way that largely comes off as brainwashing and propaganda. It's cute if you're a 1st year college student in a Gov/Philosophy class.. but if you spend 2 or 3 decades out in the real world.. you'll realize \"documentaries\" like this are just glossy surface coverage of issues that are much larger and much deeper and much more complex and nuanced. <Pilebsa>: In other words, you object to the \"tone\" of the content, but not the actual content? That doesn't seem to reflect a true desire to learn the truth. <jmnugent>: No, I object to the distorted way its presented. Truth is subjective (and especially dangerous anytime someone tries to pressure/convince you that their truth is the correct truth). I prefer facts that cannot be twisted by agendas. <Pilebsa>: &gt; No, I object to the distorted way its presented. Can you cite something specific? Or is this just a \"feeling\" you have? &gt;I prefer facts that cannot be twisted by agendas. *Everybody* has bias. There is no way to tell any story without someone's agenda getting intertwined into it. If you are aware of inaccuracies in claims in something, **point those out specifically**. If you're just vaguely commenting that you don't trust the information because of the way it's presented, that doesn't tell any of us anything. And it's not enough to condemn the source. In a perfect world, every podcast, every movie, every song would be composed in the perfect manner that makes us most comfortable. But this isn't a perfect world. So we have to adapt. We have to read-between-the-lines. We have to do our own homework. In the meantime, if you can cite something specifically errant about anything I posted, I want to know. I'm not concerned about how you feel about it. Don't imply there are inaccuracies unless you're going to **cite them**. <jmnugent>: Again.. I never said it was \"inaccurate\". What I said was that it's * Distorted presentation (it's only trying to get you to swallow the BAD side of media.. it doesn't represent both sides fairly or evenly). * and it's presented in a way that tries to \"convince you WHAT to think\".. instead of simply presenting facts and giving you freedom to make up your own mind (free from influence). Anytime a video is trying to convince you to believe a certain way.. you should always distrust that.. because they likely have an agenda. With videos like \"Manufacturing Consent\".. there's a prevailing bias and distortion that people are \"ignorant and unwilling rubes\" who are easily tricked and that the Media has some Orwellian overarching power to manipulate people in any way they want. That's just bullshit. Information only has power over you if you let it. (and you have the choice of whether to let it or not). We see that in society all around us today.. with all the divisiveness and tribalism and political-extremism from all sorts of different groups. The average citizen/end-user needs to: * Practice better critical-thinking * Get their news/media from a wider variety of sources That's all. That's it. This broad-brush stereotyping and hyperbolic nonsense of \"ALL MEDIA IS BAD\" ... is part of the problem. Because by approaching it that way, is just adding to the partisanship, divisiveness and hyperbolic knee-jerk reactions. What we should be doing is creating a Documentary that shows the average citizen how to be a better critical-thinker. How to evaluate information and understand how to separate opinion and claims and speculation from facts and unbiased information. Manufacturing Consent doesn't do that. All it does is pound you over the head with a big stick.. trying to convince you there's only 1 explanation.. and that is \"media is bad\". All those documentaries (Century of the Self, The Corporation, Manufacturing Consent,etc).. all seem to take that same style/approach: * Rapid fire \"facts\".. presented over quickly flashing video-clips of hyperbolic examples .. that are meant to illicit an emotional reaction instead of free thought. No good documentary should do that. Good documentaries should present the information in a calm and rational way, ESPECIALLY presenting BOTH SIDES of the information.. and ESPECIALLY presenting it in a way that leaves you free to make up your mind yourself. You should never finish a documentary thinking \"Well.. I'm convinced!\"... that's the surest sign of a failed documentary. You should always finish a Documentary thinking \"Wow.. there's a lot of good information to digest there. I'm going to have to take my time thinking about that and go do more research and try to understand the Pros/Cons of this topic before I come to any conclusion.\" Thats the biggest irony about videos like this. They purport to warn you against “propaganda”,.. but they themselves are propaganda. <Pilebsa>: &gt; With videos like \"Manufacturing Consent\".. there's a prevailing bias and distortion that people are \"ignorant and unwilling rubes\" who are easily tricked and that the Media has some Orwellian overarching power to manipulate people in any way they want. This is a strawman argument, like the rest of your claims. &gt;Manufacturing Consent doesn't do that. All it does is pound you over the head with a big stick.. trying to convince you there's only 1 explanation.. and that is \"media is bad\". Again, a strawman. The documentary doesn't say that. And it's a false dichotomy to suggest it's either \"all media is bad\" or \"all media is good.\" You're arguing against an imaginary position that's the result of your own bias, not the actual film. The doc does not call people \"ignorant and unwilling rubes\" but it does demonstrate various examples of how people can be manipulated by media. That's the whole point! I think this just flew right over your head. And likewise, a documentary like \"The Corporation\" which is presenting a case for why corporations have no mandate to be ethical, has an ominous soundtrack.. that's part of the presentation. If you're a smart, independent thinker, you should be able to recognize that. It seems ironic you argue people aren't \"ignorant and unwilling rubes\" but at the same time, you don't want to watch those films because apparently, you're not capable of identifying what is true and what is propaganda? Wow. Do you not see the hypocrisy? <jmnugent>: &gt; Others may find the videos full of a lot of useful information. Then they're idiots. &gt; \"The information is presented in a way that is more dramatic. That's the nature of the medium.\" No.. that's propaganda. &gt; \"I'm curious, do you complain about super hero movies having more explosions than are necessary to convey the appropriate message?\" No. .because super hero movies are fictional. Videos like \"Manufacturing Consent\".... are presented/purporting to be an \"accurate encapsulation of Media\"... and they are not. It's a dramatic and distorted hyperbole.. meant to tug at your emotional response. Like I said.. it's purporting to \"warn you against propaganda\".. but itself IS propaganda. That people just blindly accept it.. is feeding into the problem it claims to be fighting against. <Pilebsa>: &gt; Then they're idiots. This conversation has now degenerated into preschool name-calling. Good luck with life. <jmnugent>: *shrug* .. I'm pretty good at critical-thinking and avoiding propaganda... so I think I'll do just fine. <Pilebsa>: And you also know everything.... and apparently a world-renown MIT professor has absolutely no wisdom to impart to you. <jmnugent>: And again.. you don't seem to understand that it's not WHAT is being said.. but HOW it's being said. Media certainly isn't perfect. I'd agree with that. But it's not some overarching satanic evil either. Part of the individuals job.. is to use critical thinking to cut through all the misinformation and bias. To get your information from a wide variety of different sources. To put the effort into filtering and sorting through all the information you get and separating the good from the bad. You have to do your own homework. You can't just sit blindly back and expect a documentary to convince you of a certain position. Are you a passive zombie?.. or are you going to think for yourself ? If this documentary presented both sides (the good and the bad).. and gave examples from both sides.. and then ended by saying \"Now it's up to you -- to put the effort into finding the right media sources that fit your needs\".. . .. then that would be totally fine and I would 100% support it. But it doesn't do that. <Pilebsa>: &gt; And again.. you don't seem to understand that it's not WHAT is being said.. but HOW it's being said. I understand completely. How it's being said is peripheral to what is being said. You are suggesting it's just as important. But it's not. A fact is a fact. If I tell you that fact under red lighting with dramatic music, it does not in any way, make that fact any less factual. And as far as the \"gotta show both sides\" argument, I'll refer you to a famous [Jon Stewart appearance on CNN Crossfire](https://www.youtube.com/watch?v=aFQFB5YpDZE) where he skewers that false equivalence. Not all sides of an issue are equally legitimate or worthy of consideration. That myth is one of the most destructive ones in our social and political system nowadays. If you want to do a story on civil rights, the idea that you're not truly being \"fair and balanced\" if you don't give half the time to neo-nazi rantings, is completely absurd. <jmnugent>: &gt; \"How it's being said is peripheral to what is being said.\" No. It's not. HOW something is said is critically important. &gt; \"A fact is a fact.\" And if a documentary is presenting those facts in a distorted/dramatic way to make them appear to show/imply something that's not factually true.. then those \"facts\" are undercut by the distorted presentation. &gt; \"If I tell you that fact under red lighting with dramatic music, it does not in any way, make that fact any less factual.\" No. .but doing so may distort the perception enough to make someone think the the fact means something it does not. And that's the problem. That's where this documentary goes wrong. Media isn't perfect.. and it certainly is guilty of certain types of propaganda.. but it's also not the \"all seeing and all-manipulative evil\" that the documentary's tone seems to imply it is. <Pilebsa>: Let me repeat what I said: &gt; If I tell you that fact under red lighting with dramatic music, it does not in any way, make that fact any less factual. You have to decide if you're going to get bogged down in the peripheral bullshit, or you're going to use your \"critical thinking skills\" like you say you have, to isolate the relevant information. It must be nice to think that everything on this planet can/should be tailor-made to your specific aesthetic sensibilities. Your criticism of the method of delivery of the information is based on *subjective* criteria. If you isolated particular claims and showed they were false, then you'd be making an objective claim. But you're not. And I hate to break it to you, you're not the only person who has the capacity to have subjective feelings about stuff. The way we find middle ground isn't to suggest everybody deliver information that pleases our subjective opinion. It's to skip over that stuff and get to the meat of the matter. You continue to distract from the cogent points, getting bogged down in unrelated minutiae. That's your problem. Not the problem of the film's producers. The moment you actually cite something specific that you can prove is errant, then you move into the realm of having an intelligent, objective, relevant claim. In the meantime, you're no different than a typical uninformed voter who rejects massive amounts of information wholesale, because he doesn't like who said it. For example, if you show me a video of Rush Limbaugh making a claim about global warming in his typical smarmy, condescending way, I could easily take the low ground and dismiss the claim because I am not a fan of Limbaugh or I don't like the tone of his voice. *But*, the more intelligent, rational response would be to look aside from his delivery and address the actual claim he's making. You are doing the former. I advocate doing the latter. In both cases, people may come to the right decision, but one person has found truth, and the other has merely reinforced his own prejudices, and is no closer to understanding what is and isn't real. If you wholesale dismiss information merely because you don't like the way it's delivered, you are handicapping your ability to see the truth. That's not critical thinking. That's ideological and emotional blindness. <jmnugent>: A classic example of how important perspective and presentation is: https://imgur.com/CMykxFC <Pilebsa>: Completely irrelevent and unrelated to the argument at hand. In fact, the above picture illustrates why you're so wrong. You're pointing to actual evidence that something is inaccurate. You're also taking something out of context. We don't know the context of that picture. We don't know much about what it is suggesting or implying. This is exactly why you can't rush to judge something just because of the \"way it looks at first glance.\" This is why you dive deeper. You still don't understand. Now you're merely obsessed with justifying your extremely weak position.<jmnugent>: &gt; “You're pointing to actual evidence that something is inaccurate.” No. Theres nothing inaccurate there. Only 1 event happened in the photo. They just created 3 different ways of presenting it to seem like it was something completely different. &gt; “We don't know the context of that picture. We don't know much about what it is suggesting or implying.” And the exact same thing is true about the videos you linked to,.. because the presentation is so skewed and biased, people are interpreting the subject matter incorrectly. “Managing Consent” presents the Media as some sort of “all powerful corrupting influence”... which is an unfair and biased view. There are both GOOD and BAD sides of Media,.. but it only presents 1 side.", "num_messages": 19, "avg_score": 5.8421052632}
{"start_date": "1543664950", "end_date": "1543687211", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 4, "text": "<Verdant_Messiah>: How does Rachel Maddow compare to Chris Hayes as far as the nightly shows/podcasts go? Do you like one better than the other? <paddingtonboor>: For the nightly shows I find Rachel has more of a visual component that you notice missing in the podcast. Hayes seems to have more segments and the transitions between them isn’t as clear in the pod. His style lends itself better to the weekly format of Why is this Happening. Also... he talks faster which makes it easier for my mind to wander. Both are enjoyable but I like RM a little better for the nightly shows. <Verdant_Messiah>: Thanks, I do feel like I miss a visual element with RM podcast, and I do enjoy WITH. Eventually I feel like a lot of the politics you end up hearing the same thing from multiple shows, so I'll stick with RM for daily and WITH for weekly. Thanks.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543674889", "end_date": "1543681016", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 21, "text": "<715chiefs>: What RSS website do you all post your podcasts on, or do you just write the code yourself? <Scott_IUsed2Know>: Personally I just use a podcast hosting service- Podbean. There is Libsyn, Soundcloud, a whole ton of them. Since lots of services will be relying on your feed always being up AND you never know when an apple standard changes- Even though I'm a tech guy I just leave it to people paying attention to those details (but like Reagan, Trust but verify- I have a monitor on my rss feed that tells me if it goes down). Some of these services are free or fairly low cost- and many offer add-ins like EZ posting to Facebook, Twitter, Spotify Support, etc. Many of the paid services will also allow you to host your show with a custom domain- one that you buy. I'm all for that, this way if I ever need to move- I own the domain, I can move to any host without losing listeners.<715chiefs>: I had ended up posting ours on Podbean as well. It was Super easy to use, the only thing is I wanted to be able to help get it to iTunes, Google Play, etc. Hell, maybe even Spotify eventually. Does Podbean also have the ability to do that? Sorry, both of us are brand new to podcasting. We have a history in voice recording, but never our own podcast<thepodcastdude>: You'll want to copy your show's RSS feed URL and then provide it to the directories (Apple, Google, Spotify) you want it to be in. Once they review and approve your feed, they'll check it automatically for updates/changes and new episodes. Links and more info here: [https://help.simplecast.com/publishing-your-podcast/which-podcast-directoriesapps-do-i-need-to-submit-my-show-to](https://help.simplecast.com/publishing-your-podcast/which-podcast-directoriesapps-do-i-need-to-submit-my-show-to)", "num_messages": 4, "avg_score": 5.25}
{"start_date": "1544803016", "end_date": "1544869407", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 33, "text": "<macsauce2012>: Looking for suggestions Depression/Anxiety Hello I am looking for suggestions on a new podcast that I want to start listening to. I have found podcasts to help me with other areas in my life and I am wanting one now that may help with Depression and/or Anxiety. I will just add some things I struggle with so please let me now if you have any good recommendations. -Negative thoughts People dont like me, I am awkward, I sound dumb - not good at holding conversations -articulate vocabulary - not good enough - over thinking - react to what people say in a negative way, like I show emotion if someone says something to me that may be offensive, I feel like I should get so upset over some things Thanks in advance. <inthevelvetsea>: The Hilarious World of Depression is very good. It’s a series of conversations with people (some famous) who are living with depression and anxiety. <nyx_disrooted>: that's the best one methinks. helped me figure out a lot of things about myself.", "num_messages": 3, "avg_score": 11.0}
{"start_date": "1543669917", "end_date": "1543678780", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 12, "text": "<PianoConcertoNo2>: The newest Darknet Diaries is about gaming the Apple Podcasts charts... I just listened to this episode this morning, and I think I now understand how shows like My Favorite Murder gained exponential popularity early on,,.. Edit - I guess I’m wrong about My Favorite Murder being one after all.<jackrhysider>: Hey thanks. While I don't like that show personally, the little man in me never thought it was suspicious. Karen is famous, and had fans already. And people love the show. I investigated it though and listened. Suspicious ones are shows that nobody recommended ever. <PianoConcertoNo2>: Good episode!! Honestly..they’re the first ones that came to my mind. I’ll make an edit!", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1544804492", "end_date": "1545199946", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<Seasickgalaxy>: Travel Podcasts? What are some good podcasts to listen to when traveling? I'm going to be with my family and may kind of want to tune them out.<Solarbg>: well I have a podcast that might good to tune out and wont feel lost when you focus on it again. I have a podcast where I interview everyday people about their hobbies and the topics can vary (example: investments, walking, cigar enthusiast, photographer, watching sports anime, rock and roll, etc.). &amp;#x200B; The main objective is to have a casual conversation and find out what the hobby means to them, how it had an impact on their lives, and get rid of misconceptions. &amp;#x200B; The show is called Time For Your Hobby and it can be found on iTunes, Spotify, Google Play Music and etc. Here's my website to where you can find them easier ([https://timeforyourhobby.wixsite.com/podcast](https://timeforyourhobby.wixsite.com/podcast)) &amp;#x200B; <Edit>: I noticed you meant ''tune out your parents'', in that case, my podcast is also good for that.<Seasickgalaxy>: oh my gosh! that actually sounds great and perfect! I'll be sure to listen to it!<Solarbg>: glad I can help out, and you're also welcome to be a guest on the show if you want to talk about your hobby", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1543676033", "end_date": "1543768598", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<Herkullinekana>: Any recommendations? Is there any good melancholic podcast?<Mcnam003>: Without any information about your interests, “The Anthropocene Reviewed” is amazing <wakeupbellingham>: Learning about the Anthropocene in my bio anthropology class- definitely gonna check that out<Mcnam003>: It’s probably not what you’re expecting... one episode is on Hawaiian pizza,, another on Tetris <wakeupbellingham>: Hahaha great name though- pulled me in lol", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1543677895", "end_date": "1543862160", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 6, "text": "<The_Quenchiest1>: I recorded a podcast in a house, and my cohost and I accidentally bumped and creaked the table a lot Is there any way to remove these noises from the recording? We recorded on Audacity with a Blue Yeti.<day9-made-me-do-it>: For me, it helps a lot having the mic mounted on a spider, even better: a spinder mounted on an arm that is fixed on a physically separated table. Separate mics close to the mouth of each host also help.<The_Quenchiest1>: What is a spider/spinder?<day9-made-me-do-it>: It's on the end of this arm: [https://www.amazon.com/Eastshining-Adjustable-Microphone-Suspension-Microphones/dp/B073WQD1VH/ref=sr\\_1\\_2\\_sspa?ie=UTF8&amp;qid=1543862057&amp;sr=8-2-spons&amp;keywords=mic%2Bspider%2Bblue%2Byeti&amp;th=1](https://www.amazon.com/Eastshining-Adjustable-Microphone-Suspension-Microphones/dp/B073WQD1VH/ref=sr_1_2_sspa?ie=UTF8&amp;qid=1543862057&amp;sr=8-2-spons&amp;keywords=mic%2Bspider%2Bblue%2Byeti&amp;th=1) It's also called shock mount and it absorbs a lot of the noise that otherwise travels through the table to the mic.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1543679640", "end_date": "1543759294", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 11, "text": "<Oy_Vey_TheDrama>: What are some good party podcasts? I like to get drunk alone at my house and want to find more party content. Are there some good podcasts that fit the party vibe?<space_cowboy80>: The Roundtable of Gentlemen is a bunch of comedians in a room getting drunk and discussing weird news stories that have been sourced before recording. Generally veers of the news story and into weird shit. Not everyone's cup of tea but I have found them very entertaining. <alarmalarmalarmalarm>: Really good show; so sad they stopped doing it :(<space_cowboy80>: It's on hiatus as far as I have heard, mainly due to the breakup of Murderfist and people moving to different areas of the country, it just wasn't feasible for them anymore. They have said that there may be more in the future if they are ever all together in the same room again but the tour schedule for Last Podcast and Henry moving to LA permanently, and Jackie has moved to LA too. What I love is you can go through the entire catalogue and then jump right back to the start and there are so many episodes and hours that you forget episodes, so listening again becomes fun. <alarmalarmalarmalarm>: Yeah that’s true. Man that podcast was so good; I modeled my own after it. That was one of the first shows that got me into podcasts and it’s a friggin joyride. <space_cowboy80>: I discovered Roundtable through Last Podcast On The Left and held off on it for a long time. I listened to a ton of Page Seven and never dipped a toe into Roundtable, but once I did it was pure gold. I would spend many nights once the wife and son were in bed playing games on console and just marathoning Roundtable episodes. Favourite game to play with Roundtable on was Just Cause 3, just blowing stuff up and the hours and episodes flew by. Fond memory I had was of having to pause the game and take a breath because I was laughing so hard I was crying.", "num_messages": 6, "avg_score": 1.8333333333}
{"start_date": "1544806016", "end_date": "1544838088", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<killbillvolume3>: 2 USB Mics and 2 Headphones - Help? So I thought I was going to start a solo podcast but at the last minute, decided to change it to one with a co-host - so a two person podcast. But I already purchased a Blue Yeti (USB) mic instead of an XLR mic. My friend also has a mic but it’s USB too (she might have an XLR somewhere also but she has to dig for it). My laptop only has one USB port. Should I get a USB splitter? She also has a laptop. Should she bring it and record her own track on her own laptop, then transfer it to me to edit? Now, the toughest part is the headphones - we both obviously want to wear headphones and hear ourselves as well as each other, but how do we do that with USB mics? Is there a mixer for that? And which software programs would be recommended outside of GarageBand? Hmmm. Super confused over something that seems simple. Any help would be great. Thank you.<AGoodRightHander>: Could you not run this over Skype, using individual mics, headphones and laptops? Skype has a record function I believe but after that I’m not sure re editing etc?<killbillvolume3>: Hmmm. I think we want to be in the same room together because it’s a very conversational “entertainment” type of podcast, so when we’re cracking jokes it would be nice to be in that moment. <AGoodRightHander>: Ah cool, I run a podcast and my friend calls in, it works ok but your right it would be better if you are in the same room. Could you not return the mics, buy a small mixer, XLR mics etc? I managed to get set up for about £180. <killbillvolume3>: The return date passed :-( I definitely would’ve returned if I could for an XLR set of mics.", "num_messages": 5, "avg_score": 1.0}
{"start_date": "1543682293", "end_date": "1543687507", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 2, "text": "[deleted]: I present a headphones audio experience, episode 1 of my podcast - Curated By Sam. Enjoy! [removed]<stormstatic>: this is a podcast? it's like, 95% music...sounds more like a college radio hour.<melted_cheese>: AUDIO EXPERIENCE, SIR<stormstatic>: &gt; This is not a place for people to just link of their podcasts. See the next section for specifics.<melted_cheese>: Leave it to the mods, homie", "num_messages": 5, "avg_score": 0.4}
{"start_date": "1543681824", "end_date": "1543691288", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 18, "text": "<chrisham22>: Need Someone to Design my Podcast Cover Art Hey guys! I'm getting ready to launch my podcast called \"The Brown Basketball Guy.\" I've got everything ready to go, but I don't have any cover art. I was wondering if you could recommend anyone who would be willing to create my podcast artwork for somewhere around $50? I'd like it to resemble the artwork of The Bill Simmons Podcast, the JJ Reddick Podcast, Jalen &amp; Jacoby, The Logan Aguire Hour Podcast; Something cartoon-ish, but not childish. &amp;#x200B; Sorry if this isn't the appropriate subreddit to post a question like this. Thanks in advance!<bumapples>: r/slavelabour Ask the question there mate. You'll get plenty of offers<Unhelp_Desk>: I dunno, $50 doesnt sound that bad for a single piece of artwork.<bumapples>: And that's why they'd get plenty of offers", "num_messages": 4, "avg_score": 4.5}
{"start_date": "1544644418", "end_date": "1544661038", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 58, "text": "<seeyaspacecowboy>: Smart Joe Rogan Style Podcast I like his format that it's just long from two people talking. I can just leave it on in the background at work and hear some fun/occasionally insightful things. But he keeps bringing on these \"alternative perspectives\" and I know Joe would even admit he's not the sharpest tool in the shed. I'm fine with both of those things independently, but when you put it together it can get grating. So reddit, you have any recommendations for something in the same vein but with a smarter host and/or guests? <CamAndCamShow>: Hey, we are a podcast that touches on a little bit of everything! It’s just 2 main hosts and one producer that often times chimes in. We have about 18 episodes out and would love for you to take a look! We try to make things funny, but sometimes we hit on more serious topics. I do believe, however, our podcast would be perfect for just leaving on in the background and casually listening! Our link is: www.soundcloud.com/camncam We are also on iTunes, stitcher, and google play. [deleted]: Fuck off 😂<CamAndCamShow>: Why so abrupt? just a little self promotion. [deleted]: No I was saying fuck off as in like a jokey way, in Britain people say “fuck off” as a jokey kinda thing. I found it funny how the OP was looking for really smart people to listen to and you’re there like “me me me” <CamAndCamShow>: Oh I see! Well hell, got to get in where you fit in!", "num_messages": 6, "avg_score": 9.6666666667}
{"start_date": "1543687523", "end_date": "1543696347", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 90, "text": "<SteamrollerAssault>: The Ongoing History of New Music [The Ongoing History of New Music](https://itunes.apple.com/us/podcast/ongoing-history-of-new-music/id1201968027) is a radio show syndicated out of Canada and hosted by Alan Cross. He's been hosting the show since the early 90s, and it's been available as a podcast since 2017. Cross is an amazing music historian, and he dives deep with episodes showing the rise and sometimes fall of genres and bands. It's punctuated with ~~full-length tracks~~ music clips including obscure demos, breakout hits and older influences. I was reminiscing about this show today and couldn't think of a single time where I wanted to change the channel. This is after [800 episodes](https://en.wikipedia.org/wiki/The_Ongoing_History_of_New_Music) broadcast. I searched for it as a podcast, and was excited to see that there are over 100 episodes available. I had to share. If you are at all interested in modern music history (the show leans more towards alt/rock but there are episodes covering the spectrum), or even if you enjoy a good radio voice and really good research, you should check it out. <Edit>: The podcast has edited the radio show's full music tracks down to short clips. Damn licensing. Still a great show, but finding that out was a downer. EDIT 2: I should be clear--it is an *amazing* show, regardless of the accompanying music. Alan Cross leads the field in depth of research and quality of content and I still 100% recommend you check it out. <LG03>: The annoying part is that the songs are edited out on the podcast feed.<SteamrollerAssault>: Oh crap. I was so excited to find the show as a podcast that I actually posted before giving a full episode a listen. Yeah, looks like they only plays clips online. Definitely colours my impression of the podcast. <Bluered2012>: Nah, I totally get why they edit them out. The clips are fine for me, I add a lot of songs to my Apple playlist during the podcast. I’m there for his research, it’s incredible.", "num_messages": 4, "avg_score": 22.5}
{"start_date": "1544794548", "end_date": "1544813455", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 16, "text": "<sashley520>: Let me edit your podcast for free! Hi there podcasters! I am a budding audio editor currently trying to build up a portfolio of work so that I can move on to bigger jobs. I am very willing to edit your podcast for free and then if you like my work, feel free to tip. Completely optional though, I am just looking for the experience really. I listen to maybe 20 podcasts a week of various qualities, so I am very well versed in what makes one sound good. I can get your podcast sounding professional and exported efficiently in no time :) I look forward to working with you! If you're interested, either drop me a message here or an email at [Sam@NightcallSound.com](mailto:Sam@NightcallSound.com).<Hawkbait>: Reach out to the ladies of the sorry mom podcast one of them does some editing but they might appreciate the help<sashley520>: Thanks :) Will do.", "num_messages": 3, "avg_score": 5.3333333333}
{"start_date": "1543569195", "end_date": "1543693671", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 7, "text": "<maxscarletto>: An apology to the host of Song Exploder.. Without a ever bothering to check I thought the name of the host of this fine podcast was Richard K Sherway. Hrishikesh Hirway, you have my deepest apologies...<slybird>: He will likely see your apology through one of these: <http>://songexploder.net/about <https>://twitter.com/songexploder <maxscarletto>: I’m too ashamed! I think I might have racist ears...", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1544725034", "end_date": "1544814585", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 17, "text": "<ContraryTra>: Feedback and help freely given Anyone wanting some extra help feel free to message me. I'm a comm major in grad school looking to get my feet wet in the game. If you want to collab, want a different perspective, need a guest (depending on the topic), or just want to bounce ideas around, I'm open to it. My bonafides is limited to mediocre/intermediate digital marketing skills and being a fan of podcasts, but hey...free feedback as a consumer at the very least. Just looking to have some fun being creative and providing value. Lemme at 'em!<ioncedroveaspaceship>: [That One Time I Was Abducted By Aliens](https://www.soundcloud.com/bri-jaimie) &amp;#x200B; we would love some feed back :) <Smiling_Sam_>: What mic are you guys using if you don't mind me asking?<ioncedroveaspaceship>: blue yeti", "num_messages": 4, "avg_score": 4.25}
{"start_date": "1534956407", "end_date": "1534967445", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 23, "text": "<matterpink1>: Recommendations on Female Host Podcasts? Looking to find new ones! And any brief summaries with them would be helpful 👍<Nyikosis>: If you enjoy deeply obsessing over nerdy topics, Binge Mode is great. Right now they've gone through Game of Thrones and are working through Harry Potter.<tunisia3507>: The hosts are kind of irritatingly animated but you get used to it; I'm really enjoying the HP stuff. 1 male, 1 female host. If it's any help, I think she outranks him in the company.<magic_is_might>: &gt; The hosts are kind of irritatingly animated Hmm I think you nailed by their podcasts annoy me. Great content, don't get my wrong. But yeah, I think the host's delivery throws me off.", "num_messages": 4, "avg_score": 5.75}
{"start_date": "1530846588", "end_date": "1530909837", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 64, "text": "<GoldieLox9>: Podcasts about con artists? I love The Grift and Criminal and Dirty John. Anything else out there like that?<wildsoda>: This is a one-off but The Dollop did an episode about con man Arthur Lustig that's quite good. <http>://thedollop.libsyn.com/185-con-man-victor-lustig (You can also find it on Soundcloud.)<No_One_On_Earth>: I was gonna say, The Dollop has done several con man episodes. Including the Baron of Arizona, which is one of my favorite stories.<wildsoda>: Totally. That was just the first one that came to mind. Other Dollop eps (or Dolleps, as Gareth might say) about con men include The Great Diamond Hoax, The Tichborne Situation, The Car Known As \"The Dale\", and of course the two-part episode on Donald Trump.<GoldieLox9>: Very helpful that you named the episodes. Thanks so much for directing me to those! I'm downloading them now.", "num_messages": 5, "avg_score": 12.8}
{"start_date": "1543685074", "end_date": "1543708106", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<quat1e>: Does anyone use https://discoverpods.com/ to find new podcasts? Is it any good and what else do you use?<lime-link>: Yep Discoverpods is great. We have a severe lack of podcast reviewers and Discoverpods delivers!<quat1e>: Does it email with recommendations?<lime-link>: Yeah something", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1543415355", "end_date": "1543442407", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 21, "text": "<dezstern>: Help Me Name My New Podcast! Hi r/podcast! I need help coming up with a good name for my new podcast. I am creating a podcast about what people do for fun. I originally was calling it What Makes You Happy? and I really like the name because it leaves my topic options wide enough that I can theoretically talk to anyone who has a hobby as well as anyone even tangentially involved with mental health. Unfortunately, the name What Makes You Happy? is kind of taken. There is a podcast named Whatever Makes You Happy that I don't want to be confused with. Even their visual branding is similar to what I came up with. Here's a brief description of the show itself: WMYH is a show that explores hobbies and pastimes and how they delight us. The show also explores the nature of happiness itself, and how people use hobbies to make themselves happier. In a given episode, we might be speaking to a guest hobbyist, learning more about their chosen hobby. In another, we may be speaking to a mental health professional, a philosopher, or a spiritual leader about the nature of happiness, and how hobbies in general can help or hinder that. Thanks so much for any help you can give. I've got a few episodes recorded already, I think it's going to be a great show. &amp;#x200B; <Edit>: I ended up calling it What Makes You Happy? as originally intended. The other podcast with the same name hasn't been active for at least 3 years. You can check it out here: [http://clevelandcreativeoutlet.com/wmyh/](http://clevelandcreativeoutlet.com/wmyh/)<Solarbg>: I made a podcast series exactly like this called ''Time For Your Hobby''. I have interviews with everyday people to find out what their hobby means to them, how it had an impact on their lives and get rid of any misconceptions. You could call yours : ''Hobby O Clock'' ''Pass Time With Pass Times'' ''The Happy Hobby'' ''The World Of Hobbies'' &amp;#x200B; Send me the link once you have your first episode, I would love to listen to it.<dezstern>: Is Time for Your Hobby still being published? Would love to listen to it! &amp;#x200B; Thanks for your suggestions! I really appreciate it.<Solarbg>: Indeed it is, I just started the show in September and the interviews are coming along great and to be honest the best part of the whole podcast is the 1 on 1 conversation with my guest. [My website](https://timeforyourhobby.wixsite.com/podcast)//[iTunes](https://itunes.apple.com/ca/podcast/time-for-your-hobby/id1435684672)//[Google Play Music](https://play.google.com/music/listen?u=1#/ps/I25wdifqzjiivtxyy6lswfbnhey)//[Spotify](https://open.spotify.com/show/4fO9tU16O56dKRV2P4x9Qi?si=ELpLCR1-R6O3fYW7-0_ldQ)//[TuneIn](https://tunein.com/podcasts/Sports--Recreation-Podcasts/Time-For-Your-Hobby-p1154178/)//[Castbox](https://castbox.fm/channel/Time-For-Your-Hobby-id1408422?country=us)//[Pocket Cast](https://pca.st/4Imo)//[Stitcher](https://www.stitcher.com/podcast/time-for-your-hobby)//[Overcast](https://overcast.fm/itunes1435684672/time-for-your-hobby)//[Instagram](https://www.instagram.com/timeforyourhobby/?hl=en) &amp;#x200B; If we want to make it meta we could be guests on eachother's shows and talk about our hobby of making a podcast talking about hobbies. <dezstern>: Hell yes. Let me get this podcast set up and available etc and get a few more episodes recorded, and then we can do a joint episode or whatever. I'll PM you my detes so we can chat.<Isaac_Masterpiece>: I would like to submit a vote for \"Pass Time With Pastimes\", as that is word for word the suggestion I was going to make.", "num_messages": 6, "avg_score": 3.5}
{"start_date": "1543699982", "end_date": "1543994493", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 6, "text": "<photogrind>: Best program to record audio of interviews over the internet? Hit me with it. We currently are recording over skype but it seems to crush the lows terribly. I have heard Hindenberg pro. Anything out there you point me in the direction of? &amp;#x200B;<Solarbg>: I downloaded Voice Meeter Banana (a free virtual mixer) and using google hangout for the interview<photogrind>: Nice I'm going to have to check that. Just tried one on Zencaster seems pretty solid. Thanks for the tip!", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1543520013", "end_date": "1543522140", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 16, "text": "<brandi_r>: Mark as played? I am interested in moving from the default iOS podcasts app to a different app as I've heard there are several better platforms out there. I have been listening to podcasts for years and I like having my pods marked as played, and if I move to a new platform I'd really want that option so I could mark my progress on all my regulars. &amp;#x200B; From what I've seen Overcast does not have that option. Are there any platforms that do?<hamglazescramble>: Podcast Addict can do that, and you can have it set to do things like delete downloaded eps when you mark them played and stuff like that. It's a very nice app! <pupetman64>: Podcast Addict is Android only though<hamglazescramble>: Balls that sucks, it rules!", "num_messages": 4, "avg_score": 4.0}
{"start_date": "1544815218", "end_date": "1544850069", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 5, "text": "<edninety12>: Any IT support learning podcast? Recommendations welcome! Pretty much the title would like to get more involved in the scene. Common issues, fixes, faq, i don't know. Any suggestions welcome. Thank you! <Fake4000>: Try the super tech support episodes in the Reply All podcast. Very entertaining. <edninety12>: will give a try thanks! 👌", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544815889", "end_date": "1544829304", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 16, "text": "<CarlMarks13>: Any Sci Fi Podcasts? I’m in the mood to hear a good science fiction / dystopian story but I also love anything related to the genre including interviews w/ sci-fi authors and whatever oddities are out there. The only good part about my job is that I have 7+ hours to listen to podcasts so feel free to give unrelated recommendations if you have one in mind :)<SpeedSawyers>: Wolf 359 is a fun space themed podcast. Kind of like an action comedy about a space crew stuck orbiting around a star. Some drama but mostly laughs. <Kalquessa>: Wolf 359 does a lot of the same things that Doctor Who does for me and I love it.", "num_messages": 3, "avg_score": 5.3333333333}
{"start_date": "1530452609", "end_date": "1533022584", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 151, "text": "<gee1471>: What are the best true crime podcasts? As per the title I currently listen to crimetown, serial, s-town, Atlanta monster,criminal, dirty john, the rfk tapes and case file. Any other suggestions? Thanks in advance <CaesarLXIX>: You should definitely check out 'Small Town Murder', It's a comedy podcast and not as serious as the others so its refreshing. Plus the detail they both go into is ridiculous and some of the stories are right gruesome. <TheSpaceship>: My favorite part of this podcast is that they're always stories I've never heard of, but they're the most fascinating.<vaultdweller4ever>: This. I'm wondering how I never heard about a dude with a kids head in his crawl space. <CaesarLXIX>: Or a teenager who twisted kids legs until their knees popped out of their sockets only to bandage them up and do it again... <VoidofEggnog>: Oh man that episode. My brother in law felt Rulo, Nebraska was worse but that one was real bad.", "num_messages": 6, "avg_score": 25.1666666667}
{"start_date": "1544813276", "end_date": "1544819940", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 6, "text": "<dom_the_artist>: Rialto Report - Al Goldstein talks about Donald Trump Didn't know where to put this, but I found it pretty funny. In addition to that, The Rialto Report is a great podcast for anyone fascinated by the adult movie industry. Great interviews and some wonderful stories from trailblazers in the industry. This one is very short and a slice of New York history from the 80's. <https>://www.therialtoreport.com/2016/10/30/donald-trump/ <bagbroch>: How bout a TL;dl summary of his comments?<dom_the_artist>: Sure. It's basically a clip from Al Goldstein's radio show from the 80's. Each week, he would go on a rant about something that pissed him off, which, for Mr. Goldstein, there were no shortage of topics. It's basically a 5 minute tirade about Trump from the 80's.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1543717397", "end_date": "1543721628", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 15, "text": "<Smiley_Glad_Hand>: Looking for recommendations on podcasts all about the dark web. <common__123>: Darknet Diaries! <Smiley_Glad_Hand>: Yes! Thank you! Subscribed 😎.<lime-link>: Specifically episode Operation Bayonet is about the dark web.<Smiley_Glad_Hand>: Oh ok...the rest isn't specific to the dark web then?", "num_messages": 5, "avg_score": 3.0}
{"start_date": "1543711615", "end_date": "1543732313", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 211, "text": "<AdmiralBarackAdama>: I know Bear Brook has been talked about before, but I just finished this fascinating podcast and wanted to give it some love. What a wild ride. Before I read about it here, I had never heard of it and so I'm just bringing it up so other people might experience it. The forensic genealogy thing completely blew my mind. Yeah, bitch! Science! If you like true crime, this is a must listen.<DTownForever>: Seriously, I'd put it up there as one of the best if not THE BEST I've ever heard. My *only* issue, and it's a small one, is that I wish it had been longer. But then again, I complain when some shows go too long and have tons of filler episodes (i.e. Up &amp; Vanished and Teacher's Pet). Amazing, amazing work. I immediately started looking for new podcasts made by NHPR after I listened to it. It was ... just amazing. <Edit>: Grammar<Smiley_Glad_Hand>: So there's only 6 episodes? What others by NHPR have you found?<DTownForever>: Yeah, there are only 6 with one short, not super pertinent update. I haven't found anything from NHPR which I myself have been interested in, but I have seen some others here recommend a nature podcast they put out. <chidi_anagonye>: It’s called Outside/In", "num_messages": 5, "avg_score": 42.2}
{"start_date": "1543252762", "end_date": "1543325429", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 6, "text": "<almozayaf>: [Request] Podcast about Writing Stories I search in this reddit but all I find is podcast about Writing as grammar or Stories Podcast (AudioDrama) I want Podcast that teach or at last talk about storytelling, if there any. &amp;#x200B; thanks<RageMonster17>: Check out Story Arc. A fellow podcaster is developing and writing Graphic Novels during his episodes. Worth a listen.<almozayaf>: Can't find it <RageMonster17>: I see it in iTunes. Try just searching 'Story arc' it should be the first item in your list. The guy's name is Trevor Sutton.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1542322906", "end_date": "1543770551", "thread_id": null, "subreddit": "podcasts", "subreddit_id": "t5_2qh1d", "total_score": 8, "text": "<Dmaz910>: Looking for entertaining podcasts to listen to on my long drives I drive a lot throughout the week and would like some feedback on some funny and entertaining podcasts to binge on! <ioncedroveaspaceship>: [That One Time I Was Abducted By Aliens](https://www.soundcloud.com/bri-jaimie)<historyeraser4sale>: you ladies is 🔥. Awesome cast. I have a very recent anamolous video of ufo s I saw last night. Pretty kwl!<ioncedroveaspaceship>: thanks hun! send us the video!!! <historyeraser4sale>: 😍 (she said hun 2 meee!)", "num_messages": 5, "avg_score": 1.6}
