{"start_date": "1543601143", "end_date": "1543631840", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 2433, "text": "<Aboly>: Started watching Legion expecting boring teen superheros. I was so wrong, Legion is really good. I binged the first 4 episodes and loved it. It reminds me of dark angel with more psychology aspect and better acting. &amp;#x200B; and it has [Aubrey Plaza](https://www.imdb.com/name/nm2201555/?ref_=tt_cl_t3) <InspectorRumpole>: It's in a league of it's own, really unique. My only criticism is that it knows it's cool, and sometimes it forgets the story because it's busy \"showing off\", if you know what I mean. <EDIT>: Also check out American Gods if you haven't already.<ShoddyDiscussion>: Read American Gods - please<igetbooored>: I've given away half a dozen copies of that over the years. I just keep buying a new paperback copy. They average about $8 a pop and I'm more than willing to invest that into the prospect of introducing someone to a new world/author. Anansi Boys is also great. Just about anything I've read from Neil Gaiman has so far has been good though so... While the American Gods show is good, they're never going to finish it or even do a Season 2. It's such a tease and doesn't even do it as well as the book can as far as explanation and scene setting. <mynameisblanked>: Didn't they release a trailer for season 2 recently? <igetbooored>: Maybe? Last I heard key members of the cast (shadow and Odin) were out, and that was having a significant impact on season 2 prospects. If they do go forward then fantastic and I'm happy to be wrong in this case. However if they try to shift cast members mid-story and continue that way I may be out. I guess it'll depend on how they juggle the lost cast- if they go forward at all. <paulornothing>: All I’ve seen is that Gillian Anderson was definitely out. Can’t find anything on Shadow or Odin leaving.<igetbooored>: Gillian Anderson is a fantastic actress but her character wasn't tied to a single identity. Media as a character could be recast even in the middle of dialogue and it could make sense. The article I read about shadow and Odin being out was in the two week or so period after Season 1 ended. If they move forward with only Gillian recast it could definitely work. Hopefully what I read back then was wrong.", "num_messages": 8, "avg_score": 304.125}
{"start_date": "1544711832", "end_date": "1544735400", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 4322, "text": "<jsnelson21>: Netflix's Altered Carbon Season 2 Filming Begins In February <cm_bush>: Oh man, I'd heard that Netflix was quick to dismiss S2 possibilities because of low watch-through. So glad it's going on. <neoistheone1111>: I'm guilty. I made it about 4 or 5 episodes and couldn't bring myself to care anymore. Is it worth trying again?<SpliffmanSmith2018>: There were parts I didn't like but it was worth watching thru to the end for Poe alone. I read the book after seeing the show, and I can understand why a lot of book readers were upset tho. Second book is way different than the first tho, so let's see how Netflix plays this.<tbdubbs>: I read the books afterwards and I can see how some of the changes seemed a little contrived - the sister angle in particular. What's neat is that with the whole idea of switching bodies, it's possible to have so much variation with the setting and plot. The third book is very different than the previous two as well.<sotonohito>: I hated the whole sister fairy tale thing. <PowerfulMention>: Ya I don't really see what that improved over the original story.<sotonohito>: I think they were trying to make Kovacs more likable maybe? Same reason they switched him from being an ex-UN enforcer to being an idealistic revolutionary who personally knew and was romantically involved with Quill. <geoffp82>: Quell* It’s short for Quellcrist Falconer. <ScramJiggler>: Yo that’s a dumb ass name<PhoenixReborn>: Okay, ScramJiggler...<ScramJiggler>: That’s Mr. Jiggler to you.", "num_messages": 12, "avg_score": 360.1666666667}
{"start_date": "1543610022", "end_date": "1543623803", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 13, "text": "[deleted]: Do we need an epic space sci fi show that is not aimed at the Star Trek or Expanse fans? [deleted]<azazel-13>: Although I understand the need to reach mainstream audiences, I long for the next Babylon 5 or Farscape.<Nerdicide>: While I generally am more for seeing new unique works of fiction, I honestly believe Babylon 5 deserves a reboot. As much as I love the show, as years go on it becomes harder and harder to watch. <azazel-13>: Oh, man. I can’t argue with that. A lady I work with is heavily into sci-if—Stargate, Trek, etc., but had never watched Babylon. I’m like, “you have to check it out, it’s a classic.” She’s tried several times to get thru the first season, which is of course clunky because the show didn’t work out the kinks until the second season. She also couldn’t deal with the horrendous cgi. So, yeah...a reboot would be amazing. Unfortunately, J. Michael Straczynski stated that a reboot will never happen due to Warner Bros.’ ownership of the rights to the show. He owns the rights to the movies. Apparently WB would rather squander the opportunity than come to a compromise with him.", "num_messages": 4, "avg_score": 3.25}
{"start_date": "1544712106", "end_date": "1544759255", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<test_tickles>: Suggestions for my next book to read by Mike Resnick. Someone posted Mike Resnick's \"Santiago\" here a month or so ago, I read it in college and remember liking it a lot, but didn't remember the story. I just finished it, and it was just as good. Now I need a new book, and would like to read another of Mike's books, but need a suggestion.<knighthoodjustjiffy>: try Kirinyaga The premise: a Kenyan tribe resettles on an alien planet to preserve their culture. I recommend it highly<ziggurqt>: I second this, it's an excellent book. OP should definitely read it. I've also read The Dark Lady, which was ok but not as good as Kirinyaga.<test_tickles>: &gt;Kirinyaga This looks good. Thanks.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544396197", "end_date": "1544557391", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 434, "text": "<JWright_8523>: BBC Confirms No New 'Doctor Who' Season for 2019 <aReactant>: Maybe time to rewatch everything starting with 2005?<DongleNocker>: start with 1963 instead, and it is ok to skip the serials that didn't survive intact or haven't been properly restored with animation. <ubermonkey>: Oh good lord no. The old stuff hasn't aged well AT ALL. <DongleNocker>: Well in terms of special effects, set building, and costumes? I agree they are horrible compared to what is possible today, technology and budgets simply wasn't there. On the other hand, the writing was many times better. I find Jon Pertwee and Tom Baker's era of Doctor Who more enjoyable on the whole because of it. <ubermonkey>: &gt; On the other hand, the writing was many times better. Really? I find everything from that era -- not just Doctor Who -- to be embarrassingly stilted with few exceptions. People don't act or talk or even move naturally; it was the style of TV back then. By the 4th Doctor things were a LITTLE better, but the plots were still incredibly simple and generally lacking in any sort of nuance. (Again, not just a Doctor Who thing -- it was that way in most TV well into the 90s.) <DongleNocker>: &gt;People don't act or talk or even move naturally; we are talking about science fiction where the setting too often isn't on earth and the characters aren't human. <edit>: I also forgot to mention the time travel aspect as well. <ubermonkey>: Yes, we are. The subject matter is pretty irrelevant to this critique. Do you see why? <DongleNocker>: I see you point, but think they are irrelevant due to the subject matter. It is science fiction... why would an alien or even a human from another time and planet \"People don't act or talk\" like what you would consider naturally? <ubermonkey>: People don't stop being people because something extraordinary happens, and if there's one central theme in Who is that's the aliens are almost all still people, at least morally speaking. All TV and most film through the 70s is really stilted and awkward when compared to modern works. The style of the time called for a weird formalism in the way people spoke, moved, and interacted -- and this is true for stories about regular human concerns as well as for stories about Time Lords. It's part of what makes all older TV feel hokey and dated, even if there aren't any special effects. And Doctor Who doesn't get a pass just because of its plots. (Also, you're really close to an argument fanboys/Stans make when a given franchise/story is dinged for logical inconsistencies borne of poor worldbuilding or bad continuity choices. Someone asks a valid question about why Harry or Luke or whomever does a thing that seems, upon examination, to be silly in the context of the fictional world, and the Stan says \"But it's a story about wizards / space wars / whatever! It's all unrealistic!\" as though that explains it. The argument doesn't work there, either.)<DongleNocker>: &gt;People don't stop being people because something extraordinary happens, and if there's one central theme in Who is that's the aliens are almost all still people, at least morally speaking. Not really. But hey, whatever you want it to be I guess. <ubermonkey>: Well, let me clarify, because it doesn't seem like you're engaging with any of this (analysis or Who itself) on more than a surface level: Obviously the horror of the Daleks is that they are so utterly NOT human, but MOST of the time, when we encounter aliens in Who that aren't actively hostile to the Doctor and his companions, they are essentially human in nature if not biology or whatever. First and foremost, we have the Doctor. Much is made of the two-hearts, nearly-immortal nature of the Time Lord, but the reason we parse the Doctor as a hero is because s/he acts heroically in human terms, and leads by embodying values we recognize as human. Be kind. Help people. Never be cruel. Then we have the vast array of human-shaped aliens we've encountered. The most recent example this season is probably Yoss, the pregnant man from the Tsuranga / PTing episode. Obviously, if he's a *pregnant man* he's not human by physiological standards, but his fear and anxiety about his pregnancy, and his need for companionship in the process, and his awe at fatherhood, are all very human traits. He's not a Human, but he's certainly very human. That's the kind of thing I mean. It isn't just \"aliens who look human,\" either. We have plenty of other examples, like Madam Vastra, or even Kamelion, who are obviously not physically human, but function in the story as human-relatable characters with human emotions, motivations, and arcs. So yes, **really**. <DongleNocker>: &gt;Obviously the horror of the Daleks is that they are so utterly NOT human, but MOST of the time, when we encounter aliens in Who that aren't actively hostile to the Doctor and his companions, they are essentially human in nature if not biology or whatever. Not really, especially in the real/original Doctor Who. In the original doctor who you were always presented with how someone presents themselves vs how they actually take action. And the reboot series, seldom if every has that layer of complexity or realism. &gt;First and foremost, we have the Doctor. Much is made of the two-hearts, nearly-immortal nature of the Time Lord, but the reason we parse the Doctor as a hero is because s/he acts heroically in human terms, and leads by embodying values we recognize as human. Be kind. Help people. Never be cruel. That isn't really the truth, whenever the doctor chooses a side the other side will suffer, because he's decided which side better. You have the mistaken idea that the doctor is some absolute of morality. I'm not sure what having two hearts has anything to do with it, other than a distinct method to show he isn't human. &gt;The most recent example this season is probably Yoss, the pregnant man from the Tsuranga / PTing episode. Doctor Who ended last season, whatever is being made more recently is like someone re-animating a dead body to create a zombie and telling you loved one came back to life. It isn't Doctor Who anymore. I think you are too caught up in the not so great and rather awful \"new who\" and need to go back and watch the foundation of the series to see how they are mucking up the franchise. <ubermonkey>: Wow, you seem to have especially poor reading comprehension. OTOH, this explains your odd take on Who generally. &amp; also... &gt; Doctor Who ended last season, whatever is being made more recently is like someone re-animating a dead body to create a zombie and telling you loved one came back to life. It isn't Doctor Who anymore. I see that you're one of *those* sort.. I cannot IMAGINE why you draw such a bright line between seasons. Really. I'm completely stumped. <DongleNocker>: &gt;Wow, you seem to have especially poor reading comprehension. OTOH, this explains your odd take on Who generally. Nope, I just whole heartily disagree with your conclusions and place much more weight on the original series as the definition to what Doctor Who is and should be. &gt;I cannot IMAGINE why you draw such a bright line between seasons. Really. I'm completely stumped. Doctor who changes, but there are always things that don't. They have changed one one too many of those things that did not during the original series. Time to pull it back and return to something closer to the source material on what the current series is based. <ubermonkey>: &gt;They have changed one one too many of those things that did not during the original series. Just come out and say it. You post in MGTOW. It's clear where you stand on issues of gender. If you're going to be pissed off about a woman playing the Doctor, don't mince about with dog whistles. Of course, the problem with being up front about that position is that most people won't bother giving you the time of day. For example, if it had been clear to me at the outset what sort of bitter weirdo you were, I wouldn't have replied to you in the first place. Fortunately, RES allows me to tag you, so I won't make that mistake again. <DongleNocker>: My posting in other subs and on other topics is not relevant to this conversation and your stalking creepy. &gt;It's clear where you stand on issues of gender. It isn't about gender, I welcome another Doctor Who spin off with a female main characater. If you want to have a show based on a female timelord character, pick one of the many pre-existing (Susan, Romana, The Rani, etc.) or create a new one. But, the Doctor himself has always been a male role model for boys and young men, especially when he was created in the 1960's when so many fathers and grand fathers had died in both of the world wars. This is like recasting great female main characters like wonder woman, Laura Croft, Ripley, Dana Scully, Leeloo, or Sarah Conner as a man. <ubermonkey>: When you encounter someone with weird ideas, it's often illustrative to take a look at their posting history. If you don't like people can see what you've written, well, maybe be more circumspect about what you put out there. So I took a look, and what I found was a bitter MGTOW sort, and consequently I'm utterly unsurprised that you're butthurt about Whittaker despite the fact that this character has changed bodies on the regular for half a century (unlike any of the rest you name). The Doctor's still a role model, for people of all genders -- at least, if you're not some weirdo misogynist. But if that describes you, none of the prior Doctors would really be appropriate role models, either. Oh, btw: &gt;If you want to have a show based on a female timelord character, pick one of the many pre-existing We did! It's called *Doctor Who*, and it's fabulous.", "num_messages": 18, "avg_score": 24.1111111111}
{"start_date": "1544763535", "end_date": "1544770866", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 11, "text": "<dailybounty>: Hello people I've created a scifi comic looking for advice. Hello guys! I'm doing a story about a space bounty hunter named todd and how he ended up wearing a toilet as a hat. here's the first chapter: (for more IG: kazenodino) Please let me know what you think :) ALL collection so far : [https://imgur.com/gallery/BJAomwu](https://imgur.com/gallery/BJAomwu) [db1](https://i.redd.it/acds05lid6421.jpg)<Starkll7>: I haven't even read it and I already love it <dailybounty>: Thanks man, what did you like about it? :)<Starkll7>: I have to read more as to why he wears a toilet on his head, right away that catches my interest. The fact that he's a bounty hunter is so perfect. Mix of the redicolous with something serious. <dailybounty>: haha yeah I thought that mix is fun too. there's more on my instagram(kazenodino) , I got 14 chapters done so far and not sure dumping all 14 here is a good idea. Please let me know what you think when you finish them, thanks for reading!<Starkll7>: How do I access them ?<dailybounty>: ok I got all here [https://imgur.com/gallery/BJAomwu](https://imgur.com/gallery/BJAomwu)<Starkll7>: Works", "num_messages": 8, "avg_score": 1.375}
{"start_date": "1544482043", "end_date": "1544715942", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 17, "text": "<DROG0>: What were your top 5 scifi/fantasy shows of 2018? In no particular order: The Expanse, Westworld, Legion, Maniac and Counterpart.<postironical>: The expanse, dark, santa clarita diet, dirk gently's holistic detective agency, castlevania, preacher, the terror. Oh shit. Top 5. I gotta read better<DROG0>: How was Dark? I've yet to see that or Preacher.<Fishy1701>: Ye its good. Watch in german with subs, not the dubbed version. Also dont watch it yet. Ends on a cliff hanger and s2 is due <DROG0>: Thanks, will do!", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1543628143", "end_date": "1543632631", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<Bilbrath>: Any examples of sci-fi that aren't focused on the futuristic aspects, but rather just everyday problems? Can y'all think of any good instances of sci-fi (or fantasy for that matter) in which the main plot does not revolve around the speculative fiction aspects of the story? Maybe something like: a court-room drama set in 2150; a small-town murder mystery in a world with elves and orcs; A story of a single mom, who happens to live in the last metropolis on Earth-2, and the hardships she's going through trying to provide for her three half-human/half-formic babies? I know there are plenty of examples of cop stories set in the future (I.E. Minority Report, Psycho-Pass, etc.), but Im looking more for something in which the main story is not really a direct result of the speculative aspects of the fiction in which it's placed. Both of those stories could ONLY occur in those worlds, I want something like My Dinner With Andre, that just also happens to be sci-fi. Something that focuses on the everyday, normal people who live in those worlds. A character-driven drama that slightly touches on the sci-fi or fantasy world it's in, but which doesn't draw all of its entertainment from it. Something that would almost work just as easily in a non-science fiction world as it does within one.<fitzroy95>: A lot of [\"Connie Willis\" books](https://en.wikipedia.org/wiki/Connie_Willis#Bibliography) are about current day people using time travel to go back to WWII, the Dark Ages etc to observe the era, and getting caught up in current events. They are all much more people focussed and historical than future focused, but using a time machine to provide opportunity<Bilbrath>: Sounds good, but they're still getting like embroiled in conspiracy or overthrowing a king or something, right? I'm aiming at more of an everyday person kind of thing. There are plenty of very good, successful books in non-speculative fiction that are about just like a court case, or the murder of a single person that doesn't have any large world-altering underpinnings or grand scheme attached to it or anything. What I'm asking is for more of that sort of thing, but speculative fiction<fitzroy95>: No, the Connie Willis books are much more about being in London during the bombing raids and the people there, or trying to avoid catching the black plague while stuck in the Middle Ages during an outbreak. No attempts to change history, or even to protect history, its all about the people involved, and no momentous events at all. [The Doomsday book](https://en.wikipedia.org/wiki/Doomsday_Book_(novel\\)) [To say nothing of the Dog](https://en.wikipedia.org/wiki/To_Say_Nothing_of_the_Dog)<Bilbrath>: Oh hmmm, ill have to give them a look. Thanks!", "num_messages": 5, "avg_score": 1.0}
{"start_date": "1543578054", "end_date": "1543587400", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<MushieMushie420>: Individualism Hello Redditors I’m in my third year of university in the U.K. and am writing my final thesis on individualism and the fear of collectivism in Science Fiction. Just thought here would be a good place to ask for some help. Currently I am using The Borg from Star Trek as a case study for the representation of collectivism, as well as others such as the Cybermen from Doctor Who. If anyone has any other recommendations of good examples of science fiction that features strong allegories for the battle between individualism and collectivism, please let me know. Thanks in advance. <APeacefulWarrior>: Atlas Shrugged is science fiction, even if most Randroids don't want to admit it. And given Ayn Rand's prominence in this particular debate, you'd be remiss not to cover it. I'd also suggest checking out the works of Eric Frank Russell, an often-overlooked silver era sci-fi writer who is probably the most openly libertarian of a bunch of sci-fi writers who tended that way. His short story \"And Then There Were None\" is pretty representative of his beliefs, basically a utopia of an ultra-individualist society that slowly converts a ship of military men to their way of life. IIRC, it's online for free if you Google it. <Edit>: Oh, and don't forget \"Invasion Of The Body Snatchers,\" particularly the 1950s version which is widely interpreted as being an allegory for individualism vs communism.<c4tesys>: Ayn Rand's Anthem is a much shorter, easier read, and more sci-fi/fantasy than Atlas Shrugged. It's central conceit is that of individualism vs. collectivism, and it inspired the Canadian band RUSH's 2112 which is also about an individual vs. an authoritarian regime which bans music. Unfortunately Anthem's conclusion, private ownership of house/land &amp; the fruits of one's own labour, is unsustainable imo. Nevertheless, it's a decent book that can rub shoulders with the biggies: 1984 &amp; A Brave New World. To OP: you're including those two, right??<APeacefulWarrior>: &gt;Ayn Rand's Anthem is a much shorter, easier read, and more sci-fi/fantasy than Atlas Shrugged. But also much less commonly read, and less influential on the overall debate that OP is looking at. I mean, it was Atlas Shrugged that distilled out all political discussion and reduced the entire debate down to \"individualism vs collectivism\" in the first place. It's the book that basically defined the topic that OP is covering. Besides, they can just read Wiki articles. I'm certainly not suggesting they try to read it cover to cover. God no. (Although, I would take issue with saying Anthem is \"more\" sci-fi than Atlas. The entire plot of Atlas revolves around brilliant engineers and scientists developing new technologies, and then building their idea of a better society around those technologies. Her idea of a better society may be a bunch of sociopathic monsters who deliberately destroy civilization so that they can rule over the remains, but it still fits any reasonable definition of \"sci-fi.\")", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1543524396", "end_date": "1543593120", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<BenjiTheWalrus>: Star Trek: Discovery - Season 2 | \"A Whole New Trek\"<https>://youtube.com/watch?feature=em-uploademail&amp;v=hPCfQAt2UWI<APeacefulWarrior>: It says \"a whole new Trek,\" yet it looks just like last season. Nothing about that makes me think that all the changes to the production\\writing staff have made much difference. In particular, *why is the bridge STILL so dark?* Seriously. The excuse they gave last season was that Lorca's eyes couldn't handle bright light. Well, Lorca's gone. Pike's eyes are fine. So why does the bridge still look like they forgot to change all the lightbulbs? I mean, I'm not just harping on a minor point here. There's no way CBS is unaware that a lot of people **really** did not like the \"dark Trek\" tone of the first season. Simply turning up the lights, so that it *looks* more like a Star Trek show, would have been a great way to signal a major shift in direction. But no. Someone has clearly decided to ride that dark Trek ship all the way down.... while still trying to claim it's \"a whole new Trek.\" At least we have Orville.<BenjiTheWalrus>: Because it’s a new adventure. It’s not that deep. <APeacefulWarrior>: Yeah, except that whenever something is described as a \"*whole* new\" thing, that indicates a large change is happening, not just mere iteration. Also, if you think they only intended the tagline 100% literally, that makes it downright stupid. \"IT'S... A... NEW... SEASON!\" Yeah, no shit. I mean, it's a bad tagline either way, but they clearly want to try to indicate major change - without doing anything to SHOW major change.<BenjiTheWalrus>: It does sound very different from what they’ve said. This trailer was made for the walking dead audience, so I don’t think it would show anything really deep beyond explosions and “REMEMBER THIS”. Since they’re going around examining the red signals, it creates the classic formula of going from planet to planet and exploring. The cast has also explained how it’s slower-paced and there’s more room to breathe. I hope we get to see more of that and less of what’s in the trailer. I think there’s not much action since the best explosion bits they could put into this trailer are an asteroid collision and a deserted ship crashing. We shall see 🤔<YotzYotz>: &gt; This trailer was made for the walking dead audience, so I don’t think it would show anything really deep beyond explosions and “REMEMBER THIS”. Wow.. Those silly plebes, eh? <BenjiTheWalrus>: I mean that’s what they always do. They did that for comic con with the pop music and the explosions, then the next trailer was slower and less action-oriented.", "num_messages": 7, "avg_score": 1.1428571429}
{"start_date": "1538861867", "end_date": "1538929035", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 41, "text": "<BenjiTheWalrus>: Star Trek: Discovery-Trailer 2<https>://m.youtube.com/watch?v=x6eoD9rQHL4<BenjiTheWalrus>: https://streamable.com/z9bz9 Region free <Nesser30>: Thank you What idiot region locks a promotional video<Hybridjosto>: People who have targeted advertising?<Nesser30>: Please expand on that ? How does region locking a video help with targeted advertising if anything it reduces the audience numbers <Hybridjosto>: Just an assumption really... If I’m a retailer in the USA I want to maximise my impact potential to my key audience. I can see the advertisers driving that their content is not delivered to people who can’t be customers.", "num_messages": 6, "avg_score": 6.8333333333}
{"start_date": "1544774138", "end_date": "1544776849", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 0, "text": "[deleted]: HEY THIRTEENTH DOCTOR HATERs!! Maybe THIS will change your mind!!! [removed]<leearypt>: I just find the current companions unlikeable and their stories boring/complete distraction from the Doctor hereself, who I love. I feel like I barely know the new doctor, all they do is deal with companion drama. The show should be more about the doctor and less about the uninteresting companions, atleast this time around. [deleted]: LISTEN HERE YOU FUCK!!! I’m trying to make sure people like you don’t cancel the show!!!<leearypt>: Lol, woah! I certainly don't want the show canceled, just get rid of the boring grandpa and grandson, oh my grandma is dead storyline. Hoping next season they leave one or perferably two of them at home. I watch the show enjoying it and think, \"Where the hell is the doctor? Isn't this Doctor Who? Why are these companions just wandering around having pointless conversations?\". I want more of the 13th Doctor! The companions feel like filler this season, they barely have anything to do with an interesting plot.", "num_messages": 4, "avg_score": 0.0}
{"start_date": "1544774951", "end_date": "1552054938", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 32, "text": "<redwalker6>: Can I read Isaac Asimov's Foundation as a standalone? So I've only bought the first book in the Foundation series and I don't know when I'll be able to get my hands on the rest. Will I be able to take a break from reading Foundation without cliffhangers or unfinished plot threads after reading just this first book?<ThinkRationally>: Asimov made it even more complicated than that by combining the Robot series universe with the Foundation series universe. This is not evident in the original Foundation trilogy, but it is in the later books (a couple of which are actually prequels to the original Foundation series). You can actually start all the way back at The Caves of Steel (or I, Robot). That said, it's not strictly necessary.<kar86>: Do you think it would be better to read the robot series before the foundation series? <zonnel2>: No. You don't have to read one series before another because the core books of each series were written independently from each other and have no ties between them. You can read the core books of each series in any order (that is : *Foundation*-*Foundation and Empire*-*Second Foundation* / *The Caves of Steel*-*The Naked Sun*) and then read the sequel novels designed to merge two series later. Please take a look at [my recommendation post](https://www.reddit.com/r/scifi/comments/7cxi40/isaac_asimovs_foundation_series_are_being/dv9b6zu/) for the further detail. <kar86>: thx <zonnel2>: You're welcome. Enjoy the books!", "num_messages": 6, "avg_score": 5.3333333333}
{"start_date": "1535954793", "end_date": "1535958732", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<Yellewleaves>: What is the purpose of science fiction? &amp;#x200B;<equus007>: Purpose? Entertainment mostly. How it entertains is really sorta dependent on the type of sci-fi. Classic sci-fi used science fiction as a vehicle to talk about the nature of man and to extrapolate future histories, for lack of a better term, based upon social trends for the most part. Usually venturing pretty far into fantasy. Hard sci-fi is pretty straight forward. Space ships and aliens. Pulp with as much logic as possible. Most writers do a little of both.<Hieron_II>: I have to disagree with your opinions on hard / soft Sci Fi. Hard Sci Fi can have neither space ships &amp; aliens, nor pulp. Soft Sci Fi can make zero use of science fiction in it's talking about the nature of man or extrapolating histories, turning all the Sci Fi elements into a backdrop. Hard Sci Fi is about getting the science right, or, at least, not getting it obviously wrong. For obvious reasons, it is better suited to \"extrapolate future histories\" - that is called \"futurology\", btw - cause you want your extrapolations based on good premises. Soft Sci Fi abandons strict adherence to science for more creative freedom. How exactly this freedom gets used - depends on an author. \"Turning all the Sci Fi elements into a backdrop\" is one possible outcome.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544766390", "end_date": "1544906021", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<hime0698>: Help finding a book I am trying to remember a series a read a year or two back. Here is what I know 1. It is or was at the time available on Kindle unlimited 2. It's a trilogy with one prequal book 3. There is a civilization of like tiger/cat people that the humans start in a tenuous post war relationship with end end up alieing 4. The big baddy of the series end up being a hyper intelligent giant space eyeball 5. They steal an alian ship and go on a mission to steal an ancient alian ship 6. The protagonist gets put on bored a ship with a famous general in a fleet that is underfunded 7. It was recommended by Amazon after I read the lost starship 8. Inter system travel was handled by Stargate in the center of that system star eg the sun 9. The third major race was essintially a race of advanced stuck up Librarians with backwards bending knees. 10. The alian eye thing can corrupt and control people using a slug like larve that if I recall correctly goes up the nose and take over the central nervous system. I know it's not super specific, I just can't for the life of me figure out what this was and I really want to reread the series. I'll do my best to answer questions and I will recognize it when I see it. Sorry to bother y'all but I have been racking my brain anf Google to track down the series or the auther and can't find anything. <BBlack1618>: This sounds a lot like The Ringworld books (Trilogy), or something else set in the known space universe of Larry Niven. Might be wrong but that is my guess<Kugelblitz60>: &gt; a race of advanced stuck up Librarians I extremely doubt this is Niven. Can you recall the names of any of the protagonists? <BBlack1618>: I was thinking the Pierson's Puppeteers, they came off that way.<Kugelblitz60>: They are certainly arrogant! That might not be the most outstanding feature.", "num_messages": 5, "avg_score": 1.6}
{"start_date": "1543632604", "end_date": "1543672289", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "[deleted]: Why do today's space opera novels don't have many aliens? [deleted]<heretical_thoughts>: There may be a combination of three factors at play: 1) People don't seem to see UFOs any more. Now that everyone has a high def camera with them 24/7, the charlatans of old, the story-tellers looking for fame have stopped using that story. 2) SETI is - what? 20 years old, maybe older. Not a peep. 1 &amp; 2 mean that both writers and the common culture are moving away from the idea of vast alien civilizations ('Oumaumau fanatics and Tabby's Star enthusiasts aside). 3) In olden days (Pre-internet) aliens stood in for foreign cultures. Now, writers can explore and just use those foreign cultures. There could be other factors: \"It's all been done before.\" or, With self-publishing, the field of Sci-fi is saturated and it's just harder to find stories like that.<trailnotfound>: Just looked it up, and SETI is more than 60 years old. The \"Wow\" signal is over 40 years old.<heretical_thoughts>: I should have realized that it had to have been more than 20 years. In Contact, Ellie is participating in it, and I read that book in the late 1980s.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1539777090", "end_date": "1543847451", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 2848, "text": "<Sanlear>: Star Wars: Lucasfilm Reportedly Relying on 'The Mandalorian' to Revive Interest in the Saga <Billy_T_Sherman>: I loved Episode 7, loved Rogue One, thought Solo was unnecessary, and absolutely hated 8. 8 was worse than any of the prequels and should be removed from canon. This isn’t me being a “hater.” It’s me loving Star Wars and acknowledging that Last Jedi tried too hard to be “original” and completely forgot that it was part of a larger story.<chemicalsam>: The Last Jedi is the best Star Wars movie since 1980. And general audiences agree<Billy_T_Sherman>: General audiences are wrong, then. How many members of those “general audiences” saw the original trilogy in the theatre before the prequels were made? How many saw the prequels before the original trilogy? How many had a developmental disability? How many had been impregnated by a sibling? My point is that general audiences can be quite dumb. No one with a fully functioning brain, who was previously exposed to the original trilogy and the prequels, would think TLJ is better than Return of the Jedi or Revenge of the Sith. It doesn’t improve on its Act I, it overwrites it (Force Awakens was derivative but good), it wastes one of the best characters ever created (Luke), and it’s packed so full of deus ex it’s nauseating. Only a small child could actually enjoy the film. And I guess they’re part of a general audience.<chemicalsam>: “General audiences are wrong then” lol, that’s such a gatekeeping statement. What on earth are you rambling about pregnancy? Do you not know what opinions are? Maybe you didn’t understand Luke to begin with. You know Star Wars is made for children right?<Billy_T_Sherman>: Yeah; and you know parents should make sure their children are consuming high quality media, right?<chemicalsam>: At this point I’m not even sure what your problem is <Billy_T_Sherman>: Read it again, then.<chemicalsam>: You’re just getting salty over a kids movie <Billy_T_Sherman>: I’m not salty. You’re the one who is upset I didn’t like the movie you like.<chemicalsam>: I’m asking what you’re so salty about and you can’t explain it. Don’t just jump on the hate bandwagon. <Billy_T_Sherman>: When you say “salty” are you asking why I didn’t like the film? I’ve already explained that. Leia can suddenly use the force? It’s an inconsistent movie that doesn’t fit well into the universe. Nothing salty about that. I just don’t think it’s very good. I thought Rogue One was a much better movie.<chemicalsam>: What do you mean suddenly lol, it’s been 30 years off screen<Billy_T_Sherman>: No it hasn’t. That’s a lie and you know it. Last Jedi did not take place 30 years after Force Awakens. Where was her force ability in Force Awakens? She just decided to not use it? This is just one of many inconsistencies Last Jedi creates. It’s a terrible 2nd Act because it completely ignores the first act. Just accept that, man.<chemicalsam>: What the fuck? There’s a 30 year gap between The Force Awakens and return of the Jedi. What are you on? Did you not see her after Han was killed in The Force Awakens? Do you even understand Star Wars? Or are you just making things up to be mad about <Billy_T_Sherman>: She didn’t use the force in Force Awakens. Then suddenly she’s an adept force user in Last Jedi. Return of the Jedi has nothing to do with that. If she was able to use the force in Force Awakens, why didn’t she? It’s nonsense. Last Jedi completely ignores ALL the other films and creates massive plot holes. It’s just not a good movie.<chemicalsam>: So what if she didn’t? Was there a reason for her too? There’s still a 30 year gap. And if you read any of the books such as Bloodline you would know she did receive training. Okay now you’re just making stuff up to get angry over. The Last Jedi script was completed before The Force Awakens was even in theaters, JJ also produced and helped write The Last Jedi script. <Billy_T_Sherman>: &gt;if you read any of the books such as bloodline I only screen these films for my kids. I told you that. These are movies for children, remember? Who reads books about movies for children? &gt;JJ also produced... Then he helped produce and write a bad movie. It happens to a lot of producers and writers.<chemicalsam>: Now you’re just acting irrationally now. <Billy_T_Sherman>: &gt;unite just acting irrationally now What you just typed makes no more or less sense than any of your other comments.<chemicalsam>: You’re just making things up to get angry about instead of listening to facts <Billy_T_Sherman>: Here’s a fact: the Last Jedi was a bad movie.<chemicalsam>: Here’s my personal opinion which doesn’t matter really FTFY<Billy_T_Sherman>: Only opinion that matters to me!<chemicalsam>: Okay troll<Billy_T_Sherman>: Ooh! Calling a person you disagree with a troll. Who could have ever seen that level of creativity coming?", "num_messages": 26, "avg_score": 109.5384615385}
{"start_date": "1544777804", "end_date": "1544823417", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 38, "text": "<spacyzuma>: I love Poul Anderson's novels More than 15 years ago, I read his novel 'the earthborn of stormgate' and it blew my mind. No novelist had described aliens and intergalactic relations like that before. I was especially thrilled by the larger-than-life Nicholas van Rijn and his genius. Over the years, I've sporadically read other stories in Poul Anderson's Polesotechnic League universe. Yesterday I finished another anthology of his stories and was again blown away. One unique thing about Poul Anderson was how he built and described planets/stars and the subsequent effect on the evolution of sentient beings. I'm yet to come across any scifi writer who did this better than Poul Anderson. The attached picture is from the afterword to 'The Man Who Counts. For fans of Poul Anderson, I found an amazing blog where a few people have spent years discussing and analyzing all of his written works. I could spend a whole week on that blog and not get tired. It's poulandersonappreciation.blogspot.com So far, my interest in Poul Anderson is within the Polesotechnic League era, starring van Rijn and David Falkyn. After readin all the stories and novels of that era, I'll move to the era of the Terran Empire and Dominic Flandry. <daralick>: The Mote In God's Eye and followup The Gripping Hand are great reads. Which include Anderson and Niven, good combo. Niven by himself is also a good author to follow. <Edit>: These books are by Pournelle and Niven not Anderson. Thanks for the heads up.<yesmar>: The Mote in God’s Eye and The Gripping Hand are by Larry Niven and Jerry Pournelle.<72414dreams>: on the one hand, you have a mention of a great sci-fi novel in a poul Anderson thread, on the other you have an incorrect credit for authorship, gripping hand is that although the mote in gods eye was not co-authored by Anderson it is worth a read!<yesmar>: I'm not sure what you're talking about. [The Mote in God's Eye](https://en.wikipedia.org/wiki/The_Mote_in_God%27s_Eye) and [The Gripping Hand](https://en.wikipedia.org/wiki/The_Gripping_Hand) are both authored by Larry Niven and Jerry Pournelle. These are great books— highly recommended. The CoDominium setting is very interesting.<72414dreams>: My joke was unclear, perhaps because I responded to you rather than the poster to whom you replied. If you will re-read perhaps the humor will be more intelligible. At any rate, explaining a joke ruins it.", "num_messages": 6, "avg_score": 6.3333333333}
{"start_date": "1544788822", "end_date": "1544836844", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 66, "text": "<sam4636>: You may not even need a telescope on 16 Dec. to see this comet <SelectAll_Delete>: Once again, OP has copied and pasted [someone else's work](https://www.ktuu.com/content/news/72-million-miles-away-and-we-might-be-able-to-see-it-502726481.html) and is driving traffic to his shitty website. How is he not banned yet?<Warlizard>: He is now.<LightlyButteredT0ast>: Are you that guy from the gaming forums? <Warlizard>: ಠ_ಠ<LightlyButteredT0ast>: Thank you for your service<Warlizard>: Thanks.", "num_messages": 7, "avg_score": 9.4285714286}
{"start_date": "1543635319", "end_date": "1543671075", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 28, "text": "<chemicalsam>: Half of 'Last Jedi' haters were bots, trolls, activists, study says <daedalus4210>: “A US academic study” sounds pretty vague and suspicious. I was actually surprised by how many people polled they liked the movie. <APeacefulWarrior>: &gt;I was actually surprised by how many people polled they liked the movie. That's because an Internet hate-bubble is not necessarily reflective of larger global reality. There are plenty of people who enjoyed TLJ, but the over-the-top response to it from certain corners of the Internet made it impossible to have any kind of reasonable or measured debate about it. So a lot of people just gave up trying to talk about it. When one side is saying, \"Hey, it was a pretty good movie with some big ideas and a few notable flaws,\" and the other side is saying \"OMG WORST MOVIE EVER SJW BULLSHIT RAPED MY CHILDHOOD\" it's pretty hard to find much common ground for discussion.<daedalus4210>: I’m surprised because I literally don’t know anyone personally who liked it, and more than half on the internet said they did. So I’m curious where all the internet love comes from. <APeacefulWarrior>: It was one of the best-reviewed Star Wars movies ever. The critics loved it. Also, initial audience polls of people walking out of the theater gave it an A rating. And speaking personally, I *liked* that it did new things - especially after being somewhat disappointed at how much of a retread EP 7 was. Yes, Johnson probably did go a bit too far about subverting expectations, and maybe shouldn't have pulled quite so many rugs out from under people. But it set up the first Star Wars movie I've seen in ages where, from start to finish, I really had no idea what was going to happen next. And as someone who's a \"first generation\" Star Wars fan, I really appreciated that. Like the throne room scene. Going into it, I honestly wasn't sure if Rey was going to team up with Kylo Ren or not. Her going to the dark side actually seemed like a *possibility*. That's really impressive dramatically, considering how formulaic most space operas tend to be. Plus, strong performances, genuinely excellent cinematography, recognizable character arcs, and generally well-articulated themes. It was a *good* movie. Maybe not truly great, but definitely at least good.<Gibbbbb>: Nice try, bub. My rebuttal is Mr. Plinkett's The Last Jedi review. <JimmyJames42>: lol", "num_messages": 7, "avg_score": 4.0}
{"start_date": "1543586697", "end_date": "1543677260", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<tripleh3lix25>: Trying to find a specific new show I remember the trailer quoting “the next battle star galatica or expanse” and it being released in September or October or sometime later this year back in August. I haven’t been able to find it and don’t remember the name. <MooreKings94>: Was it nightflyers?<_j_smith_>: I think Nightflyers is the most likely answer, the only other recent/upcoming SF/space series I can think of are Origin on YouTube and The First on Hulu.<tripleh3lix25>: &gt;The First You're absolutely right. I could have just had a comment in my mind or something... it has to be one of these two though I'm not honestly sure. Either way, NightFlyers actually looks interesting. Thank you everyone!", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1544807943", "end_date": "1544817932", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 18, "text": "<Munninnu>: Realistic gritty recent TV shows? Good morning. I'm looking for series like LOST or Battlestar Galactica: ensamble cast, decent acting, mysteries and cliffhangers done well, non-episodic. I tried more shows than I can remember to no avail. For example I didn't like The Leftovers but it was at least acceptable or plausible. On the other hand things like 100, Westworld or Altered Carbon may range from \"meh\" to \"massive trainwreck\", usually because of cheap writing or poor understanding of how to hook an audience. Finding even one series would be great. No super heroes please. Thanks.<Janke47>: The Expanse is probably what your looking for [Trailer](https://youtu.be/8X5gXIQmY-E) <Edit>: Also if you haven't watched Fringe definitely check that out, older yes, but still one of the best scifi shows<elister>: And you'll want to give it some time. Missing out if you stop watching after 2 or 3 episodes as the show consistently get better with each season. I personally was a casual viewer, but after season 2 episode 4 [spoiler](/s \"where Miller finally finds Julie Mao\"), I was sold. Its one of the rare shows I bother to watch live. <kakihara0513>: I'd mark spoilers on that one.", "num_messages": 4, "avg_score": 4.5}
{"start_date": "1544802021", "end_date": "1544902777", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 206, "text": "<Intellect456>: Superman: The Movie (1978) AMA with author Gary Bettinson Film Studies lecturer and author of a new book that looks behind the scenes of the making of Superman: The Movie (1978) will be holding an AMA for the upcoming 40th anniversary of the movie. Gary Bettinson will be on [/r/IAmA](https://www.reddit.com/r/IAmA) (I'm his publicist) answering any questions you may have, today 12-2pm Central / 5-7pm GMT!<NortheastSnow>: I am personal friends with the actor who played young Clark Kent in this movie, Jeff East. He is a great guy and did several other Movies and TV shows in the 70's and 80's. He was the lead guest star on a great episode of M\\*A\\*S\\*H as well.<tomhagen>: How did he feel about Christopher Reeve overdubbing all his lines? That must be strange to see yourself on screen but hear another person's voice.<NortheastSnow>: Well he hates it of course but he never dwelled on it. He always just talks about how grateful he is to have been part of the movie. He is a very positive guy and just loves to talk about movies in general. We would take at lengths about all kinds of movies and TV shows. He is a great guys to talk to at a bar over a few beers!", "num_messages": 4, "avg_score": 51.5}
{"start_date": "1544806696", "end_date": "1544871823", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 9, "text": "<aladinwi>: Who were/are your favorite science fiction authors from your country? Who were or still are your favorite science fiction authors from your country? Also, if there is somebody who is not very well known but you love his works, share it here as well.<bananameltdown>: My two favorite from Canada, right now at least, are Sylvain Neuvel and Peter Watts. Neuvel's Themis Files trilogy I found a really fun read, and also a rare trilogy that is consistent across all three books with a satisfying resolution. Peter Watts books I find really hard to describe. I think he's one of the best hard sci-fi authors out there, and deserves more attention. He doesn't seem to like creating likeable characters, but creates surreal worlds in the midst of societal collapse. He publishes everything under a creative commons license so it's all [available for free](https://rifters.com/real/shorts.htm), although I'd encourage people to buy it, if they enjoy it because this guy needs to write a lot more books.<aa1874>: Actually not all of his novels are free. His newer works aren't available for download fyi<bananameltdown>: My mistake, thanks. Still the Blindsight and Rifters series are available there.", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1544667734", "end_date": "1544688801", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 54, "text": "<chopinrocks>: Logan's Run (1976) -- Netflix This was surprisingly good! It just proves special effects aren't everything. Amazingly, there was a true sense of wonder, when the main characters left the city and went out into America / Washington DC.<ShoddyDiscussion>: Cant wait for the remake/reboot/reimaginging :) Yes, there's a new one in development written by [this guy](https://www.imdb.com/name/nm2952284/?ref_=tt_ov_wr) Here's hoping hercules and rampage made them rethink that idea<TheArtBellStalker>: Don't get your hopes up of watching it anytime soon. That remake has been in development hell for the past decade with multiple scripts coming and going.<RichardMHP>: Two decades, honestly. <TheArtBellStalker>: Yes, you're right. It's a few decades. Time flies as you get older. It sounds stupid but sometimes I forget a decade ago was only 2008. lol.", "num_messages": 5, "avg_score": 10.8}
{"start_date": "1543515975", "end_date": "1543530924", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 2303, "text": "<OldManDaredevil>: 'Blade Runner' Anime Series in the Works at Adult Swim <BerlinghoffRasmussen>: Blade Runner is going anime and Cowboy Bebop is going live action. What a time to be alive.<Traiklin>: To bad Blade Runner won't be done by the people who made Cowboy Bebop. I'm picturing a flash animated, make it as cheaply as possible because we spent so much on the license.<NeedleNose1>: There was a short Blade Runner anime film leading up to 2049 directed by Shinichiro Watanabe!<barnett9>: And it was awesome<Lingispingis>: Yeeees, Cowboy Bebop in Blade Runner universe with a massive AKIRA feel... loved that short<Nixplosion>: Yesss it was sooo good", "num_messages": 7, "avg_score": 329.0}
{"start_date": "1544695051", "end_date": "1544698388", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<Plattenwendee>: Spotify Sci-Fi Audiobooks Can anybody recommend audiobooks on spotify involving sci-fi adventures?<Grischaa>: The doctor who audio books are on Spotify and are actually quite good. I enjoyed the Stories of the 8th Doctor the most. It's a little confusing to find the story you are looking for but this helps. https://en.m.wikipedia.org/wiki/List_of_Doctor_Who_radio_stories<Grischaa>: This is the first episode of the 8th Doctor https://open.spotify.com/album/774rK3dwVF5x3tHbCtWEZl?si=-llrOOCrTdSfZizc5lAb-A", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543489745", "end_date": "1543572044", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 817, "text": "<HorrorStuffAndThings>: Artist Turns Everyday Objects Into Spaceship Designs. <Dresta>: Shampoo bottle reminds me of Homeworld <Robofetus-5000>: god. One of the greatest games of all time. &amp;#x200B;<BigRedRobotNinja>: Hooked me right from the \"Karak is burning\" cutscene.<frymaster>: I only realised how deep it had got in when in the post-mission cutscene, Fleet Intelligence told me \"the subject did not survive interrogation\" and I was *gleefully* happy, after what he'd done. <kronpas>: Fleet intelligence almost always sounds so calm, so professional, but there a a few scenses in which you cam hear his voice tremble, trying to contain the emotion within. I know fleet intelligence is a team, but the person who speaks to me is always the same one. I bought homeworld remaster instantly when its available. The guys at gearbox software did a wonderful job to bring the game up to par with current standard. <frymaster>: \"Kharak is being consumed by a firestorm. The Scaffold has been destroyed. All orbital facilities dest*roy*ed. Significant debris ring in low Kharak orbit. Receiving no communications from anywhere in the system.... not even beacons.\" What a masterpiece that game was.", "num_messages": 7, "avg_score": 116.7142857143}
{"start_date": "1541560697", "end_date": "1543640787", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 2, "text": "<-MarcoPolo->: Simple new book huh? Hey new here, dont know why,, but was looking to new scifi book after finishing last one on the way home. Put standard sci fi books and added 2018 and got this one: Station Eleven By Emily St. John Mandel (2014) If a pandemic wiped out much of Earth's human population, what happens if you're an artist? Number two on the list<raevnos>: If you like that concept, track down [The City, Not Long After](https://en.wikipedia.org/wiki/The_City,_Not_Long_After).<-MarcoPolo->: Thanks for the replay. I just recently got some more time to read. Am afraid of classics of sci-fi coz if they put more pressure on tech than on story/universe-wide questions Im afraid Im gonna get put off. What u r showing is 1989 and I will... check it out after this book Ancillary Justice right now Im reading. U gonna go to my kinda new - one year old - bookmarks READ. From my side, not so small investment into SAGA comics is pretty much worth it. But Im new. And everything new is great for me so", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1543264028", "end_date": "1543312692", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 22, "text": "<BEGB13>: What to read after Rendezvous with Rama. I have been approaching the end of Rendezvous with Rama and I was enjoying it so much I was going to order all the other books. That was until a stumbled across a post on here where I learned that they were not very good. I am pretty new to reading this genre and I love Arthur C Clarke's writing style. I like how it gets to the point pretty quickly as I have found (whilst I liked the other books) they dragged out some parts which I found ruined the pace from time to time. I was wondering if anyone had any recommendations of some other books to check out once I've finished this? One of the other things I liked about Rama was the size. Whilst I'm not too fussed about how large a book is I did like the fact that I didn't have to commit to something that was going to take a while. Any recommendations would be greatly appreciated. Thanks in advance. -B<radome9>: Iain Banks, Alistair Reynolds?<BEGB13>: Cool thanks, I didn't know Iain Banks wrote Sci-Fi too.<radome9>: He writes sci-fi under the name Iain M. Banks. And you are in for a treat.<BEGB13>: Checking them out now. I think I might pick up The State of the Art.<radome9>: Excellent choice. For more *Culture* goodness, I recommend starting with *Look to Windward*.<BEGB13>: Cool. I thought those would have been best read in order or does it not matter?<radome9>: There's no strict ordering and only loose connections between the books, so you can read them in any order you want. But even if you want to read them in chronological order, I recommend not starting with *Consider Phlebas*, as it is by far my least favourite Culture book.<BEGB13>: Nice one, mate. Cheers.", "num_messages": 9, "avg_score": 2.4444444444}
{"start_date": "1544645953", "end_date": "1544707740", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 831, "text": "<BobbyDee45>: Disney+ Reveals Full Cast for Jon Favreau's 'The Mandalorian' Series <T_E_Kyle>: Damn, they got Gina Carano!? very cool to see her in action again, she was one of my favourite female MMA fighters back in the day, helped put women's MMA on the map well before the UFC picked up various women's weight classes and started promoting them. She's a great fighter and is also gorgeous to boot, let's see if she's picked up some acting skill since Haywire.<TheSecretMe>: I read that more as an \"oof, they got stuck with Gina Carano\". That's not a good start.<TheKharmeleon>: Disney isn’t in a position here where they’re settling for people. They cast her for a reason. <TheSecretMe>: I'm sure. The reason eludes me though. She's a shitty actor that tends to break any scene she's in. And Nick Nolte seems like a liability to work with. It's a pretty baffling cast really.<TheKharmeleon>: I don’t think they cast her to deliver eloquent speeches. They probably just have her doing a lot of action scenes and stunts. <TheSecretMe>: That still includes acting unless they're using her as an overpaid body double who gets billing for some reason.<dirty_rez>: Unless her character is mute, doesn't speak \"English\" (or whatever language it is the audience is able to understand) etc. Star Wars is full of non-speaking characters. Maybe she'll be a Wookie or something. <TheSecretMe>: And you think that doesn't require acting? /u/PeterMayhew is lauded for how well he managed to emote in that wookie costume. Maybe she'll do a great job but so far her track record hasn't been stellar.<dirty_rez>: Except that she's pretty good at the physical stuff. It's her line delivery that's not great. If they put her in a role where she primarily needs to be physical, and either her voice is altered, or she rarely/never speaks, I can see it working out.", "num_messages": 10, "avg_score": 83.1}
{"start_date": "1543423871", "end_date": "1543440014", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 1619, "text": "<Neo2199>: Netflix orders live-action Cowboy Bebop TV series <Dredge323>: I do not understand why people say a new version of something will ruin the original for them. Why? Are you never gonna watch the original again now? And if you do are you gonna hate it? No. Stop being drama queen and complaining about everything! It's seriously annoying. The live action avatar the last airbender, and I shudder with disgust even typing that, is on my list of the worst movies ever made and is on the list of movies we do not speak of. It's the worst thing ever. But it absolutely does not even in the slightest ruin the original for me. I still watch it all the time. You wanna hate the live action? Perfectly fine, don't care, but for the life of God stop whining that it will ruin the original. My rant is over, carry on.<DisruptedVisualz>: Why redo something that wasn't broken? These movies are for profit only. They are shit. They do not ruin the original anime. Just a waste of time to even create such things <Dredge323>: Why not? Does it really matter? Is it affecting you personally other than causing you to whine? If you don't like it, or the idea of it, then there's this magical thing you can do called not watching it. And you know there is this thing that can happen where they actually make something in a new way that you'll like. I know it's hard to believe but it's actually a thing that's possible.<DisruptedVisualz>: I don't watch them? I'm not whining either. I'm just stating the fact that they are worthless and nobody wants them so why even make them? No need to try to pick a fight with someone just stating their opinion! Thanks! :)<Dredge323>: No I'm sorry, I didn't mean to try and pick a fight. I'm just of the mindset that anybody can do anything they want whether it's wanted or not, and if I don't like it that's okay, but I don't make a big deal about it or complain publicly, I just quietly don't like it for awhile with my friends and then move on. And I also apologize for saying whining, I wasn't trying to imply you personally were whining just generalized whining. It just irritates me that people attack and complain about stuff when all they have to do to not be affected by it is to not bother with it. They cause they're own misery and/or anger BECAUSE they actively seek out to complain about it. You know?<DisruptedVisualz>: Hey man I feel ya! I was just voicing my opinion. Everybody has their own opinion! But mine is just that I feel it's just not necessary to make live action of anime. Especially since they always turn out bad. But!! People can certainly enjoy them if they wish to! I also agree with you about people attacking and complain about things that don't affect them! You are 100% correct. And it happens way too much. The internet in my opinion is toxic and people who start fights on it about dumb things have horrible issues of their own! <Dredge323>: It really is toxic! And I do actually agree that anime shouldn't be made live action, it just really can't translate into real world physics most of the time. But I do think that if done right (which it won't sadly), cowboy bebop could be one that could work and be amazing live action! I'm willing to let them try at least, and maybe if we're really really lucky we'll get something amazing out of it. But on top of that, thanks for being awesome man! I love it when I can have an actual discussion online.<DisruptedVisualz>: Agreed! I have high hopes. But sadly I know I'll be let down! Also love to have actual discussions online without someone fighting me over nothing at all! Have a great day! <Dredge323>: Thanks, you too!", "num_messages": 10, "avg_score": 161.9}
{"start_date": "1543414005", "end_date": "1543444195", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 11, "text": "[deleted]: Why do today's young readers prefer fantasy? [deleted]<Bardzly>: I haven't seen the numbers and I can't speak for everyone, but as a youngish reader I do fit more into the trend of preferring fantasy to sci-fi (in general). There are some fantastic sci-fi books and writers I love. Iain M Banks' culture series have been some of my favourite books all around, and David Brin is one of my favourite writers. Personally though I've found fantasy easier to read. I can't say exactly why that is, but I've found that reading sci-fi doesn't drag me in in the same way and I have to be really invested in the plot and or characters to keep reading to the end. On the other hand, fantasy seems to be easier for me to read and just immerse myself in. I personally think that part of it has to do with my suspension of disbelief. When I go into fantasy books its with the precognition that Gods exist, magic is a thing and the society is how it is. Don't question it. (Though the best writers always support it well). Mostly when I go into Sci-Fi, I find that the attempt to explain how the world / cosmos became as it is starts to grind on me and I have a harder time immersing myself in the book. In terms of escapism, I've found that in most fantasy books as well, the protagonists are empowered to change their entire world (a chosen one plot etc.), Whereas in most sci-fi stories, the protagonists may change their situation, but less often do they change an entire world and at least in the books I've read are more often actors within a world than chosen ones changing it (with some notable exceptions obviously). Just my 2 cents, it won't apply to everyone, but with enough input it might help narrow it down.<Crazytowndarling>: As a response to you comment about explanations of ‘the story of the universe up to those point’, I would say Randolph Lalonde’s Spinward Fringe series is a great example of doing this the right way. He sprinkles little nuggets of it in throughout his books. He reveals it in a very organic way and VERY rarely info dumps. <Bardzly>: Sounds interesting. I'll have to give those a read.<Crazytowndarling>: First one Origins is free on iBooks.", "num_messages": 5, "avg_score": 2.2}
{"start_date": "1543669362", "end_date": "1543683489", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<Sanlear>: Nick Nolte to grunge up The Mandalorian <webauteur>: So a bounty hunter is going to be a Jedi master. This is how Disney will ruin Star Wars. Everybody will get to be special. Driods like C-3PO and R2D2 will become Jedi masters and even ghost Jedi when they die. There will be an Ewok Jedi master. Storm Troopers will become Jedi masters. Chewbacca will become a Jedi master. Every damn being in the Star Wars universe will be a Jedi master.<nefffffffffff>: That's just speculation by the author.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544848085", "end_date": "1544925724", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 146, "text": "[deleted]: Book recommendations about alien visitation that aren't military? I'm wanting to read or listen to a book about alien visitations that aren't militaristic in nature. I haven't had much luck in finding some that are interesting. Bonus points if it is from the some kids' perspective. I really liked ET: The Extra Terrestrial and IT because it weirdly makes me feel young again.<SkizzlerX2>: Childhood’s end - definitely an interesting one <Mr_Oblong>: Just out of interest, did you watch the recent-ish tv show?<SkizzlerX2>: I did not, was it any good? I was a little thrown off by the look of the show through the commercials <Mr_Oblong>: Yeah... I enjoyed it I guess. It’s been a long time since I’ve read the books but it follows the story pretty well I believe. It’s only 6 episodes (3 double episodes I guess). It’s worth watching. <SkizzlerX2>: Cool! I’ll check it out in the future! Glad to hear they did not change the story much that was my main concern <SoForAllYourDarkGods>: Nope. It's not very good, despite having some good actors. The book is far superior.", "num_messages": 7, "avg_score": 20.8571428571}
{"start_date": "1544847069", "end_date": "1544891340", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 119, "text": "<Haki23>: Looking for a book title - Poul Anderson was involved I read this back in 1982-84 It was a book of short stories. The one that stood out was one of a robot on an Earth devoid of humans. A robot had experienced damage to his power supply, and so had to prey on other robots for their power, which ends up destroying them (something about the positronic brains needed to be powered at all times or the memory would be wiped). He meets a human who stays in a crypt in the middle of a cemetery, who is actually a vampire. As things turn out, an angry mob of robot villagers come out to burn the vampire robot, but his vampire friend comes out into the daylight to say he is not the killer they are looking for. The robots promptly accept the humans word as the truth and the vampire ends up turning to dust in the sun. I've tried my considerable Google-fu, but this seems too obscure even for this. **Edit: Poul Anderson was not involved in the creation of this book. It was Roger Zelazny**<Sharrukin-of-Akkad>: That sounds a *little* like Anderson's story \"Epilogue,\" but I don't think that's it - there's nothing like a human vampire in that. Honestly, I'm familiar with almost all of Anderson's work, and nothing else I can bring to mind comes close. Maybe it was a story by another author in a collection that Anderson also appeared in?<Haki23>: He might have been the Name on the Cover who gave cred to the other authors. The cover of the hardbound featured the same robot with a energy absorption machinery coming from it's chest absorbing another robots life force <Sharrukin-of-Akkad>: Aha. I think I may have found your story. \"The Stainless Steel Leech,\" by Roger Zelazny writing as Harrison Denmark. Not sure where Poul Anderson might have come into it. The Zelazny story did appear in an obscure magazine issue with one of Anderson's stories at one point, but that's about it.<Haki23>: &gt; The Stainless Steel Leech Sorry, but I looked at that and it wasn't it. The one I remember was more verbose.<Danzibarbarian>: Are you sure? The synopsis of that story, REALLY sounds like your story: &gt;Synopsis: After mankind becomes extinct and the world remains populated only by robots, a freak robot who lives as a fugitive by sucking the power from other robots befriends the last remaining human vampire. Also, the 1981 cover for the collection it's in matches your description: http://www.isfdb.org/cgi-bin/pl.cgi?42748<ImaginaryEvents>: The magazine publication of the story is [online at archive.org](https://archive.org/details/Amazing_Stories_v37n04_1963-04_aMouse/page/n113) if anyone wants to read it. Zelazny had another story in that issue, which explains the pseudonym.", "num_messages": 7, "avg_score": 17.0}
{"start_date": "1543679286", "end_date": "1543695607", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 19, "text": "[deleted]: What is responsible for the massive revival in space opera? [deleted]<hacksoncode>: Wait, what? No space opera on the shelves in the 2000s? Revelation Space (2000). The Skolian Empire series (2000). Vatta's War series (2004). The Quiet War (2009). The Commonwealth Saga (2005). Old Man's War (2007). Singularity Sky (2004). Dread Empire's Fall series (2003). Polity Series (2009). Newton's Wake (2007). Warchild (2002). And that's not mentioning all the long-running series that have continued through the 2000s, like Honor Harrington, Star Wars, and even one of the first canonical space operas ever Perry Rhodan, which has been going on at 1 book a week since 1961 (albeit in Germany). In other media: Firefly was 2002-2003. Battlestar Galactica was 2004-2010. Futurama (1999-2013). Avatar (2009). And tons of Anime. And speaking of The Expanse, Leviathan's Wake is barely out of the 2000's, being published in 2011. <Dramatic15>: Yes, the premise is wrong. The 950 page anthology *The Space Opera Renaissance* is published in 2006. The anthology's *The New Space Opera* (2007) and *The New Space Opera 2* (2010) collected another 1000 pages of short stories. And as for media, we shouldn't forget Farscape '99-'03. If Space Opera was ever dead, it was from the mid-60s to mid-70s when people's creative agendas were mostly either \"literary/arty\" with the New Wave or plausibility for the Hard Science Fiction crowd. I've heard when Star Wars (A New Hope) was previewed at Worldcon, Gary Kurtz was told \"That sort of thing isn't science fiction\" to which he replied \"Yes, you are right, it's space opera instead\", an explanation that satisfied everyone. The success of Star Wars pretty much explains why space opera is never *totally* out of fashion **ever** again. &amp;#x200B;", "num_messages": 3, "avg_score": 6.3333333333}
{"start_date": "1543603071", "end_date": "1543718755", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 223, "text": "<Sanlear>: The new George R.R. Martin TV series is more Event Horizon than Game Of Thrones <SciFiJesseWardDnD>: Looks good. I'll watch it on Netflix after Syfy cancels it.<Yage2006>: They have been cancelling shows they do not own outright. The main reason The Expanse and Dark Matter was cancelled. Going forward they want only shows they produce and so can make money selling streaming rights. IIRC, they own this show entirely, so there is that. <TeamRedundancyTeam>: Oof, still hurts being reminded about dark matter. <Yage2006>: Ya, that was fucking brutal.", "num_messages": 5, "avg_score": 44.6}
{"start_date": "1543676901", "end_date": "1543700051", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 24, "text": "<edenkl8>: Good multiverse books? Hi, I am looking for books with a multiverse that contain worlds that differ from one another up to the level of different laws of physics. Are there any? Thank you!<equalx>: While it's not a super close fit, Anathem by Neil Stephenson touches on these topics a bit.<Claytemple_Media>: Touches on them in an intellectually rigorous and satisfying manner. It's by far the best book to recommend here.<equalx>: Yeah. It's my favorite of all his books, and easily top-10 across all the books I've read, but it's also one of Stephenson's most \"academic\" books. It has big, wonderful ideas, and he takes his time in communicating them to great depth. For example, there are extra sections in the back for scenes he \"cut\" that contain additional mathematical proofs (as told by the characters). If you're not expecting or interested in that, it can be a real unpleasant intro to his writing. <Claytemple_Media>: You're quite right, and that's a pretty fair warning for the unprepared.", "num_messages": 5, "avg_score": 4.8}
{"start_date": "1544858481", "end_date": "1544890096", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 348, "text": "<MiddleAgedGeek>: “The Orville” season one finally arrives on DVD (but no blu-ray)... <F7R7E7D>: What, no vhs?<MiddleAgedGeek>: It'll only be available on Beta. <tubadeedoo>: I know that's a joke, but the Betamax player we have in my house is plugged in while the VCR isn't. <j1ggy>: What is this sorcery?<tubadeedoo>: I mean, I haven't watched anything on either in a while, but I've got a decent Disney movie collection on VHS. I should watch one soon for the nostalgia. <CFGX>: This is actually a pretty legitimate use, seeing how Disney are giant dickholes about being able to get new versions of their library through their idiotic \"vault\" system.", "num_messages": 7, "avg_score": 49.7142857143}
{"start_date": "1544851799", "end_date": "1544884876", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<N0clipping>: Free e-book Hello, my fellow sci-fi lovers. I've written a sci-fi called Afterburn. Imagine Bladerunner and Fast and Furious in a blender. The result is high-speed anti-gravity racing mayhem with all sorts of rivalry along the way. I'd love for you to check it out. In the supersonic world of pod racing, you've gotta have serious skill to be a pilot. Reme Reagan, a young farm boy knows he's got those skills. He can feel it. All he needed was the opportunity to prove it, and it found him. A chance meeting with a stranger lets the young farm boy showcase his talents. When a partnership forms between the pair. Reme will be in for the ride of his life. Friendships will flourish, so too will drama and upset. Could the politics of the pod racing world be too much for him though? Even more frustrating for him, is his own conscience. A stunning redhaired cyborg is ruling his thoughts, and she plays to win. How will he race against her, when all he can think about is her... <US>:<https>://www.amazon.com/Afterburn-R-K-Higgins-ebook/dp/B07L8PC2K1/ref=mp_s_a_1_1?ie=UTF8&amp;qid=1544851773&amp;sr=8-1&amp;pi=AC_SX236_SY340_FMwebp_QL65&amp;keywords=rk+higgins&amp;dpPl=1&amp;dpID=51-li1xHUUL&amp;ref=plSrch <Canada>:<https>://www.amazon.ca/Afterburn-R-K-Higgins-ebook/dp/B07L8PC2K1/ref=mp_s_a_1_2?ie=UTF8&amp;qid=1544792084&amp;sr=8-2&amp;pi=AC_SX236_SY340_FMwebp_QL65&amp;keywords=rk+higgins&amp;dpPl=1&amp;dpID=51-li1xHUUL&amp;ref=plSrch Merry Christmas and Happy Holidays -R.K. For exclusive manuscript leaks and more fun check out my Instagram @authorrkhiggins <BellamyJHeap>: Congratulations on getting your book out there!<N0clipping>: Thx so much!", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1543682268", "end_date": "1543708191", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 470, "text": "<eliotpeper>: The Chicago Review of Books 10 best SF books of 2018 <neuromonkey>: Wow, this is great! I've read at least a dozen other \"best of 2018\" lists, all of which were mostly the same stuff. Only one of these titles were on those other lists! (Kowal's *The Calculating Stars*) ---------------------------------------------------------------------- Other titles I from various other \"Best of 2018\" lists: ...(I can't attest to the bestness of most of these, as I haven't read most yet...) ...(Sorry if some of these are from 2017, I'm pulling from Calibre...) * *Tomorrow and Tomorrow* by Tom Sweterlitsch * *Influx* by Daniel Suarez ~~*Saturn Run* by John Sandford~~ Oops -- 2015 * *The Peripheral* by William Gibson * *The Gone World* by Tom Sweterlitsch * *The Sky Is Yours* by Chandler Klang Smith * *All Our Wrong Todays* by Elan Mastai * *Planetfall / Before Mars / After Atlas* by Emma Newman * *Dark Matter* by Blake Crouch * *Gnomon* by Nick Harkaway (2017) * *Prefect* by Alastair Reynolds * *Elysium Fire* by Alastair Reynolds * *Too Like the Lightning* by Ada Palmer * *The Wrong Stars* by Tim Pratt * *Renegades* by Marissa Meyer * *The Breach* (and sequels) by Patrick Lee ----------------------------- And HOORAY! *Mem* is at my local library... and is available!! <netsettler>: _The Calculating Stars_ deserves to be on both. It's great on audiobook. She reads her own work and it's both a solid story and solid performance. I recommend it quite highly. I just finished listening the sequel, _The Fated Sky, and it's also excellent. I hope she does more. By complete coincidence, I listened to _The Calculating Stars_ right after finishing Rebecca Traister's _Good and Mad_. (That's not sci-fi. It's more social/political, a study in women's anger written as a companion to the \"me too\" movement.) _The Calculating Stars_ puts the many issues Traister raises into clear focus in a series of worked examples, but yet manages not to be tedious about it.<neuromonkey>: Cool, thanks! I'll put Kowal's books near the top of my \"next up\" list!<netsettler>: For what it's worth, if it's the sort of thing you ever do, I really recommend Traister's book, too, I meant to say. It is extremely well-organized and a very nice study in the modern history and even ethics of anger, a topic I'd have expected to be pretty disorganized. Anger and injustice is a complex topic people probably don't think enough about, though sci-fi sometimes confronts it usefully. I found it to be a really nice flow from one book to the other.<neuromonkey>: Interesting. Thanks! Anger is definitely a topic that's been on my mind over the past couple of years.<netsettler>: One of the many things that impressed me with the book is its sense of nuance. Distinguishing between anger as a positive motivating force when things are awry, and anger as a negative once normalcy has been restored is an example; that is, not going too far. But the book is full of subtle distinctions that are visited one at a time in a form that attach a lot of organization to a messy topic. I hope you enjoy it as much as my wife and I did.<neuromonkey>: Huh. Even more interesting. I've heard that anger management tries to distinguish between *feeling* anger and *acting* upon it, particularly acting upon impulse. I feel it's a very poorly explored emotion, at least in constructive ways. It seems to motivate so much in the modern world, and there's so little analysis of it, beyond the most superficial acknowledgement that it exists. I'll grab a copy, thanks!", "num_messages": 8, "avg_score": 58.75}
{"start_date": "1544869601", "end_date": "1544872608", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 23, "text": "<Scourge31>: Cop chases alien in a dark city movie? Trying to find a film, it was a cop or detective chasing what turns out to be an alien creature in a city. Very dark sort of noir vibe. Mid 70s to mid 90s probably. At the end he has his female sidekick remotely crash the spaceship, he asks what ocean she chose and she says \"the Atlantic\". Any thoughts? FOUND IT. Thanks everyone, it was a pilot for a TV mini series called Something is out there, not as scary as I remember but I was a kid when I saw it. Thanks again.<psilocybes>: Dark City? <ArtIsDumb>: There's no spaceship crashing into the Atlantic in Dark City.<psilocybes>: I didn't assume the op memory was accurate. <ArtIsDumb>: \"Very dark sort of noir vibe\" made me think Dark City as well, but the rest of the description didn't.", "num_messages": 5, "avg_score": 4.6}
{"start_date": "1543691675", "end_date": "1543719997", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 17, "text": "<staysleepin>: Recommendations: Underwater Stories Greetings all, &amp;#x200B; I have been working on a story for some time now that takes place underwater, but I have been struggling with worldbuilding and making that place real to my readers. Any recommendations of stories and books that do a good job with creating an underwater world? &amp;#x200B; Thanks in advance!<IUseRhetoric>: Starfish by Peter Watts would be a good start.<staysleepin>: Thank you, kindly! I just looked up a synopsis. Reads like a movie. :) <Prairie_Dog>: It is also freely available from the author’s website as well as other places.<staysleepin>: That's good to know. After you recommended it to me, I put in a request at my local library. Prefer the hard copy if I can get my hands on it. Thanks again, Prairie\\_Dog !", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1544643364", "end_date": "1544665607", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 199, "text": "<elister>: Public Service Announcement: Season 3 of Travelers starts this Friday. Showcase channel for Canadians, Netflix for everyone else. <https>://www.imdb.com/title/tt5651844/ <https>://youtu.be/xyEijpJ9YL0 &lt;-- Season 3 Trailer. Gotta give props to Eric McCormack for being able to find the time to do this show, as well as the Will &amp; Grace Reboot, his family must be missing him. <Proteus_Zero>: &gt;Gotta give props to Eric McCormack for being able to find the time to do this show, as well as the Will &amp; Grace Reboot, his family must be missing him. Yup. I'm glad he's committed to both projects. Looking forward to the new season. Some folks would have bailed the moment Will &amp; Grace got a multi-season renewal.<elister>: I have noticed that when he was a producer for this show in 2016 for 12 episodes (1st season), then stopped, which makes me think he had to in order to have the time to do both shows. Personally, my wife loves Will &amp; Grace, but doesnt really care for Travelers. Where I love Travelers, but dont really care for Will &amp; Grace. <ShoddyDiscussion>: Well I enjoyed early will and grace, but it got stale, i watched the first season of the reboot and felt it recovered what made it great in the beginning", "num_messages": 4, "avg_score": 49.75}
{"start_date": "1543700767", "end_date": "1543721562", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 112, "text": "<yummypurplestuf>: New to SciFi, but just finished The Martian, Artemis, and Ready Player One. Need suggestions on what to read next, something with strong scientific/engineering component. <naught-me>: Oh man. You just got started. The absolute top classics, to me, are \"Stranger in a Strange Land\" and \"Dune\". Dune's what you'd prefer of those, going by your question - it takes engineering to universal extremes. If you really want strong scientific/engineering, though, read absolutely everything by Daniel Suarez, starting with \"Daemon\" and \"Freedom TM\" (Freedom is the sequel to Daemon). His books, mostly, just employ current technology in novel ways to change the world. Dune has way more advanced engineering, since it's projecting centuries into the future, but the stuff Suarez talks about is way closer to home.<shouldbebabysitting>: &gt;Oh man. You just got started. The absolute top classics, to me, are \"Stranger in a Strange Land\" and \"Dune\". Dune's what you'd prefer of those, going by your question - it takes engineering to universal extremes. I think it's weird you'd say Dune as heavy science scifi when to me the science is non existent and exists like magic in Lord of the Rings. It's a backdrop to tell a story but has no logic or scientific basis. If it was the 1960's it would get a pass because paranormal was still being studied. But now we know you can't actually change the world by dropping acid. <naught-me>: Well, I think it's pretty safe to say that, whatever tech they're using in 2000 years (or whatever), it'll be magic enough that we've got no business speculating except for entertainment. I wouldn't classify \"Dune\" as heavy on tech, for the same reasons, except that I love the idea that the highest technologies would be human advancements, ways to train humans to be superhuman (mentats, bene gesserits), and it's for sure a lot more tech-based than \"Stranger in a Strange Land\". Also, \"we know you can't change the world by dropping acid\"? Source? We don't even know whether we're living in a hologram.<shouldbebabysitting>: &gt; I wouldn't classify \"Dune\" as heavy on tech, But the OP said, Martian, Ready Player One and Artemis which are all heavy tech. Dune us fantasy in comparison. &gt;and it's for sure a lot more tech-based than \"Stranger in a Strange Land\". But op didn't ask for more like Stranger in a Strange Land. He asked for more like Martian. &gt; &gt;Also, \"we know you can't change the world by dropping acid\"? Source? Experiments were done for all paranormal powers. It's fantasy. Not to mention Dune, like most scifi ignores time dialation. If the guild navigators could warp space to travel faster than light, they could travel back in time. <naught-me>: &gt; But op didn't ask for more like Stranger in a Strange Land. He asked for more like Martian. Well, to be fair, I did say \"my favorites are ___, *but*\".", "num_messages": 6, "avg_score": 18.6666666667}
{"start_date": "1544879354", "end_date": "1544908630", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 1616, "text": "<Sanlear>: ‘Battlestar Galactica’ Is Now a Classic — 15 Years Ago, Fans Thought It Was a Mistake <rollieronsmitten>: It was (and still is) a significantly overrated show. It was a different approach to making TV series, and that was interesting in itself, at least at first. The Adama/Roslin chemistry was great. But overall, it was an extremely bleak, violent and ultimately ridiculous show that kept getting weaker and weaker until the creators put it out of its misery after just 4 seasons. Sadly, its legacy meant 15 years of depressing grim dark shows all across the board.<NecroDaddy>: What kind of shows would you prefer?<rollieronsmitten>: Smarter, funnier and more optimistic shows with likeable characters like Star Trek and Stargate used to be. That is before BSG's influence that totally screwed up both franchises with the creation of bleaker darker badly written shows like Stargate Universe and Discovery.<kapuh>: Staragate was some low effort cheap afternoon show crap for kids man. <nothinbuttherain>: You can't have watched more than the first season if you say that. I was misty eyed at the end of the last episode. It certainly wasn't gritty nor dark. But it was some damn fine sci fi.<kapuh>: All the episodes I've seen felt like I've seen the story before. They were predictable, acting was meh, dialogues were terrible and in the end it was just boring. I tuned in from time to time and it never changed. The only amazing thing about it was how it got all those spin offs. At that time I watched everything scifi (it wasn't much) and this was the first thing I couldn't bother with. And it's not about gritty or dark. It's just not a good made TV show. <nothinbuttherain>: If you were watching time to time then you missed the big arcs which may have contributed. It's not really an episodic show, though it seems like it's going to be at first.<kapuh>: I can't imagine a overall story that would make the things I pointed above go away. Especially when something I got from the overall arc was stuff like Jackson being dead and alive all the time like in some bad soap opera...<nothinbuttherain>: Ok, just trying to help out a fellow scifi geek. You've already made up your mind though, so probably no hope. I'll just try one more time - I feel like I'm talking to someone who is rejecting Babylon 5 based on Season 1. That's the only thing I can say that I think might move you. If not, then so be it.<kapuh>: I hope you've not been seriously comparing B5s first season to SG1s ;)<nothinbuttherain>: I hope you aren't seriously suggesting B5s first season rose above lukewarm tapwater. ;-)<kapuh>: If you define SG1 as lukewarm tap water, then yes.", "num_messages": 13, "avg_score": 124.3076923077}
{"start_date": "1543678323", "end_date": "1543733055", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 11, "text": "<Zero_From_Techdragon>: Questions - Ep 7 - Entangled / a sci-fi Web series Entangled is a indie Sci-fi web series on YouTube. This is [episode 7](https://youtu.be/TU6uyNvHahI) Questions ([full playlist here](https://www.youtube.com/watch?v=AWL3_WH2ej0&amp;list=PL5qeC6ozQqU-O7sEqpFfoaPPtEqjWzy7M)). Last episode the main character, Spanner found out there is another gate on the planet, and he wants to investigate it to see if he can get them working to get off this planet together with his AI, Lucy, and the rest of the crew of the Zarkof. <Snail736>: Is it any good? <Telvetta>: So far - yes. And the twists are getting interesting too. But you tell me. I'd love to hear what others are thinking.", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1543349947", "end_date": "1543444435", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 266, "text": "<topazdude17>: What is everyone's favorite sci-fi movie of 2018 so far? My favorite is still Annihilation. Hell it might be an all time favorite sci-fi movie. Seen it 5 times now ant it gets better on every re watch<coldfirerules>: Nothing I've seen has been very good. RPO was awful and Netflix' offerings have been disappointing. Mute, Upgrade and Annihilation were all watchable but unspectacular. I have some hope for Hotel Artemis and Prospect though, havent seen those yet. Mortal Engines could be good as well.<wandermike>: Really, ya gotta abbreviate; RPO? It's early in the AM here and it's not coming to me. Google and imdb search got nothing. Anybody? <coldfirerules>: Ready Player One...sorry.<KingCarnivore>: Ready Player One was soo fucking bad. I have no idea how it has good ratings on IMDB and RT. The whole thing was \"LOOK, WE MADE A REFERENCE, DO YOU GET IT?!?!?!\" It's like Emoji Movie quality. [deleted]: I mean, that's basically how the book was so at least they stayed true. <Stuart_Munto>: Yep first time a movie stayed true to the book and it was with this garbage. The ‘King of Kong’ documentary is far superior to Ready Player One.... and it’s based on fact rather than fiction. <DeletedLastAccount>: Except the movie was not true to the book at all... I understand the hate for the book, but the movie was so much worse.<Pete_Iredale>: Agreed. I really enjoyed the book, and thought the movie was awful. Not that I thought the book was some amazing achievement in literature mind you, but it was really fun.", "num_messages": 9, "avg_score": 29.5555555556}
{"start_date": "1532100541", "end_date": "1532260160", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 1144, "text": "<Neo2199>: ‘War of the Worlds’ Series Coming From Fox Europe and Africa, Canal Plus: The show will follow the classic alien-invasion story but set the action in the present day. <CunninghamsLawmaker>: So...the Tom Cruise movie but a show?<TooSmalley>: I actually liked the Tom Cruise one I thought it got the mood of the original novels dead on. <waveform>: &gt; I actually liked the Tom Cruise one Me too, but mainly the build-up at the beginning (because I like scene-setting in scifi). The rest simply didn't bring anything new to the table. What kills interest in modernised WotW for me is the simplistic storyline - that advanced aliens have no frigging clue about microbes. That was a perfectly fine and believable plot *when it was written* - after all, it was only the late 1800's when we discovered that microbes caused disease. The public knew nothing about them. But it's a \\*stupid\\* storyline now, for a modern scifi audience - unless it's set back in those times, in its original context. IMO if they want to set it in the present, they'll need to modernise that plot point - so it makes sense to a modern audience, yet somehow keeping that underlying message H.G. Wells wanted to portray - that we are endebted for our survival to the smallest of living creatures; the microbes, whose power and influence on our lives was first being realised during his lifetime. Otherwise, it's a story of advanced aliens somehow not realising they can't breathe our air. <ED>: I know! Make it a parable about how vaccinations are good for you! The aliens died because they weren't vaccinated against the common cold! Truly a message about microbes for modern times! :) <ED2>: Interesting trivia about microbes! A Dutch textile merchant, [Antonie Van Leeuwenhoek](http://www.bbc.co.uk/history/historic_figures/van_leeuwenhoek_antonie.shtml), was the first person to see \"tiny animals\" (he called them \"animalcules\") swimming in a drop of water, in 1676. Leeuwenhoek meticulously made his own lenses, for closely inspecting high quality linen etc. for his business. Thus he invented the most powerful \"microscope\" (the name wasn't coined yet) at the time, and that would exist for the next century. Made out of tiny, hand-made lenses, embedded in a small copper plate, he built about 240 of them over 50 years, but told nobody his secret of how they were made. He was later made a Fellow of the Royal Society for his discovery of \"animalcules\", what we now know of as \"microbes\". It took until 1876 for a German physician, Robert Koch, to prove that microbes can cause disease - an incredible revelation that completely changes our view of how the world works. Still a strange and mysterious topic 20 years later, Wells is inspired to pen \"War of the Worlds\" in 1895 (which I like to think of as a double-meaning - a war also between the normal world and the microscopic world). <Oolacileoona>: Eh I don't think its unbelievable. They probably knew about the physiology of earth but didnt anticipate all the possible chemical reactions that would destroy them. For all our advanced knowledge of chemistry we still cant anticipate all possible reactions. But I get what you mean. <waveform>: &gt; didnt anticipate all the possible chemical reactions that would destroy them But it wasn't that - Wells writes it was \"the smallest creatures that God himself put on Earth\" - i.e. microbes, disease, as they \"ate our food, breathed our air\". Pretty basic mistake to make for an alien, one would think. Then again, they never bothered testing a planet's air before beaming down in Star Trek either.<DiscoUnderpants>: It was the *point* of the story. The Martians are Victorian Englishmen. They are arrogant, violent and cruel to humans(ie people who arent Victorian Englishmen)<Onanipad>: Where did you get that from?<DiscoUnderpants>: Wells was deeply critical of the actions and behavior of his country. The journalist travels from Woking to London and encounters a pastor and a soldier who are pathetic. The great British Empire is being pounded to dust seemingly without effort. Wells hated the way indigenous people were treated by the empire, barely armed people being destroyed with superior arms and *disease*.", "num_messages": 9, "avg_score": 127.1111111111}
{"start_date": "1543713301", "end_date": "1543789645", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 90, "text": "<Fisherbuck1>: [SPS] Review: Don’t Trust Z Nation <watchcargo>: Had no idea that Z Nation has an upcoming spinoff. Netflix getting in on the Z action!<BrianZFandom>: Yes, Netflix is! I am excited about it. I can't wait to see it. <Fisherbuck1>: The spin off is supposed to be more intense, lots of running and gunning. I can’t wait for it. <BrianZFandom>: That is what I have read also. This won't be anything like ZNation. No jokes. New cast. It will be a different experience. <Fisherbuck1>: I didn’t realize it was no jokes, 🤔 <BrianZFandom>: Yes, it will be very different. It will capture the mood of a very dark time after the Zombie Apocalypse started when food was running out. Think of Cassandra and thr \"family\" she was with. That is what I am imaging part of it will be like. <psaldorn>: Black summer?<BrianZFandom>: Black Summer is the spinoff of ZNation. It is set to release direct to Netflix the Spring of 2019.<psaldorn>: Haha, I didn't realise, I just remembered that's what they called the bad time in the show. <floodlitworld>: Yeah. That was the summer before Z-Nation begins that wiped out most of the (US?) population when the available food was no longer enough to sustain the survivors. <BrianZFandom>: Exactly!", "num_messages": 12, "avg_score": 7.5}
{"start_date": "1543716751", "end_date": "1543775502", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 284, "text": "<kultcinema>: Krull (1983 / Blu-ray) – this sci-fi/fantasy gem from the 80's deserves a second look. <ShadsuX>: Awesome movie is awesome. &amp;#x200B; Glaive weapon is Glaive. &amp;#x200B; Also... 10/10 looking evil soldiers. &amp;#x200B;<isamura>: And young Liam neeson...<ShadsuX>: And a whole lot more! :) Classic British actors in the movie AND... *drum roll* the main actor played Michael Eddington in Star Trek Deep Space Nine who joined the Maquis while he was apart of Starfleet. He looks so different in DS9. :P <ShuffKorbik>: &gt;the main actor played Michael Eddington What the fuck? The walls of reality are crashing down around me. I feel like I just achieved a new tier of geekdom with the acquisition of this knowledge.<ShadsuX>: No kidding eh? :P Like you look at him in Krull and then DS9 and you're like \"Who the what now?\"", "num_messages": 6, "avg_score": 47.3333333333}
{"start_date": "1541454758", "end_date": "1541457468", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 354, "text": "<Justify_87>: 'Ad Vitam' is a sci-fi crime series from france, based on a future where humanity defeated death <oldscotch>: Can't play it in my country, and if I switch the site to English I can't find it - even searching for some of the actors. Found an English-subtitled trailer from TIFF - but this is for the film: <https>://www.youtube.com/watch?v=f7sH3-A9ocg <Justify_87>: I thought it was accessible from outside Europe and that English subtitles are available. Can't play it via yt either?<https>://youtu.be/cPOAIyu3NqA<oldscotch>: Ah, that works - thanks! <Justify_87>: No problemo", "num_messages": 5, "avg_score": 70.8}
{"start_date": "1530199664", "end_date": "1530294092", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 41, "text": "<palindrome_is_not>: So I finally got around to watching \"The Last Jedi\" and it's trash. I think the fans get a lot of crap for expecting too much but if Star Wars didn't exist and that was the first movie in the series I would think it was made by a high school A/V class with a much bigger budget. The writing was horrible, the visual effects seemed unfinished, the plot was at best disjointed and there were so many cliche scenes I wanted to barf. The random cheesey jokes that were put in really just reminded me I was watching a Disney cartoon and the scenes that were obviously made to promote a ride at Disney World were . . .. obvious. The only redeeming attribute was most of the acting was spot on but you can almost tell they were trying so hard to make the bad writing come off as something good. I am not even a Star Wars fan so I can't imagine what the fans are feeling. What a shame. I know I am just heaping on to the pile but I just couldn't get over it this morning and needed to vent. <jeikaraerobot>: &gt;and needed to vent Well, have fun with this counterpoint, then. <Context>: the original trilogy bores me to death, the prequels I haven't bothered with, the seventh movie was less memorable to me than an average Dreamworks cartoon. So then, I absolutely felt that the Last Jedi was doing—successfully—a lot of very clever things plot-wise, e.g. Leia's survival, whatshisface goblin's unexpected death and a whole plethora of other potent story forks where it could really have *believably* gone either way: is she a traitor (she could very well be—or not be), will he *not* go to the dark side (in this movie he very well might), etc. etc. To me, the best thing about the movie is how the plot forks believably (i.e. opens actual, feasible story options before resolving them) rather than stay on-rails and be 100% predictable like the rest of the franchise. Clearly, I look for completely different things in movies compared to you or some Star Wars fans. I value explicitly open-ended stories that seemingly develop right there on the screen—stories that feel *gonzo*—and finding a Star Wars movie that was actually like that bordered on being delightful. The set-in-stone roller-coaster of an average Star Wars movie bores me *to tears*.<WellGoodLuckWithThat>: I guess it was open-ended in the sense that they pretty much killed and nuked anything interesting remaining in the new trilogy, except Leia. So it left the next movie with pretty much any direction to go. But Carrie Fisher died so putting all their eggs in the girl power basket kind of backfired. They won't get to make the episode 9 where Leia helps Rey train a group of ethnically diverse all female Jedi with a few new easy to cosplay aliens thrown in to go take on the last interesting male character and his evil but newly ripped abdominal muscles.<jeikaraerobot>: &gt;they pretty much killed and nuked anything interesting remaining in the new trilogy Like what, for example? To me, the first (seventh) movie was a bland wasteland of pallid *nothing*.<WellGoodLuckWithThat>: Everybody interesting is dead, all that's left are goofy characters and a few Mary Sues. The movie ended and I couldn't really see where else it would go, and at the same time I stopped caring.<jeikaraerobot>: &gt;Everybody interesting is dead What, like in Hamlet? Also, there was *nobody* interesting in the first (seventh) movie to carry over, in my opinion. &gt;The movie ended and I couldn't really see where else it would go But that's a sign of good writing! The Last Jedi wasn't all *that* well-written or anything, but that element is an *upside*, not a downside. A movie is supposed to be completely over by the end. Fishing for sequels is trashy film-making at its worst. Man, we look at movies *so* differently.<BaconBehemoth>: Hamlet didn’t have a sequel.<jeikaraerobot>: You can't be any more wrong. It had numerous sequels, prequels and spin-offs (by different playwrights—*exactly* like like the movie in question), including world-famous stuff by very high profile authors, e.g. Stoppard. Apply yourself, BaconBehemoth.<BaconBehemoth>: Hamlet by William Shakespeare was never intended to have a sequel. The fact that it is public domain, and OTHER people have written \"sequelae\" to it, is irrelevant. SW is episodic. They undercut every single plotline, leaving basically nothing to hang episode IX on. It's junk. Curb yourself jeikaraerobot.<jeikaraerobot>: Good job moving the goalposts from \"*didn't have a sequel*\" ([literally](https://www.reddit.com/r/scifi/comments/8ukg5c/so_i_finally_got_around_to_watching_the_last_jedi/e1hsnj5/)\\) to \"*wasn't expected to have a sequel by the original author*\". I'll allow this for once. So, what makes you so certain that Shakespeare definitely, certainly didn't intend Hamlet in particular to have a sequel? He wrote sequels *and* prequels to his plays. Also, **keep in mind** that the last two Star Wars movies have completely different writers and directors. Completely different people.<BaconBehemoth>: You started this argument by comparing TLJ with Hamlet... Laughable on it's face. I'm done here. <jeikaraerobot>: Your complete inability to uphold your—admittedly nonsensical—point is what's \"laughable on it's[sic] face\".", "num_messages": 12, "avg_score": 3.4166666667}
{"start_date": "1543718966", "end_date": "1543853334", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 17, "text": "<chemicalsam>: What were your favourite moments of Star Wars The Last Jedi? (the credits and or other salty responses are not accepted) <Edit>: I can see angry salters cannot let anyone enjoy things <Rick-burp-Sanchez>: Salty, but I'll be polite. I'm sorry, but I found that movie completely forgettable. Too many plotholes, why didn't the empire just hyperspeed another star destroyer in front of the rebel's frigate? Why did Luke turn into an angry old man? How/why can Leia fly all of a sudden when she dies like two minutes later? Was Po even in the movie? Also, he's not the last Jedi, rey is a Jedi now, right? So... Why choose that title?<SilkyDoll33>: Leia: Doesn't take much motive force to push you around in null g, astronauts use compressed nitrogen so its not like shes flying around like neo, its more like pushing yourself around the wall across the pool. Think the amount of effort it took Luke to grab his lightsaber back on Hoth. You can survive vacuum but you would wind up in the hospital afterwards. <Luke>: created another Vader, and its arguably his fault. He's carrying around massive amounts of guilt and shame. <Poe>: yes. He was the designated dumbass. Last Jedi: it arguably is Luke. He fully intends to be that until almost the very end of the movie when he goes back on it. <Hyperspeed>: too late. By the time Hux realized what was happening he had about all of five seconds to do anything about it. Even if it was a viable solution he flat out didn't have the time to implement it. <Rick-burp-Sanchez>: What do you mean he didn't have time? They were chasing them the whole movie!<SilkyDoll33>: The ship came about and jumped. He didn't know what Holdo was up to until she punched the jump button.<Rick-burp-Sanchez>: Still doesn't answer the question as to why they didn't just hyperdrive another star destroyer directly in front of the rebels.<SilkyDoll33>: Yeah it does. It takes time give commands. Then relay them, then have men on the other ship carry them out. By the time Hux realized what was happening Holdo was jumping. <Rick-burp-Sanchez>: I'm talking about at the beginning of the movie. With an ansible-like communications system, the empire could have easily brought in other ships at the beginning of the chase.<SilkyDoll33>: They didn't feel the need. They had a super ultra mega dreadnaught to swat a couple of cruisers. It would be like calling in a bunch of destroyers when you're chasing a couple of speed boats and a tanker in an Iowa class battleship.", "num_messages": 9, "avg_score": 1.8888888889}
{"start_date": "1544875663", "end_date": "1544894022", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 2, "text": "<rohan690>: Space station astronauts on a spacewalk to investigate mystery hole <an_internet_denizen>: This is science faction.<Seadevil4>: Who put a bong in my ship?", "num_messages": 3, "avg_score": 0.6666666667}
{"start_date": "1543722060", "end_date": "1543767211", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 66, "text": "<Tom3nder>: 15 Best Sci Fi Games of 2018 <Tom3nder>: 1. Deep Rock Galactic 1. State of Mind 1. Ground Runner: Trials 1. Pit of Doomn 1. Battletech 1. Hyperspace Delivery Service 1. Deliver Us the Moon: Fortuna 1. AI War 2 1. Dreadnought 1. Executive Assault 2 1. Star Singularity 1. 60 Parsecs! 1. Breathedge 1. Deep Sky Derelicts 1. Rimworld What do you all think? Some pretty great games came out this year. <kefyras>: Where is Subnautica? Also s this list ordered from best to worst? Because Rimworld is way better then 15 and Deep Rock Galactic I think doesn't deserve 1 place.<gremlinclr>: It's almost like these lists are completely subjective and different people have different tastes. Crazy.", "num_messages": 4, "avg_score": 16.5}
{"start_date": "1544889579", "end_date": "1544986327", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 7, "text": "<sidehammer14>: Ansible alternative? Realistic/plausible term for Hyper/FTL communications? Or is ansible good?<retsotrembla>: James Blish used the term \"Dirac communicator\" in his story *Beep*, which predates Le Guin's usage. I'd misremembered, and thought he'd called it \"ansible\" which shows that if the device has a name, \"ansible\" is it.<redreycat>: Is that the story in which every communication was preceded by a Beep? <retsotrembla>: yes", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1538395493", "end_date": "1538443402", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 459, "text": "<shallots4all>: Ursula Le Guin’s Left Hand Of Darkness Map <Giantomato>: This is truly one of the best and most groundbreaking books ever written. It also shows how gender fluidity really could work in an alternate human physiology.<silverblaze92>: And somehow I do t know the book. Feel like a fool.<Giantomato>: It’s from 1969...Canadian author. It’s a classic but not as known as say Starship Troopers or the Moon is a harsh Mistress <bagboyrebel>: &gt;Canadian author. Ursula Le Guin was born in California and spent most of her life living in Portland, OR.<Giantomato>: Whoops, my dyslexia must have kicked in when I read her bio😅", "num_messages": 6, "avg_score": 76.5}
{"start_date": "1543716719", "end_date": "1543733642", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 3, "text": "<GoosePants72>: How is the “AVP” Double Feature Blu Ray? (Alien Vs Predator) I have the following movies: Alien Anthology (Alien, Aliens, Alien 3, Alien Resurrection) Prometheus Alien Covenant Predator Triple Feature (Predator, Predator 2, Predators) If I get the AVP Double Feature on Blu Ray, will I have ALL the alien and Predator movies? And all that take place within that universe? (Excluding the New “The Predator” movie) Also, how is the AVP double Feature? It contains all the versions of the both alien vs Predator films right? Unrated and all? Thanks.<Ryllandaras>: The Alien and Predator \"main\" series essentially ignore AVP, and in my opinion, that's a good thing. The first one was kind of cheesy and had weirdly bulky predators, the second had a few things that were beyond tasteless for me (and I can stomach a lot). On the technical side, the AVP:Requiem disc in the set seems to be pretty good, the first one only has an MPEG-2 encode (one of the first releases of Fox) - you can read more in the [Blu-ray.com review](https://www.blu-ray.com/movies/AVP-Double-Feature-Blu-ray/111064), and check out the discussion in that site's forum (accessible through the individual movies' review pages). As far as I know, all available cuts of the AVP movies are included in the set.<GoosePants72>: Thanks for this! I think I’ll pick it up. I have heard there they are not that great, but I love alien and Predator so I think I’ll need to complete more of the collection.", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1543719510", "end_date": "1543809349", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 21, "text": "<FictionallyBusy>: Questions on Solaris (spoilers) Last week I watched the original Solaris for the first time. It's an interesting movie, but I don't know entirely how I feel about it. (If it's relevant, I'm a massive 2001 fan.) A few questions on parts I didn't understand. * Why was that long take of driving the highway included? * What happened to the girl who appeared to Giberian? And who was Sartorius hiding? * What was the logic behind the black-and-white sections and color sections? The recording of Burton was in b/w but some later segments on the space station were as well. * What were the structures in the space station corridors? * What happened to the first Hari? Did Kris ever have the option of returning to Earth after blasting her off?<arcticsleep>: The director Tarkovsky is known for being incredibly metaphorical in his filmmaking - everything has meaning behind it, but as you have found it's not always easy to piece it all together. Some may consider this heresy, but I think you should watch the American re-make of Solaris that came out in the 2000s. I enjoyed watching that one more (actually one of my top \"underrated\" films of all time) and it's a bit less obscure in it's messaging. Or there is always the book upon which both are based.<noise-nut>: I am one of the people who loves the Soderbergh version (original too, just as much). Different takes, excellent execution. (Please, nobody touch Stalker!) I read that a new and possibly more correct translation of the original Lem story has been found. Anyone able to confirm? Anyone have a new English translation?<slpgh>: There' a recent translation by Amazon/Audible+a new audiobook that is supposed to be new. &amp;#x200B; It's great - reads like a modern novel. &amp;#x200B; I haven't read the old translation though", "num_messages": 4, "avg_score": 5.25}
{"start_date": "1544895227", "end_date": "1544998464", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 7, "text": "<MSRsnowshoes>: TIF (Today I Found) a sci-fi song<https>://youtu.be/gg2pS9KN28U Does anyone know of any other songs that could be considered SciFi?<kcornet>: Rush's 2112<ElectricZ>: Also [Red Barchetta](https://www.youtube.com/watch?v=FAvQSkK8Z8U)", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1542905420", "end_date": "1542991925", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 29, "text": "<ShoddyDiscussion>: What's one of the most memorable 'random' moments you remember from your SciFi History I was reading the comments on the hitchikers thread and was reminded, yet again, that proper way to fly. It's one of those stray things that has stuck with me for decades after I read it. I'm not talking about 'famous lines' or great scenes, but the small things. For instance, I often say to people \"I talked to god, she said yo what's up\" - most people don't get it I recently started working with a guy named Mitch and when I'm looking for him I often say to people \"You're not Mitch\" - they don't get that either Just some types of things I'm thinking about.<mawkishdave>: Babylon 5, do you buckle then zip or zip then buckle. That one small scene made them so human and relatable. <mattzog>: Sock sock, shoe shoe? Or sock shoe, sock shoe?<Wiinounete>: What kind of maniac does the second?<Khal_Dago>: Dwight Schrute does sock/shoe, sock/shoe.<Icaruswept>: Wait, doesn't everyone do sock/shoe, sock/shoe? I do it too. So do most people I've observed.<mattzog>: Careful careful, last thing reddit needs is another thing to argue about. I mean, your opinion is wrong and you are clearly a bad person for having that opinion, but we shouldn't argue about it.", "num_messages": 7, "avg_score": 4.1428571429}
{"start_date": "1543766004", "end_date": "1543790078", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 154, "text": "<CoreyCharette>: Tackling Novella and Movie before tackling \"Nightflyers\" TV Show So the *Nightflyers* TV is officially out today, us over at [Sci Fi Watcher](https://sayitproductions.com/scifiwatcher) are going to tackle the novella and the 1987 movie before we look at the show. Have you seen either of those? What are your thoughts on them? Love to know and we might use them on the show. The Novella episode will be released this Tuesday and the Movie episode will come out next Tuesday (12/11). Then, we'll be realase 10 episodes of 2 weeks (12/13-12/17, 12/20-12/24) on top of our regular episodes. If you wanna catch us [live](https://sayitproductions.com/live) we record Mondays at 8p Eastern.<OddCaptain>: How does “Nightflyers” tie into Doctor Who? <CoreyCharette>: I have no clue why it pulled that picture. Lol<Lardawgg>: How do you see a novella?<acdcfanbill>: A few words at a time? oh, or... In your head as you read it!<Lardawgg>: Touché you win!!!! Lmao", "num_messages": 6, "avg_score": 25.6666666667}
{"start_date": "1544902472", "end_date": "1544905221", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 9, "text": "<weeklyequation>: The Lonely Island and Star Trek [https://youtu.be/s87jXY4nh-c](https://youtu.be/s87jXY4nh-c)<ShoddyDiscussion>: Wait, that song was about star trek? (I actually have their albums). Didn't know that. Best fake rap band ever, incredibad <weeklyequation>: Not about Star Trek... but I decided it could be lol<ShoddyDiscussion>: Phew I thought I missed something :)<weeklyequation>: I was just sitting listening to music on youtube and it came on... So I started playing around. Thanks for checking it out!<ShoddyDiscussion>: I started looking into them years ago, after DIAB and I read an article about them, started look into it. Some of their stuff is genius. They have a lord of the rings song And of course they did at least one version of everything is awesome<weeklyequation>: Motherlover was just playing... All of this is leading to a Brooklyn 99 binge watch session", "num_messages": 7, "avg_score": 1.2857142857}
{"start_date": "1543772674", "end_date": "1543787180", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 16, "text": "<draw_tippy>: Time travel book suggestion Looking for books on time travel that utilize a machine or object to transport... Specifically I'm looking for the rules by which the machines and the travelers operate.<the_red_scimitar>: *Across Realtime\", by Vernor Vinge<benyacobi>: This is an utterly brilliant book. Never considered it as a time-travel book but I suppose it is - although it's more about people using stasis technology in a really cool way.", "num_messages": 3, "avg_score": 5.3333333333}
{"start_date": "1543775460", "end_date": "1544337437", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 11, "text": "<sidehammer14>: Plausible Hero Ships Millennium Falcon is supposed to be a freighter... the thing is TINY! So is Serenity! I love 'em, I really do, but are they actually viable? A real freighter would be massive, because, why build anything smaller? To be honest, I want you to convince me that they are so I can use them in my writing, so please! What REAL use is a small ship in an interstellar society?<brbATF>: (Speculation, but wide-spread): The falcon itself isn't a freighter, it's the crew cab, and hence where the real valuables are stored for smuggling. The freighter section is [pushed in front of it](http://starwars.wikia.com/wiki/File:YT_freight_pusher.jpg) (Also speculation, and just me this time): Serenity isn't meant to be an inter-planetary freighter. It's meant to be a ship-to-shore kind of boat, able to enter atmosphere where larger freighters can't, retrieve cargo from the surface and ferry it to the larger ship. The existence of the larger cargo ships is revealed in the very first scene of the series, and Serenity's limitations in terms of inter-planetary journeys is painfully demonstrated in Out of Gas. It was in a junk heap and it was what Mal could afford, it does the job but it's not meant for that purpose.<Crocsim_the_Bastard>: I think the solo movie may have dented that theory by including the escape shuttle which closes off the front docking section. Or is that still a plausibility ?", "num_messages": 3, "avg_score": 3.6666666667}
{"start_date": "1543510346", "end_date": "1543782929", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 9, "text": "<qx87>: the three body problem. Which translation, german or english? <zebadoba>: Read it in the original Chinese. It is easy, each character is a word, so using your Lexicon is fast and easy! But seriously, what is your native language? Chinese translated to English and then read by a German mind? Or just Chinese to German read by a German mind? And I just started book two, so my critique is limited, I found book one technically good, but only OK in it’s writing style. Kind of dry, kind of slow, but still good. Book two is more rich in style and character development. <qx87>: Am german, but read english mostly. just wanna read the 'better' translation. it's a fringe question though<zebadoba>: I am back again, and just finished the Dark Forest of the TBP series. But some of the comments /u/itisisidneyfeldman makes in their post are really relevant as I was reading the second book. This is not a spoiler, but in the second book there is a reference to an \"anti-trigger\" system, something a native American English speaker (not assuming about the Brits) would simply call a \"dead man switch\". Easy cultural reference, \"the man dies, the switch flips states\" is a very common understanding. BUT, Ken Liu did not take the easy way in this translation, but refers to it as a \"cradle system\", and deftly explains that the cradle system is like rocking a baby in a crib. As long as it is rocking, the baby does not wake up. I think this was done for an accurate translation but keeping the Chinese cultural reference in place, vs. just Americanizing the translation. Also, in my opinion, book 2 was amazing compared to book 1. Book 1 is good, but can be a bit dry, but it lays a lot of foundation. Onto book 3!", "num_messages": 4, "avg_score": 2.25}
{"start_date": "1543790545", "end_date": "1543974706", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 281, "text": "<Spaceman1965>: Perry Rodan <AttackTribble>: I read a lot of these as a kid. I'd forgotten about him. Thanks for reminding me.<Spaceman1965>: Ur welcome, I hope that you enjoyed reading them back in the day. <AttackTribble>: I did. When I have time, I'm an absolute book sponge. I recently did a California to England trip. I finished three books on one of the flights. Caught up on movies on the way back.<Spaceman1965>: I have read a few books on airplanes myself, once to a trip to the Philippines. <AttackTribble>: Oh, I would love to go there some day. Almost all my flights are back to England though because that's where I'm from. I absolutely love London.<Spaceman1965>: Oh I see, it has been over ten years since I have flown internationally. <AttackTribble>: Out and back, once a year. It used to be a total pain, but I've got used to it. Books and movies are wonderful things.<Spaceman1965>: Yes they sure are.", "num_messages": 9, "avg_score": 31.2222222222}
{"start_date": "1543802536", "end_date": "1543930906", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 25, "text": "<Pawin3210>: Are there any real instances of \"Tony Stark was able to build this in a cave with a box of scraps\"? It would be cool to see someone beats 100 to 200 people brains.<blackwe11_ninja>: Apollo 13 crew managed to create device that allowed them to use CO2 filters from command module in lunar module. They made it from duct tape, flight plan covers, socks and other stuff that was around, while they were already showing symptoms of raised CO2 level.<cr0ft>: While that certainly was a clutch moment that probably saved their lives, it's not quite the same as one guy building the Iron Man suit from scrap. Especially since the entire ground crew brainstormed how to do it using the parts available to the astronauts. If anything, that proves the opposite of the one guy in the cave thing - it proves that cooperation and working together is the only way to really get shit done in the world. <zeldn>: It’s not the same as building iron man, but it was also... you know. actually real. It’s the closest you’re going to get to the kind of setup in iron man, extremely smart people building a high tech device to save their lives using just what’s available. They also had hours and were being poisoned, which I’d argue more than makes up for the extra brainpower.<YotzYotz>: The point is, the Apollo crew themselves did not figure out anything there. They received a ready-made instruction set and just needed to follow it to the letter. The \"high tech\" was plastic bags, cardboard and tape. <zeldn>: I mean, they were also not held hostage by terrorists, and none of them had the iconic mustache. I just think asking for real world equivalents of \"Super genius inventing free energy device and giant flying rocket shooting mec suit while dying in a cave\" and then complaining when the closest real world equivalent turns out to not be a perfect parallel is just a little.. Picky? Like, what do they expect, \"Oh yeah I guess Apollo 13 doesn't work at all as a real world equivalent, but there WAS that other thing where someone guy build a mec suit in a cave\"? Also high tech does not mean \"complicated with lots of blinking diodes\", but sure, CO2 scrubbers are arguably not cutting edge for the time.", "num_messages": 6, "avg_score": 4.1666666667}
{"start_date": "1543807587", "end_date": "1543855473", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 16, "text": "<WitherTax>: Favorite Space battles? I did this a few months back- And i'll probably do it again next year, but I've watched a few new shows, and I would like to add them to the mix. 5. Battle to retake Deep Space Nine- Operation return ( Star Trek: Deep Space Nine ) 4 ( Tied ). Battle of New Caprica ( Battlestar Galactica: Remastered ) / Battle of the Resurrection Ship ( Battlestar Galactica : Remastered ) 3. Battle with the Omega enhanced destroyers ( Babylon 5 ) Seriously... I couldn't find a NAME for this one. 2. Battle of Babylon 5 ( Babylon 5 ) Is that what it's called? Or is it something else? I call it Battle of Babylon 5... SUE ME... Honorable mentions- Battle of the Ionian Nebula ( BSG: RDM ) Battle for Proxima III ( Babylon 5 ), 2nd, and 1st battles of Deep Space Nine ( Star Trek: DS9 ), Battle of Scarif ( Star Wars: Rouge One ) 1. Battle of Endor ( Star Wars: Return of the Jedi ) &amp;#x200B; I could make this list as long as--- as ah- as a python? Screw it- Anyways, what do you think of my list? Am I insane? Or am I barely within the boundaries of sanity? There-- There is no in between...<ArvilTalbert>: Star Trek TOS -- Balance of Terror<WitherTax>: I loved that... Damn I forgot about it. I loved how they did the whole submarine-style warfare. <Captain-matt>: I remember reading that it's based on an old WW2 submarine movie !<Kenbritz>: That would be *The Enemy Below* by DA Rayner, made into a movie of the same name starring Robert Mitchum and Curd Jürgens. Coincidentally I’m writing something along those lines, building on my own military background. *Balance of Terror* loses some of Rayner’s suspense (since being Star Trek, Kirk can’t lose) though Mark Lenard’s performance shines.", "num_messages": 5, "avg_score": 3.2}
{"start_date": "1530819361", "end_date": "1530900645", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 878, "text": "<the_dayman>: Netflix has a fair number of original scifi movies out now, which ones are actually worth watching? I tend to forget to check netflix movies for a few months at a time since I never end up finding something I want to watch, but recently I checked the scifi category and saw they had like 7 or 8 Netflix Originals that all seemed mildly intriguing. However after watching Spectral, Cloverfield Paradox, and Mute it seems a bit like like they don't really know how to do scifi beyond cheesy b-movie level. Annihilation was good, but I think that was only distributed by them so I don't know if it falls under their \"originals\". So just wondering what anyone thinks of any of the others they've watched.<beneaththeradar>: in my opinion, none of them. I've been sorely disappointed with all of the Netflix original sci-fi and fantasy. Especially *Bright.* God, that movie was awful. <monty845>: I thought Bright was great!<beneaththeradar>: it just felt extremely derivative. like it could have been titled *Shadowrun: The Movie* <WhiteRaven42>: Don't see how that makes it awful. How can it be derivative if no movie has ever actually covered this niche before? What you are saying is that the material is familiar from other media. Okay. It's material that deserved to be brought to film. I don't get it... are you saying a movie reminiscent of Shadowrun shouldn't be made because... why?<beneaththeradar>: sure, maybe this material deserved to be brought to film. however this film in specific did -in my opinion- a really poor job of doing that. the acting was bad. the plot was extremely predictable. the movie was full of clichés. it felt like the director was just trying to see how many explosions, machine guns, and hand-to-hand combat sequences they could fit in a movie. I would love an actual Shadowrun movie *if it was done well*<Geta-Ve>: Wat? Wut? Wah? Did we watch the same movie? I don't think the movie was necessarily trying to be unpredictable. It sets the tone and pace of the adventure very early on and proceeds to accomplish exactly what it said it was going to. I am interested in which cliche's turned you off? Further to that, which action pieces did you find to be unneeded and useless? Most of them seemed like the logical progression of events. <beneaththeradar>: It's a shit movie. I'm not going to convince you otherwise, and you're not going to convince me otherwise. Agree to disagree.<Geta-Ve>: I am not looking to be convinced otherwise, why would I need to be if I am the one who enjoyed it? I am simply looking to see if you can validate your points with any meaningful details. Your criticisms were all vague and nondescript. I could copy and paste your comment onto literally any other movie. I don't care that you didn't enjoy it, enjoyment is highly subjective; what I do care about though is criticism without explanation. All anyone seems to be doing is either comparing the film to Shadowrun or saying arbitrary things that could be applied to anything else. *shrug* ah well.<beneaththeradar>: I'm not interested in spending the time explaining in minute detail why a bad movie is bad. I am not a film critic, just some guy on the internet that didn't like a thing you did. It happens.<WhiteRaven42>: The problem is, we get the same non-answer from everyone that shits on this movie. Getting real tired of generalities and innuendo that I can't tie to anything I actually saw in the movie.<beneaththeradar>: cool story, I'm not obligated to explain why I think a move sucks in detail and feel disinclined to do so for people that are obvious fanboys for it. there's no point. it's like trying to convince someone who voted for Trump why he's a bad president.", "num_messages": 12, "avg_score": 73.1666666667}
{"start_date": "1543819359", "end_date": "1544061892", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 10, "text": "<MiddleAgedGeek>: Doctor Who 11.9, “It Takes You Away”... <lord_wright>: not too good. had potential then didnt....<saucyweasel>: This season or just this episode? I watched 3 or 4 and just cannot find the interest to watch more<lord_wright>: rosa parks was interesting, except the baddie.. the demons of the punjab was , but the baddie wasnt, i cant remember most of the rest as terrible. the thing that ate the ship with the butt. the kids loved that part as wsant scary it made them laugh. i know this cos i was woken up at that point.. yes i fell asleep a few times this season.. granted all seasons have had their clunkers. obvious ones are the moons a egg and flys off at the end and the the eye sleep gunk monters..", "num_messages": 4, "avg_score": 2.5}
{"start_date": "1543821748", "end_date": "1543880133", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 658, "text": "[deleted]: Should HBO introduce the Mass Effect universe to the mainstream? [deleted]<nerdshark>: I mean, they could, but seeing as how Mass Effect is probably dead as a franchise, I doubt they will. Also, considering that The Expanse is a thing right now, a Mass Effect show probably would be seen as a copycat riding its coattails. &gt; How would the mainstream react to a graphic \"romance\" scene between a human and Asari? Probably just as well as they would react to a person with a furry.<carlio>: &gt; would be seen as a copycat By whom? I suspect that Expanse fans and Mass Effect fans have a lot of overlap so there'd be a small minority that would be ignorant of the different provenance and IP. Besides, the stories aren't particularly similar and nobody ever said 'let's have no more things similar to Star Trek'. &gt; probably dead as a franchise Any links or info about that? I didn't play Andromeda much so I can believe this, but I haven't kept up with news to know either way. Would be interesting to read about.<AKA_Sotof>: &gt; Any links or info about that? I didn't play Andromeda much so I can believe this, but I haven't kept up with news to know either way. Would be interesting to read about. <ME>:A tried to revive the rotten corpse of ME3 and failed. They literally tried to go to another galaxy to avoid dealing with that massive fuck up of an ending and somehow still failed.<theCroc>: ME3 was great, except for the lackluster ending. There should never have been a choice. Only destroy. And also cut like 90% of the overly pompous dialogue with the starchild. If you assume the \"Destroy\" ending is canon, there is a lot you can do with the recovery of galactic civilization. The mass relay network is damaged but not lost. The galaxy has united against the reapers, but now reconstruction will start. Old conflicts come back to the surface and new challenges come from the resurgent Krogans, and the Quarians settling their homeworld again for the first time in 300 years. The various sides will all race to salvage the remains of the destroyed Geth and Reapers in order to gain a technological edge over one another. Can the citadel council be reestablished? How much of the galaxy can they control with the network down? I could see one conflict center around what relays get repaired first. Also the new location of the citadel in orbit around Earth will bring accusations that Earth get favorable representation in the council. Meanwhile thousands of systems will be out of reach of a functioning relay, and unlikely to see a repair crew in a long time as repair is expensive and difficult and precious few have the expertise needed. A few decades later and these systems will be all but independent with massive piracy problems as relatively few vessels have the capacity to generate their own mass effect field for galactic travel. I see this as a universe with huge potential. Instead of Andromeda we should have seen new characters in this setting on new adventures. But that would require the original studio run it and not the paired down new studio they pushed Andromeda on.<AKA_Sotof>: I agree that if they had not gone with the starchild and done a suicide mission last arc then the game would have been good, but they didn't and they're not ever going to. As it stands that ending utterly ruined 3 excellent games and it deserves all the hate it gets. That said, I actually liked Andromeda for what it was. It wasn't spectacular which isn't good for an ME game, but it was good fun aside from that. Though, I really wish they would've nailed Andromeda better - it had a lot of potential it did not quite live up to. As for the continued Milky Way story... It's going to take a lot of work to recover from the giant pile of shit that is ME3s ending.<MoonPieMoney>: &gt; that ending utterly ruined 3 excellent games Hyperbole. The last five minutes of one game did not ruin an entire triliogy. People like you and your tantrum* \"ruined\" it for yourselves.That's like claiming a bad remake somehow ruins the original work. Calm down.<AKA_Sotof>: &gt;Hyperbole. The last five minutes of one game did not ruin an entire triliogy. If the Lord of the Rings ended with Frodo having to pick a colour at Mt. Doom then you'd see that the two previous books were ruined as well because everything leads up to that and you know it does. &gt;People like you and your tantrum* \"ruined\" it for yourselves. You know that ending is flawed as fuck. People were absolutely right to be pissed off at it. &gt;That's like claiming a bad remake somehow ruins the original work. It's not a remake you drooling moron. It's the original work. There's no great original to look back on. &gt;Calm down. You're the one getting personal over criticism of a game.<MoonPieMoney>: Okay. Whatever makes you happy.<AKA_Sotof>: At least you didn't waste my time further.<MoonPieMoney>: Sh. You need a hobbby.<AKA_Sotof>: I got plenty. Bye.<cryo>: What? Stating opinion as fact? :p<AKA_Sotof>: And where did I do that? Oh right, I didn't.", "num_messages": 14, "avg_score": 47.0}
{"start_date": "1544913774", "end_date": "1544917407", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 7, "text": "<c4cynic>: Shameless Scifi Song Self-Promo Saturday Punkish scifi song about wanting a cute lil Rosie Jetson and a tribute to Fahrenheit 451: <https>://open.spotify.com/album/1jzryWEi2NO9LcYFPbWN4I?si=Ra6i0OCPTJ-9gvNhG6vj-w<TashaReg>: I even like the not punk one at the end :D<c4cynic>: Thanks! We did one for a horror movie too that's on there: Beware of the Klowns<TashaReg>: Ooooooooooooooo that one's nice too<afromn232>: I'm glad you enjoyed it! Thanks!!", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1543835615", "end_date": "1543888644", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 7, "text": "<enkkidu>: Looking for good Japanese Sci Fi books Hi, could you recommend me a good Japanese Sci Fi books that have decent translations to English ? <potatolulz>: Koji Suzuki's Ring/Spiral/Loop trilogy Kobo Abe's The Face of Another<_Endif>: Koji Suzuki! Love his books. Very much worth the read.", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1544916830", "end_date": "1544994736", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 17, "text": "<Michael_Dinich>: [SPS] 9.5 Reasons Why A Sharknado Movie Will Be Biting Back Soon <MostDefNotTheFBI>: I agree on the reboot. The series needs a fresh start to being in new viewers for sure. <BrianZFandom>: That was my thought. Plus their production costs would go down with a brand new cast. <MostDefNotTheFBI>: Any idea what their production costs have run on their last few?<BrianZFandom>: Not exactly. Mixed #s on wiki and other sources. But in general The Asylum is known for having some of the lowest production costs in the industry.", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1543845582", "end_date": "1543894859", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 690, "text": "<NinjaSwag_>: I've seen Blade Runner, Ghost in the Shell, Akira and I love them - What should I watch next? Wow this post really exploded: Thank you all for your great recommendations, my goal is to watch EVERYTHING you posted :) Thanks!<PIP_SHORT>: Altered Carbon, try to get past the bad acting because there's some really cool sci-fi concepts and fantastic worldbuilding. <drdeadringer>: When was there supposed to be bad acting in Altered Carbon?<SciFiJesseWardDnD>: Yea that is weird. I never thought anyone's acting in the show was bad. Including the sister.<RedundantTautology>: The only gripe I had with the series was the side story where raped and killed virtual girl gets her redemption by becoming super badass and no one addresses the implications of a virtual entity without the restrictions AI characters had.<psclafani>: She wasn’t AI. She was raped as a human but had here body destroyed and her stack was “lost”. This was central to the theme of how the stack technology and sleeve system can be abused. <Mirror_Sybok>: Also Poe was such a great character. It's refreshing to see an entirely artificial AI represented that is a good entity that cares for others. <pazz>: I felt so had for Poe, he seemed be programmed to need to be appreciated but then society's attitude towards his kind of AI changed and he was viewed as a creepy relic of the past doomed to suffer indefinitely in a culture that could never appreciate him again.", "num_messages": 8, "avg_score": 86.25}
{"start_date": "1544919297", "end_date": "1544935784", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<DysguCymraeg5>: Looking for book recommendations I'm after some new scifi books and thought I would ask here, as Goodreads algorithms are crap. I haven't read loads of scifi, but I'm not really after big space battle-style novels or YA novels, but more weird/dystopia books. I really enjoyed Time Out of Joint by Philip K. Dick (also some of his short stories and DADOES), Brave New World, Fahrenheit 451, 1984 etc. I tried reading Foundation by Asimov but found it a bit boring and the writing style jarring (don't hate me). Hoping I can get some good recommendations. Thanks!<EchoFoxT>: Starship Troopers is a pretty good book. Kind of dystopian if you read between the lines. <DysguCymraeg5>: Thanks, I've seen the film, will that ruin it?<EchoFoxT>: Nah, I don’t think so. Quite a few things are different from the movie but not enough to make you dislike one or the other.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543846313", "end_date": "1543849399", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 4, "text": "[deleted]: What would be interesting to see in space opera [deleted]<1leggeddog>: There is a bit of that already in the show The Expanse, with a huge generational ship built for mormons to reach a planet outside the sol system. For it actually happening irl, i have doubts. But as a plot element, it's possible. I'm imagining a kind of spatial anomaly where a bunch of those ships are sucked into another part of space and have to work together to survive in a new, uncharted and hostile place. And they each bring something to the table the others needs to survive.<Tidemand>: Yes, but that's a generation ship. And it is only Mormons, no others. And they have their ship stolen from them. All concepts about how they end up in the hypothetical situation is possible. <1leggeddog>: Oh i only mentioned the ship because im a huge Expanse fan :p", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1544486104", "end_date": "1544927197", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 12, "text": "<culll>: Books about alternate history I'm looking for something to read about alternate histories, particularly what if Europe hadn't colonized most of the world and other cultures were able to develope without influence.<DanglingDingleberrys>: Eric Flint's 1632 series is an interesting look on a Europe changed drastically in the 1600's.<beamin1>: Excellent story here, exactly what op asked for! <DanglingDingleberrys>: And you can continue in it as long as you want", "num_messages": 4, "avg_score": 3.0}
{"start_date": "1544920831", "end_date": "1544978635", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<eliotpeper>: [SPS] My new SF novel pits tech platforms against nation states My new novel, Borderless, is out: [https://www.amazon.com/gp/product/B07BM7F9SF/](https://www.amazon.com/gp/product/B07BM7F9SF/) Borderless is a speculative thriller about a refugee-turned-rogue-spy navigating a geopolitical labyrinth through a near future where information is power and whoever controls the feed rules the world. Lush, nuanced, and philosophical, the story grapples with the decline of the nation state, the rise of tech platforms, and reconciling sins of the past with dreams of the future. Craig Newmark calls it, “A riveting cautionary tale about how the control of information could lead to new forms of democratic governance, or to accidental empires. Rooted in the current realities of the internet and social media, Borderless explores a near future in which our lives are shaped without our conscious consideration.” Unlike any other book I’ve written, Borderless had a title before I sat down to draft chapter one. The dismantling of borders is a powerful theme in my life, and I began to recognize it beneath the surface of the headlines. The characters, plot, and world gravitated around this core idea before falling into place as I made my way through the manuscript. I am a child of immigrants. My father is from Holland. My Jewish paternal grandfather was one of the only members of his family to survive World War II. He hid in a secret compartment while Nazi patrols searched their cramped apartment. Meanwhile, my paternal grandmother, a Protestant, became a secret agent of the Dutch resistance, ferrying information, supplies, and people out of the camps, even as she raised and protected her family. They fled to the United States when they worried that the Cold War might devolve into a third World War. My mother is from Vancouver. Her family immigrated to Canada from the Orkney Islands north of Scotland, and for them, British Columbia must have felt tropical. I have many fond memories of scrambling over rocks and sneaking through forests on Vancouver Island with my cousins. And, of course, huddling around the monitor’s glow to play Final Fantasy VII while our parents shook their heads in bewilderment. My wife is from Colombia, and her family escaped the drug violence that plagued Cali by moving to Connecticut. Just before I embarked on Borderless, we volunteered with a local resettlement agency to host a Ugandan refugee in our home in Oakland. The initial commitment was for three months, but Marvin ended up staying for nine months and became a dear friend. We’ve learned an enormous amount from each other, and he continues to find it quite odd that my “job” is writing books. As I prepared to write this particular book, I couldn’t help but notice how different our world today is from the one my grandparents inhabited. Baby pictures from friends living in a far-off Austrian village greet me when I go online after my morning coffee. A momentary uptick in Sri Lankan tea prices zips through global markets at the impossible speed of high-frequency trading. We can fly halfway around the world only to board an on-demand car service and stay in a stranger’s apartment complete with an unfamiliar toilet and a friendly list of local tips taped to the fridge. While I worked my way through the rough draft, more modern oddities presented themselves. I used Google Maps to track the trajectory of a character's flight to and from the Arctic. I played around with a research tool that projects the impacts of sea-level rise on specific urban areas. I discovered the beautiful true story of the Golden Record via Maria Popova’s peerless blog, Brainpickings. Just for fun, I backed a Swedish artist’s Kickstarter project and began a collaboration with a designer living in Argentina and an illustrator living in New Zealand. My grandfather spoke Esperanto, but he would never have recognized this weird dimension we insist on calling “reality.” Cars, telegrams, planes, phones, trains, broadcast media, and container ships made the world smaller. Now the internet is stitching the strange, scary, and wonderful pieces together into a single civilization. Unfortunately the results aren’t always pretty. As I write this, authoritarian populism is rearing its ugly head, hate-mongers dominate the news cycle, and a country of immigrants is beginning to turn away people like Marvin. This is something my grandparents would recognize in a heartbeat. Fear at an uncertain future is all too understandable. Technology isn’t just making our national borders more porous; it’s shifting the borders of the twentieth-century social contract and causing a lot of people a lot of suffering. But letting fear get in the way of reason leads to ruin. Civilization is more delicate than it seems, and unlike previous civilizations that were geographically limited, this is the only one we’ve got. Progress is painful. We use technology to do work we would prefer to avoid, and then need to make up new jobs for ourselves. We enjoy the cheap prices made possible by offshore manufacturing, and then realize we can’t enforce social or environmental regulations across the supply chain. We download entire libraries of pirated music, and then discover we must support artists if we want more of what we love. Problems beget solutions beget new problems. The snake eats its tail, and we go round and round again. But that doesn’t mean things don’t get better. Child mortality, infectious disease, poverty, and violent death are at all-time lows. Literacy, longevity, and scientific knowledge are at all-time highs. There isn’t a time in all of history I’d rather live in than the present, and there’s nothing more important than doing our part to build a better future. When I finally reached the end of the rough draft, Diana, the protagonist, had become a close friend. As a quirky and dangerously competent spy, she was enormous fun to write. Chapter by chapter, she developed a stronger and stronger sense of agency until I felt like I was documenting her adventures rather than inventing them. Diana proved herself to be the kind of person who doesn’t shy away from hard truths, who confronts and overcomes her own flaws, who aspires to serve rather than rule others, and who fights through all the madness and pain that life throws her way in order to do what she feels is right. I have a lot to learn from her. Perhaps we all do. Thank you for reading. I put everything I have into this story, and if you’re still with me, I can only hope that it will resonate with you. As in so many other arenas of life, the borders delineating the publishing industry are changing fast. But there’s at least one thing that’s as true as ever: writers write manuscripts, but books succeed thanks to the support and enthusiasm of readers. If you enjoy Borderless, please leave a review and tell your friends about it. It may feel insignificant, but nothing is more powerful than word of mouth. Onward and upward. Here's the book: [https://www.amazon.com/gp/product/B07BM7F9SF/](https://www.amazon.com/gp/product/B07BM7F9SF/)<dyrtdaub>: Your family history is amazing... I’m happy it’s so much a part of you.!!<eliotpeper>: Thanks! It's shaped the person I've become.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1544453711", "end_date": "1544475292", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 177, "text": "<lluckya>: What are your favorite invasion stories or movies? I’m watching “The Darkest Hour” right now and have been mentally sorting through a list of the stories and movies I loved in the same vein. Outside of some the obvious (Battle LA, War of the Worlds), what stories or movies may I not have read or seen that are worth checking out?<siilkytofu>: movies with an invasion (some alien and some alien adjacent): Cloverfield (2008) Attack the Block (2011) Extinction (2018) Pacific Rim (2013) Edge of Tomorrow (2014) that’s all i can think of at the moment <lluckya>: Solid list! Thank you. The only one I haven’t seen yet is Attack the Block. <Kriggy_>: You better do it asap. Its hillarious. Bring some friends and beer for more fun<lluckya>: Hilarious like the masterpiece known as Evolution starring David Duchovny?<hawttdamn>: Thanks I totally forgot about that one. Time to watch it again.<lluckya>: One of the greatest comedies ever made (regarding amorphous/changing aliens)!<RandomFlotsam>: Not to mention containing important advice on how to keep your hair lustrous and dandruff free.<lluckya>: ❤️", "num_messages": 9, "avg_score": 19.6666666667}
{"start_date": "1544495598", "end_date": "1544500372", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 42, "text": "<ShoddyDiscussion>: ‘Toxic Avengers’ Movie Reboot In Works At Legendary - JUST NO! <jessek>: Who the fuck watches The Toxic Avenger and thinks \"this would be improved by a higher budget, CG and competent acting\"? The only reason to watch it, and any Troma movie is because it's a weird zero budget fiasco with goofy practical effects that's acted by what looks like a local community theatre group, that's all of the charm it has. <ShoddyDiscussion>: If someone buys the rights to student bodies i'm burning hollywood to the ground. TO. THE. GROUND.", "num_messages": 3, "avg_score": 14.0}
{"start_date": "1544964008", "end_date": "1544966851", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 22, "text": "<boomtekd>: Looking for book recommendations similar to Tau Zero I love hard sci-fi, and especially books like Poul Anderon's Tau Zero and Greg Bear's Anvil of Stars. However, I am struggling to find other books like this(granted this search did link me up with the Hyperion Cantos which was fantastic, but not the same type of book). So, if anyone has any recommendations I would greatly appreciate it. Thanks!<dleeschro>: I am unfamiliar with Tau Zero and look forward to checking it out as hard-science fiction is my favorite. Kim Stanley Robinson writes great hard-science fiction and does a great amount of research. Some stories are near future, some are set in the distant future. He has also written an alternative history called the Years of Rice and Salt and a book about a caveman called Shaman. The Mars Trilogy is his most famous work. Red Moon was just released and is about China colonizing the moon. I have yet to read that yet. <harpagos>: I like both KSR and Poul Anderson, but they practice very different forms of hard sci-fi. Not least, KSR is a socialist who's interested in human community structures, and Anderson a libertarian who likes star drives.", "num_messages": 3, "avg_score": 7.3333333333}
{"start_date": "1543860451", "end_date": "1543877247", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<kaysea112>: Can you recommend a book series from this decade? Looking for new series to get into. The last series of books I read was the Destiny's crucible. It's about an alien species who transplanted humans to a new world thousands of years ago. Now in the 2000's after an airplane accident an alien transplants one human into the other world. It was a very good read.<HariSeldonPlan>: Alastair Reynolds' Revelation Space series! I think it is considered more \"hard\" sci-fi with a cyberpunk twinge. It consists of several mainline books and a bunch of smaller short stories with first one written around 2003 (I think). It is deeply engrossing. <EDIT>: I know you said \"this decade\" and I wrote 2003, but the latest book in the series was just released last year, so I still think it qualifies :)<Master0fTricksterity>: What did you think of the use of nanotech in that series? Is there much exposition on its uses? (I've not read the series, thinking about doing so)<HariSeldonPlan>: I would say it's pretty pervasive throughout the series. Just about everyone in the series has some level of augmentation, implants, nano \"meta-chines\", etc... There is quite a lot of discussion about the capabilities and possibilities nano-tech makes available. Without giving away too much, there is even a nano-tech based cataclysm affecting a wide swath of humanity. The descriptions and affects are all pretty detailed. If that is the kind of thing you like in your sci-fi, there is plenty of nano-tech to go around in that series. Highly recommend it<Master0fTricksterity>: That's my kinda sauce, yes. and thank you.", "num_messages": 5, "avg_score": 1.2}
{"start_date": "1543104127", "end_date": "1543114406", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 10, "text": "<Michael_Dinich>: [SPS] Walker Stalker Con: My Biggest Mistake Ever! <DeadlyShogunate>: Went to Walker Stalker Dallas one year. It was alright, but it was like somewhere between 60-90 bucks to get Chandler Rigg's autograph. Just expensive af for all the stars there. Something about the venue making them do it? I don't remember. So instead I got three of the guys from Comicbook Men to sign a comic for 30 total. Much better deal lmao<Michael_Dinich>: Wow that’s crazy!", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1544542442", "end_date": "1545213754", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 4, "text": "<finer_life>: Eerily accurate and far off the mark tech predictions in sci-fi films From self-driving cars in Total Recall to Back to the Future's hoverboards, drones and self-tying shoelaces - have a look at this entertaining list [https://www.compelo.com/technology-inspired-by-films/](https://www.compelo.com/technology-inspired-by-films/)<spacednlost>: Aelita Queen Of Mars was released in 1924 and had rocket propulsion many decades before it happened. (Wright Bros. first flight was in 1903, so this was a big leap for a movie)<LonesomeDub>: Also Fritz Lang's \"Frau im Mond\" (1929) influenced German rocket deseign which ultimately became NASA rocket design. Even the idea of a count *down* to lift off comes from there.<spacednlost>: Thanks. I'll look for that. <finer_life>: :)", "num_messages": 5, "avg_score": 0.8}
{"start_date": "1544911419", "end_date": "1545080829", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<lindseycharlie>: Free (Until Dec. 20) Sci-Fi E-book In honor of self promotion Saturdays, here's a link to my free e-book. Fun sci-fi about the next American Civil War with a cool surprise ending. Give it a go here: [https://www.amazon.com/Cabra-Lindsey-Charlie-ebook/dp/B01N77TYU8/ref=sr\\_1\\_1?ie=UTF8&amp;qid=1544910561&amp;sr=8-1&amp;keywords=cabra+lindsey+charlie](https://www.amazon.com/Cabra-Lindsey-Charlie-ebook/dp/B01N77TYU8/ref=sr_1_1?ie=UTF8&amp;qid=1544910561&amp;sr=8-1&amp;keywords=cabra+lindsey+charlie)<AaronKClark>: Suprise ending? The south wins this time?<lindseycharlie>: haha i can't give it away cause it's definitely the coolest part of the story, but i hope you like it<AaronKClark>: Thank you!", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544981971", "end_date": "1544991630", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 49, "text": "<prasanthvi>: Baby born following uterus transplantation from diseased donor | Health consciousness Science. <FedoraLa>: Deceased. <Needless-To-Say>: To be fair, the article says diseased 3 times and deceased only twice. (Correction) both are said 3 times<kinnaq>: Wow. Let's not upvote such a piss poor source, people.", "num_messages": 4, "avg_score": 12.25}
{"start_date": "1544027450", "end_date": "1544050569", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 482, "text": "<neeve____>: Are there any sci fi books that are especially good on audiobook? Anything with a narrator that really makes it awesome? Sci fi of any kind to listen to on airplanes! thanks for your help :) <Edit>: wow thank you all so much for your responses! You guys are amazing, I’m looking forward to digging through your suggestions and trying some out! ❤️<abeuscher>: - The Expanse books are excellent, except for book 2 or 3 where they made the Martians British for some reason. - Hyperion and Endymion by Dan Simmons are both very well made as are their respective sequels. - The Ender Series, especially the 20th Anniversary edition of Ender's Game are probably top 3 or 4 audiobook series of all time for me. Card says in the afterword of the above mentioned book that audiobook is his intended format. So he spares no expense and puts a lot of time and effort into all of them. Highly recommend if you can get past Card's shortcomings as a person.<RidePlanet>: I will second the Expanse as read by Jefferson Mays. I've listened up to Cibola Burn and thoroughly enjoyed how he's captured the characters. There's slips in accents occasionally, but he nails the Belter Patois.<Sekh765>: His Avasarala is still my favorite. I'm glad people rioted enough to get him to come in and record for Cibola Burn. The original guy was awful.<RidePlanet>: Shohreh Aghdashloo instantly became Avasarala once I saw her in the show, but the audio book was still a great rendition.<Sekh765>: She really is amazing in the show, I just wish Shohreh was allowed to have the original dialogue with all the extremely amazing swears from the books :(<RidePlanet>: She is a bit of a neutered character in the show.<AxezCore>: Rumor has it that the move to amazon will allow her to be a bit more colorful in her speech.", "num_messages": 8, "avg_score": 60.25}
{"start_date": "1544992304", "end_date": "1545013373", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 477, "text": "<Morgan-delty>: Looking for a good sci fi novel that takes place underwater/in the ocean Am fairly new the sci fi genre and am on the hunt for any great sci fi books that take place in the ocean or any aquatic environment. Any recommendations would be great! Loved the H.G. Wells short story “In the Abyss” <TheKnightMadder>: Rifters by Peter Watts is about a bunch of people working in an abyssal level sea base. It's very 20 minutes into the future biopunk, in that the divers have been modified to be able to survive swimming around there with minimal equipment, some even feeling more comfortable out there in the pitch dark freezing water than inside the claustrophobic hull of their seabase. I'm pretty sure it's free too. If you've played SOMA, SOMA feels sometimes like a game made by people who'd just marathoned a combination of Rifters and Black Mirror.<neonbliss>: If you liked SOMA, how did you find rapture in bioshock?<TheKnightMadder>: I mean, really the only connecting theme is they're both underwater. And in honestly SOMA does underwater properly, while Rapture doesn't feel particularly real at all. Still love Rapture though. Art deco is incredible. I wish I had a superpower where i could shoot an art deco beam out of my eyes and it'd redecorate things. Actually, scratch that, I want the 'neo-deco' from PREY's setting Talos-1. It's very much a modern rapture in a space station. <neonbliss>: I’ll definitely check that out, thanks for the hint. It’s been a while since I played bioshock and you are right it’s not 20 min in the future more like 20 min in Alternative past. I still loved the idea of it being under water in that deathtrap-secret kind of way.<TheKnightMadder>: Oh, Prey? It's 50% off right now I think. It's very much Dishonored meets the new Deus Ex games. Lots of awesome powers as you sneak around reading peoples emails, hacking things, exploring a beautiful future. Definitely recommend, especially if you love Art Deco. <neonbliss>: That’s fantastic! I loved dishonored, both 1 and 2. I am a sucker for story telling in games. Fallout 3 and nv were my gateway drug. :)<TheKnightMadder>: Jeez, why haven't you played Prey man! It's literally by the same devs as Dishonored, and published by Bethesda (though they made a few stupid marketing decisions). It's also really story based, but not in the normal way. It's hugely into the 'figure it out yourself by reading peoples emails, memos, audio logs and the occasional recording you made yourself' sort of thing. Reviews were very positive for it, but for some reason it just didn't sell too well (again Bethesda did sort of fuck up the marketing so that might be it). <EDIT>: Here, have a trailer: [https://www.youtube.com/watch?v=XJsha\\_16yrc](https://www.youtube.com/watch?v=XJsha_16yrc) And this is a gameplay trailer for the DLC, which gives you an idea of what the action is like: [https://youtu.be/qUJqMiUPTFM](https://youtu.be/qUJqMiUPTFM) There was one other trailer too, but it was hot garbage and should not be watched. &amp;#x200B;<neonbliss>: I don’t know. I only ever play come christmas, it’s when I can be a secluse for a few days. Immersing myself in a game and a bottle of whiskey until people return from their holidays. You just made my Christmas! Thank you, trailers look amazing!", "num_messages": 9, "avg_score": 53.0}
{"start_date": "1544996970", "end_date": "1545101392", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 11, "text": "<TheDruidOftheland>: Why I think Shiro from Voltron represents Diversity in the right way. [link](https://i.redd.it/pmjq8ktj4p421.png) What I loved about Shiro and how Dreamworks handled the character was that \"it wasn't forced onto the audience\". For example \"here's a gay character from the start and everyone should fall in love with them. Otherwise you're a bigot!\". What I find more in modern science fiction shows is that they're trying too hard to \"be progressive for the sake of being progressive\" and just giving \"forced diversity\". For example, the newer Star Wars has a female hero \"Rey\" who just kicks ass for the sake of kicking ass. Even though she's never had any training and knows little about the force. Often criticized as a \"Mary Sue\". Why..........because \"feminism and girl-power and we can sell this stuff off\" Then in The Last Jedi, we have Vice-Admiral Haldo, who came across as an incompetent leader, but the audience is suppose to like her even when she makes bad decisions. Again with Rose, a chubby Asian woman who comes across as annoying and is not charismatic or likable, but we're suppose to like her because it's sexist otherwise. In the last seasons of Doctor Who, we were introduced to the companion \"Bill\" who is a lesbian black women. In the adventure she's goes on with the Doctor through times and space, almost every opportunity, she introduces herself as a lesbian. Which is unrealistic as a hetro character wouldn't just go around saying \"Hi, How are you doing? I'm a straight guy\" everywhere they went. In the more recent Star Trek Discovery, we're introduced to a gay couple. Again it just feels very forced and any criticism is met with taunting. An example on handling diversity which did work, was the original Star Trek. You had an engineer who \"just happens to be Scottish\". A helmsman \"who happens to be Japanese\". A communications officer who \"happens to be a woman and black\". These traits didn't define them as a person, in the same way that Captain Picard was bald and played by an English man. Or Lando Calrissian was black. People loved Lando Calrissan because he was cool, slick and charismatic. People loved Picard because he came across a strong leader. The audience like these characters because they're likable characters. Their colour, sex or sexual orientation becomes irrelevant. In the same way that someone's hair or eye colour is irrelevant. What I really liked about Shiro, is that they made a very \"likable\" character. He's a veteran hero, a competent leader, brave, has his own struggles and doubts and tries to overcome them and lifts people up and overall acts like a big brother to the rest of the team...............who happens to also be gay. I really liked the character and in the end, his race, gender and sexual orientation became completely irrelevant and didn't matter That's how you strengthen diversity and that's how you make good presentation.<ShoddyDiscussion>: I honestly have never cared about the gender or sexuality of a character, and unless it's vital to the story you're telling, it doens't matter...at some point, whether or not someone is gay will not matter, whether or not someone is a man or woman will not matter, whether or not someone is of X descent will not matter...at that point, that's your equality, when NONE of it actually matter. And I mean, you had a succubus main character on lost girl who basically had sex with any gender, and it just was...<monkey_sage>: Do you at least understand why it may be important for minorities to see themselves in popular culture? I understand that *you* may not care, but can you understand why others might?<ShoddyDiscussion>: Yes, I understand, what with growing up jewish in america, I understand what it's like not to see your self represented in popular culture as much. <monkey_sage>: That's nice to hear, that you can relate :) Thank you for your honesty.<ShoddyDiscussion>: It's amazing how this seems like sarcasm and pisses me off<monkey_sage>: It's not, I was sincere.", "num_messages": 7, "avg_score": 1.5714285714}
{"start_date": "1544998823", "end_date": "1545017610", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 8, "text": "<trekuniverse123456>: Spock And Captain Pike Try To Save The Galaxy In New Star Trek Discovery Season 2 Trailer In this video I analyse the new trailer for Star Trek Discovery season 2. [https://www.youtube.com/watch?v=y1\\_Q10Nve8o](https://www.youtube.com/watch?v=y1_Q10Nve8o)<ShoddyDiscussion>: Which reality does this one take place in ?<APeacefulWarrior>: AFAIK they're still trying to claim it's in the Prime verse, even though they'd make their lives so much easier (and have less fan hate) if they'd just stick it in another timeline.<ShoddyDiscussion>: Well at least in that timeline spock and pike were more around the same age :)", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543865167", "end_date": "1543945616", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<rohan221>: OSIRIS-REx NASA spacecraft meets with asteroid today <jdblaich>: This site redirects users, albeit to a legit site, but it shouldn't.<Misaria>: It's spam. You can click on the site next to the title to see links to it: <https>://www.reddit.com/domain/crazyupdate.online/", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1545000135", "end_date": "1545059881", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 5, "text": "<Alameda->: Looking for a scifi story I read years ago Back when I was younger I read a story inside a \"award winning scifi stories book\", which I can't remember the publisher nor the name of the story itself It happened in an elevator, which stopped every now and then in a tower's different levels, always going up. Inside the elevator were a few different characters. The story itself was short but I remember a pregnant woman giving birth and all the floors being human-free, the only people in the story were the people in the elevator. Someone makes a calculation in the end and counts the total floors of the tower, getting to the conclusion that the tower is infinite or something like that I read it in spanish originally, so it could be a translation of a original story. Anyways, I would love to read it again, can someone ID it for me? Also, I am just getting into scifi again so, any great short stories I should read? Thank you!<skycruiser>: Sounds like something from Borges?<DesignerChemist>: You're thinking of the infinite library, and I don't remember a pregnant woman being mentioned in it, although, being infinite, she's in there somewhere.", "num_messages": 3, "avg_score": 1.6666666667}
{"start_date": "1543875393", "end_date": "1543983606", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 7, "text": "<newobj>: Book Recco?: Utopian Sci Fi Hi, I'd love to get some recommendations for Utopian (as opposed to Dysoptian) Sci Fi novels. I'm particularly interested in books that touch on the economic aspects of Utopian society, either in a way that's central to the novel, or in a way that's heavily fleshed out in the process of world-building. e.g. if the world is post-scarcity, how/why is it post-scarcity, and how does the book speculate on the consequences of post-scarcity? In a Utopian Far Future, what is capitalism replaced by, or does it evolve, and if so, into what? -- those kinds of questions. Thanks!<KeavesSharpi>: The Culture series by Iain Banks is right up your alley. <newobj>: This def seems to come up the most. I was a bit off because the first book seemed to be about war?<KeavesSharpi>: Yes, but it's a war between the utopian Culture and the fanatical Idirans. And it shows how a true technological utopia even deals with war, which itself is pretty cool. The series is a bunch of books that are generally completely unrelated stories, that take place in the context of The Culture. So you get to see all kinds of facets of it, and the worlds that it interacts with. It's really just what you're looking for based on the details of your request. Honestly the first book can be a bit of a let down in parts, but it does a good job of introducing you to The Culture, and why some people feel opposed to it. Also, the war itself is the backdrop of the story, not the story itself. <newobj>: I see. Thanks!", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1545013628", "end_date": "1545015341", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 15, "text": "<ksoviero>: Looking for a story, be it a book, TV, movie, etc. I had this thought of a psychic monster that has no eyes, but hunts by seeing the world through the eyes of its prey. As a result, the only known defense is to close your eyes and run. Have there been any stories done that make use of this concept, or similar? <sunlitstranger>: Never heard that idea before. You should delete this and claim what’s rightfully yours before someone takes the idea <ksoviero>: Well I'm not much of a Storyteller, I was hoping to actually read a story or watch a story that makes use of the concept.<sunlitstranger>: Maybe drop the idea off at r/writingprompts and there’s a chance people will write a story to it <ksoviero>: Ya, that's not a bad idea...", "num_messages": 5, "avg_score": 3.0}
{"start_date": "1544377255", "end_date": "1544390952", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 724, "text": "<DoctorBones13>: Best of Sci-Fi on Netflix I want to hear about your favorite sci-fi movies or shows currently on Netflix! I just watched Tau which was decent, but not fantastic. I also am a few episodes into Altered Carbon, which is absolutely fantastic so far. Pandorum is one of my all time favorites as well: a good blend of sci-fi, action, and psychological thriller. Recommend me more, my hunger is insatiable. <Edit>: The Expanse sounds like everything I've ever wanted, I'll be starting that tonight.<therea1bobsaget>: (Obligatory response detailing how great The Expanse is)... But yea seriously The Expanse is the best sci fi show I've seen in years, and it looks like it's only going up from here. Not on Netflix tho, my b <DoctorBones13>: Someone recommended that to me once, where can I watch it?<therea1bobsaget>: First 2 seasons on Amazon Prime, third season will be there at some point <DoctorBones13>: Oh fuck yeah, I have amazon prime!<Hickoid>: Then I would also recommend *The Man In The High Castle*. <DoctorBones13>: That has been on my radar for a long time. I love political sci fi<Hickoid>: I started watching it two or three times but couldn't get into it. When I finally got past the first episode it grabbed ahold of me. Excellent cast excellent show. Also, if you're looking for a good laugh, *The Tick*, also on Amazon, is hilarious.<jandrese>: Don't worry if you haven't read the book, the TV series doesn't track it very closely. <Princeofcatpoop>: Also, don't worry if you HAVE read the book, the TV series doesn't track it too closely.<irresistibleforce>: So basically, don 't worry<charden_sama>: Be happy", "num_messages": 12, "avg_score": 60.3333333333}
{"start_date": "1544671579", "end_date": "1544678110", "thread_id": null, "subreddit": "scifi", "subreddit_id": "t5_2qh2z", "total_score": 6, "text": "<TheRatMann>: Looking For Some Weird Sci Fi and Cyberpunk, Any Suggestions? So this is my first post on here but I've been lurking for a while and I've see that this sub is pretty good when it comes to recommending things. I'm a fan of weird Sci Fi, Sci Fi that really plays with the idea of what's out there that we don't know of, whether it be books or movies or games. A few examples being that I'm a fan of Warframe, Lovecraft, and cyberpunk franchises like Blade Runner/Do Androids Dream of Electric Sheep and Shadowrun. I know cyberpunk doesn't really fall into the \"weird\" of weird Sci Fi but that's just stuff I'm looking for more of. <mobyhead1>: You’ll have to be more specific. Written science fiction already tends to be weirder than movies and TV.<TheRatMann>: Well things like Lovecraft, Warframe, and Shadowrun all tend to have this mixture of science with spirituality or magic, especially Lovecraft and Shadowrun whereas Warframe tends to treat the weird or alien as something normal that isn't really questioned. I suppose another example of what I mean would be Empire of a Thousand Planets.<mobyhead1>: So, occultism weirdness?<TheRatMann>: I suppose so. That blending of science and magic or the treatment of magic as science.", "num_messages": 5, "avg_score": 1.2}
