{"start_date": "1543602868", "end_date": "1543615825", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 51, "text": "<Burzumator>: Space Opera Heya! &amp;#x200B; I'm looking for a grand space opera. I want as many novels as possible, featuring many characters, complex plot and story arcs, a span of many years (storywise), battles, empires and political intrigue (especially that). &amp;#x200B; I want to hear suggestions for classics in the genre (i.e. the \"Foundation\" series, suggested by a friend) but I would also like to find out new and up-and-coming authors. &amp;#x200B; Many thanks in advance!<NewbornDawgie>: Can’t go wrong with [Dune](https://en.wikipedia.org/wiki/Dune_(novel)), by Frank Herbert.<Queefism>: Although if you're looking for a series, you might wanna be wary of the sequels. I really liked the first two, a lot of people like the third, and things start getting questionable after that.<pal1ndrome>: All 6 are good. Not completely uniform, but good.", "num_messages": 4, "avg_score": 12.75}
{"start_date": "1544726538", "end_date": "1544761762", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 220, "text": "<dandeets12>: What book would you suggest to help me with being more mentally consistent when it comes to motivation &amp; creating long term positive habits? I often will get a burst of motivation to live a healthier, hard working lifestyle. But after a short period of time and/or a minor speed bump, I lose that drive &amp; motivation and go back to my old inconsistent habits. Are there any books you recommend that helped you become more consistent and create a long term motivated mind set? <SthrnGal>: [The Four Tendencies](https://www.goodreads.com/book/show/33566873-the-four-tendencies?from_search=true) but if you're a rebel it's not going to be much help. Maybe check out her website first. I think there's a test on it. <Moveitalong123>: Thanks! I just took the test and was surprised it actually had helpful, doable tips for my tendency type. <PM_ME_UR_PEN_NIB>: Her book *Better Than Before* is SUPER good. Really practical, with legit points to do and don’t. And all of the advice is geared towards how you react or behave in certain situations. I really appreciated that she recognizes that people won’t tackle the same goal the same way. For example, when it comes to food or drink I’m an Abstainer. I have no issue with wanting it if it’s not in the house. I am NOT a Moderator. I can’t just eat one chocolate. If it’s in the house, it has my undivided attention. She gears her suggestions for building a healthy eating habit around whether you’re an abstainer or moderator. And she does this with many different scenarios. It’s really the epitome of practical habit formation. <Moveitalong123>: 🤯 I need this. Thank you!!", "num_messages": 5, "avg_score": 44.0}
{"start_date": "1543608819", "end_date": "1543667561", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 390, "text": "<aigirl>: What book had you hooked right from the beginning? I'm usually an avid reader, but lately I'm finding it hard to get excited about anything I read. I'd like to hear about what books grabbed you right from the beginning. Doesn't have to be your favourite book, or any particular genre, I'm just looking for one of those \"up til 3am trying to finish it\" kind of books<gopms>: * Lolita * 100 Years of Solitude &amp;#x200B;<GodzillasCock>: After the first page of one hundred years of Solitude I was convinced it was gonna be a great book. Was not disappointed, one of my favourites.<frevernewb>: I have had this book for years and always think it will be boring, thanks to your comments I may give it a try!<GodzillasCock>: It was never boring for me, but it is quite an exhausting read, that demands 100% attention at all times. Give it a shot, it's very polarising, depending on if you like magic realism and don't mind the vast amount of characters and storylines. I loved it and can't wait to read it again.<iTAMEi>: I'm reading it at the moment, I think ordinarily I'd love it but I can't keep track of all the aurelianios and joses<GodzillasCock>: One of the most important things for me was having a family tree handy to keep up with who in what relations the story is happening. Google the family tree, print it out and have it next to you while reading. Makes a big difference for following what's going on. The book print really should have a family chronicle printed inside the book imo.<gopms>: My copy came with a family tree! I’d have been lost otherwise.", "num_messages": 8, "avg_score": 48.75}
{"start_date": "1544611956", "end_date": "1544674244", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 15, "text": "<Redditbrooklyn>: Medical themes in fiction? I’d like recommendations for books that have medical themes in fiction. This could be a character with a disability or illness or recovery from trauma, books featuring a doctor or nurse or midwife or hospital setting, or books that get into bioethics dilemmas, etc. Some examples would be Lisa Genova’s books, or The Memory Keeper’s Daughter, or Jodi Picoult’s My Sister’s Keeper. Not really interested in sci-fi/fantasy. Thank you! <floridianreader>: Robin Cook writes medical fiction Oxygen by Carol Cassella is a fictional story of a child who dies in surgery and the anesthesiologist trying to find out what went wrong<CayseyBee>: Yes, this, I didn’t eat beef for 6 months after reading Toxin. That book was awesome", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1543610525", "end_date": "1543703025", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 19, "text": "<barsmut>: Serial Killer Noir Is this a genre? Any suggestions? Looking for more sinister noir... Less damsel in distress. And i hate happy endings. Thanx.<VVVEGAS>: American Psycho by Brett Easton Ellis <NotWorriedABunch>: Was coming to suggest this!<RedHatOfFerrickPat>: In 20 years, authors won't be giving a shit about pronouns, either. It will be extremely annoying, and you're partly to thank for that. How else can you shorten your already-tiny sentence?<NotWorriedABunch>: I could have simply said, \"this ^^\" :)<RedHatOfFerrickPat>: At least you wouldn't be pretending that it was a sentence.", "num_messages": 6, "avg_score": 3.1666666667}
{"start_date": "1544601273", "end_date": "1544617874", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 8, "text": "<holdentherye13>: Looking for a book of Weird/Dark/Surreal/ short stories. Any or all of the descriptions above. I’m fine with scary too, I’m aware that Stephen King is a man (lol) but I’d be fine with suggestions by him too<Ick_Glokmah>: The Girl with Curious Hair by David Foster Wallace is weird but accessible compared to Infinite Jest. <cbisko>: Brief interviews with hideous men by David Foster Wallace is a collection of short stories", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1544749181", "end_date": "1544827137", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 6, "text": "<wellfork>: Romantic fantasy but not fantasy romance Hi. I love fantasy novels. JRR is my god. I have worked my way through all my GoodReads suggestions, and am at a bit of a loss. I need a good book. Hell, I need a good trilogy. Life is also really stressful right now, so I don't want any heavy handed fantasy novels, I just want a really well written book that can take me to another realm and also people fall in love cause love's great. Examples are One Hundred Thousand Kingdoms (read all her books, love her) and the Kushiel series. What I DON'T want is the typical romantic trope but everyone just happens to have pointy ears. Please help!! <ABookishSort>: Collegium Chronicles by Mercedes Lackey. Most of her Valdemar series has some romance in it. The Belgariad by David Eddings has a very little bit. Riyria Revelations has a few scenes of romance throughout the series. <wellfork>: I was so sad when I finished Belgariad, such a great series! I'll check out the others, thanks!", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1543604888", "end_date": "1543617896", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 13, "text": "<boccy4>: Looking for a French book So my bestfriend has hinted she’d like a book in French, considering she is studying the language at college. We are only 19, and her French is great but I think maybe a Young Adult level book would be just the right difficulty of French. So, what are the most popular ‘must read’ French books? Possibly in the coming of age/YA genre, but i’d happily buy a French classic if it’s a must read! Thank you in advance!<rodomonte>: My favorite French classic is *Gargantua and Pantagruel*, which I assume is available in French. Great middle ages satire.<boccy4>: Can you give me a quick overview of the storyline?<rodomonte>: Oh boy, let's see...A fictional country is ruled by some giant and his son travels around having adventures with his posse. But they run into lots of satirical ideals and make fun of governments and laws and religions, and have no problems poking fun at bodily functions or sex. I would say it's in a similar vein to *Gulliver's Travels*.<boccy4>: Wow that souds good! I’ll definetly look into that, thank you!<rodomonte>: You're welcome! I don't know how it is in the original French, so it might seem pretty dated.", "num_messages": 6, "avg_score": 2.1666666667}
{"start_date": "1544707294", "end_date": "1544718380", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 21, "text": "<LordGeneralTimmy>: Please help me find a new epic fantasy series. Severe DNF syndrome after WoT 😞 Hello friends, &amp;#x200B; I finished Wheel of Time (WoT) about 2 months ago and have been in a severe reading slump exacerbated by DNF'ing books simply because I'm not feeling into them. I'm hoping you could recommend me an epic fantasy series, hopefully multiple books (not just a duology or trilogy) with world changing stories, character and story driven, strong protagonist and antagonist, could be chosen one (I love a good chosen one story!), medieval fantasy setting with good magic system (I don't think I'm into flintlock or grimdark but I'm not sure yet. I really enjoy medieval settings though). &amp;#x200B; **Really liked:** * Stormlight Archive * Wheel of Time * A Song of Ice and Fire * Harry Potter (read a long time ago) &amp;#x200B; **DNF** (these are perfectly good books, I just couldn't get into them. no offense to fans of the series): * Mistborn (halfway through first book) * Lightbringer (90% of first book) * Witcher (second short story) * Malazan (second chapter) * Six of Crows (first few pages) * First Law (first chapter) * Riyria Revelations (partway through second book) * The Name of the Wind (about 7 chapters in) Thank you. &amp;#x200B;<purpleinthebrain>: A Forest of Stars: The Saga of Seven Suns by Kevin J Anderson, Coyote by Allen Steele. <LordGeneralTimmy>: Woah, its all science fiction aliens and space ships. I was hoping more for a medieval epic fantasy with magic and superpowers, kings and queens, mages... <purpleinthebrain>: Oh ok . Have you ever read The Chronicles Thomas Covenant series?<LordGeneralTimmy>: Nope, will check it out. Thanks!", "num_messages": 5, "avg_score": 4.2}
{"start_date": "1544549572", "end_date": "1544560916", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 27, "text": "<Radio_Passive>: Book ideas for my non-reading teenage niece I never know what to get my niece and nephew for Christmas. We're not super close (they're my husband's, much older, half-sister's kids) and this year I'm thinking books, since they're my favorite thing in the world. Since he's a giant nerd, I understand my 13 year old nephew (he's getting Brandon Sanderson's Mistborn) but my 16 year old niece is a mystery to me. She's not much of a reader, but I know she likes soccer and at least a few years ago she was really in to baking and one direction? Is that still a thing? I can't imagine she'd like anything I was reading at that age, so what are your suggestions for a reading-averse teen girl?<avoidmeatallcosts>: If she likes baking, get her a cookbook. But honestly if she doesn’t like reading, why get her a book at all? Tailor your present to her needs and desires. <Paige0409>: I agree here. If she doesn’t read then it will be a waste of money and just sit on a shelf or worse. Maybe a gift card or soccer related items? You can’t push your love for something on others. Unfortunately, not everyone was meant to have a love for books.", "num_messages": 3, "avg_score": 9.0}
{"start_date": "1544741025", "end_date": "1544741525", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 10, "text": "[deleted]: Books so good that you can't put them down, but don't contain any sexual content. Any suggestions? I really want to get invested and attached to a book while I have a month off of school. I used to read all the time - including very complex books like Anne Rice's \"The Vampire Chronicles\" ever since was was little, but ever since I started pursuing a higher education, I just haven't had the time. I really want to be immersed in a book again, but I'd like one with no sexual content simply because it doesn't appeal to me. Can anybody suggest some amazing books without it? I like all genres! <kaerfehtdeelb>: Elie Wiesel books are all beautifully written, in my opinion. Ayn Rand writes a lot involving her philosophical view of egotist ethics, the idea that everyone acts on selfish impulse alone. Her book Atlas Shrugged is long (over 1000 pages, iirc) but a very immersive read. And if you haven't yet, definitely Harper Lee's Go Set A Watchmen, the sequel to To Kill A Mockingbird. [deleted]: I did read Elie Wiesel's \"Night,\" more than once, but each time it was just so difficult to get through emotionally; I could never make it to the end! He does write beautifully and I wish I could have finished it. I have read To Kill A Mockingbird and loved it, but I have yet to read Go Set A Watchmen. I'll have to pick that one up soon! I'll also check out Atlas Shrugged - I'm very interested in philosophy and actually have a philosophy class scheduled next semester, so it might be an interesting read. Thank you!", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1543615598", "end_date": "1543622673", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "<-Dancing>: What's some good classic American / Wild West classics? I just finished watching The Ballad of Buster Scruggs... what are some good novels or anthologies about the old American west?<RaphaelKaitz>: Elmore Leonard wrote short stories about the American West. There are a lot of good ones.<G30N30>: He is awesome! I read the Raylan Givens series *Justified T.V. show based on these* &amp; they were great fun!", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1544755220", "end_date": "1544763187", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 10, "text": "[deleted]: Self help or motivating book to remind me of my independence. Remind me that I don’t need to be in a relationship right now!! [deleted]<cortsnort>: Wild<QuirkyForever>: I second. &amp;#x200B;", "num_messages": 3, "avg_score": 3.3333333333}
{"start_date": "1543584954", "end_date": "1543852751", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 80, "text": "<nugatkrisp>: Looking for extremely long, tedious but rewarding book. Every year I set a sort of reading challenge for a select group of people, and every year this one girl just breezes through it. The winner gets a bookmark by me, but this year, I want to put the bookmark into a book that will be her downfall. In jest, of course. If you could recommend the book that took you longest to read, but you didn't grow to hate, and that's ideally available used for a low price, that would be great! &amp;#x200B; <Edit>: Well. I did NOT expect this many responses. Thanks to you, I will be able to make up a new challenge just for her, containing many wonderful choices from House of Leaves to Les Miserables. I will present this challenge inside a hardback copy of Kants *Kritik der reinen Vernunf*t. I can't possibly thank everyone, so maybe some of you will go back and read this. Thank you all so much! <FattyPascoe>: Gravity’s Rainbow by Thomas Pynchon. It’s my Everest. Not tedious but it is bloody dense.<BooksAreMyVice>: It's next on my list. Any advice before I jump in? I'm used to fairly hefty tomes, but have been warned about GR in the past, so am a little cautious. <qfwfq9>: Nah, just jump into it. Don't care so much about if you get it or not, try to enjoy the insanity, and if you do you will be very rewarded. <BooksAreMyVice>: Thanks a million. I only ask because sometimes reading a book about the book can really help with these expansive tomes. That's what got me though Ulysses (Portals of Discovery / Understanding Joyce) and Infinite Jest (DT Max's bio gave the all the motivation I needed there - lots of Pynchon talk too). <qfwfq9>: I understand the appeal of reading something on the side of something large and complex just to get through it. Gravity's Rainbow is tough and if you really want to get the most out of the first reading I'd suggest the online notes¹ as they summarize large parts of the book where the plot goes through a lot of twists and turns. It's just a summary though, but very helpful. The companion book is not so helpful since it maps out all the references and tries to follow the thought process of Pynchon instead of analyzing the work. It should be saved until the second or third time you read it. Something that has helped me with reading complex books is reading along to the audio book. Ulysses, Finnegans Wake, The Tunnel, and JR are a few books that rely heavily on the spoken language, and will therefore reward you with a lot of nuance that will go missed without sound. It also helped me with morale during the more abstract parts of Finnegans Wake. For Gravity's Rainbow I'm not sure but I'm thinking about reading it again with the audio since there's so many weird puns sprinkled through out the book. Good luck, and don't remember to let yourself laugh! ¹https://www.ottosell.de/pynchon/rainbow.htm<BooksAreMyVice>: Thanks so much for all those fantastic notes. I was the same with Joyce, and can definitely see the essential element of reading aloud / listening to certain points so that the onomatopoeia and linguistic tricks can reveal themselves, whereas an internalised narrative might have missed them. I've enjoyed some of the 'lighter' Pynchon books, but this will be my first time with GR. Once again, thank you. Your input has been very useful. Oh, and you should check out Shem The Penman (Sings Again). It's an experimental Irish movie about Joyce / Finnegans Wake and it's superb <qfwfq9>: Cool! Thank you for the recommendation.", "num_messages": 8, "avg_score": 10.0}
{"start_date": "1544732375", "end_date": "1544757670", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 31, "text": "<lupinecreature>: Werewolf books Hi, I'm a big fan of werewolf books but it seems that there aren't many out there to read. Please suggest any good werewolf novels! I've read: The Wolves or Mercy Falls Trilogy by Maggie Stiefvater, The Twilight Saga, <Grimmview>: “Bitten” by Kelley Armstrong. It starts a series where the narrators switch ever couple of books. “Blood and Chocolate” by Annette Curtis Klaus. (Avoid the movie) “Kitty and the Midnight Hour” by Carrie Vaughn (another series starter. Fun lil romps). <lupinecreature>: I loved Blood and Chocolate! Have to agree with you on the movie. I couldn't even get through half of it. Thank you for the suggestions!<Grimmview>: Honestly, Bitten felt like and adult version of “Blood and Chocolate”. I absolutely loathe the whole “abusive alpha tropes”and unfortunately, a lot of the werewolf ones I have read fall into that. Bitten does not.", "num_messages": 4, "avg_score": 7.75}
{"start_date": "1544704154", "end_date": "1544727979", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 234, "text": "<kafka0002>: Books with a suicidal protagonist? <GeekyWhirlwindGirl>: Not quite what you're looking for but -- The Bell Jar by Sylvia Plath <Edit>: also Perks of Being a Wallflower!<Lisbeth_Salandar>: As a person that struggles with depression, anxiety, and sometimes suicidal thoughts, the bell jar is the single greatest book I’ve ever read on the topic. It really describes how depression feels and how it wraps your world view in a way that I could never put into words before. <GeekyWhirlwindGirl>: Yeah my hesitance to recommended it is based in Sylvia Plath's ultimately successful suicide. The book is beautifully written but I might not recommend it to somebody suicidal who is looking for empathy through a book. It so accurately describes the condition that although I wasn't actively suicidal at the start of the book, it dredged that feeling back up within me. I worry that it's not a good idea to encourage somebody facing suicidal thoughts to connect with a semiautobiographical book written by a woman who did in fact commit suicide. I'd rather recommend books that show the utter hopelessness of rock bottom, the protagonist in crisis, melting down and feeling like their mind is at war with itself, and then show that life can and does move beyond crisis. In one way The Bell Jar does this, but for me, it left me feeling more empty than I started. While pain never does go away, we need to respect it, and learn from it. For me, that pain eventually taught me the color of the air in my lungs and the deweyness of grass on my feet. So much can bloom from pain, and hope exists. Pain might never go away, but that can be *ok*. I don't mean in any way to diminish what an awesome work The Bell Jar is. I might just be a little motherly about it :P<Lisbeth_Salandar>: Imo, reading the bell jar helped me feel less suicidal because I felt less alone and like what I was going through was quantified right there. Someone else knew what was happening to me. It helped me on my road to recovery.", "num_messages": 5, "avg_score": 46.8}
{"start_date": "1544720972", "end_date": "1544722519", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 47, "text": "<Codex432>: Books For 13F Hey everyone! I’m new here so I hope I did this right. Let me know if I didn’t. I “adopted” a child for Christmas this year and was happy find that she requested books! Only problem is that I have no idea what she would like to read. Do I buy stereotypical girl books? I love fantasy (Percy Jackson is my fav in that age range) but I’m not sure she would like that. What about something like The Book Thief? Or is that not appropriate? All I know is that she is 13 and loves art and books. Any ideas would be appreciated. Thanks! <LionessOfTruth>: Any series by Tamora Pierce will be perfect for a 13yo. They're well-written, great fantasy, and almost always feature a female protagonist which is a nice bonus. My personal favorite is the Immortals quartet, but the ones about Alanna the Lioness are usually everyone else's first choice.<Codex432>: Ooo, the Immortals series sounds good. It sounds like it would be really similar to The Secrets of the Immortal Nicholas Flamel series by Michael Scott. The latter also being one of my favorites. <LionessOfTruth>: I still go back and read the Immortals quartet every so often, even though I'm in my 20s now. Daine is without a doubt one of my favorite fantasy protagonists ever. I also really enjoyed the Provost's Dog trilogy too. Same universe, but set a few hundred years in the past. <Codex432>: Hah, I go back and read all my old fantasy novels too. God, I love them. The only good “adult” fantasy I’ve gotten into is the Wheel of Time. Absolutely amazing. Glad I’m not the only one who rereads old books <LionessOfTruth>: I tried to get into Wheel of Time and couldn't quite do it, but I have a few friends who really love it. Have you read the Chronicles of Amber by Roger Zelazny? Technically 'adult' though there's not really graphic sex or what have you. I really enjoyed reading those last year. <Codex432>: Oh geez. When I typed “adult” I didn’t mean *adult*. I just meant something who’s audience wasn’t 12-16 year olds 😀", "num_messages": 7, "avg_score": 6.7142857143}
{"start_date": "1543593991", "end_date": "1543594635", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "<jublazev>: Is there a book that I could read to learn important things about world history? <cb_moon_shine_12>: Well that’s a broad question! Check out A Short History of Nearly Everything by Bill Bryson. <jublazev>: Yeah, I didn't really explain much. I would like to learn as much as I can about world history in a short time, because I'm a freshman at the faculty of political sciences and I should know a lot about world history, but sadly I had bad professors in high school, so now I'm super confused... Anyway, thank you! :)", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1544703292", "end_date": "1544759935", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<DwarfishIbuprofen>: Looking for fascinating non-fiction (crime, biography, history) I have recently gotten back into reading and I pretty much exclusively read non-fiction. Last year I read 12 books (and beat my New Year's Resolution of 10 books), but this year I've been slacking off a bit. I'm looking for non-fiction books that are interesting, surprising, or scandalous. Bonus points if the story is funny or tragic. I love books that captivate you with all the minor details and make it impossible to stop thinking about what's going to happen next. Some of my favourite genres are true crime, biography and history. I have also read a couple of travel books by Bill Bryson which I really enjoyed. I also like Holocaust books. Some books I enjoyed reading last year: * Wild Swans by Jung Chang * Into Thin Air and Into the Wild by Jon Krakauer * The Surgeon of Crowthorne by Simon Winchester * Seductive Poison by Deborah Layton * People Who Eat Darkness by Richard Lloyd Parry Thanks everyone :)<CatPooedInMyShoe>: I’ve read almost 600 Holocaust books. One of my favorites is Ephraim Sten’s Holocaust diary, “1111 Days of My Life Plus Four” which reads like a thriller as Ephraim and the others bounce from one crisis to the next. For crime I recommend David Simon’s “Homicide: A Year on the Killing Streets” where a reporter shadowed Baltimore homicide detectives for a year and wrote down everything he saw. David Simon also created the TV show The Wire.<DwarfishIbuprofen>: Thanks for the recommendations! I’m currently watching The Wire and absolutely loving it 😍<CatPooedInMyShoe>: OMAR COMIN!!!", "num_messages": 4, "avg_score": 1.0}
{"start_date": "1543597704", "end_date": "1543606425", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 25, "text": "<monkeysensei>: Speculative fiction about near-future dystopias and realistic apocalypse scenarios. In a dark mindset and want something about near-future dystopias and realistic apocalypse scenarios of societal decay and revolt. I keep listening to Year Zero - Nine Inch nails on repeat. Something along those lines.<joshua_smith524>: The Dog Star. Can’t remember the name of the author right now<monkeysensei>: Just got back from the book store with The Dog Stars in hand.<joshua_smith524>: Good. I enjoyed it. Glad I could help out", "num_messages": 4, "avg_score": 6.25}
{"start_date": "1544708254", "end_date": "1544759777", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<Richmansvault>: Average man becoming a badass hero but not a fantasy can somebody suggest a book where the protagonist is an average man, something happens to him and he becomes a badass kind of a book, also it would be great if its published after 2010<MessageToObserver>: Are you looking for a thriller type of book, like the Bourne series? Do you not want any sci fi or fantasy elements? <Richmansvault>: Exactly! bourne, jack reacher, orphan x kind of characters story which goes like they were average guys before becoming a dont mess with me type of badass Or even the reversal would be fine... Like there is this comics in which a spy whose cover is blown, quits and becomes a chef in a local restaurant... People who doesnt know about his skill set, who thinks he is just a chef tries to create trouble and he tackles it like an international spy So a beta male becoming an alpha and surprises the bad guys or the the bad guys think he is a beta but he surprises them showing them his skill set And yes anything that is not scifi or fantasy _/\\_", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544727528", "end_date": "1544824439", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 7, "text": "<HoldMyCrayons>: I am really craving a Christmas time romance book. Either the blossoming of a new relationship or rekindling an old relationship... <frellingaround>: I don't think I've ever read an m/f holiday romance, but I can recommend some lgbt+ romances. Would that work?<HoldMyCrayons>: Yeah sure :) I’m open to whatever. <frellingaround>: Okay! These are all cute and fairly short. [Mr. Sparkles](https://www.goodreads.com/book/show/42094393-mr-sparkles) by RJ Scott - M/m, contemporary. This is free online and it's pretty funny. [Safety Protocols for Human Holidays](https://www.goodreads.com/book/show/36580264-safety-protocols-for-human-holidays) by Angel Martinez - F/f, sci-fi. Aliens need to figure out how to help their human crewmate celebrate the holidays. It's hilarious. This one has a sex scene (the others don't). [Hearts Alight](https://www.amazon.com/Hearts-Alight-Elliot-Cooper-ebook/dp/B07L25KZ7F) by Elliot Cooper - M/m, urban fantasy. A young man falls in love at Hanukkah. This book is a little more emotional than the others I'm recommending. [Stone and Shell](https://www.goodreads.com/book/show/32912319-stone-and-shell) by Lloyd A. Meeker - M/m, contemporary. A little boy is looking for a new husband for his lonely dad. <HoldMyCrayons>: These all sound so cute! I really wanna start with the alien one!", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1544754584", "end_date": "1544846125", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 7, "text": "<ShovelBugger>: Can anyone recommend any post-gunpowder fantasy? It seems a lot of fantasy novels are pre-gunpowder technology. Perhaps for obvious reasons (cf. that Raiders Of The Lost Ark scene). Can anyone recommend any sort of fantasy that is set in more recent times and manages to deal with technology mismatch?<Gideon_Nomad>: The genre you're looking for is 'flintlock fantasy'. There are many popular books in this category. Check it out.<ShovelBugger>: Thanks!", "num_messages": 3, "avg_score": 2.3333333333}
{"start_date": "1543602526", "end_date": "1551152035", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 20, "text": "<Mynotoar>: Accessible books about the colonisation and decolonisation of Africa. And I mean every country in Africa. I'm interested in learning more about the history of European colonialism, and how each country (except Ethiopia of course) came to be colonised, and then later gained their independence. Can anyone recommend accessible texts that cover all of colonialism in Africa over the 19th and 20th centuries?<letskeepthinking>: Segu <Mynotoar>: Any more detail?<letskeepthinking>: It’s a superb historical fiction book that relates closely to actual people and timelines as they occurred in west Africa involving the spread of Islam, slave trade and European missionaries. I am writing a final paper for it for my African kingdoms class at university. Follows multiple different perspectives of people and it all is tied together neatly. <grey_contrarian>: Sounds cool!", "num_messages": 5, "avg_score": 4.0}
{"start_date": "1544751508", "end_date": "1544790474", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 45, "text": "<WEREWOLF10MM>: Are there any good books where humans are the invading alien race against another species? Thanks for any recommendations. <jayysaw>: Isn't Ender's Game sort of about this? I haven't read it in a really long time. <WickedKnight23>: Well \"Enders Game \" is a preemptive strike after buggers had attempted to colonize earth. But in the novel Enders Game, Earth is on the offensive so yes and no.<cluisr>: Wait, would the buggers have killed all the humans had they been successful in their first attack? I read the first two books years ago and I’m not sure anymore. <WickedKnight23>: I'm not sure how to answer this without spoilers", "num_messages": 5, "avg_score": 9.0}
{"start_date": "1544754981", "end_date": "1544802589", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 6, "text": "<bernardmoss>: Biographies or books about painters/artists. A few years back I read The Season of Migration by Nellie Hermann. It’s about Van Gogh’s early years when he moved to the Belgian countryside and lived basically in poverty. I’d love to read more books like this, biographies or whatever but about other artists like Monet or Rembrandt or even Warhol. <ughborged>: Warhol has a really funny autobiography that I highly recommend. I also very much enjoyed “Seeing is Forgetting the Name of the Thing One Sees” which is about Robert Irwin. I wasn’t even a huge fan of his before reading it and it was so compelling. “Toulouse-Lautrec and the Fin de Siecle” by Sweetman is good if you’re looking for more of a traditional biography and Toulouse-Lautrec has a very interesting story. If you are interested in dada, I also recommend Tomkin’s biography of Duchamp or Hentea’s on Tristan Tzara. Neither of these are written in a particularly fantastic way but they are both very solid biographies. <bernardmoss>: The Andy Warhol Diaries I assume?<ughborged>: “The Philosophy of Andy Warhol (From A to B and Back Again)”", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544723593", "end_date": "1544747468", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 27, "text": "<Evolone16>: I'm looking for some excellent nonfiction books, along with some good memoirs/autobiographies/biographies. List inside with some books I loved this year...looking for similar suggestions! I, unfortunately, wasn't able to read as much this year as I would have liked. This last (fall) semester has been an absolute *beast*, and I haven't been able to dedicate the time necessary to read as I usually do. That said, here are some books I read this year that I really enjoyed. I picked up several from years past that I've been meaning to get to: **H is for Hawk**: man, this one really, *really* got me. I didn't expect to like it as much as I did. The way the author rights is just...engrossing. I really *felt* for her and rooted for her and was so happy for her all throughout her journey of raising that hawk. Beautiful book. **Sapiens**: *Fantastic!* Should be required reading of all humans. It opened my mind to ideas I'd never thought about, made me realize that we have come such a long way from where humans once were. Plus, it helped solidify my shifting views on religion. Three years ago, I left Mormonism and entered a confusing \"midland\" between belief in God and belief in...nothing. Now, after *Sapiens*, I am much more comfortable is accepting things as they are, that God is a great idea for people to rely on for comfort and such, but that science, evolution, and logical explanations for why we are here, where we came from, and where we're going win the day in the end. That leads me to my *favorite book I read this year*: **Educated, by Tara Westover**: I cannot stop praising this book. I read it in two days, despite being so busy with school and other things. I couldn't put it down. It hit me so hard (coming from a Mormon background myself), and the story of triumph, resilience, and bravery was incredible. I've recommended it to any person who asks me for a book suggestion. I've given out three copies of it as gifts, and have purchased another five to send as Christmas gifts. I want everybody to read this fantastic book. Up next? I am finishing my finals tomorrow. I want to read *a lot* over the Christmas holiday break I have. I've got **How to Change Your Mind by Michael Pollan** and **Heartland: A Memoir of Working Hard and Being Broke by Sarah Smarsh** coming from Amazon on Saturday. I want to read **Homo Deus** and Yuval's other book he released this year, soon, too. Any other excellent non-fictions or memoir/autobiography/biography type books that you fine folks read this year that you can recommend to me? Anything similar to those nonfictions/memoirs I've listed would be incredible.<OliviaPresteign>: My recent favorites: - *All You Can Ever Know* by Nicole Chung - *Bad Blood* by John Carreyrou <Jim_H80>: Bad Blood was amazing!", "num_messages": 3, "avg_score": 9.0}
{"start_date": "1543619951", "end_date": "1543623984", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 15, "text": "<gustog1rl>: Palate Cleanser About to finish It by Stephen King. I am looking for something short and light, maybe something that as to do with the holidays. Thanks! <SocialWorked>: I haven't read this myself but, if you want something to do with the holidays, I've recently been introduced to \"Claus: Legend of The Fat Man\" by Tony Bertauski. From the reviews it seems to be quite a unique spin on Santa's origin story. I'm about to start it myself so I may stop by to edit this afterwards to confirm or redact my recommendation.haha.<gustog1rl>: Thanks!", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1544760594", "end_date": "1544761209", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<ProfessionalPlastik>: Semi-short classics to read over winter break So to preface: I'm limiting myself to ten minutes a day on social media over my break from school...which is going to be a lot for me since I'm always on either my phone or computer. Now since I won't have anything else to do with my life, I decided to go into a reading marathon and read 8 books in two weeks. I've recently re-read one of my favorite books \"The Picture of Dorian Gray\" which has motivated me to read more classics. I'm also on my school's trivia team and my focus is literature so knowing classics helps a lot with that. So what are some good books that aren't too long that I should add to my list? So far I have 1. A Brave New World (another favorite of mine I'm re-reading as a warm-up) 2. 1984 3. Animal Farm 4. The Great Gatsby 5. Catch 22 Which leaves me with three more slots. Any help is welcome and appreciated!! Thank you for taking the time to read this, and please don't drag me for not reading a single Orwell book yet!!! I know!<IndigoRuby>: Catcher in The Rye, The Pearl, Heart of Darkness<ProfessionalPlastik>: I just looked up Heart of Darkness, and for some reason I always thought it was super long which always scared me off...guess not! Thank you for the recs!", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544709233", "end_date": "1544722532", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "<Mawkitas>: Books set in winter I love books set in cold places and seasons. I want to have a few options to read when the winter comes (it's now spring here in Brazil). All elements relating to cold weather are desirable: snow, fireplaces, blizzards, heavy coats, wool blankets, hot coccoa and coffe, wind, white landscapes, etc. <cheezits121>: The Shining!<Mawkitas>: Oh! I already read it and i loved it!", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1543620869", "end_date": "1543694742", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "<ieatbeet>: Well written crime/detective series I am looking for well written crime/detective series. After some research I have found * Tony Hill and Carol Jordan series by Val McDermid * Cormoran Strike series by J. K. Rowling * Cardinal series by Giles Blunt * Kenzie-Gennaro series by Dennis Lehane * Dublin Murder Squad Series by Tana French Which of those is the best? Is there any other better series? As I mentioned, series does not have to be super unique. I need accessible writing style, I like when the book flows by itself. <RagingFire56>: The jack reacher series by lee child. The first book is called killing floor<ieatbeet>: I've read 4 random Jack Reacher books. I enjoyed them all.", "num_messages": 3, "avg_score": 4.6666666667}
{"start_date": "1544721308", "end_date": "1544738214", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 26, "text": "<psychedelicdevilry>: Funny Sci-fi books? Other than the Hitchhikers Guide to the Galaxy. <danielle8088>: Good Omens by Neil Gaiman and Terry Pratchet. Quite a few hilarious moments<linsyschopman>: I really liked that book, but is it really science-fiction?<danielle8088>: Hmmm. I suppose more fantasy fiction than anything. Supernatural? Idk.", "num_messages": 4, "avg_score": 6.5}
{"start_date": "1544729213", "end_date": "1544730769", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 9, "text": "<sallypants>: Book for a hermit 15 year old boy Not exaggerating when I use the word \"hermit.\" This will be a Christmas gift for a 15 year old relative who spends most of his time in his room sleeping or playing video games, and who very rarely leaves the house. He often stays up all night and sleeps all day. He has been homeschooled for thee years after experiencing bullying in middle school, mostly because of his weight. I use \"homeschooled\" loosely, as the program he uses has just a few very minimal requirements, which he usually fulfills over a week or two right before they are due at the end of each of semester, so he really doesn't go to school at all. I actually don't think he has completed all of his courses in recent semesters, so is below grade level. He experiences anxiety, which has a lot to do with why his parents allowed him to leave school and quit sports (which he continued for awhile, but eventually quit entirely). For example, I have been to his house many times over the last year, and have only seen him once, for about five minutes. &amp;#x200B; He is a smart kid, but is behind in many basics at this point. I am very worried about him, as are his parents, who are caring, but don't really know what to do. I don't know a lot about his interests, though his mom recently mentioned anime, and I do know he plays a lot of video games. Oh, and he's into Lego models, and likes sports, especially baseball. I don't think he is much of a reader, but I'm hoping to find something that could engage him, maybe find something that helps him feel not so alone and isolated, or that maybe even could encourage him to re-engage with the world. His mom thinks something shorter, or short stories, might be more digestible for him. I'd like to find something that would sound interesting enough to him to get him to at least open the cover, but who knows. &amp;#x200B; &amp;#x200B;<SerranoDeBergerac>: What about starting with manga? There are a lot of good series - maybe Ruroni Kenshin or Fullmetal Alchemist?<sallypants>: These? <https>://smile.amazon.com/Rurouni-Kenshin-3-1-Vol/dp/1421592452/ref=sr_1_1?ie=UTF8&amp;qid=1544730687&amp;sr=8-1&amp;keywords=rurouni+kenshin+manga <https>://smile.amazon.com/Fullmetal-Alchemist-Vol-1-3-3/dp/1421540185/ref=sr_1_7?ie=UTF8&amp;qid=1544730755&amp;sr=8-7&amp;keywords=full+metal+alchemists", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1544716317", "end_date": "1544746858", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 8, "text": "[deleted]: Need gift ideas for my teenage sister who doesn't read much [deleted]<kindlewick>: It would help if you could tell us what kinds of stories she likes. What TV shows/video games/movies does she like?<Parker2419>: She’s a big hunger games and Harry Potter fan, but unfortunately she always preferred the films to the books. For TV, she’s into pretty standard stuff. Friends, the office, parks and rec, etc.<kindlewick>: I think someone else recommended Eleanor &amp; Park, by Rainbow Rowell, which I would second, along with pretty much anything else by Rainbow Rowell, *Carry On, Simon* and *Fangirl* in particular. I also really like *Trouble is a Friend of Mine*, because it's a fast paced crazy adventure.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1535778610", "end_date": "1535790165", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 236, "text": "<dudewithturban>: Books that have profoundly changed your life. Hi, I'm a 19 year old guy that is currently trying to look for books that will quake me to my very core. What are some books that have profoundly impacted you and maybe made you a better person or more ambitious person. Thanks.<subvertedglasses>: The collected poems of Rumi <dudewithturban>: Rumi is an amazing poet. <subvertedglasses>: Much more than that to me. His philosophy encompasses and answers so many questions on love, religion and living with such simplicity. He teaches you compassion and detachment at the same time. It has been a hard lesson to practice but one only has to go back and remember the ecstasy that he able to bring forth in every action and event. <dudewithturban>: OMG, this is something I appreciate so much about rumi. He has a very spiritual out look on life. It really resonates with me.<subvertedglasses>: Precisely. Have you looked at other Sufi poets? They have some wonderful ways of teaching us how to live without changing a thing. <dudewithturban>: I have a friend who reads a lot of religious text. He loves reading poetry by many religious poets.<subvertedglasses>: I would love to know some names. I know so little and the universe keeps expanding <dudewithturban>: I'll ask him for you but, their is no guarantee he'll answer because, he's the type of guy to not use computers or a phone for a month or two at a time. He lives an insanely simple life. Does some freelance work every 6 months I. The city then he lives in a farm for the rest of the year. <subvertedglasses>: A dream life!", "num_messages": 10, "avg_score": 23.6}
{"start_date": "1544661960", "end_date": "1544844695", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 22, "text": "<Naobeau>: A book about the descent of the hero First time poster here, so please excuse any mistakes. Suggest me a fictional book (or multiple) about the protagonist starting out as a young, hopeful, and idealistic beginner wanting to do good and be a trailblazer in their profession/change the world, but over time and learning new things/experiences, becomes jaded, angry, and the very thing they swore they would never become.<HeatherS2175>: Oh, sorry, I haven't written my memoir yet but when I do I'll be sure and get back to you. <Naobeau>: Ouch. Sorry to hear that. Hope life has been treating you better lately.<HeatherS2175>: It was kind of a joke and kind of not! But I'm fine...everything's fine right now. Thanks, though!<Naobeau>: Good shit fam. 👍 Some unsolicited advice, so feel free to ignore it and move on, but do the best you can do. That's all anyone can ask of you in the end.", "num_messages": 5, "avg_score": 4.4}
{"start_date": "1543619457", "end_date": "1543673466", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 38, "text": "<Lady5ofia>: A Hades-Persephone love story Been interested by those two a while now. Does anyone know a romance book with them as the main focus? <SweetHermitress>: YA series: The Goddess Test<Rayrose321>: My daughter and I love the Persephone story. Do you think this book would be ok for a 13 year old? I’m guessing YA means it isn’t overly sexual or scary. Would make a great Xmas gift. <SweetHermitress>: Scary no. There is a sex scene but it is not at all graphic, more implied. I would say appropriate for a 13-year old.", "num_messages": 4, "avg_score": 9.5}
{"start_date": "1544726747", "end_date": "1544757864", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 69, "text": "<sangemini>: Is there a motivational writer that has a similar message to Jordan Peterson, but who isn’t as controversial as Jordan Peterson? My boyfriend seems to really really like Jordan Peterson, and it makes me a little uncomfortable. I’m not trying to initiate a ‘defend JP’ thread. I’ve been assured that if you analyze his controversial statements, you’ll see that they aren’t controversial. However, I just don’t feel comfortable with the sexist, racist, transphobic counter culture that some of his followers stray towards. My boyfriend is a really great guy, but I don’t think he understands how jarring it is to see some of the stuff I see surrounding Jordan Peterson in the media (and on his subreddit for that matter) and associate it with my S/O. With that being said, I think it’s great that his writing has helped out many people, but I don’t necessarily feel that his ideas are revolutionary or unique. (Ex: “Keep your room clean” ...You’re getting rich off advice my mom harped on me my whole life) Is there another introspective writer, possibly with a clinical or professional background I could recommend to my boyfriend that has a similar helpful message, who doesn’t stir up so much trouble? <EDIT>: spellin’ <johnstarksmoustache>: FWIW I don't think you should judge a thinker by his followers. Many Nazis claimed themselves Nietzscheans. <Edit>: Why all the down votes? Do people really think we ought to judge art by the quality of its admirers?<troplazy>: And the he goes and says that woman that use make up and then complain about sexual harassment in the office are hypocrites <tman37>: That isn't what he said at all. He said if we want to remove all aspects of sexuality from the work place we need to address things like make up, high heels etc. because the purpose of them is to enhance sexual characteristics like red lips, big eyes, up turned butt and shapely calves. His point is that there will always be some sort of sexual interest/behaviour anytime you mix men and women. And that short of dressing everyone in the same form hiding smocks, it is just the nature of people and we should accept that. Once we accept that sexual behaviour between men and women is normal, we can discuss limitations from a realistic perspective. <sangemini>: I agree that that is one of his quotes that gets very very misconstrued and is often used against him, and sure, that might be a good point. However, it’s easy for a misogynist or incel to take that point and say “if women don’t want to be harassed, maybe they shouldn’t wear make up. I’m not to blame for my sexual behavior, women put that on themselves” and it overlooks the fact that in western society, an aspect of professionalism is looking nice and presentable. Women who don’t wear make up are seen as incapable of taking care of themselves, thus would be seen as unprofessional if they didn’t try to make themselves look nicer. Him pointing that out isn’t clever or thought provoking. I think that thought process would occur to anyone. But it’s placing blame on women. The equivalent argument for men I could say is “why don’t men not indulge in status symbols like cars and nice watches?” <NorthEasternNomad>: As reasonable as this response is, you're essentially blaming JP for false interpretation and misuse of his words by others. That's hardly reasonable behavior from a person as intelligent and open as yourself. Consider this: there exists a grain of truth in JP's words. If there werent, you wouldn't be here, because he wouldn't bother you. Instead, you would dismiss it as guys being guys and move on. But it's gotten under your skin. Made you think. And that you're willing to listen is wonderful. But please, give Peterson a chance. Not his words as interpreted by others. Not the over muscled under brained reddit users. Just listen to JP, and I think you'll find that in the end, his is just an honest look at men and women, and by the interaction between them, as these things really exist, as opposed to the PC perspective society wants us to see. Thanks for coming here with an open mind.<sangemini>: I think your explanation of “an honest look at men and women” is a good way to put it. And you’re right, sometimes it’s hard to put a mirror up to society and see what’s there. It’s “evolutionary psychology,” right? (I’m honestly asking haha is that the correct field we are talking about?) I don’t have a problem with that at all. I think it’s good to be made aware of human natures...sometimes shitty, but natural tendencies. Tribalism is a good example. we are aware of the fact that throughout prehistoric human history we have had a natural tendency to see people different than us as a threat, or paint them as lesser, or whatever. In modern society that tendency has manifested itself as racism and we know that it has no place in this day in age. By being aware of that we can start to learn about racism and address it. So I don’t have a problem with him being HONEST about it, what I don’t like is the *finality* in his message. Where’s the solution? I feel like that could just lead to people feeling like their shitty “natural” tendencies are excusable, when really they’re regressive to a massive degree. If he believes that the way to a better life is setting boundaries and expectations for yourself, why is he resistant when the “pc” culture tries to do it? (Pc culture might have been a bad example ghah) P.s. I really appreciate how respectful you were in your response, and perhaps you’re right. Even if I don’t end up agreeing with him, maybe having these thoughtful conversations was good for my brain!! <NorthEasternNomad>: Great response. I tend to think that Peterson understands a hard truth: there is no \"solution.\" Not as such. Men are men. Women are women. We each want what we want. There's no convenient solution to the nature of each respective Beast. Sure, PC Culture sees masculinity as a problem to be solved. But its not; its Male nature, healthy doses of masculinity are not toxic and there is no problem to solve. Rather, Peterson urges us to escape pradigms. PC, personal wants/desires and see these human beasts, and their behaviors, as they are, rather than as we want them to appear. Peterson is a sort of Platonic philosopher for behavior. Stop looking at the shadow image of behavior, colored by paradigm and expectations, and see the behavior, and its source, as it really is, as opposed to judging it by the flickering shadow upon the wall of your personal cave. Or mine.", "num_messages": 8, "avg_score": 8.625}
{"start_date": "1543624686", "end_date": "1545762212", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "<IsPepsiOkaySir>: Scientific Reads Hey, I'm looking for books that make me learn some stuff, preferably scientific. I have read and enjoyed Darwin's \"On the origin of species\" even though I would have to read it again since it's very hard to follow. I have enjoyed another book that doesn't have an english translation but the book was about actual brain injury patients, and they somehow pieced it together to be fun to read while teaching me which areas of the brain are specialized in which functions and the effects it had on the patients. Basically most of all I'm looking for something **factual** and **scientific**. I'd avoid books that \"teach\" how to become invincible through meditation or something.<NotWorriedABunch>: Mary Roach has written several. I think STIFF: The Curious Lives of Human Cadavers was the first. It talks about what happens to the human body after death. She wrote one about the science of sex, one about astronauts, they are very engaging and educational. <IsPepsiOkaySir>: Hey, just wanted to let you know that I bought the one you recommended. There's a lot of great recommendations, but yours caught my attention the most as to buy it right away. Will read after I'm done with exams, thanks!<NotWorriedABunch>: I hope you like it!!", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544739442", "end_date": "1544816960", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 7, "text": "<Sir_Top>: Epic love war stories? Just finished - Love and War: Timeless (She Remembers) by Josie Blaine So looking for more love stories that incorporate the heart over the hardships of war? Thanks. # &amp;#x200B;<RubyReviewsBooks>: falls on the more tragic side of things, but *A Farewell to Arms* is a love story during war<Sir_Top>: Thank you. I will take a look at it. I appreciate it. [deleted]: I was going to suggest this one. One of Hemingway's best.<Sir_Top>: Thank you, obviously a good one, if multiple folks saying the same thing.", "num_messages": 5, "avg_score": 1.4}
{"start_date": "1544717897", "end_date": "1544745531", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 70, "text": "<CharlieDyson>: Just finished rereading The Goldfinch by Donna Tartt. Please suggest a book similar in excellent prose and epic scale? <ragnarockette>: **Shadow of the Wind!** Do not pass go. Do not collect $200. Go to your nearest bookstore/library and get this book immediately. Goldfinch is one of my absolute favorites. Shadow of the Wind is like the perfect companion. I **LOVED** it. I actually took a day of PTO to read it. It has the same high stakes bildungsroman vibe with unrequited love, a secret object, and a beautiful landscape. It takes place in Barcelona. Seriously. Read this book now!! Also **She’s Come Undone**. Another one of my favorite books and the main character is incredible. <CharlieDyson>: Your sales pitch won me over. Shadow of the Wind is the first of many recommendations I’ll read. Thank you! <ragnarockette>: Yay! It is such a masterpiece and it reminded me so much of the Goldfinch. I got the exact same feeling while reading it.", "num_messages": 4, "avg_score": 17.5}
{"start_date": "1544617714", "end_date": "1544635451", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<crankthat21pilots>: Poetry suggestions? I really got into poetry recently and I would like some recommendations on good poetry books to read. I like the type that’s really powerful and makes you think, and makes you really emotional. <hamslut420>: Try crush by Richard Siken! Other favourites are The Glass Essay by Anne Carson, <hamslut420>: John Berryman, James Wright, Frank O'Hara and Danez Smith", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544723033", "end_date": "1545320069", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 33, "text": "<Burrito_Suave>: Deep space rescue/exploration type book? Even though it was universally panned, I loved the idea of the movie “Event Horizon” (distress signal from way out in space is even weirder because it’s from a ship,that vanished years earlier). Are there any books with a similar plot? I found [Contagion](https://www.amazon.com/Contagion-Erin-Bowman/dp/0062574140) that looks interesting. Any others?<HostaSauce>: We Are Legion - We Are Bob by Denis E. Taylor (book 1 of the Bobiverse series) was pretty good. Space exploration and a few rescue missions in there. It's not the dark and gritty space opera/horror story you might be looking for, though. It's fairly lighthearted.<Burrito_Suave>: Awesome. Thanks!<castle___bravo>: For what it's worth, this book series (on audiobook, for what its worth) was my most pleasantly surprising find of the year, in terms of humor/ humor style, and depth of the universe he creates. It may not be \"hard\" scifi, or anything close (though, to his credit, his internal consistency is VERY high, especially considering the times/distances involved in the story between actors. I felt the need to add a disclaimer because, compared to Event Horizon (which I LOVE, fuck the haters), The Bobiverse may seem kinda silly. (Silly in a great way, don't get me wrong) But I was thinking about it, and the Scifi that I read that would most closely resemble the vibe and type of universe in this book, you might want to look into \"The Laundry Files\" series by Charles Stross -- Not so much space exploration in the \"rockets\" type of way, but in terms of high level physics and other dimensions/hell/possession/magic/horrors still being ostensibly a side effect of truly scary. The Series is referred to by \"The Laundry Files\" but the first book, called \"The Atrocity Archives\" (which is generally printed with a novella at the end, (\"The Concrete Jungle).... In the TLDR version, it follows another \"bob\" (this time Bob Howard) as he is drafted into a secret British govt. organization that works to actively suppress the knowledge of existence of \"Magic\" (super advanced math, the true language of the universe, can cause reflections and changes in higher dimensions that can affect changes in physical reality, but can also call \"other\" denizens of the multiverse, decidedly Event Horizon to the CORE in this regard. The series is set in contemporary times, where the amount of people thinking, plus the rise of ever more advanced computers(which can be used to more safely do \"magic\") is making us light up and look extra tasty for the Lovecraftian horrors that exist right beside us in the multiverse, watching, waiting, and licking their lips.... It's very funny, but not in a slapstick way, more of a \"it's very funny to hear the main character talking about \"Computational Demonology\" and how he stopped a tentacle monster from beyond spacetime from dragging a coworker into a doorway turn portal to hell using his Networking Necromancy and saved her soul -- but is being dragged over the coals by the organizational auditors on seemingly frivolous use of paperclips and not having used the correct forms in his rush to stop a Cthulhu wannabe from invading earth, etc -- Bureaucracy doesn't care if your late because of the bus or because of the end of the world, TPS REPORTS DON'T FILE THEMSELVES! <edit>: Reddit really DOES have everything, found this spot if you are more interested and wanna learn more! Should be able to find any info you need to make whatever choices, etc, the author also releases a decent portion of his work for free via creative commons if you'd like to read a few stories from the mythos to get an idea! r/thelaundryfiles <Burrito_Suave>: This is great! Thanks<castle___bravo>: Your handle is great, el guapo ;)<Burrito_Suave>: Thanks!", "num_messages": 7, "avg_score": 4.7142857143}
{"start_date": "1544744461", "end_date": "1544764549", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "[deleted]: What Books Have A Lot Of Greek Mythology [deleted]<LilUmsureAboutThis>: Percy Jackson (and beyond) is pretty well written for younger readers For death as a main character read the book thief. even though it doesn’t have Greek mythology it really does the character welk <TheTurtleSage>: The first series is definitely more for kids but Heroes of Olympus got way more mature, and now with the Trials of Apollo is like super mature IMO it's amazing. Definitely the best series to recommend though like 10/10 would read again.<LilUmsureAboutThis>: Need to finish (or at least get up to date with) the Apollo one lol <TheTurtleSage>: I've just recently finished the Burning Maze, the 3rd book in the series so far. I can honestly say it's my favorite out of the 3 series aswell, it even begins to half-ass dabble into the rest of his series aswell it's pretty nice.", "num_messages": 5, "avg_score": 3.4}
{"start_date": "1543542027", "end_date": "1543590935", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 224, "text": "<amazedave>: Enjoyable book for a 16 year old girl with a potential history of abuse Every Christmas my SO \"adopts\" patients who live in the long-term care facilities that her company manages. This year, one of her adoptees is a 16 year old girl who requested books (along with boots and perfume) on her wishlist. That's all we know for sure about her. However, since she lives in this facility she may have been through some traumatic experiences. Looking for some good stories targeted at her age range while avoiding any possible abuse triggers. Any recommendations? <Edit>: Thanks for all the recommendations everybody, looking through them all now! Also, I agree with many of you that books containing stories of abuse and redemption could provide catharsis, but I feel that is not my place. I believe it would be inappropriate to push her towards that experience if she wasn't prepared for it, so I decided it would be best to play it safe. <SavesNinePatterns>: I would say go for something completely different. If she's asking for books I suspect she wants to escape. Try the belgariad by David eddings. <Edit>: or a kindle with some money on so she can browse and see what she likes. <amazedave>: They're only allowed paperback books for security reasons<BiggerB0ss>: Security reasons?<amazedave>: The facility doesn't allow hardback books or glass of any sort. Even small make-up palettes have their mirrors removed<BiggerB0ss>: I don't see what a hardcover could be used for tbh<amazedave>: To hit someone? Idk, I don't make the rules", "num_messages": 7, "avg_score": 32.0}
{"start_date": "1544704967", "end_date": "1544764610", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "[deleted]: Books without romance, or some Chad getting the girl I am tired of reading a book, and there is a girl in it who falls in love with some tall and handsome Chad/Alpha male. Real life is already like that, what is the point in having it in a work of fiction? What books has no romance in it?<PanickedReader>: Have you tried reading your diary? <serralinda73>: Savage.<birdniqqa3>: No remorse.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544739755", "end_date": "1544900420", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 6, "text": "<valdog29>: Are there any GOOD books on how much America influences the rest of the world? <yooobrah>: This book does not quite fit the description... but is close... try reading The Accidental Superpower. Very good read.<stabbyhand>: I didn't mind this book but found weird that it didn't mention climate change at all. Surely that will have a huge bearing on how the 21st century evolves.<yooobrah>: That is a good point. Definitely something it should have touched on considering the subject.", "num_messages": 4, "avg_score": 1.5}
{"start_date": "1544757492", "end_date": "1544764721", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "<misskaykennedy>: Looking for Cleopatra Can anyone reccomend a well written book about Cleopatra and her ruling time in Egypt? I would like to gift this to someone for Christmas and she mentioned there were a lot books out there that are written from the authors opinion and not well researched. I am clueless on this topic and any recommendations are greatly appreciated!<kid-gorgeous>: Cleopatra by Stacy Schiff is an absolutely amazing read! I highly, highly suggest it. Good luck!!<AndiLivia>: I second this! I loved it so much its one of my go-to gifts for friends!", "num_messages": 3, "avg_score": 5.6666666667}
{"start_date": "1543533116", "end_date": "1543604924", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 24, "text": "<addiction_to_fiction>: French literature (translated to English) I've recently read The Count of Monte Cristo, Les Miserables, and The Phantom of the Opera and enjoyed them quite a lot. Any others you guys would recommend? They don't have to be older like these, these are just what I picked up while going through the \"classics\". Wondering what else is out there.<ProtectressNephthys>: The Hunchback of Notre Dame?<addiction_to_fiction>: Oh yeahhh, I forgot about that one. Thank you!<ProtectressNephthys>: Don't expect it to be anything like the film haha. It you like long descriptions of French architecture, you'll love it.<addiction_to_fiction>: I've never seen the film and don't know anything about it. Except character names. I'm excited about it.<ProtectressNephthys>: Oh cool then you'll go in with no expectations! Enjoy!", "num_messages": 6, "avg_score": 4.0}
{"start_date": "1544731227", "end_date": "1544765784", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 32, "text": "<underco5erpope>: I want to get emotionally invested in a good book I’m on a break off from school, and promised myself to read a lot. So far I feel like I’ve done that well- I’ve read two books, and a coiple other works of philosphy. The two books I’ve read were “the secret history”, and “middlesex”- but the problem is now I don’t want to continue with the list I made for myself. The ones I had planned were classics, books like “the underground man”, “Lolita”, “grapes of wrath”. But now those don’t feel sufficient, the first two books I read were so engrossing, and especially with middlesex, I felt so emotionally invested in the characters. I feel like with “classics” I won’t get that, cause generally they’re colder, have a more distant style. What are some really good books that will also have me hooked, feeling for the characters ?<G30N30>: **Beartown** by Fredrick Backman. Every line felt like a sucker punch to my soul! It was sooo good!<chloelaura89>: If you don’t know already it has a sequel “Us Against You” , it’s also very good :) <G30N30>: Thank you!! I actually have it. I just finished **Beartown** last week &amp; needed a breather! Have you read any of his other books? I have heard they are all pretty good but are they all so emotional?<chloelaura89>: I’ve actually only read Beartown! I have the sequel too I just took a break from when I finished reading Beartown and have been super busy since. I have heard that too, I’d really like to give the others a try, Beartown has such a different vibe to other books I’ve read so I think after I have read the sequel I will look into them!", "num_messages": 5, "avg_score": 6.4}
{"start_date": "1543553902", "end_date": "1544765025", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<KittenNyx>: Looking for non ya or romance books with fairies/faeri/fae I want to read books where fairies/faeri/fae are a big part of the story but that are NOT romance novels or YA.<ouqturabeauty>: The Invisible Library series by Genevieve Cogman features fae especially in Book 2 The Masked City. The books are adult adventure/fantasy with many supernatural forces and characters: fae, dragons, vampires etc. I think they are lots of fun!<KittenNyx>: Sounds fun!", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544561777", "end_date": "1544599656", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 26, "text": "<bebetolittlefella>: If an alien wanted to learn a lot about us, our planet, our history etc and he could only do that by reading our non-fiction books, what great books should the alien read? <JC_Gadgets>: He should read my novel. <MrTimmannen>: Is it non-fiction?<JC_Gadgets>: No<MrTimmannen>: Well then it doesn't really fit the parameters of the question.", "num_messages": 5, "avg_score": 5.2}
{"start_date": "1544644225", "end_date": "1544667744", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 225, "text": "<SuperWhoMerlin>: What are some of the best psychological thrillers you’ve read? <LearnAndLive1999>: The Hannibal Lecter Tetralogy, by Thomas Harris! They’ve been my favorite books for almost 10 years now :) - “Red Dragon” (1981) - “The Silence of the Lambs” (1988) - “Hannibal” (1999) - “Hannibal Rising” (2006) I would especially recommend The Silence of the Lambs and Hannibal!<EJKorvette>: Red Dragon. The squickiest bad guy.<LearnAndLive1999>: Kind of a fun fact: I was actually born in the same town as Francis Dolarhyde. Springfield, MO.<EJKorvette>: Hope you turned out better than he did! &amp;#x200B;<LearnAndLive1999>: Well, I wasn’t born with a cleft palate or abandoned at an orphanage... so I’ll probably be fine lol", "num_messages": 6, "avg_score": 37.5}
{"start_date": "1544742208", "end_date": "1544819250", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<FidelDeSucre>: Philosophical novel recommendations? Im interested in philosophical and psychological novels like Nausea by Jean Paul Sartre and Thus Spoke Zarathustra: A Book for All and None by Nietzsche. Anyone have any recommendations for other books?<Southpaw502>: The Razor's Edge- W Somerset Maugham<FidelDeSucre>: Thank you! Will check it out", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544615795", "end_date": "1544632073", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 218, "text": "<krystalpants>: I want to be a better/nicer person. Is there any books that I could read that would help me? <impersonatingtuna>: Highly recommend Jordan B.Peterson - 12 Rules for Life<outrageously_smart>: Yikes<Mr_Salami>: Don’t let his reputation on social media deter you from his lectures/books. I stay away from his politics for the most part, but he has a lot to offer when it comes to teaching self-help and has done a lot for the field of clinical psychology. Still, I don’t think 12 Rules For Life is *necessarily* the book OP is looking for.<outrageously_smart>: &gt; Don’t let his reputation on social media deter you from his lectures/books No thanks. Fuck this guy. [deleted]: Why? I haven’t listened to him much. I listen to JRE a lot but whenever he’s a guest I turn it off cus I’m tired of politics/Jordan Peterson’s voice. <Mr_Salami>: People on reddit are just butthurt he has controversial opinions (that are hardly relevant to his books and lectures)", "num_messages": 7, "avg_score": 31.1428571429}
{"start_date": "1544767327", "end_date": "1544791925", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 269, "text": "<MaxTennyson80>: So The Good Place has made me think to take up philosophy again, where should I start? <aichaaicha_>: TM Scanlon <MaxTennyson80>: Saw what you did there :)<DaBeggad>: i don't, would you mind explaining it to me?<Whitemageciv>: He wrote What We Owe Each Other. I think it would probably be more technical than OP wants, but who knows.", "num_messages": 5, "avg_score": 53.8}
{"start_date": "1543609565", "end_date": "1543631064", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 15, "text": "<Chakahan342>: A book by a writer like Tom Wolfe I’ve read Bonfire of the Vanities, A Man In Full, Back To Blood, and The Right Stuff. Other than the Right Stuff i didn’t love his other nonfiction when i tried it but i could not put Right Stuff down, and same with all of his fiction. I think it has more to do with his characters and stories rather than his uniquely sassy writing style which i like but is not totally essential to why i enjoyed these books so much. I’m out of fiction to read by him and wondering if anyone has anything similar, as I’ve rarely been as hooked on a story as i was with those ones. <nothingshort>: Point Counter Point by Aldous Huxley.<Chakahan342>: Looks awesome, thanks I’m definitely gonna read this", "num_messages": 3, "avg_score": 5.0}
{"start_date": "1544756766", "end_date": "1544833934", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 25, "text": "<psychedelicdevilry>: Books in the comedy style of Bob’s Burgers? So I guess I’m looking for books that have dry, unusual, and sometimes silly humor all in one.<GotHuff>: Anything by Christopher Moore. <PartTimeSatan>: Maybe I need to give it another try, but I read Lamb 3-4 years ago and hated it. I felt all the humor was from a 10 year old boy and not actually funny. <itstonypajamas>: I felt the same way, but after rereading it it seemed funnier having studied some of the religions and customs mentioned in the story. I thought it was rather clever<PartTimeSatan>: I have my B.S. in religion and read it for a class about depictions of Jesus in art so that was definitely not it. Maybe I’ll give it another go.", "num_messages": 5, "avg_score": 5.0}
{"start_date": "1544724299", "end_date": "1544727041", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "<MickandRalphsCrier>: Book that takes place in a setting that blends futuristic Sci Fi with fantasy creatures and magic? The best examples of what i'm looking for is Final Fantasy XV. They have cars, electricity, huge cities with skyscrapers, airships, etc but the world is flooded by fantasy monsters and demons along with magic being an integral part of society. In Altissa, a floating city based on venice, I ran into a Samurai Ronin Demon in the middle of an outdoor cafe and had to kill it while people stood up and backed away with a curious expression like this happens every day. That's the aesthetic I want. I dont' want something like Harry Potter or Twilight or The mortal instruments, where magic exists in the cities we live in and we just can't see it. I want a totally different world where sci fi meets fantasy, specifically the blend of high tech weapons and cities with magic and demons. If anyone knows anything like this i'd really appreciate it<BananaFrappe>: [*Dune*](https://www.goodreads.com/book/show/234225.Dune) by Frank Herbert is definitely the closest thing to fantasy-science fiction, I've read. There are definitely creatures, and the magic powers that various people have are explained by \"science\". <MickandRalphsCrier>: I own dune and have tried to get into it multiple times, but never get past about 10 pages in. Not sure why it just isn't hooking me. I'll give it another shot I guess<BananaFrappe>: It takes a bit to get into to it. At 10 pages, you haven't even gotten to the titular planet, yet. I would say you need to give it at least 150 or so pages. By then, you'll be hooked and won't be able to put it down. It's complex and deep (with plenty of action) and such a great read.", "num_messages": 4, "avg_score": 4.25}
{"start_date": "1543616713", "end_date": "1543672444", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 17, "text": "<Nitemarephantom>: Similar to Wonder My Sister-In-Law is 12 and really loved Wonder. Looking for similar books/books in that genre for her that she'll enjoy. Or just any books people think she will like lol<VVVEGAS>: The Curious Incident Of The Dog In The Night Time by Mark Haddon<visionsofsolitude>: I wouldn't say this is for a 12 year old. <chops_potatoes>: I know some 12 year olds that would like it, but yes, it’s certainly not for everyone. OP needs to check this one carefully before considering a purchase.", "num_messages": 4, "avg_score": 4.25}
{"start_date": "1544766735", "end_date": "1544791214", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 5, "text": "<CooledCup>: Mistborn, kingkiller chronicles, storm light archive or wheel of time? I want to get into some deep fantasy and all of these seems extremely interesting and have been talked about a lot. What would you recommend? Thanks <Szeth-Father-Sigi>: Id say go for a finished series first, originial Mistborn trilogy or WoT. The best one imo is Stormlight Archive<joshrr211>: Agreed. Start with mistborn. It’s an excellent starting place into the rest of the authors other books<CooledCup>: Great, thanks for the input!", "num_messages": 4, "avg_score": 1.25}
{"start_date": "1544659504", "end_date": "1544754556", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 269, "text": "<UnplannedProofreader>: Young Adult Titles With Safe Sex Lessons Im looking to gift a little collection of novels to my 17 year old niece who is being taught abstinence only. She has her first boyfriend and I’m terrified she will get pregnant and try to pray the problem away because her bat shit crazy mom refuses to live in the 21st century. If you’ve got a title that also teaches young women about self respect and loving themselves enough before being ready to practice safe sex that would be a bonus. Pretty specific but I thought I’d give it a shot and ask. <Edit>: look for fiction. I know there are sex education books out there but I have to hide the message in fiction. Also, please don’t openly judge me for going against her mother’s wishes. There’s a lot to this teen’s upbringing that have led me to wanting to send her messages through fiction.<jyort>: Just tell her that you're worried that she's only being taught about abstinence and that she needs to find real information about sex in case she ever needs it. At 17 she's mature enough to hear it from you if she hasn't heard it elsewhere. It might be slightly awkward, but she'll most likely appreciate you being honest. Maybe suggest a youtube channel like sexplanations.<lalotele>: I think OP is trying to find a more subtle approach so as not to overstep her boundaries or upset her niece’s mom.<jyort>: Yeah I know, I'm just saying it's not necessary to be subtle and the niece is definitely not going to tell her mom.<lalotele>: I’d venture to guess you don’t actually know that and OP probably knows better. I’ve known kids from sheltered families who would in fact spill the information to their parents because they had been brainwashed so badly by their parents.<jyort>: I guess she could be unlike any 17yo I've ever met, but I find it more likely that OP is being overly cautious because that's generally how people treat talking about sex. OP should really consider thoroughly whether it truly isn't an option to just tell her that there are things she needs to know and that just having knowledge isn't going to violate any of her values. A subtle sex education is a likely to be poor sex education.<lalotele>: My parents never outright spoke to me about sex education and I learned through things like books and then research afterwards, and I was the smartest and safest of my peers. I had to teach my friend who had spoken with her parents that a blowjob did not cause pregnancy but that you should still use a condom while taking BC pills. This is not simply meant to be sex education, but an introduction to the subject so that hopefully OP’s niece does research like I did. You literally know zero reasons why OP is doing it this way, it’s ridiculous to think they’re doing this because “this is how people treat talking about sex.” There are so many more reasons and facets but very good job at painting things black and white. Yes, 17 year olds can in fact be different than the ones you have met believe it or not, not only is that anecdotal evidence for an entire population of teenagers but like I said even I myself have met teens who would tattle on whomever outright spoke to them about things their parents made “taboo.” Please do get off your high horse in response to a post where OP is simply trying to help someone in a way you deem not good enough, even though you know so little of their situation. <jyort>: I think you're misunderstanding me. I'm not saying OP should give her a sex education, just that they should let her know that it's important to do that research and maybe give her a place to start. I get your point that I shouldn't be judging people I don't know, which is why I'm suggesting that they think carefully about it rather than insisting they do what I would. I didn't mean to say they should give her the talk, I was just using that as an example of people being overly cautious about talking about sex.", "num_messages": 8, "avg_score": 33.625}
{"start_date": "1543615130", "end_date": "1543694410", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 20, "text": "<mickeymaya>: Looking for something adventurous, out-there and action packed, but not cliche, unintelligent, or outright stupid. It might be a bad example, but I found the Monster Hunter International series to be a fun read that didn’t seem to completely sacrifice its ability to be an engaging story. I felt that it had some meat to it. I’m looking for something in a similar vein, but a little better thought out. Something clever AND super fun/entertaining. If it helps any, I’d probably put what I’m looking for somewhere between Monster Hunter International and Stephen King’s Dark Tower Series... but probably leaning towards The Dark Tower in terms of tone/reading level. I hope that helps in the way of getting good suggestions, and please don’t be afraid to go well outside what I’ve tried to explain here. I wholeheartedly trust the opinions of users on here, so have at it!<FootballAndReading>: Well, this isn't that similar to the books you mentioned but it definitely fits the description of \"adventurous, out-there and action packed, but not cliche, unintelligent, or outright stupid\", *Bjorix The Brave: A Tale of Ancient Mercia*, it's novella-lengthed, and every chapter ends on a cliffhanger which makes it very easy to binge. Very action-packed but not in a way that's detrimental to the plot, every fight scene moves the plot forward (and there's a number of them, but not so much that it becomes repetetive). It's of the sword and sorcery genre of fantasy, in case that matters. <FootballAndReading>: Here's some reviews of it from other folks for a few takes that might be better than mine:<https>://www.goodreads.com/book/show/34414600-bjorix-the-brave <https>://www.amazon.com/Bjorix-Brave-Tale-Ancient-Mercia/dp/1543089860/ref=tmm_pap_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=<mickeymaya>: That actually sounds right up my alley. I’ve been into Norse stuff since I was a kid. Just the old mythology on its own is action-packed, so I can imagine what a modern imagination might be able to do with those ideas. I will definitely check this one out! Thank you so much!<FootballAndReading>: For sure. For what it's worth there's a sequel that, in my opinion, is actually slightly better, it's also short, but I'd recommend giving it a look if you find that you enjoy the first one. <mickeymaya>: I certainly will. Do you know if it’s in audiobook form? I ask because I deliver pizzas, and it sounds like this would be a great way to avoid getting bored on the job. I could use a magical Norse adventure to keep me engaged.<FootballAndReading>: Hmmm.....not on amazon. <https>://www.amazon.com/Bjorix-Brave-Tale-Ancient-Mercia/dp/1543089860/ref=tmm_pap_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=", "num_messages": 7, "avg_score": 2.8571428571}
{"start_date": "1543628018", "end_date": "1543629906", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 9, "text": "<sharonaflemming>: Looking for books on Philosophy I'm trying to get into Philosophy again years after I had Philosophy classes, and I found out I don't actually remember much. I searched for books on this topic and of course there are a bunch, but I'm wondering how to go about it. I'd like to start simple, maybe something that would give me an overview of philosophical themes, and only then get into the actual philosophers' works and deeper discussions about it. Anybody has some suggestions? Thanks in advance!<peasantcore>: I'm a philosophy PhD candidate, so I hope I can help. If you are looking for a general introduction, try *Think* by Simon Blackburn. For a very beginner-friendly survey of ethics, try either *The Fundamentals of Ethics* by Russ Shafer-Landau if you want a textbook by a single author or *The Ethical Life* edited by Russ Shafer-Landau if you want an edited collection. I'm not super familiar with all of these, but they all have been used by people in my department in freshman-level classes. Sometimes the best way is to read primary sources. It depends on what you'd like to do or think about. Some of Plato's dialogues are beginner-friendly, in particular \"Euthyphro\" and \"The Apology.\" Or maybe you might want to read Descartes *Meditations* to think about skepticism and the nature of the mind. For ethics, the *Nicomachean Ethics* is great; it is the book I use in my introduction to ethics course, though it is less beginner-friendly than others I have suggested.<sharonaflemming>: Thank you so much! I'll definitely look into those. I love the ethics aspect of philosophy so I'm sure most of these will interest me.", "num_messages": 3, "avg_score": 3.0}
{"start_date": "1543594452", "end_date": "1543607311", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 23, "text": "<alittlelessconvo>: Latin American history for beginners Looking to get some reading in on Latin American history ahead of a trip to Mexico and Colombia and for my own enjoyment. Any books that cover the entire continent (or even Mexico and Colombia) that aren't too much of a doorstopper and can ease a novice into its history?<amarisanz76>: # Open Veins of Latin America by Eduardo Galeano<Alaishana>: Just wanted to.... to be taken with quite a bit of salt though.", "num_messages": 3, "avg_score": 7.6666666667}
{"start_date": "1544716719", "end_date": "1544750693", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 6, "text": "<StranaMente>: Suggest me a book for my brother who's an university professor Christmas is coming and both me and my brother are avid readers. I wanted to gift to him a book that may be near his interests/work, so I'm asking you some help. We both read and really loved the Unseen University books in the Discworld series, by Terry Pratchett and I would like to find something that may share that sense of humor, or that is funny and has something to do with teaching. Thanks in advance!<hamslut420>: Jasper Fforde is similar to Pratchett imo! Or possibly Ben Aaronovich He's probably read Lucky Jim by Kingsley Amis but worth a shot<MissTwiggley>: Aaronovitch’s Rivers of London series is a fun read.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544763793", "end_date": "1544862753", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 7, "text": "<McHoff>: Started A People's History of the United States, was disappointed and am looking for a replacement It became pretty clear that the author has one central idea that he shoe-horns everything into. I'd still like to read about the US history in some form: preferably something a bit lighter than not, as I'm no history buff <kaladinandsyl>: I was considering reading this book, what were you issues with it? What was the idea he tried to shoehorn in as you say?<McHoff>: It's an interesting book, but he goes really hard on a privileged-exploiting-lower-class theme to the point where it feels like he bends over backwards to make it apply to anything and everything.<LesbianRobotGrandma>: Or maybe it does in fact apply to everything but it's just not your area of interest.", "num_messages": 4, "avg_score": 1.75}
{"start_date": "1544770704", "end_date": "1544837902", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 8, "text": "<freckled-one>: Suggest Me a Fantasy/Supernatural Series Hello and thank you in advance! I'm looking for a fantasy or supernatural series to get into. Something with magic and adventure. Dark is fine, Young Adult is fine. I feel like I've read all of my collections too many times and I need something new. In the past I've enjoyed the Anita Blake series, Meredith Gentry, Sookie Stackhouse, Tolkien, Narnia, Dark Tower. Thank you for reading this!<inkblotsandquills>: Maybe try “The Woman of the Otherworld” series by Kelly Armstrong. It’s got werewolves, witches, and demons. Fun, easy reads. Or The Harry Dresden series by Tim Butcher, <freckled-one>: Sounds good to me!<inkblotsandquills>: I hope you enjoy. Happy reading.", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1543590429", "end_date": "1543628837", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<amarisanz76>: STORIES about children fulfilling a dream their parents failed to achieve Hi, I'm looking for titles about children who complete or succeed at a dream their caregivers failed to achieve. &amp;#x200B; What books come to your mind? &amp;#x200B; Thanks for the help.<LuveeEarth74>: Only one I can think of at this moment is **The Pillars of the Earth** by Ken Follett. Jack (played by Eddie Redmyn in the movie) builds the gothic style cathedral his father began in a far more modest style. <amarisanz76>: Excellent, thank you for your help!", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543621620", "end_date": "1543653469", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "<Katara_Moon>: What are sone great page turner books? I like the genres relistic fiction and a little mystery. Maybe some diversity too. I dont like fantasy though. Thanks!<idrinkmilkis>: Plot heavy thrillers and mysteries in general. I am Pilgrim by Terry Hayes, Dan Brown's books (Da Vinci Code et al). Oo, The Cormoran Strike books (first is The Cuckoo's Calling).<Olga_Ale>: Cannot say enough good about I Am Pilgrim!!!!<Digbedog>: My eyes are twitching.", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544709631", "end_date": "1544772659", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 19, "text": "<mrthaapa>: Can you guys name me books that every book lover has read? Like there are movies like Shawshank redemption,inception,etc that every movie lover has watched.Similarly what are books that are a must read.Looking forward to start a habit to reading because it gives me peace.<dondeestalalechuga>: [This list](https://www.goodreads.com/list/show/952.1001_Books_You_Must_Read_Before_You_Die?page=1) contains all the titles from the *1001 Books You Must Read Before You Die* books, and have been voted on by readers so the most popular ones are at the top. If you want more personalised recommendations - what kind of stories do you enjoy?<quiltsohard>: Meh..this is mostly just a list of the classics. Not necessarily popular reading. I’ve probably read 1:2 of these. Some good some not so much but I wouldn’t put most of them in a “must read” list. Just my opinion. <dondeestalalechuga>: Yeah, that’s the problem with OP’s question - everyone has a different opinion on what is a ‘must read’. That list is the opinion of the *1001 Books You Must Read...* authors, but it’s not going to be something ‘all readers’ agree on.<birdsbooksbirdsbooks>: Agreed. And I really hate this type of question, because it makes reading sound like a chore. \"What *should* I read? What *must* I read?\" How about \"Help me find something I as a unique individual will *enjoy* reading.\"<dondeestalalechuga>: Yup! (I also struggle with ‘Here are three books I’m interested in, which should I read first?’ I don’t know - which appeals to you the most? And ‘Is it worth reading X book? I’ve seen mixed reviews.’ Clearly some people like it, some people don’t, but I have *no idea* which category you would fall into.)<birdsbooksbirdsbooks>: Ditto. Also, \"Recommend me a good book. I'm open to anything.\" Ugh, really?<HeatherS2175>: Frigg, I would never say this to someone.", "num_messages": 8, "avg_score": 2.375}
{"start_date": "1544512795", "end_date": "1544514427", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 14, "text": "<metacognitioning>: Any obscure books with a well-written, unconventional romance Nothing too well known please, I’m looking for books I haven’t read or heard of a million times before. I’m not looking for romance novels or erotica, but I’m not opposed to them if they are exceptionally well-written (I’ve found those genres to be pretty god awful in the past, but maybe I was choosing the wrong books).<literalytrash>: Stalking Jack the Ripper!!! The romance isn’t the main storyline but omg I love it<metacognitioning>: Thanks, I’ll check it out. Love your enthusiasm! <literalytrash>: So far it’s a trilogy too!!!!", "num_messages": 4, "avg_score": 3.5}
{"start_date": "1544505173", "end_date": "1544593553", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 8, "text": "<SextonHardcastle11>: Give me a book that you would love to see get made into a movie/tv series? Basically what the title says. Doesn't matter the genre, doesn't matter the author, no limitations, no conditions. What book would you love to see made into a movie or television series? <VampireZombieHunter>: Old Man's War<MaarekStele7>: It would be a long movie, everything in that book was good.<VampireZombieHunter>: A 9 or 10 episode series, like *Lost in Space* would be a good format", "num_messages": 4, "avg_score": 2.0}
{"start_date": "1544764914", "end_date": "1544824159", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 3, "text": "<KittenNyx>: I'm asking people to pick things for me to read in 2019 I'm trying to knock out as many of the books I own off of my TBR and thought I would ask here what people think I should go with. &amp;#x200B; [These are the books I own and haven't read](https://www.goodreads.com/review/list/7578168-nikki-the-nocturnal-bookworm?shelf=books-i-own-tbr) &amp;#x200B; For reference on what I like the most these are some of my favorite books: &amp;#x200B; The Hobbit by J.R.R. Tolkien The Secret Garden by Frances Hodgson Burnett Let the Right One In by John Ajvide Lindqvist Jurassic Park by Michael Crichton Fahrenheit 451 by Ray Bradbury The Perfect Storm by Sebastian Junger Homeland by R.A. Salvatore The Graveyard Book by Neil Gaiman Hyperion by Dan Simmons Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch by Terry Pratchett &amp; Neil Gaiman<smellthebreeze>: Definitely the Gary Jennings book (Aztec)<KittenNyx>: Thanks! And if I end up liking it I actually already own the second one so that will be perfect!", "num_messages": 3, "avg_score": 1.0}
{"start_date": "1544773430", "end_date": "1544828974", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 13, "text": "<JM062696>: Please, someone save me from this reading slump. I need something to spark me again! About a month ago I was reading like 100 pages a day, I finished 6 or 7 books in a span of 4 weeks. The last book I read was A Little Life (loved it by the way). But since then I just haven’t had he motivation to read, and I need something to pull me back. I like horror and have read most Stephen King, would love a psychological thriller that’ll give me chills or make me think. Even a good coming of age book that will make me ugly cry. Someone save me! <GunsmokeG>: Dark Matter<JM062696>: This ones also on my list but I’m having trouble finding it <GunsmokeG>: Have you checked the library? It's fairly popular. <JM062696>: Yep it’s not in my area<GunsmokeG>: Hmm. My library has something called Prospector where you can request materials from other libraries. Don't know if that is available for you or not. <JM062696>: I’ll check that out. I believe they do actually. I just hate ebooks so I’m trying to avoid those too if I can.", "num_messages": 7, "avg_score": 1.8571428571}
{"start_date": "1544775319", "end_date": "1544831667", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 27, "text": "<xrayzone21>: I've read multiple times the \"hitchhiker's guide to the galaxy\" series and now I'm loving Good Omens, are there any books out there with a similar style? <sutherlanderson>: Christopher Moore, esp. Fool<birdsbooksbirdsbooks>: Came here to recommend Moore. My favorite is Lamb, but pretty much anything by him will have this zany style similar to Adams and Pratchett.<crabbiejohnnie>: You Suck.<crabbiejohnnie>: Moore.", "num_messages": 5, "avg_score": 5.4}
{"start_date": "1544774336", "end_date": "1544793123", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 30, "text": "<MorganAndMerlin>: Fantasy standalone novels? What’s your best fantasy novel that’s a stand-alone? Or maybe a duo? Or even a series where each book is relatively unrelated to the other in the sense where book two isn’t a chronological continuation or book one. I’ve been reading stand alone one off books and I’ve really enjoyed moving between one story/world fairly quickly. Recently, I’ve liked Queens of Innis Lear by Tess Gratton, Daughters of the Storm by Kim Wilkins, Circe by Madeline Miller, The Beautiful Ones by Silvia Moreno and Uprooted by Namoi Novik. Overall, I like a swords and magic kind of setting with usually a romance involving the min character but I’d love to look into anything that gets recommended to me. Thanks! <jddennis>: [Tor.com recently had an article about standalone fantasy novels, and they have some good suggestions](https://www.tor.com/2018/12/07/tired-of-series-try-these-10-standalone-fantasy-novels/). Here's a few others that I've enjoyed over the last year: * [***Temper***](https://www.goodreads.com/book/show/36260411-temper) by Nicky Drayden * [***Last Dragon***](https://www.goodreads.com/book/show/10407670-last-dragon) by J.M. McDermott * [***The Healer's War***](https://www.goodreads.com/book/show/37906758-the-healer-s-war) by Elizabeth Ann Scarborough * [***Dreamsnake***](https://www.goodreads.com/book/show/263021.Dreamsnake) by Vonda N. McIntyre * [***The Curse of Chalion***](https://www.goodreads.com/book/show/395967.The_Curse_of_Chalion) by Lois McMaster Bujold (This one is the start of a series, but it's also a standalone) * [***Who Fears Death***](https://www.goodreads.com/book/show/7767021-who-fears-death) by Nnedi Okorafor * [***In the Vanishers' Palace***](https://www.goodreads.com/book/show/41724928-in-the-vanishers-palace) by Aliette de Bodard<human_trampoline>: The restraint of standalone novel writers— especially fantasy authors, is to be commended. They should have a prize just for this!<jddennis>: I agree! I find myself drawn to standalone novels a lot more these days. Finishing a book is a bit more satisfying than finishing just one part of a multi-part epic. That being said, I find it interesting when an author takes a collection of novellas and turns it into a single novel. [***Weaveworld***](https://www.goodreads.com/book/show/52640.Weaveworld?from_search=true) by Clive Barker was an interesting exercise in this format. Sadly, the story wasn't to my taste.", "num_messages": 4, "avg_score": 7.5}
{"start_date": "1544716488", "end_date": "1544791976", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<LadyAmaltheaMoon>: Afraid of running out of books...Need Recommendations! Have been bingeing a very specific genre of book and am afraid of running out of them! I would classify them as Historical Fiction/Fantasy/Fairy Tale Retellings. Think along the lines of The Bear and the Nightingale, Uprooted, Spinning Silver, The Sisters of the Winter Wood etc... I've read most of the newer books in this genre so I would love some older book recommendations that I might have missed. But really anything is appreciated!! :)<SteelAmethyst>: Mercedes Lackey's 500 Kingdoms series has fairy tales and retellings of them.<LadyAmaltheaMoon>: &gt;Mercedes Lackey's 500 Kingdoms I've been wondering where to start with Mercedes Lackey! This series sounds great! Thanks for the recommendation :)", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543588037", "end_date": "1543606909", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 8, "text": "<YoungRockyRacoon>: I remember reading some assassin creed books a few years ago that were actually pretty good. What are some good books based on video games? I saw a prequel novel to the Spiderman PS4 exclusive that renewed my interest in video game novels. I might have to pick that one up too. <lgrasv>: ..... idk if they quite count because they started as tabletop games first before becoming video games - but the Ciaphas Cain series based off of Warhammer 40 k are pretty good. especially if you like good thoughtful storytelling mixed with comedy. also the Myst book series is great, especially The Book of Ti’ana.<TwoVelociraptor>: Came to rec this... even though they’re not originally video games :)", "num_messages": 3, "avg_score": 2.6666666667}
{"start_date": "1544733456", "end_date": "1544735144", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 12, "text": "<lupinecreature>: Books for a Biology Major I'm currently a biology major on winter break and I'm looking to get into nonfiction and learn new things during the break without picking up a textbook ( I really need a break from those lol). I've never read nonfiction books for fun before but I want to get started. I'm interested in reading about reading human biology, medicine, animals, the environment, psychology, mental health, medical/ science history, modern science, health. I don't want to read something too dense, I want it to be a fun enjoyable read. The only nonfiction book I've read was the Immortal Life of Henrietta Lacks for a class and, to my surprise, enjoyed it. I liked the combination of science and history. I'm also interested in reading stuff like Hillbilly Elegy by J.D Vance, I have yet to read it but it sounds like a good read. If you have any suggestions on fiction about doctors, scientists, etc, please suggest those as well as long as the content in the book is relatively accurate. <aichaaicha_>: Try Phantom in the Brain by VS Ramachandran, books by Stephen Jay Gould, Oliver Sacks, Siddhartha Mukherjee.<RoosterBonnet>: I want to second the recommendation for Stephen Jay Gould. His works have really challenged and broadened my perceptions of evolution and natural history, and the man’s writing is beautiful, without being dense. He had a talent for science writing unlike pretty much anyone else. <aichaaicha_>: True.. his collection of essays “The Richness of Life” is an absolute essential read.", "num_messages": 4, "avg_score": 3.0}
{"start_date": "1544732224", "end_date": "1544885517", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 23, "text": "<cristi_ivann>: Getting into Hungarian literature What are some Hungarian masterpieces to get me going? I’d love to read one before visiting Budapest during the Christmas holiday. Anything from crime to absurd novels is welcome. Thank you in advance guys. <Edit>: Some of my favorite authors are Dostoievski, Kafka, Heine and France.<lisastens>: Dezsö Kosztolånyi, Miklos Bánffy, and Antal Szerb are Hungarian authors I've enjoyed. They are all older, writing in the 1920s and '30s but I would definitely recommend them. <cristi_ivann>: Some of my favorite authors are from that period so I can’t wait to get my hands on books by them.<lisastens>: You won't be disappointed. I don't know what kind of time investment you are looking at but Miklós Bánffy wrote the Transylvanian Trilogy, \"They Were Counted\", \"They Were Found Wanting\" and \"They Were Divided\", and it's absolutely brilliant. It starts in 1914 and goes through the war. It gives you such a great picture of what life was like then and how quickly it fell apart. It's not a quick or easy read, its very dense with history and politics of the region, but if you like Dostoevsky and Kafka, you'll have no problem. <cristi_ivann>: I bought the trilogy online and now it’s on its way. Can’t wait for it to arrive! Thanks once again for taking your time to answer!!", "num_messages": 5, "avg_score": 4.6}
{"start_date": "1544785893", "end_date": "1544810165", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 19, "text": "<Ronald_Dillons>: A book where the protagonist(s) don’t have a love interest(s)? There was this show I really liked call “Daily lives of high school boys” where the characters didn’t have a love interest, characters were oblivious to any romantic buildup, and a lot of mini-stories subverted expectations by not following through on obvious romance queues/tropes. Does anyone know of a book like this or similar?<Arthemeeza>: I wish I could recall more now, but it only comes to mind the movie Children of Man. The book Martin Eden starts with a love interest, but then it trancends that. Studio Ghibli also have a lot of plots where the characters aren't build around love stories. Hope I could help... Good luck :)<Ronald_Dillons>: The last two movies by studio ghibli Isaw (‘Ponyo’ and ‘the witch and the white flower’) kept talking about love conquering all, or the like. That’s fine, but when the characters are young children and they’re talking about man and woman type love? That’s a bit off putting. I’ll definitely check out Chidren of Man, though.<Arthemeeza>: Yeah, I understand what you mean. Of those two I have seen only Ponyo, but I am not sure they meant love like that. But, for example, Nausicaa is pretty awesome and Spirited Away too. Princess Mononoke does not revolve either about love. Now books, you can easily find on line a short story named The Machine Stops, by E. M. Forster which is pretty cool and very easy to read. Does not have a love interest and is dystopian.", "num_messages": 4, "avg_score": 4.75}
{"start_date": "1544767838", "end_date": "1544787249", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<Thedesperatehero>: Looking for easy to read and gripping interesting books (ADD) Hey guys, looking for book suggestions that have a very gripping plot that can prevent my ADD mind from wondering off and preferably easy to read What I've already read and loved/liked- Percy Jackson series (Including the sequels and spin offs like Magnus Chase) Harry Potter series (sadly, even the cursed child) The Underland Chronicles Keys to the Kingdom series by Garth Nix Ready Player One (This wasnt an easy read since it was hard to relate to the 80's stuff but I still enjoyed a lot) Armada Mark of thief series by Jennifer A Nielsen The Wuthering Heights Earings from Frankfurt Books I tried to read or are in my to read list - Pendragon series Seven wonders series Artemis fowl <barelysentient->: Try The Belgariad series by David Eddings. I loved that as a teenager. Fantasy, magic, prophecy. Good fun.<Thedesperatehero>: Thank you for your suggestion, ill look right into it!", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543592632", "end_date": "1543682022", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 26, "text": "<jessicasanj>: Going through a tough time.. need some solid fiction to get through Caught my stbx cheating not too long ago, and now I'm beginning the lengthy process of divorce. I need something to absorb my mind into to give my overactive brain a break. Something that will last a while, but not too dense. As an example, when my mother was dying I read all of the Harry Potter series through her death and the grieving process. Something easy, addicting to read, and that won't be over in a day or two. Thanks a bunch.<Monstiemama>: I recommend \"Oryx and Crake\" by Margaret Atwood... it is literally one of the best books I've ever read; it's part one of a trilogy and you will read that thing like it's air you need to breathe. There's also \"White Oleander\" by Mary Agnes Donoghue, \"She's Come Undone\" by Wally Lamb, and \"Sharp Objects\" by Gillian Flynn, who also wrote \"Gone Girl.\" If you're going through a divorce, \"Gone Girl\" may give you some satisfaction because a wife pulls the most criminal and fucked up shit on her husband. <jessicasanj>: I’ve really them all but Oryx and Crake and Sharp Objects. Thank you for the suggestions!<Monstiemama>: I got you gurl! Sharp objects is extremely intense; if you saw the hbo show I’d just start with Oryx. I feel like I should get a percentage of book sales because I’ve recommended it so many times on Reddit! Happy reading! <jessicasanj>: Thank you so much!", "num_messages": 5, "avg_score": 5.2}
{"start_date": "1544789784", "end_date": "1544795321", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<ActiveAnxiety>: I have a couple of eBooks. Suggest me what I should read next among these. So a friend gave me a couple of eBooks. I know that they belong to different genres, and I don't have any preferences as of now (I'm just a book beginner). Just suggest me a book to read next among these: - To Kill a Mockingbird - Pet Sematary - the Catcher in the Rye - Man's Search For Meaning - Lolita - Fahrenheit 451 - Kite Runner - Brave New World<doggnuttt>: Fahrenheit 451<RealHellpony>: Same.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1543272465", "end_date": "1543385219", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 15, "text": "<quilly7>: Loading up a kindle with a bunch of books - recommendations needed! I got my boyfriend a kindle for Christmas, and I am going to load it up with a bunch of books so that they are on it when he receives it - the only problem is our book tastes are very different! He is really into old nautical stories like the Alexander Kent books, but I want to have a range that aren't solely from that very specific area. So, if anyone has any recommendations for a 27 year old male that would be fantastic! Thanks!<jack0fclubs>: The terror by Dan Simmons might be in his wheelhouse<AviTech72>: Was about to suggest this. Have you read the song of Kali?<jack0fclubs>: Actually haven’t even finished terror yet, almost done though. It’s been a while since I read something like this with a great plot AND good writing. You recommend song of kali?<AviTech72>: Yes", "num_messages": 5, "avg_score": 3.0}
{"start_date": "1544792713", "end_date": "1544794124", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 9, "text": "<FailingDegree91>: Help me escape! Can anyone recommend me any books to help me escape from reality. I'm in a pretty dull job but get a fair amount of breaks and time to do something but have nothing to actually do So yes, exciting books to help me get away from the dim 9-5 would be helpful <jehk72>: That depends on what sort of books you have liked reading in the past, what genres do you like?<FailingDegree91>: I like fantasy/sci fi usually but I like to find other things too. I'm basically just going to look at things what people suggest and have a look at the synopsis <jehk72>: Well if youre looking for something easy to read but really fun I always recommend anything by Brandon Sanderson. The Mistborn trilogy is a good place to start. If youre looking for a fun fantasy heist novel The Lies of Locke Lamora is great If you want something super immersive then you can't go wrong with The Name of the Wind. (Warning this series is a work in progress so the third book is not out yet)<FailingDegree91>: This is a great answer. Thanks for all those suggestions. I've got one of Brandon Sandersons books but it's the second in a series so I haven't read it yet <jehk72>: Of course! And if you like what you see with Sanderson just wait till you dive into the cosmere. Its a story on top of the stories", "num_messages": 6, "avg_score": 1.5}
{"start_date": "1543462637", "end_date": "1543509708", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 57, "text": "<PikaMasterWasTaken>: Can anyone suggest me a long book (550-1000 pages) that keeps me in suspense and it’s hard to put the book down. P.S. it’s my first time on the sub <philsqwad>: Brothers Karamazov The Instructions by Adam Levine <PikaMasterWasTaken>: Nice book<philsqwad>: It might also be nice for you to read the Wool Trilogy by Hugh Howey. They are fantastic and after 3 books, it turns out to be \\~1500 pages.<PikaMasterWasTaken>: 1500 pages total, or per book<philsqwad>: 1500 total. About 500 per book. The first book will pull you into the world though. And I read it recently, I'm 26, but it seems to be written for a younger audience.<PikaMasterWasTaken>: Not bad. I’m in the middle of reading silence by Natasha Preston. It is a very good book and I highly recommend <philsqwad>: I'll add it to the list. Thanks and good luck with your reading!", "num_messages": 8, "avg_score": 7.125}
{"start_date": "1544756857", "end_date": "1544829093", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 4, "text": "<gaybatman75-6>: Sci fi horror similar to Who Goes There/The Thing I've been looking for some more horror centered around a group of people that are isolated and being terrorized by monsters. Sci fi horror is a plus.<PeterM1970>: The novelization of the 1980 The Thing movie was by Alan Dean Foster, and it was very good. He also did the novelizations for Alien and Aliens, also good. The Terror by Dan Simmons is a fantasy/horror take on what might have happened to a real world 19th century Arctic expedition that never returned. The isolation and desperation of being far from home and besieged by something you don’t understand really comes through. <gaybatman75-6>: I actually came across the terror and another dan Simmons book and added them to my wish list. They sound super promising.", "num_messages": 3, "avg_score": 1.3333333333}
{"start_date": "1544792875", "end_date": "1544818886", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 11, "text": "<Jetza99>: Is there a fiction book about corporations taking over the world in the future and group or one of rebels fighting them ? something like Altered Carbon <Arthemeeza>: You have Ready Player 1, for example. But you mean only corporations or governments as well?<Jetza99>: It can be governments<Arthemeeza>: Well, then you have a lot of dystopian novels, best ones in my opinion: - 1984 by Orwell - Farenheit, by Bradbury - We, by Zamiatine :) Have fun", "num_messages": 4, "avg_score": 2.75}
{"start_date": "1544641325", "end_date": "1545000057", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 10, "text": "<hunter1899>: A D&amp;D like book, but with deeper characters and story? I'm looking for everything the Salvatore books offer (an epic quest with **magical loot, monsters, adventure**) but with the depth of character and story and quality of writing more like Game of Thrones, etc. What would you recommend? Already tried WoT, LOTR.<yettibeats>: You're looking for **The City Stained Red**, friend. A must read for any DnD fan. Just ask /u/SamSykes <hunter1899>: Does this take place mainly in a city or do the characters travel to various lands?<SamSykes>: Yes and yes.<hunter1899>: Appreciate the reply and congrats on all of your success. Added your book to my wishlist!", "num_messages": 5, "avg_score": 2.0}
{"start_date": "1543595220", "end_date": "1543606413", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 9, "text": "<crapehaanger>: Short story collections, anyone? **Here's a long list of my favorites:** *Tunneling to the Center of the Earth* \\- Kevin Wilson *Fortune Smiles* \\- Adam Johnson *Venus Drive* \\- Sam Lipsyte *Karate Chop* \\- Dorthe Nors *Hot Pink* \\- Adam Levin *The Taker* \\- Rubem Fonseca *Willful Creatures* \\- Aimee Bender *Orientation* \\- Daniel Orozco *Internal Medicine* \\- Terrence Holt *The Girl on the Fridge* \\- Etgar Keret **Any recommendations would be very much appreciated!** [deleted]: On A Chinese Screen by Somerset Maugham Dance Of The Happy Shades by Alice Munro<crapehaanger>: Ooh, I've never heard of Maugham! [deleted]: He's very good. The last story in this collection is my favorite short story. <crapehaanger>: I'll check him out. Thanks for the tip!", "num_messages": 5, "avg_score": 1.8}
{"start_date": "1543589535", "end_date": "1543618825", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 22, "text": "<kellietara>: Looking for a book, I enjoyed Ready Player One and Hunger Games years ago... am watching Riverdale and Sabrina on Netflix - any suggestions around these I like adventure but I also like the sci-fi/dystopian sort of themes in Ready Player One and The Hunger Games. There has to be a romance in there too... any suggestions? RPO is the first book I’ve read in about 9-12 months so really wanting to get back into it...<BananaFrappe>: [*Red Rising*](https://www.goodreads.com/book/show/15839976-red-rising) by Pierce Brown meets all of your requirements. It's the first part of a **completed** dystopian SciFi trilogy. The trilogy finishes with *Golden Son* and *Morning Star*. (Note: the first book of the next trilogy in that universe has been released, but it's years after the events of the original trilogy, with a new plot and new characters.)<zeth4>: Seconded this series is amazing <publiusdb>: Amazing might be overstating it. \"Hot mess\" might be more accurate. <BananaFrappe>: Agreed. I enjoyed the series, but it was a bit too YA for my taste and a bit... well... just a bit too much. :P I suggested it because asked for a YA (similar to *Ready Player One*) that was SciFi and dystopian. RR fits the bill.<publiusdb>: Don’t get me wrong. I enjoyed the first series. It’s the second series that I think goes off the rails. <BananaFrappe>: I haven't read *Iron Gold* and have no plans to do so in the foreseeable future. I started RR without realizing how YA it was. I finished the trilogy because it was mildly enjoyable, but not worth starting the new series.<publiusdb>: Yeah, I can see that. I feel ya.", "num_messages": 8, "avg_score": 2.75}
{"start_date": "1543545959", "end_date": "1543641383", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 6, "text": "<FezAndWand>: Any books where we get to see an underdog rise to the top? <Literal_Genius>: This was my favorite part of Pillars of the Earth. Fair warning - it takes a long time to get there.<Cyborg14>: &gt;But the end is so so so rewarding. One of my all-time favorites.", "num_messages": 3, "avg_score": 2.0}
{"start_date": "1544755115", "end_date": "1544816457", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 29, "text": "<-rba->: Books about the Library of Alexandria? You hear a lot about how much knowledge was lost when the library burned. I'd love to learn more about it. Any books on the topic?<anxietyandstress>: The Rise and Fall of Alexandria: Birthplace of the Modern Mind by Justin Pollard and Howard Reid<-rba->: Perfect, thanks!", "num_messages": 3, "avg_score": 9.6666666667}
{"start_date": "1544800741", "end_date": "1544818992", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 56, "text": "<jayneonthecobb>: Please help with my 2019 reading challenge. So I’m planning on reading 52 books in the next year and I’ve come to rely on this community for the best recommendations ( r/52book is cool, but it seems more just like people posting pictures of piles of books). Specifically, I would like ideas for novels and non-fiction alike written by authors that are female, people of color, or LGBTQ+. I’m not trying to get brownie points for reading these. I just know that I’m pretty well read when it comes to white cis males and I’d really like to expand my horizons. I don’t really care if the authors suggested are writing *about* their experiences - although that’s perfectly fine. I just want to experience some fresh voices. Preferably no fantasy or horror (or, at least just standalone novels if they’re a must read.) Also, I have two kids, so I can’t read a 1,000 page magnum opus and finish my challenge. Thanks in advance! <G30N30>: My favorites from 2018: •FICTION• Octavia Butler **Kindred** **Parable of the Sower** Becky Chambers **A Long Way to a Small Angry Planet** **A Closed and Common Orbit** Marissa Meyer **Cinder** **Heartless** Margaret Atwood **Oryx and Crake** **Handmaid’s Tale** •NONFICTION• Trevor Noah **Born a Crime** Tara Westover **Educated** Bell Hooks **Teaching to Transgress** <lgrasv>: know this is slightly off topic, but how do you bold? ty<G30N30>: 2 asterisks before title 2 asterisks after with no spaces- if you want to write italics use 1 asterisk. <lgrasv>: ty", "num_messages": 5, "avg_score": 11.2}
{"start_date": "1539846972", "end_date": "1543644485", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 18, "text": "<VD909>: Marine biology or ocean books for older children? Child in question is 10 and wants to be a marine biologist. So, books about the ocean, marine biology etc, etc that aren't aimed at under 7's which it seems like a lot of them are. Also, do you know any marine biologist biographies which are either aimed at children or would be suitable for a child to read? Thanks in advance. <SunThestral>: Oh perfect! That was my obsession at that age as well! It’s really hard to find things for that age range but one thing we used to do when I was out of books was go to a used book store and look there. You’ll find older books that are out of print and that helps a lot. The good thing though is if she just keeps wanting to read that her reading level will shoot through the roof 🤣👍🏻👍🏻 She will start reading adult nonfiction in like 2 years! Lol! Here’s some fiction: (This is a series) Into the blue by Ben Baglio (I’m assuming she’s read this) How to speak Dolphin by Ginny Rorby Here’s some nonfiction: Dolphins of shark bay by Pamela turner Orca song by Michael amour Dolphin Diaries by Denise herzing (reading level is pretty high but is written like journal entries) <VD909>: I got her the Dolphins of Shark bay book and she loved it, so thanks. I might look at getting the Dolphin Diaries for Christmas, so thanks x 2. <SunThestral>: Aww!! Yay!! I’m so glad!! Always happy to help a marine mammal lover! If you also want to show her some amazing videos Nathan Pettigrew always has wonderful videos on his Instagram. His handle is Marine_life_kayaker <VD909>: Just had a quick look and she will absolutely love that, thanks! Do you think if I put his handle in her Christmas card that'll count as a present? :)<SunThestral>: 🤣 I wouldn’t bank on it! Buy her a kayak and a GoPro and put his handle on the seat??😅😅<VD909>: Hmm, as I will probably be the one who gets \"volunteered\" to go out with her I'm not sure I want to risk my life that much. Maybe I'll just stick with the books, sounds much safer. 😊", "num_messages": 7, "avg_score": 2.5714285714}
{"start_date": "1543642100", "end_date": "1543853930", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 13, "text": "<thegeckomaster>: Wanting to get more into reading, topics I am interested in below Hello everyone, I just found this sub so I am hoping I could get some help. I am a college freshman looking to get more into reading. Here are some of the topics I am currently very interested in (sorry, its a wide range/random). I don't know of any good books in general, and was hoping I could get some help. Help is very appreciated! Thanks. &amp;#x200B; * **Theology** (or books about Judaism or Islam and their origins and what they believe in, etc) * **History** (Spanish/Japanese/Italian/Chinese/Greek/Roman history, specifically) * **Non fiction war books** * Or any really good books somewhat related to any of these topics<voyeur324>: *The Prophets* by Abraham Joshua Heschel *The Essential Talmud* by Adin Steinsaltz *The Soldiers of Salamis* by Javier Cercas *SPQR* by Mary Beard &amp;#x200B;<thegeckomaster>: Are these ones readable for someone that has a basic knowledge of them?<voyeur324>: Depends on what you mean by basic knowledge. *SPQR* and *The Essential Talmud* are written for general audiences. *The Soldiers of Salamis* is about the Spanish Civil War and historical memory, even though its title is an allusion to the Peloponnesian War. It's a challenging book, but one I like a lot. &amp;#x200B; If you know nothing about the conflict, you might start with *The Spanish Civil War* and *The Franco Regime: 1936-1975,* both by Stanley Payne. I also admire the work of Helen Lane in Spanish Civil War scholarship. If you want pre-1492 Spain, you might read *The Ornament of the World* by Maria Rosa Menocal. If you want the history of Spanish imperialism in the Americas, I suggest you read *The Open Veins of Latin America* by Eduardo Galeano. Ironically, many of Eduardo Galeano's most famous books were published while he was exiled in Spain.<thegeckomaster>: Thank you! This is great.", "num_messages": 5, "avg_score": 2.6}
{"start_date": "1544802829", "end_date": "1544804191", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 12, "text": "<pwe5000>: Annotated Divine Comedy? A friend is looking for an annotated edition of The Divine Comedy and not having much luck. Can anyone point me in the right direction for this? (I've seen some annotated ebooks, but there seems to be a dearth of print editions that are annotated.)<InquisitorLavellan>: Look up \"The Portable Dante\", edited by Mark Musa. It includes the Divine Comedy and one of Dante's other works, La Vita Nuova.<pwe5000>: Thanks! That one looks great!", "num_messages": 3, "avg_score": 4.0}
{"start_date": "1544804347", "end_date": "1544833050", "thread_id": null, "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41", "total_score": 7, "text": "<Drughelpandadvice>: My father doesn't understand addiction Are there any books out there that I could purchase for my father so that she could better understand my addiction. She just doesn't grab the concept as a whole. This leads him to just get angry all the time and said some really hurtful things as well as makes derogatory comments.<phoeniks>: Unbroken Brain: A revolutionary New Way of Understanding Addiction - Maia Szalavitz &gt;A NEW YORK TIMES BESTSELLER More people than ever before see themselves as addicted to, or recovering from, addiction, whether it be alcohol or drugs, prescription meds, sex, gambling, porn, or the internet. But despite the unprecedented attention, our understanding of addiction is trapped in unfounded 20th century ideas, addiction as a crime or as brain disease, and in equally outdated treatment. Challenging both the idea of the addict's \"broken brain\" and the notion of a simple \"addictive personality,\" The New York Times Bestseller, Unbroken Brain, offers a radical and groundbreaking new perspective, arguing that addictions are learning disorders and shows how seeing the condition this way can untangle our current debates over treatment, prevention and policy. Like autistic traits, addictive behaviors fall on a spectrum -- and they can be a normal response to an extreme situation. By illustrating what addiction is, and is not, the book illustrates how timing, history, family, peers, culture and chemicals come together to create both illness and recovery- and why there is no \"addictive personality\" or single treatment that works for all. Combining Maia Szalavitz's personal story with a distillation of more than 25 years of science and research,Unbroken Brain provides a paradigm-shifting approach to thinking about addiction. Her writings on radical addiction therapies have been featured in The Washington Post, Vice Magazine, The Wall Street Journal, and The New York Times, in addition to multiple other publications. She has been interviewed about her book on many radio shows including Fresh Air with Terry Gross and The Brian Lehrer show.<thisISme4now>: I am a recovering addict and I have read this book. I loved it! I would highly recommend to anyone wanting to understand addiction better!", "num_messages": 3, "avg_score": 2.3333333333}
